{
  "title": "Two security officials martyred in Balochistan attacks - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Two security personnel were martyred, and another person was injured in separate armed attacks in Balochistan on Sunday.\n\nIn the first incident, armed men opened fire on a vehicle near the Gumbaz area, close to Nana Sahib Ziarat, killing a security official and injuring anot­her. Levies officials identified the deceased as Marhaba Khan, while the injured was identified as Idris Khan.\n\nAccording to officials, five people were travelling in the vehicle after watching a football match when assailants ambushed them. Three passengers seated in the back escaped unhar­med.\n\nThe victims were immediately shifted to Duki Civil Hospital, where the injured person was later referred to Que­tta for further treatment.\n\nAuthorities suspect personal enmity as a possible motive for the attack and have launched a search operation to track down the attackers.\n\nIn a separate incident, Frontier Corps (FC) soldier Abdul Hakeem Ashayzai was gunned down in Chaman.\n\nAccording to officials, motorcycle-borne attackers opened indiscriminate fire on him at the Chaman Master Plan site, fatally wounding him.\n\nPolice officials shifted the body to the District Headquarters Hospital, Chaman. Officials confirmed that the soldier sustained multiple gunshot wounds, leading to his immediate death.\n\nAfter completing medico-legal formalities, the body was handed over to his family.\n\nPolice have described the FC soldier’s murder as a targeted killing, though no individual or group immediately claimed responsibility for the attack. Further investigations are underway.\n\nThe attacks came after 23 terrorists were killed and 22 security personnel embraced martyrdom a day ago in major counterterrorism operations in Balochistan’s Harnai and Kalat districts and Khyber Pakhtunkhwa’s Dera Ismail Khan.\n\nFour martyrs laid to rest\n\nFour security personnel martyred in the Mangochar, Kalat, gun battle were laid to rest with full military honours on Sunday in different areas of Nasirabad Division.\n\nThe 18 security personnel martyred in the Mangochar attack included six from Balochistan, while others were from Sindh, Punjab and Khyber Pakhtunkhwa.\n\nTheir funeral prayers were attended by Chief of Army Staff Gen Asim Munir, Balochistan Governor Sheikh Jaffar Khan Mandokhail, Chief Minister Sarfraz Bugti, Commander 12 Corps Lt Gen Rahat Naseem Ahmed Khan and other senior civil and military officials.\n\nThe funeral prayers of three martyrs — Zamir Khan Lashari, Manjhi Khan and Sultan Khan Jamali — were held in Manjhipur and Sohbatpur, attended by Commandants of the 53 and 75 Wings, Assistant Commissioner Sohbatpur, tribal elders and a large number of citizens.\n\nAnother martyred soldier, Mohammad Naeem, was laid to rest in Mir Naseer Muhammad Sobdarani village in Gandakha, Usta Muhammad district. Senior officials, including the Usta Muhammad deputy commissioner and police officials, attended his funeral.\n\nAll four martyrs were buried with full military honours, and FC soldiers presented a gun salute in recognition of their sacrifices.\n\nCTD registers case\n\nThe Counter-Terrorism Department (CTD) has registered a case following the deadly ambush on Balochistan Levies personnel in Dera Ismail Khan late on Saturday night, which left five people, including four Levies officials, dead.\n\nOfficials confirmed that after completing legal formalities, the bodies of the martyred personnel and a civilian were sent to Balochistan. The martyrs belonged to Chaman.\n\nThe attack occurred near the Daraban Grid Station on the N-50 Highway when unidentified gunmen ambushed a vehicle with a green number plate, used mainly by official vehicles.\n\nThe assailants opened indiscriminate fire, killing the four Levies personnel and their driver on the spot. The vehicle caught fire following the attack.\n\nAt the time of the assault, one of the Levies personnel was in contact with his family, which led to an immediate alert. Upon receiving the information, a heavy contingent of Dera Ismail Khan police rushed to the scene, cordoned off the area and launched a search operation to track the attackers.\n\nAli Jan Mangi in Dera Murad Jamali and Muhammad Irfan Mughal in Dera Ismail Khan also contributed to this report\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:15:47.692Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889380/two-security-officials-martyred-in-balochistan-attacks",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:20.000Z"
}
