{
  "title": "Another PAEC contract worker freed from captivity in Lakki Marwat - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: A kidnapped contractor of the Pakistan Atomic Energy Commission (PAEC) was freed by militants after three weeks on Sunday, a local tribal elder confirmed.\n\nIrfanullah, who was kidnapped along with 17 PAEC contract workers on January 9, was handed over to the leaders of a jirga at an undisclosed location, said Naseer Turab, a jirga leader.\n\nIn a video posted by Mr Turab on social media, the freed PAEC contractor was seen in a car with him and two other jirga leaders, Inayatur Rehman and Malik Waqar, while returning from an undisclosed location in a car.\n\nIn his video, the jirga leader thanked the Allah Almighty, saying Mr Irfanullah had been handed over to them.\n\nMilitant hideouts on Karak-Bannu border destroyed in CTD action\n\nThe PAEC contractors were kidnapped by armed militants along the Darra Tang while they were going to a project site at Qaboolkhel in a private coach.\n\nThe militants had abandoned the coach after setting it on fire in a forest along the Kurram River.\n\nAfter the incident, police and security forces launched a rescue operation and recovered eight abductees, three of whom were injured.\n\nLater, on Jan 25, the militants handed over Nawaz Khan, the coach driver and the body of another hostage identified as Rehanullah to tribal elders who had gone into the mountainous terrain searching for the kidnapped men.\n\nDuring the last three weeks, several videos purportedly of the hostages appeared on social media in which they were appealing to the government to agree to the militants’ demands for their release.\n\nThe kidnapping had also sparked protests and shutter-down strikes in Lakki and other towns of the district.\n\nOn Jan 27, thousands of people rallied in front of the District Headquarters Complex, Tajazai, to protest the delay in recovering the kidnapped men.\n\nThe local elders had declared that the tribesmen would come out with weapons and launch an action against militants if they did not release the hostages.\n\nOperation in border area\n\nMeanwhile, the Khyber Pakhtunkhwa police and Counter Terrorism Department (CTD) conducted a joint operation against alleged militants in the Latambar area on the Karak-Bannu border.\n\nA police official said on Sunday that the district police officer, Shahbaz Elahi, had tasked the police to track down alleged militants in the mountainous region.\n\nHe said DSP Headquarters Fazal Akbar Khattak and CTD DSP Imtiaz Khan led the operation.\n\nThe security personnel, equipped with light and heavy weapons, “destroyed” the hideouts of miscreants and criminal gangs in the area, the official claimed.\n\nHe said local elders and Chagha parties (armed villagers) also supported the police in their actions.\n\nThe official, however, did not disclose details about any arrests or seizure of arms and ammunition during the operation.\n\nDSP Khattak said the police were alert and vigilant to prevent crimes and eliminate militants.\n\nThe officer added that search and strike operations would continue in future to establish lasting peace and protect people’s lives and properties.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:19:40.714Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889456/another-paec-contract-worker-freed-from-captivity-in-lakki-marwat",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:34.000Z"
}
