{
  "title": "Cop gunned down in KP’s Khyber as year’s first polio drive begins - Pakistan - DAWN.COM",
  "author": null,
  "content": "A police constable on polio duty was killed on Monday in the Jamrud town of Khyber Pakhtunkhwa’s Khyber district on the initial day of the year’s first nationwide anti-polio drive, authorities said.\n\nThe vaccinators, who go door-to-door to innoculate children, are frequently targeted by militants, esp­e­cially in KP and Balochistan. In 2024 alone, 20 people were killed and 53 injured during anti-polio campaigns in the province.\n\nPolice spokesperson Zaheer Ahmed told Dawn.com, “Unknown suspects who were riding a motorcycle targeted the official in the Ghundi area near Sakhi Pul and fired upon him.”\n\n“The constable, identified as Abdul Khalid, was going on duty to guard the polio team when he was martyred,” he said adding that an investigation was underway.\n\nZarmat Khan, another police official, told AFP that “despite the incident, the polio vaccination drive in the area remains ongoing”.\n\nThe banned militant Tehreek-i-Taliban Pakistan group claimed responsibility for the attack.\n\nInterior Minister Mohsin Naqvi condemned the incident targeting the anti-polio drive team in Jamrud, the ministry posted on X.\n\nExpressing his condolences for the cop, Naqvi said, “We salute the duty of martyred Constable Abdul Khaliq while on duty to secure the future of our children.”\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic.\n\nDespite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy, and misinformation have slowed progress.\n\nPrime Minister Shehbaz Sharif on Sunday launched the year’s first nationwide anti-polio campaign, running from February 3 to 9, by administering polio drops to children under five and vowing to eradicate the disease from the country.\n\nHe hoped that the dedicated teams would work “day and night to eradicate the disease, and would reach the far-flung areas and villages,” adding these teams would successfully meet the huge responsibility by “utilising their complete energies”.\n\nAccording to the premier, the country reported 77 polio cases last year, with the virus detected in at least 90 districts. This year’s first case was reported in KP’s Dera Ismail Khan district.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/03131908da839d8.png",
  "retrievedAt": "2025-08-25T19:19:10.734Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889483/cop-gunned-down-in-kps-khyber-as-years-first-polio-drive-begins",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T07:50:40.000Z"
}
