{
  "title": "Gas companies cry foul amid IMF-driven policy shake-up - Business - DAWN.COM",
  "author": null,
  "content": "• SNGPL warns of financial crisis, excess RLNG supply over captive power plants’ exit from gas grid\n• Says policy allowing private competitors to profit while public utilities suffer losses\n• Pakistan LNG seeks permission to import LNG, sell to CPPs\n\nISLAMABAD: In a new twist to IMF’s push for transferring industrial captive power plants (CPPs) to the national power grid through a hike in gas rates and supply disconnections, gas companies are crying foul over losing long-term clients to private competitors.\n\nAs if it was not enough, a state-owned enterprise has sought government clearance to import liquefied natural gas (LNG) to supply the CPPs if Sui Northern Gas Pipelines Limited (SNGPL) and Sui Southern Gas Company Limited (SSGCL) fail to meet demand.\n\nSources told Dawn that Pakistan LNG Limited (PLL) proposed to the Special Investment Facilitation Council (SIFC) last week that it be allowed to import LNG cargoes and supply them to the industrial sector as SNGPL and SSGCL face a shortage of customers and want cancellation of contracted cargoes.\n\nSources said the Lahore-based SNGPL protested the PLL’s suggestion and the diversion of its clients to private shippers.\n\n“How could an IMF conditionality be applied to an existing gas supplier and not on another company under the same Ministry of Energy or a private party?” a participant questioned, arguing that gas supply at a price not regulated by the Oil and Gas Regulatory Authority (Ogra) may instead encourage more CPPs to stay away from the power grid.\n\nThis has come days after the government increased gas prices for CPPs from about Rs3,000 per million British thermal units (mmBtu) to about Rs3,500 and imposed another 5pc levy to ensure these industrial plants have electricity generation parity with the national power grid.\n\nThe power division has already directed power distribution companies to sign new service standard agreements with CPPs to ensure uninterrupted electricity.\n\nAs part of its IMF commitments, the government had pledged to disconnect the gas supply to CPPs by January 2025, forcing them onto the national grid. However, until technical grid constraints are resolved, the government agreed to raise gas tariffs to match power costs.\n\nThe SNGPL demanded in writing that “any policy regarding the shifting of CPPs away from the gas grid to the national grid should be implemented across the board for public and private sectors”.\n\nIt highlighted that the existing policy of allowing third parties to sell indigenous gas at cheaper tariffs in RLNG areas like Punjab had already created market distortions.\n\nSNGPL said that while it could only sell gas at Ogra-notified RLNG tariffs, private players could supply cheaper indigenous gas in RLNG-designated areas, making windfall profits at the company’s expense.\n\n‘Sovereign default’\n\nThe gas company claimed that the IMF scheme of things relating to CPPs would be disastrous for the petroleum sector as it could “render SNGPL and Pakistan State Oil, etc., bankrupt and possibly lead to sovereign default. The third parties will hugely benefit from this decision since they are not being asked to stop supply to CPPs”.\n\nThe SNGPL reported that “in reality, these CPPs are shifting to third-party shippers since a major chunk of them are not going to opt for the power sector, owing to very high tariffs, lack of reliable supplies, etc”.\n\nTherefore, the essence of IMF conditions will be compromised, and these third parties will make windfall profits owing to market imperfections and regulatory failure at the cost of the public.\n\nIt said that an active shipper, UGDC, was already supplying gas to Punjab-based CPPs — including Tariq Glass, Ittehad Chemicals, Azgard-9, Din Industries, MK Sons and IPak Films, to name a few — that were on the distribution network of SNGPL.\n\nIt complained that the departure of CPPs from the gas grid would reduce SNGPL’s sales, impacting its revenue.\n\nAnother 40 mmcfd of RLNG will be rendered surplus by SSGCL. The total RLNG surplus arising from the sudden shifting of CPPs will be around 200 mmcfd in addition to 150 mmcfd surplus due to reduced power offtake, making a total surplus of around 350 mmcfd.\n\nThis would increase to 400 mmcfd as K-Electric’s RLNG demand from PLL was expected to phase out from 2026, the SNGPL said, adding that this could potentially result in around 240 surplus cargoes over the remaining contract. “Over 30pc of RLNG supply will be rendered surplus,” the company said.\n\nIn such an instance, SNGPL will be constrained from diverting RLNG to domestic consumers to the extent of their demand, thus increasing the RLNG diversion volumes. Since domestic demand was limited, SNGPL will be constrained to curtail supplies from indigenous gas fields, or surplus LNG cargoes may have to be diverted on hefty “take or pay” penalties or sold on net proceed differential.\n\nPolicy overhaul sought\n\nThe SNGPL demanded that the policy of allowing third parties to sell indigenous gas in RLNG areas be reviewed and all available and upcoming indigenous gas should be provided to gas utilities to increase indigenous gas blend for the provision of gas to the public at large at affordable rates.\n\nIt also demanded that a level playing field be ensured and regulatory imperfections and public and private parties should be allowed to compete on equal terms like the oil sector, where PSO competes with private oil marketing companies at the same pricing structure and without in-built subsidies.\n\nIn addition, it called for the implementation of a national weighted average cost of gas (Wacog) and a separate tariff for indigenous gas supplies to the power sector so that gas utilities could blend both local and RLNG in surplus situations, reducing the cost of diversion being passed on to domestic consumers.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:06:55.332Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889377/gas-companies-cry-foul-amid-imf-driven-policy-shake-up",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:28.000Z"
}
