{
  "title": "Car bomb kills 20 in northern Syria, deadliest since Assad toppled - World - DAWN.COM",
  "author": null,
  "content": "A car bomb killed at least 20 people in the northern Syrian city of Manbij on Monday, the Syrian presidency said, marking the second attack there in three days and the country’s deadliest since Bashar al-Assad was toppled from power in December.\n\nThe presidency’s statement said it would hold the perpetrators of what it described as a “terror attack” accountable.\n\n“This crime will not pass without the most severe punishment against its perpetrators to serve as an example against those who will try to tamper with the security of Syria or harm its people,” the presidency said.\n\nThere were no immediate claims of responsibility for the attack in Manbij, located some 30 kilometres from the Turkish border. At least 14 of the dead were women, according to a preliminary toll issued earlier by the civil defence rescue service and another 15 women were wounded.\n\nThe victims were agricultural workers and the death toll was likely to increase, a civil defence official told Reuters.\n\nManbij has changed hands numerous times during Syria’s 13-year civil war, most recently in December when Turkish-backed groups captured it from the US-backed SDF, which is led by the Kurdish YPG militia.\n\nThe SDF had taken Manbij from Islamic State in 2016.\n\nOn Saturday, a car bomb in Manbij killed four civilians and wounded nine others, including children, the Syrian state news agency SANA reported.\n\nAssad was ousted from power on December 8 after a lightning offensive by the Islamist Hayat Tahrir al-Sham (HTS) group, whose leader, Ahmed al-Sharaa, was declared Syria’s transitional president last week.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/03191547effad98.jpg",
  "retrievedAt": "2025-08-25T19:19:06.268Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889511/car-bomb-kills-20-in-northern-syria-deadliest-since-assad-toppled",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T14:16:51.000Z"
}
