{
  "title": "‘Political’ development schemes for lawmakers make a comeback - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: On the eve of the first year in office, the PML-N government has revived the controversial parliamentarians’ development schemes, which could not take off in the first half of the current fiscal year (2024-25), despite over Rs460 billion revenue shortfall in first seven months.\n\nIn a major move, the government doubled the size of these political schemes, code-named ‘Sustainable Development Goals Achievement Programme’ (SAP), to almost Rs50bn from Rs25bn allocation in the budget books 2024-25.\n\nIt also declined a demand of the coalition partner PPP to carry forward around Rs30 billion in unspent funds from the last fiscal year.\n\nThe government also relaxed principles already notified for the Public Sector Development Programme (PSDP) to ensure quick disbursements to satisfy parliamentarians associated with the government. This is in addition to about 300pc increase in the salaries of parliamentarians allowed last week.\n\nThe government has also decided that since the Pak Public Works Department (PWD) that used to implement most of such schemes had been abolished, the task should be given to Pakistan Infrastructure Development Company Ltd (PIDCL) of the housing ministry.\n\nAllocation to Rs50bn SDG Achievement Programme doubled; PPP request for rollover of unspent funds declined\n\nAt a recent meeting, the Steering Committee on SAP, led by Deputy Prime Minister Ishaq Dar, was informed that Chairman Senate Yousaf Reza Gilani and Deputy Speaker National Assembly Ghulam Mustafa Shah had written letters for re-validation of funds which lapsed during the financial year 2023-24.\n\nIt may be recalled that the then PML-N government had allocated Rs91bn in FY2023-24 budget for the parliamentarians’ scheme and approved for disbursement about Rs61bn before it was replaced by the caretaker government which put a freeze on such political schemes.\n\nAs a result, about Rs57bn could be utilised by end of the fiscal year. The two PPP constitutional officeholders wanted those Rs34bn unspent funds to be utilised this year.\n\nMr Dar, however, explained that the Public Finance Management Act 2019 did not allow such re-validation of lapsed funds of previous years, therefore the committee feels constrained to agree to the proposals, as per the official record seen by Dawn.\n\nSDGs Achievement Programme\n\nPlanning Minister Ahsan Iqbal, however, told the meeting that Rs50bn had been allocated by the government for the SAP for FY24-25 under PSDP.\n\nHowever, the PSDP available on the ministry’s official website involves an allocation of Rs25bn for SAP without approval of the respective schemes.\n\nBased on the planning minister’s statement, all members of the steering committee unanimously agreed that SAP funds may be released to respective federal ministries/divisions and provincial governments.\n\nThe committee approved the release of Rs48.37bn for execution of SAP schemes after authorisation for release from the Ministry of Planning and relaxation of quarterly release strategy from the Finance Division.\n\nThe committee comprised 27 members, including a total of 16 parliamentarians, seven federal secretaries and four provincial representatives.\n\nThe parliamentarians incl­uded seven sitting cabinet members and nine MNAs, including Raja Pervez Ashraf, Shazia Marri, Sardar Yousaf Zaman, Riazul Haq, Javed Hanif Khan, Khalid Magsi, Ijazul Haq, and Tariq Fazal Chaudhry.\n\nOf the total Rs48.37bn, Rs28.87bn were approved by Punjab-based parliamentarians, followed by Rs15.25bn for Sindh, Rs2.25bn for Balochistan, Rs1.25bn for Khyber Pakhtunkhwa and Rs750 million for Islamabad.\n\nSources said about Rs40bn has since been authorised by the planning commission for disbursement.\n\nIt may be noted that the government has so far kept a tight lid on the core development programme under which only Rs148bn could be utilised in the first half of the fiscal year against a budget allocation of Rs1.1 trillion, accounting for 10.45pc.\n\nThis utilisation is even lower, both in absolute and percentage terms, than in the same period of last year when a caretaker government was in place. Six-month utilisation had amounted to Rs150bn last year, accounting for 16pc of Rs940bn annual allocation.\n\nDespite relatively higher spending, the PSDP spending could not go beyond Rs635bn by end of the year and almost one-third of the budget allocation was used for deficit financing. If that is an indication, the development programme is unlikely to even cross Rs600bn this year.\n\nUnder the mechanism announced by the Ministry of Finance for the current fiscal year, the government should release 15pc of the budgeted allocation in the first quarter, followed by 20pc in the second quarter, 25pc in the third quarter and remaining 40pc in the last quarter of the fiscal year.\n\nAs such, the estimated release for PSDP by end-December should be at least 35pc of annual allocation or no less than Rs385bn, almost three times the actual spending in six months.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:06:55.874Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889382/political-development-schemes-for-lawmakers-make-a-comeback",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:20.000Z"
}
