{
  "title": "Lawyers up in arms as new IHC judges report for duty - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Fresh roster sees changes to seniority rank of existing judges; six division benches also formed\n• Newly-transferred Justice Dogar comes at No. 2, erstwhile senior-most Justice Kayani moves down to No. 3\n• Legal fraternity announces strike against judges’ transfer, opposes JCP meeting and Peca tweaks\n\nISLAMABAD: With three new judges, transferred to the Islam­abad High Court, all set to start their duties from today (Monday), the capital’s lawyers have demanded the withdrawal of their transfer orders and decided to pursue all legal and constitutional avenues to resist the decision.\n\nIn a statement issued after the meeting of the Islamabad Bar Council, Islamabad District Bar Association, and the Islamabad High Court Bar Association, the legal fraternity announced the All Pakistan Lawyers Convention to be held on 3 Feb at the judicial complex in G-11 to formulate future strategy regarding the recent transfers.\n\nThe lawyers bodies issued a joint resolution condemning the transfer of judges and supported the letter written by five judges of the IHC that opposed the transfer of the judges from other provinces.\n\nAccording to the resolution, the legal fraternity reaffirms its commitment to resisting the unjustified transfers and appointments of judges from other provinces to the IHC.\n\nIt said that they would safeguard the judicial independence of Islamabad using all legal and constitutional avenues. The lawyers demanded that the IHC CJ be appointed from among the present senior most judges of the IHC to ensure fairness and merit-based selections, as per the resolution.\n\nThe lawyers also criticised the Judicial Commission of Pakistan for scheduling a meeting on Feb 10 to appoint eight judges to the Supreme Court and demanded a hearing of petitions against the 26th Amendment by the full court comprising the existing 16 judges.\n\nThey said the decision to appoint judges without a decision on the 26th Constitutional Amendment compromised the judiciary’s independence and eroded public trust. The resolution also asked the legal fraternity to observe a strike on Feb 3.\n\nThe lawyers also endorsed the media’s reservations regarding the Prevention of Electronic Crimes Act (Peca) amendments which were criticised by international and national stakeholders.\n\nNew IHC roster\n\nA day earlier, the president approved the transfer of three judges, Justice Mohammad Sarfraz Dogar of the Lahore High Court, Justice Khadim Hussain Soomro of the Sindh High Court, and Justice Mohammad Asif of the Balochistan High Court, to the IHC under Article 200 of the Constitution despite opposition by the judges and lawyers.\n\nThe transfer also altered the seniority list of the IHC judges affecting a number of judges, except Chief Justice Aamir Far­ooq.\n\nAcco­rding to the list, the newly transferred Justice Sardar Mohammad Sarfraz Dogar has become the senior puisne judge for being second in the seniority list. Justice Mohsin Akhtar Kay­ani, who was the senior-most judge after the CJ, is at number three now.\n\nLikewise, Justice Miangul Hassan Aurangzeb, Justice Tariq Mehmood Jahangiri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Justice Arbab Mohammad Tahir also moved one step down in the seniority list.\n\nJustice Khadim Hussain Soomro, transferred from the Sindh High Court, comes at number 9 before Justice Saman Rafat Imtiaz, who has moved down from eighth to tenth position. Justice Mohammad Azam Khan who was at number 9 is at 11 now.\n\nJustice Mohammad Asif, who was transferred from the Balochistan High Court is at number 12, while Justice Inaam Ameen Minhas has moved down three places, from 10 to 13.\n\nAs per the cause list issued by the IHC, six division benches have been constituted. The first division bench comprised IHC CJ Farooq and Justice Minhas; second division bench included Justice Dogar and Justice Soomro; third division bench comprised Justice Kayani and Justice Sardar Ejaz; fourth division bench included Justice Aurangzeb and Justice Imtiaz; fifth division bench included Justice Jahangiri and Justice Azam Khan; and sixth division bench included Justice Sattar and Justice Tahir.\n\nThe staff of newly transferred judges was also directed to report to their respective courts by Monday.\n\nPublished in Dawn, February 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:07:25.442Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889383/lawyers-up-in-arms-as-new-ihc-judges-report-for-duty",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T01:19:20.000Z"
}
