{
  "title": "OpenAI announces new ‘deep research’ tool for ChatGPT - World - DAWN.COM",
  "author": null,
  "content": "US tech giant OpenAI on Monday unveiled a ChatGPT tool called “deep research” that can produce detailed reports, as China’s DeepSeek chatbot heats up competition in the artificial intelligence (AI) field.\n\nThe company made the announcement in Tokyo, where OpenAI chief Sam Altman also trumpeted a new joint venture with tech investor SoftBank Group to offer advanced artificial intelligence services to businesses.\n\nAltman and SoftBank founder Masayoshi Son will meet the Japanese prime minister later on Monday and will reportedly announce plans to boost Japan’s AI infrastructure.\n\nIt comes as AI newcomer DeepSeek has sent Silicon Valley into a frenzy, with some calling its high performance and supposed low cost a wake-up call for US developers.\n\nOpenAI, whose ChatGPT led generative AI’s emergence into public consciousness in 2022, said its new tool “accomplishes in tens of minutes what would take a human many hours”.\n\n“You give it a prompt, and ChatGPT will find, analyse, and synthesise hundreds of online sources to create a comprehensive report at the level of a research analyst,” the company said in a statement.\n\nOn social media platform X Altman said that deep research, which paid “Pro” ChatGPT users can access 100 times a month, was “slow” and required a lot of computing power.\n\nBut he was more bullish on stage at a business forum in Tokyo.\n\n“This is a system that I think can do — this is just an estimate of mine — but I think can do a single-digit percentage of all economically valuable tasks in the world,” Altman said.\n\nSoftBank and OpenAI are part of the Stargate drive announced by US President Donald Trump to invest up to $500 billion in artificial intelligence infrastructure in the United States.\n\nSimilar steps to build AI data centres and power plants in Japan could be announced when Altman and Son meet Prime Minister Shigeru Ishiba, the Nikkei newspaper said.\n\nIshiba is also expected to visit Washington to meet Trump for the leaders’ first in-person meeting later this week.\n\nAt their event for businesses on Monday afternoon, Son announced a new joint venture equally split between the two companies.\n\nHolding a purple crystal ball, the Japanese tycoon outlined the services of a new AI product called Cristal, which can crunch firms’ system data, reports, emails and meetings.\n\nA joint statement said SoftBank would “spend $3bn annually to deploy OpenAI’s solutions across its group companies”.\n\nThe venture “will serve as a springboard for introducing AI agents tailored to the unique needs of Japanese enterprises while setting a model for global adoption”, it said.\n\nSeparately, Altman told the Nikkei he wanted to develop “a new kind of hardware” using artificial intelligence in partnership with Apple’s former chief design officer Jony Ive.\n\nBut Altman indicated it would take several years to unveil a prototype, the Nikkei said.\n\nAltman also told the newspaper that DeepSeek is “a good model” that highlights the serious competition for AI reasoning technology, but that its “capability level isn’t new”.\n\nDeepSeek’s performance has sparked a wave of accusations that it has reverse-engineered the capabilities of leading US technology, such as the AI powering ChatGPT.\n\nOpenAI warned last week that Chinese companies are actively attempting to replicate its advanced AI models, prompting closer cooperation with US authorities.\n\nWhile OpenAI has not confirmed Altman’s next movements, media reports said he was expected to travel on Tuesday to Seoul.\n\nA spokesperson for South Korean IT conglomerate Kakao told AFP that they would on Tuesday announce their “collaboration with OpenAI” but did not confirm whether Altman would be there.\n\nOpenAI chief Sam Altman said the US company has “no plans” to sue Chinese startup DeepSeek, which rattled Silicon Valley with its powerful and apparently cheaply developed chatbot.\n\nChatGPT creator OpenAI warned last week that Chinese companies were actively attempting to replicate its advanced AI models.\n\n“No, we have no plans to sue DeepSeek right now. We are going to just continue to build great products and lead the world with model capability, and I think that will work out fine,” Altman told reporters in Tokyo.\n\n“DeepSeek is certainly an impressive model, but we believe we will continue to push the frontier and deliver great products, so we’re happy to have another competitor,” he also reiterated.\n\n“We’ve had many before, and I think it is in everyone’s interest for us to push ahead and continue to lead.”\n\nDeepSeek’s performance has sparked a wave of accusations that it has reverse-engineered the capabilities of leading US technology, such as the AI powering ChatGPT.\n\nOpenAI has said rivals are using a process known as distillation in which developers creating smaller models learn from larger ones by copying their behaviour and decision-making patterns — similar to a student learning from a teacher.\n\nBut the company is itself facing multiple accusations of intellectual property violations, primarily related to the use of copyrighted materials in training its generative AI models.\n\nHemanth Mandapati, boss of German startup Novo AI, was an early adopter of DeepSeek chatbots when he switched to the Chinese AI model from OpenAI’s ChatGPT two weeks ago.\n\n“If you have built your application using OpenAI, you can easily migrate to the other ones … it took us minutes to switch,” he said in an interview on the sidelines of the GoWest conference for venture capitalists in Gothenburg, Sweden.\n\nDeepSeek’s emergence is changing the landscape for AI, offering companies access to the technology at a fraction of the cost, according to interviews with more than a dozen startup executives and investors. It also has the potential to push other AI companies to improve their models and bring down prices.\n\n“There was an offer from DeepSeek which was five times lower than their actual prices,” said Mandapati. “I am saving a lot of money and users don’t see any kind of a difference.”\n\nEurope’s tech startups had struggled to adopt the new technology at the same rate as US rivals, which have easier access to funding. But executives say DeepSeek could be a game changer.\n\n“It marks a significant step forward in democratising AI and levelling the playing field with Big Tech,” said Seena Rejal, chief commercial officer of British firm NetMind.AI, another early adopter of DeepSeek.\n\nAnalysts at Bernstein estimate that DeepSeek’s pricing is 20 to 40 times cheaper than equivalent models from OpenAI.\n\nOpenAI charges $2.5 for 1 million input tokens, or units of data processed by the AI model, while DeepSeek is currently charging $0.014 for the same number of tokens.\n\nConcerns have been raised by regulators about whether DeepSeek is copying OpenAI data or censoring answers that could portray China in a bad light. It is currently being investigated in different European countries.\n\n“While the future of DeepSeek as a business is difficult to predict, the structural impact seems quite pervasive,” said Sanjot Malhi, partner at venture capital firm Northzone.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/031504355c50cdf.jpg",
  "retrievedAt": "2025-08-25T19:19:12.251Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889499/openai-announces-new-deep-research-tool-for-chatgpt",
  "dateList": "2025-02-03",
  "date_published": "2025-02-03T10:06:12.000Z"
}
