{
  "title": "Bilawal stresses on collective role to get rid on political, economic quagmire",
  "link": "https://www.app.com.pk/national/bilawal-stresses-on-collective-role-to-get-rid-on-political-economic-quagmire/",
  "date_published": "2023-04-24T14:52:00.000Z",
  "source": "APP",
  "content": "LARKANA, Apr 24 (APP): Foreign Minister and Chairman Pakistan People’s Party (PPP) Bilawal Bhutto Zardari has stressed upon the national unity and said that it was the responsibility of everyone to play their role and get the country out of the prevailing political and economic quagmire.\nSpeaking at Eid Milan gathering at Bhutto House Naudero (Larkana) on Sunday night, Bilawal Bhutto Zardari said that he was happy to be with his supporters throughout Ramazan and now at Eid as well. Today, Pakistan’s democracy, economy and the state are going through testing times, he said.\nHe said that hopefully, when we would be successful in this effort then I would be in front of you (public) for campaigning for simultaneous elections in all provinces.\nThe Chairman PPP said that we would soon be ready for the 2023 election campaign and the Party workers would enjoy it.\nHe reiterated that Pakistan People’s Party once again had the chance to play its role when the country was divided.\nEverybody has to play his role for the betterment of the country, he added. He said that the Supreme Court seemed to be divided and the in-fighting between the institutions would ultimately put negative impact on the common people.\nHe also said that both the Supreme Court and the Parliament were at logger heads and not ready to accept each other’s decisions.\nBilawal Bhutto Zardari said that the conflict between the Parliament and Supreme Court was making the state in-efficient to address the issues of the masses. He asked all the state institutions to resolve the public issues within their respective domains and minimize the problems of the general public.\nThe Chairman PPP said that his party was trying to reconciliate the allies to convince them for negotiations even with adversaries, by keeping the national interest supreme. Only those societies can make progress who can limit their political differences to elections only, he said and added that if the political parties settled down the issue of elections being conducted on a single day we would be in a better position to aggravate the situation of the poor public.\nHe said that we were still experiencing the ramification of last year’s flood along with the negative effect of global recession on our economy. The conspirators are trying to conduct early election in Punjab that will send negative message to all federating units.\nBilawal Bhutto Zardari said that PPP was always standing with the Constitution, the state, the people and provincial rights. He said that the conspirators should stop playing with the fate of the country and give chance to all the stakeholders to resolve the national issues.\nBilawal reiterated that elections should be held simultaneously in the whole country on same day, adding that the efforts of the conspirators were underway even today.\nTheir first attempt is to hold elections only in Punjab, he claimed and added, once the provinces are separated from the federation, the winner will face the consequences. The conspirators want political chaos in the country, he claimed.\nBilawal Bhutto Zardari said that PPP was trying to resolve the issues through mutual diplomacy and dialogue in order to save the country from massive damage.\nOn this occasion, Bilawal Bhutto Zardari and Bibi Aseefa Bhutto Zardari were presented with traditional gifts of Sindhi Ajrak at the Eid Milan gathering.\nThe gathering was attended by the Bibi Aseefa Bhutto Zardari, President PPP (Women Wing) Pakistan MPA Ms. Faryal Talpur, President PPP Sindh Senator Nisar Ahmed Khuhro, Federal Minister Syed Khursheed Ahmed Shah, Senator Jam Mehtab Dahar, MNA Khursheed Ahmed Junejo, MPA Suhail Ahmed Siyal, MNA Naseebaan Channa, Aijaz Leghari, Ghulam Mustafa Leghari, MPAs, MNAs, prominent citizens of the area, Party leaders and workers.",
  "retrievedAt": "2025-08-11T08:22:10.247Z"
}
