{
  "title": "Efforts afoot to provide maximum facilities to pilgrims: Talha",
  "link": "https://www.app.com.pk/national/efforts-afoot-to-provide-maximum-facilities-to-pilgrims-talha/",
  "date_published": "2023-04-24T15:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 24 (APP): Minister for Religious Affairs and Interfaith Harmony Senator Muhammad Talha Mahmood on Monday said despite difficulties, efforts were afoot to provide maximum facilities to pilgrims during Hajj 2023.\nTalking to the media in Makkah, the minister said due to time constraints, he had made an emergency visit to Saudi Arabia in order to give a final shape to the Hajj arrangements for pilgrims.\nHe said he was holding meetings with quarters concerned for the provision of the best possible facilities to the Pakistan pilgrims in Mina, Arafat and Muzdalifah.\nHe stressed the importance of providing adequate arrangements for pilgrims’ residence, food, transport, and medical needs during their holy journey in Makkah and Madina.\nSenator Talha shared that the proposal of hiring services of Pakistani expatriates in Saudi Arabia who were acquainted with the local rules and regulations, areas and language were under consideration.\nHe believed that this step would enable the pilgrims to be entertained in a more appropriate manner and would help reduce the overall expenses, stating that bringing Moavineen-e-Hujjaj from Pakistan would be a costly decision.\nHe said inflation and the depreciation of the Pakistan rupee were the main factors affecting the overall cost of Hajj operation this year adding that he would bring all the matters and his efforts to the notice of the federal cabinet and media on his return to Pakistan.\nLater, Senator Talha travelled to Madina where he paid homage at the mausoleum of the Holy Prophet Muhammad (peace be upon him).\nHe also offered Nawafil in Riaz-ul-Jannah, Masjid-e- Nabvi and prayed for the peace, progress and prosperity of Pakistan.\nThe government’s efforts to ensure maximum facilities for pilgrims during Hajj 2023 demonstrate its commitment to the welfare of Pakistani citizens. The hiring of Pakistani expatriates to assist with the arrangements would be a step to enable the pilgrims to have a comfortable and fulfilling holy journey.",
  "retrievedAt": "2025-08-11T08:22:16.912Z"
}
