{
  "title": "Imran first political leader whose statement contradicted by own party’s official account: Marriyum",
  "link": "https://www.app.com.pk/national/imran-first-political-leader-whose-statement-contradicted-by-own-partys-official-account-marriyum/",
  "date_published": "2023-04-24T11:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 24 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb while taking a jibe at Imran Khan, said that he was the first leader whose statement was being denied by his own party’s official account.\nIn a series of tweets, she said the PTI official account stated that “what Imran said, Imran did not say.”She asked Imran not to play with people’s minds and don’t tell lies in the face of the nation. She said that this was a reason that a ” fraudster” had to put the black canister on his face. She said that Imran was a criminal and would remain a criminal person.\nShe said that Imran had destroyed the society, moral values, politics, economy, poisoned the minds of the masses and filled the hearts with hatred, polluted the politics and paralyzed the country.\nShe said that it was shameless that according to his own claim, he dissolved the assemblies on the request of Bajwa.\nThe minister said that for the sake of power, Imran Khan insulted the people of Punjab and Pakhtunkhwa, mocked their representatives and dissolved their elected assemblies.\nThe minister said that PTI leaders abused the judiciary, threw shoes on the picture of the Chief Justice, took the bail relief package by threatening the judiciary.\nShe stated that if the Chief Justice gave a verdict in favour of Imran not because of the Constitution, but due to the fear of the mother-in-law, and advice of children and wives, this will not be allowed to happen.\n“Neither the nation will forgive those who play with the Constitution, nor will we spare them”, she maintained.\nShe said that it was strange that a woman had become spokesperson of those who threw shoes at the poster of her son-in-law.\nMarriyum Aurangzeb said that when the Constitution and justice fall victim to the advice of foreign agents, sons-in-law, daughters-in-law, children and mother-in-law, then the country has to suffer at the hands Imran-like thieves, liars, who brought inflation and unemployment.\nNow, elections will be held on time and not on the advice of Bajwa and the mother-in-law of anyone, the minister added.",
  "retrievedAt": "2025-08-11T08:22:16.097Z"
}
