{
  "title": "Imaan Mazari, Hadi Ali Chattha indicted in case pertaining to controversial social media posts",
  "author": "Tahir Naseer",
  "content": "An Islamabad district and sessions court on Thursday indicted human rights activist and lawyer Imaan Zainab Mazari-Hazir and her husband, Advocate Hadi Ali Chattha, in a case related to controversial social media posts.\n\nThe National Cybercrime Investigation Agency (NCCIA) had registered a case against Mazari and Chattha, accusing the two of attempting to incite divisions on linguistic grounds through social media posts and of creating the impression that the armed forces were engaged in terrorism within the country.\n\nAdditional District and Sessions Judge Muhammad Afzal Majoka heard the case, in which Mazari and Chattha both denied guilt.\n\nThe court summoned all prosecution witnesses for the next hearing and ordered Chattha to once again submit bail bonds, to which Mazari responded, “If you want to arrest us, reject my bail as well.”\n\nThe judge replied, “My principle is that if I respect you, I will get respect.”\n\nMazari’s advocate, Qaiser Imam, pointed out that the accused also had to appear in other cases, “sometimes at the Islamabad High Court (IHC), sometimes in Rawalpindi”.\n\nHowever, in response, Judge Majoka said that he had “adjourned the hearing three times on their request for that reason”.\n\nThe court then adjourned the hearing till November 5.\n\nYesterday, Chattha had been arrested outside the courtroom for non-appearance, despite Mazari claiming that there was video evidence of his presence both “inside and outside the courtroom” on social media platform X.\n\nHe has now been released.\n\nSpeaking to reporters outside the court today, Chattha claimed that he had appeared in court five minutes ahead of time for the proceedings but the judge had issued an arrest warrant “to his face”, saying, “This was not according to any law.”\n\nHe added that Majoka had recalled his “illegal order” even before they could argue against it today, but had insisted that they submit another Rs10,000 bail bond as the previous one had been forfeited. He also recalled this order after Chattha refused to comply with it, the advocate said.\n\n“The principle is this … you are running a court, you are a judge; how are you so far removed from the four corners of law?” he said while speaking to the media. “Why do you feel that doing this (specifically targeting the two accused) will get you praise?”\n\nChattha also said that the era of the courts intimidating people with the threat of jail time or punishments was over, saying, “Nowadays, word spreads very quickly. People are present — witnesses are present and they see this.”\n\nAsked what proceedings had been delayed yesterday and whether they had taken place today, the advocate said that only four days after the supply of copy, the court wanted to frame the charge. According to him, the judge had told the accused beforehand that if there were cases against them, they could come in at the end of the day as he was there until 3:30pm.\n\n“Imaan went first in the morning, then at 11am, then sat there waiting for him from 2-2:30pm,” he said. “He did not leave his chamber.”\n\nChattha added, “The moment I got back from cases in Pindi, I was present in court before 2:35pm. And he got angry that I had appeared at the end of the day, so he couldn’t indict me … So he forfeited the bail bonds and issued the warrant to my face and had me arrested from the courtroom.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/301237486cc4d4f.webp",
  "retrievedAt": "2025-11-01T23:58:57.455Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952156/imaan-mazari-hadi-ali-chattha-indicted-in-case-pertaining-to-controversial-social-media-posts",
  "dateList": "2025-10-30",
  "date_published": "2025-10-30T08:21:19.000Z"
}
