{
  "title": "42 million set to lose food aid amid US shutdown",
  "author": "Reuters",
  "content": "WASHINGTON: Nearly 42 million people are set to lose food aid due to the second-longest US government shutdown, as Democrats and Republicans in Congress continue to blame each other for a weeks-long legislative stalemate.\n\nNeither party was showing signs of changing its position days before funding for the Supplemental Nutrition Assistance Programme, also known as food stamps, is set to lapse beginning on Saturday. The US Department of Agriculture’s decision last week not to draw on an emergency fund to pay for part of November’s SNAP benefits is splitting senators, as Democrats argue the agency is legally required to spend the roughly $5.5 billion in contingency funds to maintain at least a portion of the benefits.\n\n“The Trump administration is weaponising hunger as a political bargaining chip,” said Senator Jeanne Shaheen of New Hampshire, the top Democrat overseeing food aid funding.  “When it comes down to it, this is a choice.”\n\nRepublicans say Senate Democrats are responsible for the shutdown because most have voted 13 times against a stopgap bill to reopen government, called a “CR” or continuing resolution, to force concessions from the Republican majority on healthcare issues.\n\n“The Democrats should vote for a clean CR to open government, and that’ll take care of all these things,” said Senator John Hoeven of North Dakota, the top Republican in charge of food aid appropriations.\n\nThe White House’s Office of Management and Budget did not respond to a request for comment.\n\nCuts to a Bipartisan Program\n\nThe cost and breadth of US food support are regularly debated in Congress, especially during the renegotiation of the farm spending bill that funds SNAP. Trump and Republicans’ July tax and spending bill expanded SNAP work requirements and increased state-specific costs. This has limited almost $200 billion in overall funding and could push some off the programme.\n\nAmericans in every state rely on federal benefits. Of the top five states with the highest per capita SNAP beneficiaries, who represent more than 15 per cent of the population, three are represented by Republican senators: Louisiana, Oklahoma, and West Virginia.\n\nThis week, Republican Senator Josh Hawley pushed a standalone bill to fund SNAP in November, which garnered some bipartisan co-sponsors by Tuesday, followed by Senate Democratic leaders announcing their own version.\n\nHowever, Republican Senate Majority Leader John Thune questioned why the chamber should vote on such a bill after a similar targeted bill to pay federal workers during the shutdown failed last week.\n\nLegal U-Turn at the USDA SNAP benefits have been distributed in past shutdowns, including the longest in history during Trump’s first term.\n\nAt the time, Trump’s USDA officials argued to Congress’s nonpartisan watchdog, the Government Accountability Office, that contingency funds could be used for benefits.\n\nThe agency repeated that position in a September 30 plan, released by the USDA in advance of the current shutdown, but that plan was no longer visible on the USDA website. Instead, a website banner blames Democrats for failing to fund SNAP at the expense of backing healthcare for immigrants living in the US illegally and “gender mutilation procedures”.\n\n“That’s just a red herring,” said Senator Tina Smith, a Minnesota Democrat, about the department’s message.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/69029fa2e8009.jpg",
  "retrievedAt": "2025-11-02T00:01:45.068Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952092/42-million-set-to-lose-food-aid-amid-us-shutdown",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:47.000Z"
}
