{
  "title": "Trump amplifies Pakistan’s narrative against India",
  "author": "Anwar Iqbal",
  "content": "WASHINGTON: President Donald Trump has at least “25 times” cited claims that five to seven “brand new, beautiful” planes were shot down during the May conflict between Pakistan and India, according to Indian media tracking.\n\nThe actual number of losses remains disputed, but Trump’s remarks have helped validate Pakistan’s version of events and strengthened its diplomatic position.\n\nSpeaking at a regional meeting in South Korea on Wednesday, Trump again credited himself with preventing a full-scale war by threatening both India and Pakistan with 250 per cent tariffs — the highest he has mentioned for any country. “If you look at India and Pakistan … they were going at it,” he said. “Seven planes were shot down. They were really starting to go.”\n\nTrump also praised Chief of the Army Staff Field Marshal Asim Munir, calling him a “great fighter”.\n\nAsserts ‘brand new, beautiful’ planes shot down during conflict\n\n“I’m doing a trade deal with India and I have great respect and love, as you know, for Prime Minister Narendra Modi, as you know. We have a great relationship,” he said.\n\n“Likewise, the prime minister of Pakistan is a great guy, and the field marshal — they have a field marshal. You know why he’s a field marshal? He’s a great fighter. He really is. He’s a great guy, too.”\n\nA day earlier, addressing business leaders in Japan, he used almost identical language, describing how “two big nuclear powers” were heading towards war before his intervention. New Delhi continues to deny that any of its aircraft were lost and rejects Trump’s claim of mediation, insisting that the ceasefire was mutually agreed.\n\nTrump’s version again contradicts India’s stance. He said he personally called Prime Minister Narendra Modi and Pakistan’s leaders to warn that Washington would halt trade and impose “massive tariffs” if the fighting continued.\n\nAnalysts see a broader shift in Washington’s tone. Michael Kugelman  of the Wilson Center noted that Secretary of State Marco Rubio said, “We  see an opportunity to expand our strategic relationship with Pakistan.”\n\nKugelman observed that while commercial interests drive White House  engagement, “the wider administration’s messaging has gone further.”  Rubio, he added, even described Pakistan as “an ally” — a rare term in  recent US policy.\n\nThe ripple effects of Trump’s statements are evident in the diplomatic sphere. US and Indian outlets reported that Prime Minister Modi chose to join the Asean Summit in Kuala Lumpur (Oct 26-28) virtually, apparently to avoid being publicly upstaged if Trump praised Pakistan in his presence. India’s opposition Congress Party called the move “a diplomatic retreat,” with Rahul Gandhi alleging Modi had skipped “another global stage out of fear of embarrassment.”\n\nTrump has also spoken about the Pakistan-Afghanistan clashes, calling them “an easy one for me to solve” and praising Pakistan’s leadership as “great people.” His self-styled image as a “war-solver” projects US influence while keeping Pakistan central to regional diplomacy.\n\nYet, despite this apparent tilt towards Islamabad, Trump in Seoul signalled that a trade deal with India is imminent.\n\nTrump’s rhetoric may have lent international weight to Pakistan’s account of the air war, but his economic priorities force him to seek a deal with India.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/30074025532925f.webp",
  "retrievedAt": "2025-11-02T00:03:22.409Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952079/trump-amplifies-pakistans-narrative-against-india",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:20.000Z"
}
