{
  "title": "SHC slams state failure to protect kids from drug trade",
  "author": "Ishaq Tanoli",
  "content": "KARACHI: The Sindh High Court (SHC) has observed that criminal networks are exploiting children, often through poverty, lack of education or coercion, and that stronger child protection laws and rehabilitation programmes are needed to combat it.\n\nA two-judge bench, headed by Justice Omar Sial, also remarked that the state has indeed failed to fulfil its obligations under the United Nations Convention on the Rights of the Child and noted that if a child was involved in drug selling, it might indicate neglect, lack of supervision and even direct involvement or exploitation by adults in the household.\n\nThe bench made these observations while granting bail to a 14-year-old girl in a drug peddling case and ordered police to arrest her parents and investigate them for using the child in drug selling.\n\nIt also ordered the magistrates and superintendents of police (investigations) concerned to ensure that parents/elders of a child caught selling narcotics are included in the investigation and, if found involved, be prosecuted.\n\nBench grants bail to 14-year-old girl held for carrying 510 grams of heroin; directs police to investigate her parents\n\nPolice had arrested Sadia in a Malir locality in May this year for allegedly carrying 510 grams of heroin. The suspect, through her counsel, filed a bail application in the SHC.\n\nAfter hearing both sides and examining the record, the bench in its order said that it was a regrettable and distressing case, as a 14-year-old child had been apprehended for selling heroin and she told the police that it was given to her by her mother to sell.\n\nIt also noted that the girl’s mother, Asia alias One Ten, was very much alive, but when the court summoned her parents, the girl’s father, Akhtar Ali, claimed that his wife had passed away.\n\nAn additional prosecutor general submitted that, as per the investigating officer, Asia was alive and there was a strong possibility that the parents were using their daughter as a drug mule.\n\nThe bench observed that parents played a crucial role in a child’s upbringing, supervision and moral development, and they were legally and morally responsible for providing guidance, monitoring activities and protecting their children from harmful influences.\n\nIf a child becomes involved in drug selling, it may indicate neglect, lack of supervision or even direct involvement or exploitation by adults in the household, and in such cases authorities often investigate whether the parents fulfilled their duties of care and control, it added.\n\nHowever, it also observed that, regrettably, the police had not interrogated the parents to determine their involvement in this case.\n\nThe order further said, “This court, in the very recent past, has seen an exponential rise in cases in which minors are involved in drug selling. There is every likelihood that children are being exploited, just in the way that women have been in the past. Narcotics exploitation of vulnerable children is a global issue affecting communities worldwide.”\n\n“Criminal networks exploit these children, often through poverty, lack of education or coercion. They face physical and psychological harm, perpetuating crime and poverty cycles. To combat this, stronger child protection laws, community education and rehabilitation programmes are needed. The state has indeed failed in its obligations under the United Nations Convention on the Rights of the Child”, it added.\n\nThe bench ordered the release of the detained underage girl and directed the jail authorities to hand her over to her paternal aunt, who will furnish a surety of Rs5,000. If no one comes forward to provide the surety, the case should be relisted before the bench for further directions, it added.\n\nThe SHC also directed the police to immediately arrest the parents of the juvenile suspect and investigate them about their involvement in narcotics selling and using their child for this purpose.\n\nThe bench ordered the IO to make regular visits to the minor girl’s home to ensure her well-being and safety.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/300954417cd6780.webp",
  "retrievedAt": "2025-11-02T00:01:12.947Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952059/shc-slams-state-failure-to-protect-kids-from-drug-trade",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:54.000Z"
}
