{
  "title": "Punjab hands over TLP mosques, seminaries to moderate clerics",
  "author": "Zulqernain Tahir",
  "content": "• CM Maryam orders release of ‘innocent’ supporters of proscribed outfit\n• Dismisses claim about 400 to 600 deaths in Muridke protest\n\nLAHORE: Apparently under pressure from some religious groups, the Punjab government on Wednesday announced handing over the administrative control of the mosques and seminaries erstwhile being run by proscribed Tehreek-i-Labbaik Pakistan (TLP) to a group of moderate clerics.\n\nThe administration led by Punjab Chief Minister Maryam Nawaz had earlier announced giving the administrative control of 300 mosques and 125 seminaries run by the TLP in the province to the Auqaf department.\n\nBesides, CM Maryam ordered the release of TLP prisoners, who were fount innocent during the investigations.\n\nAt least eight people, including a policeman, were killed and over 1,600 injured in clashes between police and TLP supporters in Muridke earlier this month.\n\nThe Punjab police had arrested over 6,000 TLP activists so far following the violence, which was sparked by the outfit’s attempt to hold an anti-Israel demonstration outside the US embassy in Islamabad.\n\nOn Wednesday, a meeting of the Ittehad Bainul Muslimeen Committee was held with CM Maryam Nawaz in the chair.\n\nReligious leaders from all schools of thought expressed full support for the Punjab government’s stance against the TLP and endorsed its efforts for maintaining peace.\n\nIn the meeting it was decided that the administration of the TLP-run mosques and seminaries would be handed over to the Tanzeem-ul-Madaris Ahle Sunnat Pakistan led by Mufti Muneebur Rehman.\n\n“Those who misuse religion for personal agendas are not serving the faith,” the CM noted.\n\n“The mosques and seminaries are being handed over to Mufti Muneeb-ur-Rehman’s organisation for proper management,” she added.\n\nRelease of TLP supporters\n\nThe CM also ordered the immediate release of the TLP supporters, who were proven innocent, and instr­ucted officials to escort them home with “dignity”.\n\nShe dismissed the claim that 400 to 600 people were killed during the TLP protest in Muridke.\n\nReferring to jailed former prime minister and PTI founder Imran Khan, the Punjab CM said: “A person sitting in Adiala Jail tweets that 400 to 600 people died [in Muridke].”\n\nShe added that Mr Khan had been in jail for the last two years and still not stopped inciting sedition. “The lie of hundreds of people being killed was falsely spread. If it were true, where were the dead bodies?” she asked.\n\nThe CM further raised the question as to which hospitals provided medical treatment if thousands were injured.\n\n“No videos of the injured and killed came to surface, but only those of raids and recoveries emerged,” she noted.\n\n“When a police inspector was martyred, his funeral was held and everyone watched,” she continued, asking why were matters brought to such a tragic point that parents, wives, husbands and children were deprived of their loved ones.\n\nThe Punjab CM said everyone was surprised to see such a large number of weapons being recovered from TLP activists and supporters.\n\nDuring police raids, she stated that modern weapons were recovered from TLP activists, including ones that even law enforcement agencies did not possess. “These arms were meant to be used against the state and the police.”\n\nShe denounced the harsh statements being made on social media about security personnel, adding that the agenda of those behind them was only to “defame religious and political parties”.\n\n‘Miscreants creating divisions’\n\nThe CM observed that some people in religious groups were pious, guiding followers toward the truth. However, she asked: “who are those destroying property and taking innocent lives.”\n\nShe criticised the elements creating divisions among religious groups. She said certain miscreant groups were formed only to discredit and harm religious organisations.\n\n“It is the state’s responsibility to protect the lives, property, and honour of citizens and to ensure daily life is not disrupted,” she added.\n\n“The state was forced to act [against the TLP],” she said, continuing that while the world rejoiced over the Gaza ceasefire, some people in the country were calling for a march on Islamabad.\n\n“Not once did these agitators [TLP] speak for Palestine. Instead, they incited violence against the police.”\n\nShe said using women as shields and hiding weapons in mosques was inhumane, referring to the TLP tactics.\n\nThe meeting was inf­o­rmed that all personnel deployed for the CM’s sec­urity were being screened following the crackdown against the TLP.\n\nBesides, the security of the CM and some other members of her cabinet has been beefed up.\n\nThe CM announced a stipend of Rs25,000 per month for a prayer leader (imam) of each of the 65,000 mosques in the province.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/30072607452ff60.webp",
  "retrievedAt": "2025-11-02T00:02:45.129Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952096/punjab-hands-over-tlp-mosques-seminaries-to-moderate-clerics",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:14.000Z"
}
