{
  "title": "PPP announces protest drive against governor for ‘harming’ its interests in Khyber Pakhtunkhwa",
  "author": "Bureau Report",
  "content": "PESHAWAR: Pakistan Peoples Party, Peshawar leaders have announced to launch a protest campaign against Khyber Pakhtunkhwa Governor Faisal Karim Kundi, accusing him of using the Governor’s House for personal gains and causing severe harm to the party’s organisational structure in the province.\n\nAddressing a news conference at the Peshawar Press Club on Wednesday, PPP city district leaders Zulfiqar Afghani and Zulfiqar Awan, accompanied by some local body representatives and other office-bearers, criticised the provincial and central leadership for ‘neglecting’ party affairs in KP.\n\nThey lamented that no ceremony was held anywhere in Peshawar to commemorate the death anniversary of Begum Nusrat Bhutto, the ‘mother of democracy’, saying only the Peshawar Press Club became the venue for paying tribute to her sacrifices.\n\nThey said Nusrat Bhutto faced imprisonment, police brutality, and dictatorship with courage, yet her legacy was being forgotten and no official event had been organised by the party in her memory.\n\nLeaders allege Kundi exploiting Governor’s House for ‘personal gains’\n\nThe leaders alleged that Governor Kundi — appointed to strengthen the party in the province — was instead ‘destroying’ its foundations and exploiting the Governor’s House for ‘personal gains’.\n\nAccording to them, the governor reports to President Asif Ali Zardari and PPP chairman Bilawal Bhutto Zardari that ‘everything is fine’ in KP, but the ground reality was alarming. They claimed the governor had surrounded himself with a small circle of favourites, while the majority of party workers were being treated ‘like stepchildren’. They also accused him of preventing workers from meeting Bilawal Bhutto and said the provincial president and general secretary had become ‘silent spectators’.\n\nThey gave a 10-day ultimatum to the party’s provincial president Mohammad Ali Shah Bacha and the general secretary to hold talks with workers, and restore district and divisional organisations across the province. They warned if the provincial leadership failed to respond within 10 days, a press conference would be held in Islamabad on Nov 9, followed by a sit-in in front of the Zardari House.\n\nThe leaders also criticised the absence of activity at the PPP secretariat in Peshawar, saying it had been reduced to a venue for photo sessions only. They alleged that Governor Kundi was often away on personal trips, ‘indifferent’ to the party’s disarray in Khyber Pakhtunkhwa, and accused him of patronising certain elements for his own interests.\n\nThey claimed that even when Zulfiqar Afghani’s son was assaulted in the governor’s presence, but no action was taken, alleging Mr Kundi had hired hooligans for his own protection while ignoring loyal party workers.\n\nThey further alleged that the governor had failed to attend the funerals of several senior party members, including Agha Mazhar Hussain, Alamzeb Tufail Khan, Asad Naveed, and Ghulam Muhammad Daya, because he did not even know who the real workers were.\n\nThe PPP Peshawar city leaders said the party’s very existence in Khyber Pakhtunkhwa was under threat as workers were leaving in large numbers, holding the governor responsible. They stressed that if PPP still existed, it was because of those workers who sacrificed their lives and endured imprisonment during martial law.\n\nThey called on Asif Zardari and Bilawal Bhutto to take notice of the situation and protect the legacy of Shaheed Benazir Bhutto.\n\nConcluding the press conference, Zulfiqar Afghani said PPP workers in Peshawar would continue their struggle for the revival of the party in the province, adding that they were not after positions or privileges but wanted to see the party thrive once again in KP.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/30103052780e95a.webp",
  "retrievedAt": "2025-11-02T00:00:43.309Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952015/ppp-announces-protest-drive-against-governor-for-harming-its-interests-in-khyber-pakhtunkhwa",
  "dateList": "2025-10-30",
  "date_published": "2025-10-30T00:00:15.000Z"
}
