{
  "title": "Body of woman brought to KP’s Bara after protests over Tirah ‘shelling’",
  "author": "A Correspondent",
  "content": "KHYBER: The body of a woman and three injured children were brought to Bara after a series of protests by residents against the shelling of private houses in Tirah during fighting between security forces and terrorists.\n\nLocal sources said that another girl, who was killed after her house was hit by a stray mortar shell, was buried in Tirah amid curfew in most parts of the valley.\n\nThey said that while sporadic clashes continued between security forces and terrorist groups, mostly in the Bar Qambarkhel area, residents were strictly advised to remain indoors.\n\nSources said that relatives of the deceased and injured children had to walk for several hours on unfrequented routes in order to reach Bara as traffic between Bara and Tirah remained suspended due to intense gun battle between security forces and terrorists.\n\nThere were also unconfirmed reports of a fierce fighting near an army camp atop Haidarai Kandaw in which several persons from both sides lost lives and sustained injuries.\n\nMeanwhile, political activists and tribesmen staged a protest at Bara Bazaar against the ongoing fighting in Tirah valley and the imposition of curfew.\n\nThey later gathered at the Hayatabad Toll Plaza on the Ring Road for several hours before dispersing in the evening.\n\nAddressing protesters, MNA from Khyber tribal district Iqbal Afridi said that on the Tirah issue and military operations, the provincial government and his party stood with the people.\n\nHe claimed the provincial government had not allowed the launch of any security operation in the province.\n\nMr Afridi said that the chief minister was fighting against the state’s repression.\n\nHe said that military operations were launched by the federal government, with the provincial governments having nothing to do with it.\n\n“During Prime Minister Imran Khan’s government, there was peace in the tribal region. The drone strikes and military operations started after the PTI government was ousted,” he claimed.\n\nThe lawmaker alleged that wars were imposed on tribal people for money and to please the United States.\n\nHe said that tribesmen’s sacrifices for the country were not hidden.\n\nMr Afridi claimed that innocent women and children were killed in clashes between security forces and terrorists.\n\nLater in the evening, Mr Afridi said representatives from the region would go to the chief minister to demand an end to security operations in the province and if the demand wasn’t met, residents would take to the streets.\n\nHe also threatened to stage another protest sit-in today (Thursday).\n\nThe protest continued for several hours, blocking the Ring Road, the main artery connecting the Hayatabad with other areas of the city, to the misery of motorists and commuters.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/301035448fb7ed0.webp",
  "retrievedAt": "2025-11-02T00:00:43.351Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952016/body-of-woman-brought-to-kps-bara-after-protests-over-tirah-shelling",
  "dateList": "2025-10-30",
  "date_published": "2025-10-30T00:00:15.000Z"
}
