{
  "title": "Israel demanded Google, Amazon use secret code to bypass legal obligations, investigation reveals",
  "author": "Dawn.com",
  "content": "Tech giants Google and Amazon agreed to use a secret code to evade legal obligations in countries around the world to serve Israeli interests, a report by The Guardian has revealed.\n\nThe joint investigation, conducted with Israeli-Palestinian publication +972 Magazine and Hebrew-language outlet Local Call, highlights how a $1.2 billion cloud-computing deal in 2021 (known as Project Nimbus)  between Israeli government and the tech firms had an “unusual demand”, i.e., agree to use a secret code as part of an arrangement that would become known as the “winking mechanism”.\n\nProject Nimbus was a joint contract that aimed to provide cloud computing infrastructure, artificial intelligence (AI) and other technology services to the Israeli government and its military, which has faced condemnation for its war on Gaza, described by United Nations experts and several countries as a genocide.\n\nGoogle employees based in the United States also staged protests last year at the tech giant’s offices in New York City, California and Seattle to oppose the contract.\n\nThe unusual demand as part of the Project Nimbus, according to the Guardian, was born out of Israel’s concerns that data it moves into the global corporations’ cloud platforms could end up in the hands of foreign law enforcement authorities.\n\n“Google and Amazon’s cloud businesses routinely comply with requests from police, prosecutors and security services to hand over customer data to assist investigations,” the report points out. However, “the process is often cloaked in secrecy”.\n\n“The companies are frequently gagged from alerting the affected customer their information has been turned over. This is either because the law enforcement agency has the power to demand this or a court has ordered them to stay silent,” the report states.\n\nBut for Israel, losing control of its data to authorities overseas was a significant concern. “So to deal with the threat, officials created a secret warning system: the companies must send signals hidden in payments to the Israeli government, tipping it off when it has disclosed Israeli data to foreign courts or investigators.”\n\nAccording to the report, “Israeli officials inserted into the Nimbus deal a requirement for the companies to send coded message, a “wink”, to its government, revealing the identity of the country they had been compelled to hand over Israeli data to, but were gagged from saying so”.\n\nThe report refers to leaked documents from Israel’s finance ministry, which include a finalised version of the Nimbus agreement suggesting the secret code would take the form of payments (referred to as special compensation) made by the companies to the Israeli government.\n\nCiting the documents, the Guardian details that the payments must be made within 24 hours of the information being transferred and correspond to the telephone dialling code of the foreign country, amounting to sums between 1,000 and 9,999 shekels.\n\nThe report highlights the mechanism of the deal as follows:\n\nIf either Google or Amazon provides information to authorities in the US, where the dialling code is +1, and they are prevented from disclosing their cooperation, they must send the Israeli government 1,000 shekels.\n\nIf, for example, the companies receive a request for Israeli data from authorities in Italy, where the dialling code is +39, they must send 3,900 shekels.\n\nIf the companies conclude that the terms of a gag order prevent them from even signalling which country has received the data, there is a backstop: the companies must pay 100,000 shekels ($30,000) to the Israeli government.\n\nMoreover, “Israeli officials also feared a scenario in which its access to the cloud providers’ technology could be blocked or restricted,” the report says.\n\n“In particular, officials worried that activists and rights groups could place pressure on Google and Amazon, or seek court orders in several European countries, to force them to terminate or limit their business with Israel if their technology were linked to human rights violations.”\n\nThe Guardian investigation refers to government documents prepared after the deal was signed, where Israel inserted controls into the Nimbus agreement which Google and Amazon “appear to have accepted”.\n\n“The documents state that the agreement prohibits the companies from revoking or restricting Israel’s access to their cloud platforms, either due to changes in company policy or because they find Israel’s use of their technology violates their terms of service,” the report emphasises.\n\nThe Guardian further cites an Israeli official familiar with the project stating that there can be “no restrictions” on the kind of information moved into Google and Amazon’s cloud platforms, including military and intelligence data.\n\n“The terms of the deal seen by the Guardian state that Israel is entitled to migrate to the cloud or generate in the cloud any content data they wish,” as per the report.\n\n“Israel inserted the provisions into the deal to avoid a situation in which the companies decide that a certain customer is causing them damage, and therefore cease to sell them services,” the Guardian cites one document as noting.\n\nLast month, Microsoft disabled a set of cloud and AI services used by a unit within the Israeli Ministry of Defence after an internal review found preliminary evidence supporting media reports of a surveillance system in Gaza and the West Bank.\n\nHowever, under the terms of the Nimbus deal, “Google and Amazon are prohibited from taking such action as it would discriminate against the Israeli government,” the Guardian points out. “Doing so would incur financial penalties for the companies, as well as legal action for breach of contract.”\n\nThe report quotes the Israeli finance ministry spokesperson who said Google and Amazon are “bound by stringent contractual obligations that safeguard Israel’s vital interests”, adding that these agreements are confidential and “we will not legitimise the article’s claims by disclosing private commercial terms”.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/30144743f67a5bd.webp",
  "retrievedAt": "2025-11-01T23:58:56.585Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952154/israel-demanded-google-amazon-use-secret-code-to-bypass-legal-obligations-investigation-reveals",
  "dateList": "2025-10-30",
  "date_published": "2025-10-30T09:54:38.000Z"
}
