{
  "title": "We didn’t bat, bowl well in South Africa T20 series opener: Saim",
  "author": "Agencies",
  "content": "RAWALPINDI: While acknowledging below-par batting by his team, Pakistan opener Saim Ayub says South African bowlers produced a fine show that gave the tourists a big win in the first T20 International in Rawalpindi on Tuesday.\n\n“We did not bat well, no doubt. On the other hand, South Africa executed their bowling better [than us] in accordance with the playing conditions, bowling at a very good line and length,” the left-handed Saim told reporters during a post-match media conference.\n\nChasing 195 at the Rawalpindi Cricket Stadium, Pakistan were shot out for 139 in 18.1 overs to give a depleted South African side led by Donovan Ferreira an ideal start in the three-match series.\n\nAnswering a question on the logic behind Pakistan’s decision to bowl first, the 23-year-old player said the dew factor made the hosts opt for bowling.\n\n“In the present playing conditions here in Rawalpindi, the dew factor which generally comes into play during the second innings and that’s why we decided to bowl first,” he said.\n\nReplying to a question regarding Pakistan’s new go-get it approach towards the game since head coach Mike Hesson took charge that resulted in the team getting bowled out, the batter said the home team would continue to look for improvement.\n\n“In recent times, if you recall, we played some games in which we tried to go above-par which usually did not happen in our cricket [before], due to which we also reached the Asia Cup final [in the UAE],” Saim stated.\n\n“Yes, during the same period, we have batted poorly too but we as a team always look to go above-par in every game according to the prevailing conditions.\n\n“The first match [against South Africa] is now history. In the next two games, we will try to outplay them.”\n\nResponding to a query as to why Pakistan did not bowl Faheem Ashraf in the first T20 where South Africa with their three seamers used the conditions well, the opener said the home bowlers did not deliver.\n\n“The captain and coach can answer this question better. As far as my opinion is concerned, I think we did not bowl well. We should have restricted South Africa to a lower total,” he stated.\n\nSaim, who is currently experiencing a lean path with the bat, said pressure was a constant factor in international cricket.\n\n“Pressure [to perform] in the present match is always there even if a player has [already] appeared in 200 [international] matches,” said the struggling opener who has got five ducks, including three consecutive in the Asia Cup staged in September, in his last 11 T20 International innings.\n\nOn whether there was any pressure of limelight, the batter said, “When one enters the ground to play the game, there is nothing like [pressure of] limelight or downfall and the focus is on the match be it batting, bowling or fielding.\n\nTo another question on his dip in batting form, Saim said, “Yes, the scores are not coming. From my side, I am trying my best to keep the same intent.\n\n“If a batter does not want to dominate [the] opponent bowlers, his game finishes,” he added.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/301559320b25e97.webp",
  "retrievedAt": "2025-11-02T00:01:44.721Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952114/we-didnt-bat-bowl-well-in-south-africa-t20-series-opener-saim",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:40.000Z"
}
