{
  "title": "AI chip giant Nvidia becomes world’s first $5 trillion firm",
  "author": "AFP",
  "content": "NEW YORK: AI chip juggernaut Nvidia became the world’s first $5 trillion company on Wednesday, as investors remain confident that artificial intelligence will deliver a new wave of innovation and growth.\n\nThe California-based tech giant saw its share price rise by 4.91 percent to $210.90 at the open of trading on Wall Street, pushing Nvidia’s market capitalisation past the never-before-seen threshold.\n\nBy way of comparison, the level was greater than the GDP of France or Germany or higher than that of Tesla, Meta (Facebook), and Netflix combined.\n\nMicrosoft and Apple, the two other largest global market capitalisations, only just exceed $4 trillion in valuation each.\n\nThe surge in Nvidia’s share price follows continued strong sales, a flurry of new deals — including a partnership with Europe’s Nokia announced on Tuesday — as well as expectations that the company may soon regain access to China.\n\n“While it’s almost unfathomable to think about a company reaching this milestone, it comes from a company with so many operational efficiencies that it seems to announce massive deals on a daily or weekly basis.”\n\nNvidia CEO Jensen Huang is expected in South Korea this week, where he will attend the sidelines of the APEC summit, at which US President Donald Trump will meet his Chinese counterpart Xi Jinping, with issues related to AI development expected to be discussed.\n\nIt would invest $5 billion in struggling chip rival Intel, in response to the Trump administration’s desire to bring back more manufacturing of semiconductors to the United States.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/300927315ff5c75.webp",
  "retrievedAt": "2025-11-02T00:01:43.174Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952086/ai-chip-giant-nvidia-becomes-worlds-first-5-trillion-firm",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:48.000Z"
}
