{
  "title": "Onion prices double to Rs220 after tomato crisis",
  "author": "Aamir Shafaat Khan",
  "content": "KARACHI: After facing a severe tomato crisis, consumers now face another serious challenge following a massive increase in onion prices up to Rs 220 per kg from Rs110-120 per kg in just a few days.\n\nAs tomato prices crashed to Rs200 per kg after rising to a record Rs600-700 per kg, onion prices are likely to remain under pressure in the coming days due to a demand-supply gap.\n\nAs soon as the prices of perishable and non-perishable commodities rise substantially, consumers restrict their purchases to their daily requirements rather than buying in bulk.\n\nFalahi Anjuman Wholesale Vegetable Market Super Highway President Haji Shahjehan said supplies of onion from the new Sindh crop have started on a low note, which may pick up pace by the third week of November. Still, till then, prices may remain on the higher side.\n\nHe claimed that a small quantity is also arriving from Iran. Still, prices in the neighbouring country are high, and reports are coming in about problems with the clearance of Iranian onions at the border.\n\nShahjehan said that the markets lack any supply from Afghanistan due to the closure of Pak-Afghan trade for the last two weeks after clashes at the border between the two countries.\n\n“The wholesale markets have been facing a shortage of onions for the last few days due to thin arrivals from the Sindh crop and limited imports from Iran,” he said, adding that the wholesale price of the main staple food items of the kitchen has swelled to Rs6,000-6,500 per 40 kg from Rs3,000-3,500 a few days back.\n\nCurrently, exports of onions have also been suspended due to very high prices, he said.\n\nAs in past practice, daily item prices issued by the Commissioner Karachi never match market prices. The official retail rate of onions is Rs104 per kg, but it is available at Rs200-220 per kg.\n\nMarket traders said that onion prices have also risen in some cities of Punjab, with reports that a 105-kg bag is now available at Rs23,000. They added that the Sindh crop is also finding its way into the Punjab areas.\n\nAs per the Sensitive Price Index data ending Oct 2, the national average price of onion in various cities ranged from Rs55-140 per kg, rising to Rs65-160 per kg in the week ending Oct 23.Economic Survey FY25 suggests that onion production during FY25 surged by 16pc to 2.670 million tonnes from 2.304m tonnes in FY24.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/300734402881e62.webp",
  "retrievedAt": "2025-11-02T00:02:15.150Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952074/onion-prices-double-to-rs220-after-tomato-crisis",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:34.000Z"
}
