{
  "title": "What the US resumption of nuclear testing could mean for the rest of the world",
  "author": "Dawn.com",
  "content": "United States President Donald Trump on Thursday announced that he had instructed the Department of Defence to immediately resume the testing of nuclear weapons on an “equal basis” with other nuclear powers, in a move that could potentially destabilise the nuclear treaty under which countries have been constrained for decades.\n\nThe move has raised concerns about the threat of nuclear power being wielded by multiple countries, including the risk of the collapse of the nuclear disarmament treaty that keeps this power under strict control.\n\nTrump posted on the social media platform Truth Social early this morning the news of the announcement, saying that the US had more nuclear weapons than any other country as a result of his first term in office.\n\n“Because of the tremendous destructive power, I HATED to do it, but I had no choice!” he said, adding, “Russia is second, and China is a distant third, but will be even within 5 years.”\n\nThe Associated Press (AP) reports, contrastingly, that Russia is believed to have 5,580 nuclear warheads according to the Washington-based Arms Control Association, while the US has 5,225. The two countries account for nearly 90 per cent of the world’s atomic warheads.\n\nIn his post, the president attributed the decision to other countries’ testing programmes, saying he had ordered the resumption of testing “on an equal basis” to these countries.\n\nHe was possibly alluding to the successful test of the Poseidon nuclear-powered super torpedo by Russia as announced by its president Vladimir Putin yesterday.\n\nThere are a few confirmed details about the Poseidon, but Reuters has called it a “nuclear-capable cross between a torpedo and a drone”. Military analysts have said this torpedo is capable of devastating coastal regions by triggering vast radioactive ocean swells, while arms control experts say it breaks most of the traditional nuclear deterrence and classification rules.\n\nThe US also has a nuclear weapons rivalry with China, which AP reports is building more ground-based nuclear missile siloes. In particular, under President Xi Jinping, NYT says that China has been rapidly building up its nuclear arsenal after decades of maintaining a comparatively modest force.\n\nAfter the earlier remarks, Trump had met Xi today on the sidelines of the Asia-Pacific Economic Cooperation (APEC) summit and struck a deal to reduce his harsh tariffs on China, in exchange for Beijing resuming US soybean purchases; analysts now express concern about the consequences of ratcheting up nuclear competition between the countries.\n\nAccording to NYT, “Trump’s combative words alone could reinforce wariness in Beijing about US nuclear intentions. Nuclear weapons are one area where distrust between China and the United States has deepened, with little prospect for quick agreement.”\n\nHowever, NYT added that when asked later about his remarks on nuclear weapons testing, Trump suggested that they were not related to China. “It had to do with others,” he said, without naming any countries. “They seem to all be nuclear testing.”\n\nThe Comprehensive Nuclear Test Ban Treaty has been signed by 187 states and is one of the most widely supported disarmament treaties in the world, according to The Conversation. Although the US has yet to ratify the treaty, it is legally bound not to violate its spirit and purpose as a signatory for decades.\n\nAccording to Business Insider, the US last conducted a nuclear weapons test in 1992, when Congress pushed to halt such experiments after the Cold War’s conclusion. Former US President George H.W. Bush signed the moratorium on tests in October of the same year.\n\nUnder the treaty, both the US and Russia have agreed to keep their deployed warheads to a maximum of 1,550. However, China’s rapid buildup of weapons has led to the fear from Washington that China will soon reach the same number of nuclear weapons, turning two-way negotiations into a three-cornered struggle.\n\nThe New York Times reports that moves toward renewed explosive tests of nuclear warheads could “further endanger the treaty that for decades has constrained all but a handful of countries from carrying them out”.\n\nAP reports that, if the US restarted nuclear weapons testing, it isn’t immediately clear what the goal would be.\n\nNonproliferation experts have warned that any scientific objective likely would be eclipsed by backlash. They also point out the possibility that the decision will serve as a “starting gun” for other major nuclear powers to begin their own widespread testing.\n\nIf the United States follows through with resuming nuclear testing, “it would effectively give, I think, China and Russia a carte blanche to resume full-yield nuclear testing, which is something that neither country has done in a number of years,” said Ankit Panda, author of The New Nuclear Age and a senior fellow at the Carnegie Endowment for International Peace, according to NYT.\n\nPanda added that the nuclear nonproliferation regime was “under tremendous stress”, saying, “Russia, China, the United States can’t even agree on the basic principles of what really makes the nonproliferation regime tick.”\n\nMeanwhile, Business Insider reports that some advisors have urged the US to pursue more aggressive nuclear policies and introduce additional modern methods of nuclear attack as a show of strength. As a result, concerns have been growing among nuclear analysts in Washington that the world is on the cusp of a new arms race.\n\nHeader image: An unarmed AGM-86B Air-Launched Cruise Missile is released from a B-52H Stratofortress over the Utah Test and Training Range during a Nuclear Weapons System Evaluation Program sortie, 80 miles west of Salt Lake City, Utah, US on September 22, 2014. — Reuters/File\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/30145912f1c987e.webp",
  "retrievedAt": "2025-11-01T23:58:20.535Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952161/what-the-us-resumption-of-nuclear-testing-could-mean-for-the-rest-of-the-world",
  "dateList": "2025-10-30",
  "date_published": "2025-10-30T10:14:44.000Z"
}
