{
  "title": "Karachi’s Senator Taj Haider Bridge opens to traffic",
  "author": "Dawn Report",
  "content": "KARACHI: The Sindh government has opened to the public the Senator Taj Haider Bridge adjacent to Qayyumabad Chowrangi.\n\nSindh Senior Minister Sharjeel Inam Memon said that the project — named after Pakistan Peoples Party’s late senator and renowned intellectual Taj Haider — would ease travel for people in industrial areas such as Korangi and nearby neighbourhoods.\n\nHe said for the first 10 days the bridge would operate as one-way route.\n\nIn a social media post, he said that the bridge had separate tracks for public transport and cyclists.\n\nSharjeel says bridge, a key part of Yellow Line project, will ease travel between Korangi Industrial Area and nearby localities\n\nThe old Jam Sadiq Bridge will be demolished and replaced with a new bridge built to modern standards, he added.\n\nHe said the newly opened bridge is an integral part of the Bus Rapid Transit (BRT) Yellow Line project, which was progressing rapidly under the Sindh government in collaboration with the World Bank.\n\n“When Yellow Line BRT buses begin service, citizens will have better travel options and relief from congestion. The Sindh government is working to complete the BRT lines as soon as possible,” he said while talking to the media on the occasion.\n\nE-ticketing system message to citizens to obey traffic rules\n\nCommenting on the recently inaugurated e-ticketing traffic system, Mr Memon said that the traffic police launched the e-challan system.\n\n“The message to citizens is to adopt a positive attitude, obey traffic rules and demonstrate discipline so everyone can benefit from the city’s development initiatives,” he said.\n\nThe minister slammed those who were criticising the government without any mandate.\n\nHe said the government would welcome it if people followed traffic rules and no challans were issued. “However, anyone violating the law will face a challan.”\n\nIn response to another question, the senior minister said all citizens deserve respect. “Many accidents occur due to traffic violations, costing precious human lives; often the victim is the sole breadwinner. Our goal is to protect human life.”\n\nHe said more buses were being added to Karachi’s transport fleet. He said Karachi is the Sindh government’s top priority because people from across the country come to the city for work and medical treatment.\n\nHe reiterated that the Sindh government is providing free pink scooties to employed women and students, along with free training and service lines. “No other province is offering such a facility to the public,” he said.\n\nHe said the government plans to add 500 more buses as it works to provide the best possible travel facilities to citizens.\n\nHe also said the job portal launched by iWork for Sindh and the Sindh government on Tuesday was being linked. “Along with government jobs, private-sector job announcements will be posted on iWork for Sindh, while only government positions can be applied for through the Sindh government job portal.”\n\nOn foreign policy, he said Afghanistan is a brotherly country and Pakistan has always sought to support it. “But if Afghanistan is used as a proxy for India to commit or facilitate terrorism against Pakistan, Pakistan’s forces will not tolerate it.”\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/30095838eb2dd3f.webp",
  "retrievedAt": "2025-11-02T00:01:18.112Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952055/karachis-senator-taj-haider-bridge-opens-to-traffic",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:54.000Z"
}
