{
  "title": "India savours ‘greatest day’ after Women’s World Cup heroics",
  "author": "AFP | Reuters",
  "content": "India’s stunning World Cup semi-final win over Australia was described on Friday as the greatest day in the history of women’s cricket in the country, with Jemimah Rodrigues hailed for her “innings of a lifetime”.\n\nBatter Rodrigues hit an unbeaten 127 as the hosts chased down a record 339 in Mumbai on Thursday to oust reigning seven-time champions Australia in Mumbai.\n\nIndia face South Africa in the final at the same venue on Sunday as both teams attempt to win the one-day tournament for the first time in its 52-year history.\n\nAmanjot Kaur hit the winning boundary to take India into their third final of an ODI World Cup, triggering emotional scenes.\n\nThe 25-year-old Rodrigues sank to her knees in tears while her teammates rushed to celebrate the sensational upset.\n\n“This is the greatest day in the history of Indian women’s cricket,” veteran commentator Harsha Bhogle said on X.\n\nVirat Kohli, the star batsman from the men’s team, called Rodrigues’s display the “standout performance”.\n\n“A true display of resilience, belief and passion,” he said on social media.\n\nFormer men’s captain Sunil Gavaskar called the victory “exhilarating” and “absolutely thrilling”, especially because they were clear underdogs.\n\n“They’d lost to three big guns in the tournament and then to come back the way they have just tells you the determination of this team,” the batting great said on TV channel India Today.\n\n“So clearly you can say that the Indian women’s team has definitely come of age.”\n\nIndia lost three successive matches in the league phase before clinching the last semi-final spot, in contrast to Australia’s unbeaten run into the final four.\n\nIndia were in trouble at 59-2 in reply to Australia’s massive 338 when Rodrigues turned the game on its head in a 167-run third-wicket partnership with skipper Harmanpreet Kaur, who hit 89.\n\nRodrigues, a middle-order batter who had a modest start in the tournament and was dropped in the league game against England, was promoted to number three and delivered when it mattered.\n\n“When you are left and then come back into the team the pressure is way too high… today’s innings was a marvellous innings,” said Gavaskar.\n\nThat was echoed by former national cricketer Mohammad Kaif, who called it an “innings of a lifetime”.\n\n“Fantastic to watch free-flowing cricket by Jemimah Rodrigues,” he said on X.\n\n“In and out from the team but she never stopped believing.” India have twice been runners-up, in 2005 and 2017.\n\nIn 2017 they beat Australia in the semi-finals before losing to England.\n\nFacing the pressure of playing in a World Cup on home soil, Rodrigues struggled for consistence, posting two ducks and a pair of 30s before being dropped for India’s group-stage match against England.\n\nShe said she often broke down in calls to her parents as she tried to cope with the pressure.\n\n“I am so blessed to have friends, I can call family, I didn’t have to go through it alone. And it’s okay to ask for help,” Rodrigues said.\n\n“I will be very vulnerable here because I know if someone is watching, this might be going through the same thing. Nobody likes to talk about their weakness,” she added, holding back tears.\n\n“I was going through a lot of anxiety and when you are going through anxiety,\nyou just feel numb. You don’t know what to do. You are trying to be yourself. And in this time, my mum and dad supported me a lot.\n\n“When you are dropped, you have a lot of doubts because I always want to contribute to the team. That really hit me … But sometimes all you need to do is, just hang in there and, things fall into place.”\n\nA composed 76 not out against New Zealand helped restore her confidence and set the stage for her semi-final heroics against seven-times champions Australia.\n\nRodrigues said she had only one thought in mind when she went out to bat.\n\n“All I would say was I didn’t play for my 100. I didn’t play to prove a point at number three,” she said. “I just played to make sure India win. I wanted to see India win at the end and that was my only motivation.”\n\nHeader image: India’s Jemimah Rodrigues celebrates after winning the semi-final against Australia at the DY Patil Stadium in Navi Mumbai, India on October 30, 2025. — Reuters\n\nNewsKit Publishing Platform",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/3113110696e4800.webp",
  "retrievedAt": "2025-11-02T00:03:18.088Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952347/india-savours-greatest-day-after-womens-world-cup-heroics",
  "dateList": "2025-10-30",
  "date_published": "2025-10-31T08:14:32.000Z"
}
