{
  "title": "Qatar’s PM blames Palestinians for ceasefire violation after attack on Israeli soldier",
  "author": "Dawn.com",
  "content": "Qatar’s Prime Minister Sheikh Mohammed bin Abdulrahman bin Jassim Al Thani blamed a “Palestinian party” for a ceasefire violation, referring to the reported killing of an Israeli soldier in southern Gaza’s Rafah on Tuesday.\n\nSpeaking at the Council of Foreign Relations in New York yesterday, the PM told interviewer Ayman Mohyeldin that the attack on the Israeli soldiers was “basically a violation by the Palestinian party”, pointing out that while Hamas has put out a statement that they are not in communication with this group, there is no “verification if this is true or not”.\n\nIt is important to note, however, that following the attack on the soldier, Israeli Prime Minister Benjamin Netanyahu ordered “powerful” retaliatory strikes on Gaza.\n\nThe attacks killed 104 people, mostly women and children, Al Jazeera reported, citing Gaza’s Health Ministry. Israel claimed its strikes targeted senior Hamas fighters, killing dozens, and then said it would start observing the ceasefire again mid-Wednesday.\n\n“We’ve been engaging in a very intensive way with both parties in order to ensure that the ceasefire holds,” Qatar’s PM stated. “The US engagement, of course, was key in that. And I believe that what happened yesterday [Tuesday] was a violation.”\n\nHe pointed out that there had been discussions about Hamas trying to “delay the transfer of bodies”. “We made it very clear for them that this is part of the commitment that we needed to be fulfilled,” he added.\n\n“From our perspective, since the start of this, since October 7 until today, if you look throughout the process, we went through a lot of challenges, a lot of obstacles, and it wasn’t an easy road,” he said.\n\n“We tried our best to navigate and to make sure that we achieved the first [ceasefire], the second one, and now the ceasefire that hopefully will last,” the PM added.\n\nReferring to the incident as “very disappointing and frustrating”, Al-Thani said they are trying to contain it. “We mobilised right away after this and in full coordination with the United States. And we have seen that the US is also committed to the deal.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/30162127fe7c60c.webp",
  "retrievedAt": "2025-11-01T23:58:31.474Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952164/qatars-pm-blames-palestinians-for-ceasefire-violation-after-attack-on-israeli-soldier",
  "dateList": "2025-10-30",
  "date_published": "2025-10-30T12:15:29.000Z"
}
