{
  "title": "Pakistan win silver in boys volleyball after straight-set defeat to Iran at Asian Youth Games",
  "author": "Dawn Sport",
  "content": "Pakistan’s unbeaten streak at the Asian Youth Games came to an end on Wednesday night when Iran dominated the boys volleyball final in three straight sets to win gold, leaving the Green Shirts to take home a silver medal.\n\nPakistan put up a tough fight in all three sets but ultimately lost 25-21, 25-23, 25-23 to Iran.\n\nThe silver was Pakistan’s second medal at the ongoing games so far, with the boys Kabaddi team winning bronze last week.\n\nThe Pakistan Volleyball Federation (PVF) said the team’s silver brought “immense pride and honour to the nation”.\n\n“The team’s performance throughout the tournament was\nexceptional — Pakistan did not lose a single match before the final, defeating teams like Mongolia, Bahrain, Uzbekistan, Saudi Arabia, and China with dominating performances,” the PVF said in a press release.\n\n“The final match was a display of determination and courage, where the Pakistani players pushed hard in every set but were unfortunate to miss the gold medal by a close margin.\n\n“Nevertheless, finishing undefeated until the final stands as a historic achievement for Pakistan volleyball at the youth level.”\n\nThroughout the tournament, standout performances were delivered by Muhammad Yahya, Muhammad Anas, Muhammad Irfan, and Ajmal Junaid, PVF said.\n\nThe federation emphasised that the success was part of its “long-term development plan that started four years ago — from the U16 Asian Championship (Gold Medal) to the U18 Asian Championship, then the U19 World Championship, and now the Silver Medal at the 3rd Asian Youth Games 2025.”\n\nMatch scores throughout tournament:\n\nPak v Indonesia; semi-finals: 22-25, 25-13, 25-19, 26-24 (3-1)\n\nPak v China; quarter-finals: 25-12, 25-13, 25-17 (3-0)\n\nPak v Saudi Arabia; Group ‘E’ classification: 25-16, 25-21, 23-25, 26-24 (3-1)\n\nPak v Uzbekistan; Group ‘E’ classification: 25-13, 25-20, 25-18 (3-0)\n\nPak v Bahrain; preliminary round Pool A: 25-18, 26-24, 25-23 (3-0)\n\nPak v Mongolia; preliminary round Pool A: 25-22, 25-13, 25-15 (3-0)",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/3012140722d794c.webp",
  "retrievedAt": "2025-11-01T23:59:03.163Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952149/pakistan-win-silver-in-boys-volleyball-after-straight-set-defeat-to-iran-at-asian-youth-games",
  "dateList": "2025-10-30",
  "date_published": "2025-10-30T07:16:53.000Z"
}
