{
  "title": "Mills ink deals to import 2m cotton bales",
  "author": "The Newspaper's Staff Reporter",
  "content": "LAHORE: Textile mills have stepped up cotton import agreements following quality concerns over the domestic crop affected by rains, floods, and reports of adulteration by some ginners in Sindh.\n\nIndustry sources said mills were securing imported cotton to ensure timely delivery of export orders. Around two million bales have been contracted over the past six to eight weeks, mainly from Brazil and the United States, with smaller volumes from Mexico and Argentina.\n\nThis year marks the first time Pakistan is imp­orting more cotton from Brazil than from any other origin. Analysts attribute this shift to Brazil’s strong crop performance and relatively competitive prices. However, some mills have reportedly scaled back orders from Brazil due to the “Honey Dew” issue de­­tected in this season’s crop.\n\nThe temporary closure of the Pakistan-Afghan­istan border has also disrupted trade, with around 50,000 bales reportedly returned to Afghanistan. Industry officials said Pakistani mills might cancel import contracts for about 500,000 bales of Afghan cotton if the situation persists. Pakistan traditionally imports most of Afghanistan’s annual cotton output of about one million bales.\n\nCotton Ginners Forum Chairman Ihsan-ul-Haq said the International Cot­ton Association has rece­n­tly blacklisted several Pak­istani mills for defaulting on past import contracts, leading to the cancellation of some new deals.\n\nHe added that an incident in Tando Adam, Sindh, has raised fresh concerns about domestic cotton quality after reports surfaced that a ginner had mixed cotton waste into finished bales. Instead of taking action against the factory, local authorities registered a case against a four-member Pakistan Cotton Ginners Association (PCGA) team that had gone to inspect the site.\n\nMr Haq said this development has created anxiety among ginners and called on federal and provincial authorities to take strict action against those involved in adulteration to protect the reputation and export potential of Pakistani cotton.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/300756301610e0c.webp",
  "retrievedAt": "2025-11-02T00:01:42.436Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952069/mills-ink-deals-to-import-2m-cotton-bales",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:34.000Z"
}
