{
  "title": "PSX extends losses amid Afghan border deadlock",
  "author": "Muhammad Kashif",
  "content": "KARACHI: Amid renewed border tensions with Afghanistan, the Pakistan Stock Exchange (PSX) on Wednesday extended its losing streak for a sixth consecutive session, with the benchmark KSE-100 index falling below the 159,000-point level as investors continued profit-taking during the rollover week.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, said the decline was primarily driven by the breakdown of Islamabad-Kabul talks, which ended without progress on key border and security issues.\n\nThe stalemate has intensified regional uncertainty, dampening investor sentiment and raising concerns over its impact on cross-border trade.\n\nAccording to Topline Securities, the market opened positively, gaining 589 points in early trade. However, selling pressure soon mounted, pushing the index down by 1,794 points intraday. The benchmark later recovered slightly to close at 158,465.06, down 1,635.97 points or 1.02 per cent.\n\nThe market remained in a corrective phase as investors responded to mixed corporate earnings. While some companies posted stronger profits, others fell short of expectations. Margin calls on leveraged positions added to the downward pressure, while volatility remained high amid the ongoing futures rollover.\n\nMajor draggers inclu­d­­ed Lucky Cement, United Bank, Mari Energies, MCB Bank and Engro Fer­tiliser, collectively shaving off 577 points from the index. In contrast, National Bank, Thal Ltd, Bank Alfalah, Javedan Cement and Interloop Ltd provided limited support, adding 186 points.\n\nTrading activity also weakened, with volume dropping 6.56pc to 950 million shares, falling below the one-billion mark after several sessions. However, traded value increased 11.81pc to Rs41.2bn. K-Electric led the volume chart with 92.9 million shares changing hands.\n\nAnalysts said the breach of the 160,000 level — a key psychological threshold — reflected increased caution among market participants.\n\nThe next support is seen at 157,678 points, the recent low recorded on Oct 13. The coming sessions will indicate whether the market can stabilise or continue its downward trend.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/30081121b20ee73.webp",
  "retrievedAt": "2025-11-02T00:01:35.980Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952067/psx-extends-losses-amid-afghan-border-deadlock",
  "dateList": "2025-10-30",
  "date_published": "2025-10-29T23:59:34.000Z"
}
