{
  "title": "Reforms to transform judiciary into citizen-focused underway",
  "author": null,
  "content": "ISLAMABAD, Jan 23 (APP): As a part of his Judicial Reforms, the Chief Justice of Pakistan, Yahya Afridi, has undertaken transformative reforms to modernize the judiciary and establish it as a model institution that upholds fairness, transparency, and accessibility to meet standards for judicial excellence and ensuring that the justice system remains citizen-focused and responsive to the litigants needs.\nAccording to a press released from the media office of the SCP issued Thursday, advanced information technology systems have been integrated to enhance judicial efficiency, including the e-Affidavit system, which streamlines filing processes, reduces delays, and ensures transparency, and a Case Management System enabling litigants and lawyers to instantly access certified case copies, eliminating traditional dispatch delays.\nTo promote transparency and public trust, feedback mechanisms involving legal practitioners, litigants, and civil society have been introduced. Recognizing the vital role of the district judiciary, the Chief Justice has personally visited remote and underserved districts to assess grassroots challenges, enhance institutional capacity, and address resource gaps, ensuring equitable access to justice and strengthening public confidence in the judicial system.\nThe press release added that to uphold transparency and meritocracy in appointments, the Chief Justice has constituted committees, comprising senior judges and the Attorney General for Pakistan to oversee the selection of key appointments, including the Secretaries of the Law and Justice Commission of Pakistan, the Judicial Commission of Pakistan, and the Supreme Judicial Council.\nThe committee for the selection of the Secretary of the Law and Justice Commission of Pakistan is chaired by Chief Justice Yahya Afridi and comprises Mrs. Justice Ayesha Malik and Justice Shahid Waheed to interview the candidates nominated by the Chief Secretaries of the provinces.\nSimilarly, the committee for selection of the Secretary of the Judicial Commission of Pakistan consists of Justice Syed Mansoor Ali Shah, Justice Munib Akhtar, Justice Amin-ud-Din Khan, Justice Jamal Khan Mandokhel, and the Attorney General for Pakistan.\nFor the Secretary of the Supreme Judicial Council, the committee comprises Justice Syed Mansoor Ali Shah, Justice Munib Akhtar, and the Attorney General for Pakistan. These committees will interview the candidates, including serving and retired District and Sessions Judges, nominated by the Chief Justices of the five High Courts and Chief Secretaries of the provinces.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:58:02.912Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/reforms-to-transform-judiciary-into-citizen-focused-underway/",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T13:56:00.000Z"
}
