{
  "title": "Hutchison Ports expresses investment  US$1 billion in Pakistan’s port infrastructure",
  "author": null,
  "content": "ISLAMABAD, Jan 23 (APP):A high-level delegation from Hutchison Ports, led by Andy Tsoi, Managing Director for the Middle East & Africa Division, met with Federal Minister for Maritime Affairs Qaiser Ahmed Shaikh and secretary Syed Zafar Ali Shah to share a proposed US$1 billion investment plan.\nAccompanying Andy Tsoi were Capt Rashid Jamil, Country Advisor for Hutchison Ports Pakistan, and Leonard Fung, Business Director for the Middle East & Africa Division at Hutchison Ports.\nThis groundbreaking proposal, which includes an upfront US$200 million Foreign Direct Investment (FDI), aims to modernize Pakistan’s port infrastructure and elevate its role in global trade, said a press release issued here on Thursday.\nThe proposed investment focuses on upgrading Karachi International Container Terminal (KICT) and South Asia Pakistan Terminals Limited (SAPT) with advanced automation technologies, enhancing operational efficiency, and adopting eco-friendly solutions. The plan includes the introduction of electrified and remote-control equipment to reduce carbon emissions, reflecting the government’s commitment to sustainable development.\nAdditionally, Hutchison Ports’ proposal includes the establishment of a state-of-the-art warehousing depot to address the growing demands of Pakistan’s trade sector. Significant funding is also proposed for improving road infrastructure around the south wharf to ensure smooth container traffic flow and boost supply chain efficiency.\nThe minister welcomed the proposal, stating: “This partnership represents a significant milestone in Pakistan’s journey to becoming a global trade leader. Hutchison Ports’ confidence in our economic potential highlights the transformative opportunities in our maritime sector.”\nAndy Tsoi, Managing Director of Hutchison Ports, expressed his views: “We are proud to partner with the Government of Pakistan to modernize and innovate its maritime infrastructure. This proposed investment reflects our long-term commitment to enhancing trade and logistics in the region.”\nOther delegates also shared their optimism about the project’s potential to significantly boost Pakistan’s trade and logistics capabilities, further strengthening Hutchison Ports’ long-standing partnership with the country.\nThe Ministry of Maritime Affairs remains focused on fostering partnerships that drive economic growth, create jobs, and strengthen Pakistan’s global trade networks. This landmark proposed investment underscores Pakistan’s potential to become a key player in the global maritime industry.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:57:03.889Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/hutchison-ports-expresses-investment-us1-billion-in-pakistans-port-infrastructure/",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T17:45:00.000Z"
}
