{
  "title": "IT ministry invests Rs 57 bln to enhance connectivity: Amin",
  "link": "https://www.app.com.pk/national/it-ministry-invests-rs-57-bln-to-enhance-connectivity-amin/",
  "date_published": "2022-03-18T11:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): Federal Minister for IT and Telecommunication Syed Amin Ul Haque Friday said that his ministry has invested about Rs. 57 billion to enhance connectivity and improve digital infrastructure to facilitate the common man in the country.\nAddressing Pakistan Cloud Summit 2022 he said that the first Cloud Policy by the Ministry of IT was the greatest milestone achieved by Pakistan and the efforts being made to connect the country to the whole globe through connectivity.\nUnderscoring the need for exploration and investing in Information Technology, Syed Amin Ul Haque said that the government’s target after achieving the milestone of 4G should be towards 5G and the transformation of industrial and Information Technology economy would not only boost the economy but would also create job opportunities.\nThe performance of the Information Technology and Telecommunication Ministry was outstanding for the past three years, nevertheless, the world had suffered from COVID-19 and the ministry of IT invested more than Rs. 57 billion over connectivity, he added.\nAddressing the Summit, Federal Secretary Information Technology and Telecommunications, Muhammad Suhail Rajput said that the world was moving fast towards the transformation of IT and IT services, therefore Pakistan’s agrarian economy should be changed with an IT-based economy.\nLater on, the contract signing ceremony was held between PSEB and Huawei to offer cloud service to the IT Industry Pakistan Cloud Summit 2022 organized by Huawei with the collaboration of Abacus was graced by the presence of Muhammad Suhail Rajput, the Federal Secretary of Information Technology and Telecommunication, Usman Nasir Managing Director, PSEB members, IT entrepreneurs and other notables.",
  "retrievedAt": "2025-08-11T14:33:31.435Z"
}
