{
  "title": "No intention to impose Governor rule in Sindh: Qureshi",
  "link": "https://www.app.com.pk/national/no-intention-to-impose-governor-rule-in-sindh-qureshi/",
  "date_published": "2022-03-18T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): Minister for Foreign Affairs Shah Mahmood Qureshi Friday made clear that the federal government had no intention to impose Governor rule in Sindh.\nAddressing a press conference along with federal ministers Asad Umar and Fawad Chaudhry here, he said today political committee of Pakistan Tehreek I Insaf (PTI) met under the chairmanship of Prime Minister Imran Khan.\nThe participants held consultations on the issue of no confidence motion, he added.He said it was decided that the party would face the no confidence motion and would defeat opponents.\nSpeculation was made about our allies but he was saying consistently that our allies would not leave PTI, he added.\n“I knew Chaudhrys and they will not make emotional decision but will take political decisions as they knew how much room Pakistan Muslim League(N) has for them.”\nHe said PMLN created hurdles in the way of PMLQ in 2018 and now PMLN had majority in the Punjab and they would remove PMLQ from power whenever they would want.\nThe minister said everybody knew the treatment meted out by Peoples Party to Muttahida Qaumi Movement in Sindh.\nHe said those who were elected on the symbol of bat and were sitting in the Sindh House knew the requirements of law and constitution.\nPMLN did not fulfill the promises made with people for the award of tickets, he said adding he would ask his colleagues not to sit in the lap of political opponents and look at the situation coolly.\nHe said the political committee stated that if despite the appeals, any member deserted the party he would be issued a show cause notice.\n“There is no room for minus one in Tehreek I Insaf,” he said adding Peoples Party and Muslim League(N) never agreed to minus one in their party.\nShehbaz Sharif could not replace Nawaz Sharif , he said adding Imran Khan was the founder of Pakistan Tehreek I Insaf (PTI) and it formed four governments at the federal and provincial levels.\nHe said he was seeing that winds of change were blowing in Sindh.\nHe said opposition should ponder over the situation in Afghanistan, adding India could not give a reason for accidental firing of missile into Pakistan.\nQureshi said the situation of Ukraine was affecting economies of the world and in this situation Pakistan could not afford political instability.\nPeoples Party used public resources for their march from Karachi to Islamabad and the government did not create any hurdle in its way, he added.",
  "retrievedAt": "2025-08-11T14:33:43.587Z"
}
