{
  "title": "CJCSC calls on military leadership during visits to Germany, Switzerland",
  "link": "https://www.app.com.pk/national/cjcsc-calls-on-military-leadership-during-visits-to-germany-switzerland/",
  "date_published": "2022-03-18T10:46:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 18 (APP): Chairman Joint Chiefs of Staff Committee, General Nadeem Raza, who is on official visit to Germany and Switzerland called on Chief of the Defence Forces, Germany General Eberhard ZORN.\nDuring the meeting, matters of bilateral professional interest including further strengthening of security and defence cooperation between the two countries was brought into discussion, said an Inter Services Public Relations (ISPR) news release here received.\nBoth sides reaffirmed their commitment to work together for peace, security and stability in the region particularly in Afghanistan.\nCJCSC during his visit of Germany also visited German Infantry School at Hammelburg and Center for Internal Leadership at Kolbenz where he was briefed about the mandate and curriculum of the institutes.\nEarlier, upon arrival at German Ministry of Defence a smartly turned out contingent presented ‘Guard of Honour’ to the CJCSC.\nLater, General Nadeem Raza visited Switzerland where he called on Chief of Swiss Armed Forces, Lieutenant General Thomas SUSSLI.\nThe CJCSC reviewed the full gamut of bilateral defence relations and exchanged views on global and regional security environment and enhanced military and defence cooperation between the two Armed Forces.The CJCSC also visited Geneva Center for Security Policy (GCSP). GCSP is an international foundation that provides executive education and training in comprehensive international peace and security policy.\nDuring the visit of the center, General Nadeem Raza highlighted the security perspective of Pakistan on geo-strategic situation of the region with emphasis on Afghanistan. The General emphasized upon the need for reconciliation within Afghanistan for regional peace and security.",
  "retrievedAt": "2025-08-11T14:33:34.549Z"
}
