{
  "title": "Farrukh appeals to ECP to take action against turn coats",
  "link": "https://www.app.com.pk/national/farrukh-appeals-to-ecp-to-take-action-against-turn-coats/",
  "date_published": "2022-03-18T08:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): Minister of State for Information and Broadcasting Farrukh Habib on Friday appealed to Election Commission of Pakistan (ECP) to take notice of the ongoing horse trading at Sindh House and take action against turn coats to end this ugly practice.\nTalking to media outside the Election Commission of Pakistan along with Parliamentary Secretary for Law and Justice Malika Bukhari, he said that Election Act was clear that loyalties of a voter could not be bought with money.\nThe ECP had an opportunity to end this unholy practice by disqualifying Yousuf Raza Gilani, the minister said.\nHe said that Sindh House has been turned into an “auction house”,and all fraudsters were there.In connection with NFC, he said the Sindh government was given Rs 2000 billion but no body knew where that huge amount was spent.\nTaking a jibe on the revolting MNAs of the PTI he said those who could not become councilors, begged Imran Khan for PTI tickets before 2018 elections.\n” But now seeing the shine of currency notes they have sold their conscience”, the minister said.Farrukh Habib appealed to the ECP to decide case against Yousuf Raza Gilani and immediately stop vote sale and purchase practice once for all. He said votes of Members of National Assembly were purchased in Senate election and video of Gilani’s son was its evidence.\n“We have not done anything wrong by saying ‘Absolutely not,’ we are ready to face the consequences”, he said.\nHe said the “captain” will fight hard and will not be blackmailed by dirty tactics and he will not make any compromise on principles.\n“Today all the corrupts are on one side and Imran Khan is standing firm against them”, Farrukh Habib said.\nTo a question, he said, in coalition set up all allies were taken along, though there may be some difference of opinion on certain issues.\n“We will not allow Pakistan’s democracy to become an ‘auction house’ and will resist and stand against such shameful acts”, he said.\nHe said that Article 63A was clear, the laws are made to be feared and the people should not be able break it.\nHe challenged the revolting MNAs to come out of Sindh house, tender resignation and seek re-election.He said that the people of their respective constituencies would teach them a lesson as they would lose badly against Imran Khan’s candidates.",
  "retrievedAt": "2025-08-11T14:33:37.263Z"
}
