{
  "title": "Dr Sania chairs a meeting to plan integration of Chatbot in Ehsaas Raabta app",
  "link": "https://www.app.com.pk/national/dr-sania-chairs-a-meeting-to-plan-integration-of-chatbot-in-ehsaas-raabta-app/",
  "date_published": "2022-03-18T10:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Senator Dr Sania Nishtar on Friday convened a meeting to take stock of the refinements being made to the “Ehsaas Raabta App” that is currently in its final stages. Principally aimed at guiding a common man about different programmes of Ehsaas, the android-based Ehsaas Raabta App will be available shortly on Google Playstore.\n“Ehsaas Raabta will be an all-in-one platform of Ehsaas, digitally linking the public with the right set of information needed to enroll and benefit from its diverse programmes. ChatBot is also being integrated into this app to help users by providing answers to their queries about Ehsaas”, said Dr Sania Nishtar.\nDr Sania appreciated the Technology Team of Ehsaas who were working hard to develop this app. The meeting also reviewed the quality and improvement aspects of the app. To make it more apt and user-friendly, several value additions were also discussed alongside the timelines.\nSecretary Ismat Tahira, Additional Secretary Syed Muazzam Ali, Director General Naveed Akbar, Director General Noor Rehman, Director General Meer Anwar and other senior officials of Ehsaas programme were also present in the meeting.\nSpecifically designed instructional information in Urdu allows the app users to read and understand information of myriad Ehsaas programmes: Ehsaas Kafaalat, Ehsaas Taleemi Wazaif, Ehsaas Rashan Riayat, Ehsaas Nashonuma, Ehsaas Survey, Ehsaas Registration Desks, Ehsaas Undergraduate Scholarship, Ehsaas Interest Free Loan, Ehsaas Bachat Account, Ehsaas Amdan, Dar-ul-Ehsaas, Ehsaas Panagah, Ehsaas Langar, Ehsaas Koi Bhooka Na Soye, One Window Ehsaas, Ehsaas Tahafuz and several others.\nThrough Ehsaas Raabta App, anyone interested to know about his/her entitlements for various benefits under Ehsaas will go to the Ehsaas 8171 web portal section.\nBy scanning the QR code mentioned on the backside of Ehsaas Card, the app will inform the user about the whole range of entitlements for his/her family under Ehsaas.",
  "retrievedAt": "2025-08-11T14:33:34.592Z"
}
