{
  "title": "Strengthening youth’s intellectual power vital to judge fake news: President",
  "link": "https://www.app.com.pk/national/strengthening-youths-intellectual-power-vital-to-judge-fake-news-president/",
  "date_published": "2022-03-18T12:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): President Dr Arif Alvi Friday said that amidst the onslaught of digital media influencing the thinking of everyone globally, it was essential to strengthen the intellectual power of the youth to enable them to judge the fake news.\nThe president, addressing a seminar on “Digital Transformation: Political economy of Media” held by Rifah Institute of Media Sciences, also called for constituting committees at schools to ensure enhanced discussions on the subject.\nQuoting an American journal’s report, the president said the 14 years old youngsters were more susceptible to getting influenced by the fake news. Therefore, he said it was essential to launch countering efforts even before the kids reach the age of 14.\nLauding the idea of the seminar, the president said the similar exercises needed to be done at the larger scale to achieve a progressive Pakistan as digital media was transforming society across the world bringing a whole new world into existence.\nHe said as blocking the objectionable content could not be a solution, therefore the government and the educational institutions should enable the people to differentiate between right and wrong.\nHe said for sake of clients, the digital media companies flooded the users with the desired content on the basis of web analytics, exposing everyone particularly teenagers to the risks of undesirable content.\nHe said every conservative society desired to control the social media content to prevent its impact on society, however, it was not a solution to the problem. This technique is being used by all social media giants making the users dependent on it, he added.\nHe said owing to commercial reasons, the media could also not solely focus moral building of the society.\nHe said the Holy Quran had also advised the followers to judge the news before believing it, and exemplified the destruction of Iraq just on the basis of fake news of the existence of the weapons of mass destruction there.\nPresident Alvi said the problem was getting complicated with the passage of time as the world was not getting deliverance from the wars. This necessitated moral training as well as enhanced discussions keeping in view the needs of the society.\nHe told the gathering that as the haptic and holographic technologies were getting sophisticated day by day, things would go out of human control within the next 10 to 15 years.\nVice Chancellor of Rifah International University and Chairman of Rahmatullil Alameen Authority Dr Anis Ahmed said besides providing entertainment, the media is also responsible for character building.\nHe said the children were getting influenced by the intellect being provided by the western media tools which was in no way conforming with our social norms.\nHe said keeping in view the negative impacts of the media onslaught, the media should play a constructive role to build an ideal society.",
  "retrievedAt": "2025-08-11T14:33:27.551Z"
}
