{
  "title": "Musk’s Tesla marks formal India entry with Mumbai launch event - World - DAWN.COM",
  "author": null,
  "content": "Tesla will open its first India showroom in Mumbai next week, having imported $1 million worth of cars and merchandise, marking its entry into the world’s third-largest car market despite CEO Elon Musk’s complaints about high import tariffs.\n\nIn an invitation to the media on Thursday, the carmaker said the July 15 event was the “launch of Tesla in India through the opening of the Tesla experience centre at Bandra Kurla Complex,” located in the city’s leading commercial business district.\n\nGrappling with excess manufacturing capacity at its other factories and falling sales, Tesla has pivoted to selling imported cars in India, on which it will need to pay about 70 per cent import duty and other levies.\n\nCommercially available custom records from January to June showed Tesla imported vehicles, chargers and accessories into India worth close to $1m, mainly from China and the United States.\n\nThe vehicles included six of Tesla’s best-selling Model Y at a shipment value of $32,500 each for five cars, and $46,000 for the long-range version, as well as several Superchargers.\n\nIndian Prime Minister Narendra Modi’s government has for years wooed Tesla, including forming a new policy to attract the carmaker to build its EVs locally.\n\nLast year, Musk had planned to visit India, where he was expected to announce an investment of $2 billion to $3 billion, including in local EV manufacturing. But he cancelled the trip at the last moment. Tesla has conveyed that it is not interested in manufacturing in India at the moment.\n\nUS President Donald Trump has said that if Tesla were to build a factory in India to circumvent that country’s tariffs, it would be “unfair” to the US. Tesla has hired for several of the three dozen positions it advertised in India earlier this year, bringing on board store managers, sales and service executives. It is looking for supply chain engineers and vehicle operators for its autopilot ambitions.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/171445066ea6699.jpg",
  "retrievedAt": "2025-08-17T20:11:39.511Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923483/musks-tesla-marks-formal-india-entry-with-mumbai-launch-event",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T06:59:32.000Z"
}
