{
  "title": "SBP builds reserves on record inflows, dollar buying - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The State Bank of Pakistan (SBP) ramped up its foreign exchange reserves to a 39-month high of $14.5 billion by the end of FY25 after managing to secure $1.77bn during the week ending July 4 — a development aimed at sending a strong signal to market stability.\n\nAccording to SBP data released on Thursday, the central bank’s reserves rose primarily on the back of official inflows, though no specific breakdown was provided.\n\nBankers said the SBP purchased over $8bn from the interbank market during FY25, supported by record-high remittances of $38.3bn.\n\nThese inflows were primarily driven by incentives offered to banks on transactions from overseas Pakistanis. However, the government is now considering scrapping these incentives, though no final decision has been made.\n\nThe central bank also maintained a tight grip on dollar outflows throughout the year, particularly during the final quarter, frustrating importers who struggled to secure foreign exchange. This control on imports, combined with heavy dollar buying, led to a shortage that gradually pushed the exchange rate upward.\n\nSome bankers noted that to attract more remittances, banks were offering higher rates to overseas senders — exceeding official dollar quotes — to capitalise on per-transaction incentives.\n\nThe dollar’s appreciation in the local market continued on Thursday. The Exchange Companies Association of Pakistan reported the interbank rate at Rs284.76, up 10 paise from the previous day, while the open market rate rose 50 paise to Rs287.50.\n\nThis rise came despite the US dollar weakening globally against major currencies, with the greenback slipping further from a two-week high on Thursday.\n\nCurrency analysts believe the SBP’s reserve build-up could continue in FY26, potentially reaching $20bn. However, this would depend on sustained remittance inflows, rollover of a significant portion of external debt, and smooth relations with the International Monetary Fund (IMF).\n\nPakistan faced little difficulty in securing commercial loans during FY25, largely due to its continued participation in the IMF programme — a factor expected to sustain investor confidence and ease access to external financing.\n\nAs of July 4, the country’s total foreign exchange reserves stood at $20.028bn, including $5.526bn held by commercial banks, according to SBP data.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/2810523075c2bd3.jpg?r=105240",
  "retrievedAt": "2025-08-17T20:12:52.556Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923377/sbp-builds-reserves-on-record-inflows-dollar-buying",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:34.000Z"
}
