{
  "title": "Rubio says Asia might get ‘better’ tariffs than others - World - DAWN.COM",
  "author": null,
  "content": "KUALA LUMPUR: US Secretary of State Marco Rubio said on Thursday that Asian nations might get “better” tariff rates than the rest of the world, as he attended Asean talks focused on Washington’s trade war.\n\nRubio’s visit to Malaysia came after US President Donald Trump threatened this week to impose punitive tariffs on more than 20 countries if they did not strike deals with Washington by Aug 1.\n\n“I would say that when all is said and done, many of the countries in Southeast Asia are going to have tariff rates that are actually better than countries in other parts of the world,” Rubio said on the sidelines of the Association of Southeast Asian Nations meeting in Kuala Lumpur.\n\n“But these talks continue. There’ll be talks next week with Japan. There’s ongoing talks with virtually every country represented here.”\n\nTrump said on Monday that duties he had suspended in April would snap back — even more steeply — by the new deadline.\n\nHe has told more than 20 countries, many in Asia, they face tariffs ranging from 20 to 50 per cent, and announced a 50pc toll on copper imports and a possible 200pc duty on pharmaceuticals.\n\nAmong those targeted were top trade partners Japan and South Korea, which could each be hit with 25pc.\n\nIndonesia, Laos, Thailand, Malaysia, the Philippines, Brunei and Myanmar all members of Asean face duties ranging from 20 pc to 40pc.\n\nVietnam, which is also an Asean member, is one of only two countries Britain being the other to have reached a tentative agreement with Trump.\n\nThe levels were not too far from those originally threatened in April, although some were notably lower this time.\n\n`Not going to walk away’\n\nUS officials said ahead of Rubio’s trip that Washington was “prioritising” its commitment to East and Southeast Asia.\n\nIn Malaysia, Rubio said the United States has “no intention of abandoning” the region.\n\n“We’ve spent decades building these relationships,” Rubio told reporters.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/110939282d15a6e.jpg",
  "retrievedAt": "2025-08-17T20:12:36.172Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923393/rubio-says-asia-might-get-better-tariffs-than-others",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:47.000Z"
}
