{
  "title": "Russia bombards Kyiv before ‘frank’ talks with US and aid pledges - World - DAWN.COM",
  "author": null,
  "content": "KYIV: Russia unleashed heavy air strikes on Ukraine on Thursday before a conference in Rome at which Kyiv won billions of dollars in aid pledges, and US-Russian talks at which Washington voiced frustration with Moscow over the war.\n\nTwo people were killed, 23 were wounded and there was damage in nearly every part of Kyiv from missile and drone attacks on the capital and other parts of Ukraine. Addressing the Rome conference on Ukraine’s reconstruction after more than three years of war, President Volodymyr Zelensky urged allies to “more actively” use Russian assets for rebuilding and called for weapons, joint defence production and investment.\n\nParticipants pledged over 10 billion euros ($12bn) to help rebuild Ukraine, with the European Commission announcing 2.3bn euros ($2.7bn) in support.\n\nUS President Donald Trump has been increasingly frustrated with Vladimir Putin over the lack of progress towards ending the war raging since Russia’s invasion of Ukraine in Feb 2022, and has accused the Russian president of throwing a lot of “bullshit” at US efforts to end the conflict.\n\nAt talks with Russian Foreign Minister Sergei Lavrov while in Malaysia, US Secretary of State Marco Rubio said he had reinforced the message that Moscow should show more flexibility.\n\n“We need to see a roadmap moving forward about how this conflict can conclude,” Rubio said, adding that the Trump administration had been engaging with the US Senate on what new sanctions on Russia might look like.\n\n“It was a frank conversation. It was an important one,” Rubio said after the 50-minute talks in Kuala Lumpur. Moscow’s foreign ministry said they had shared “a substantive and frank exchange of views”.\n\nZelensky said Thursday’s assault by Russia had involved around 400 drones and 18 missiles, primarily targeting the capital.\n\nExplosions and anti-aircraft fire rattled the city. Windows were blown out, facades ravaged and cars burned to shells. In the city centre, an apartment in an eight-storey building was engulfed in flames.\n\n“This is terror because it happens every night when people are asleep,” said Karyna Volf, a 25-year-old Kyiv resident who rushed out of her apartment moments before it was showered with shards of glass.\n\nAir defences stopped all but a few dozen of the drones, authorities said, a day after Russia launched a record 728 drones at Ukraine.\n\nAir defence strained\n\nEscalating Russian strikes in recent weeks have strained Ukraine’s defences at a time when its troops are facing renewed pressure on the front line, and forced residents in Kyiv and across the country into bomb shelters.\n\nRussia’s defence ministry said it had hit “military-industrial” targets in Kyiv as well as military airfields. It denied targeting civilians, although towns and cities have been hit regularly in the war.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/110955540ba7922.jpg",
  "retrievedAt": "2025-08-17T20:12:31.155Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923391/russia-bombards-kyiv-before-frank-talks-with-us-and-aid-pledges",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:47.000Z"
}
