{
  "title": "Saud Shakeel to lead Pakistan Shaheens squad for England tour - Sport - DAWN.COM",
  "author": null,
  "content": "The Pakistan Cricket Board (PCB) on Friday announced that Saud Shakeel will lead an 18-member Pakistan Shaheens squad to tour England from July 17 to August 6 for two three-day and three 50-over matches.\n\nPakistan Shaheens, the name for the men’s ‘A’ team, last featured in a match against the Bangladesh ‘A’ side in Dubai in February of this year.\n\n“Saud Shakeel is set to lead the team, while he will be joined by three other Test-capped players in Mir Hamza, Musa Khan and Sajid Khan,” the PCB said.\n\nThe press release added that among other players, Azan Awais and Maaz Sadaqat, who finished as the leading run scorers, respectively, in the Quaid-i-Azam Trophy 2024-25, have been selected.\n\nOther batters include Ali Zaryab, Haider Ali, Mohammad Suleman, Omair Bin Yousuf, Shamyl Hussain, while Rohail Nazir will perform the wicket-keeping duties. The pace arsenal consists of Mushtaq Ahmed, who bagged 77 wickets in the two most recent first-class competitions (QeA Trophy & President’s Trophy), Fata pacer Shahid Aziz and Ubaid Shah.\n\nWrist spinner Faisal Akram will accompany left-arm spinner Mehran Mumtaz and off-spinning all-rounder Mubasir Khan to form the spin quartet along with experienced Sajid for the Shaheens across the red and white-ball fixtures.\n\nThe 18-member squad will take part in a training camp at the Hanif Mohammad High-Performance Centre in Karachi before departing for England on July 16, the press release added.\n\nPakistan Shaheens will also visit Darwin, Australia, later this year to take part in the Top End T20 Series, the PCB confirmed earlier in the week.\n\n“This year’s edition of the Top End T20 Series will take place in Darwin from Aug 14 to 24 with Pakistan Shaheens taking on Bangladesh ‘A’ in the opening match of the tournament on Aug 14 at the TIO Stadium in Darwin,” the PCB said.\n\nSquad:\n\nSaud Shakeel (captain), Ali Zaryab, Azan Awais, Faisal Akram, Haider Ali, Maaz Sadaqat, Mehran Mumtaz, Mir Hamza, Mohammad Suleman, Mubasir Khan, Musa Khan, Mushtaq Ahmed, Omair Bin Yousuf, Rohail Nazir (wicket-keeper), Sajid Khan, Shahid Aziz, Shamyl Hussain and Ubaid Shah\n\nMeanwhile, preparations for the Pakistan women team’s tour to Ireland continued in Karachi for a fourth day today.\n\nThe 27-day camp is being conducted at the Hanif Mohammad High Performance Centre and the Oval Ground, with an emphasis on refining skills and improving fitness levels ahead of the upcoming Ireland tour.\n\n“Women cricketers practised batting, bowling, and fielding intensively for 5 hours,” the PCB said in a post on X.\n\nUnder the supervision of Head Coach Muhammad Wasim, women players underwent practical exercises in batting, bowling and fielding, the PCB said.\n\n“Women players put in tremendous effort at the skills and fitness camp, according to the press release.\n\nJunaid Khan taught bowling techniques to women fast bowlers, while Tahir Khan guided spinners.\n\nA separate training camp for the Ireland-bound squad will be held from July 28 to August 2. A 15-member squad, to be selected by the national women’s selection committee, will take part in this phase of the preparations.\n\nThe national side is set to depart for Ireland on August 3, where they will feature in a three-ma­tch T20 International series against the hosts. All matches are scheduled to be played at Clontarf Cricket Club Ground in Dublin.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/1118143491a5212.jpg?r=181924",
  "retrievedAt": "2025-08-17T20:10:41.795Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923532/saud-shakeel-to-lead-pakistan-shaheens-squad-for-england-tour",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T18:19:43.000Z"
}
