{
  "title": "Judiciary, rights bodies liaison must to ensure justice: CJP - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Chief Justice Yahya Afridi has said collaboration between the judiciary and human rights bodies was vital to ensure access to justice for all, especially the vulnerable and marginalised segments of society.\n\nThe CJP made these remarks in a meeting with the National Commission for Human Rights (NCHR) chairman, Rabiya Javeri Agha, on Thursday.\n\nThe meeting discussed initiatives for the protection and promotion of human rights, according to an official statement.\n\nCJP Afridi appreciated the NCHR for its efforts to address rights-based challenges.\n\nIFJ asks apex court to review Peca, directs govt to amend it\n\nMs Agha briefed the CJP on NCHR’s ongoing initiatives, policy interventions and monitoring mec­hanisms related to the implementation of constitutional and legal safeguards for fundamental rights.\n\nThey reaffirmed the need for co­ordination among state institutions to address systemic gaps in the human rights protection framework.\n\nThe CJP emphasised the judiciary’s commitment to upholding constitutional values, due process, and the protection of citizens’ fundamental freedoms.\n\nThe meeting ended with a “shared resolve to work collectively for a more just, inclusive and rights-respecting society,” the official statement added.\n\nPeca review\n\nThe International Federation of Journalists (IFJ) secretary general, Anthony Bellanger, has requested the Supreme Court to review the Prevention of Electronic Crimes Act (Peca) as a matter of priority and provide necessary directions to the government to amend the law.\n\nIn his letter addressing the CJP, Mr Bellanger said “swift action” was needed to “address this critical situation for Pakistan’s media and pro-tect press freedom as guaranteed in Article 19 of Pakistan’s constitution”.\n\nThe letter was delivered to the apex court on Thursday by Shakeel Ahmad, the Pakistan Federal Union of Journalists (PFUJ) secretary general.\n\nThe letter stated the increased political polarisation, widespread protests and social disruption meant media professionals across Pakistan were “facing increased challenges while performing their duties”.\n\nThey are also facing a “heightened level of legal persecution including litigation, intimidation and cases filed under Peca”.\n\n“We understand that Pakistan is a signatory of the International Labour Organisation (ILO) and United Nations Conventions that confer freedom of speech and expression and key democratic rights, but the curtailing of these fundamental rights under Peca is of great concern for the IFJ and international journalist community,” the letter explained.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2023/04/04025315656c6fe.jpg?r=025325",
  "retrievedAt": "2025-08-17T20:13:17.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923400/judiciary-rights-bodies-liaison-must-to-ensure-justice-cjp",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:28.000Z"
}
