{
  "title": "NA body approves rightsizing bill - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A parliamentary committee has approved a bill seeking amendment to the Civil Servants Act 1973 with a direction to the federal government to lay off only a minimum number of employees in its ongoing restructuring and rightsizing exercise.\n\nThe National Assembly Standing Committee on Cabinet Secretariat, which met here on Thursday, while approving “The Civil Servants (Amendment) Bill 2025” also directed the Establishment Division to ensure rights of the civil servants likely to be affected by the planned administrative reforms and adjust maximum number of employees, declared surplus or redundant, in other departments.\n\nThe committee meeting was presided over by ruling Pakistan Muslim League-Nawaz (PML-N) MNA Malik Ibrar Ahmad.\n\nThe secretary, Establishment Division, told the committee members that the government had embarked upon administrative reforms aimed at improving efficiency and realising savings through rightsizing.\n\nGovt directed to ensure rights of civil servants while carrying out administrative reforms\n\nThe bill had been tabled by the government in the National Assembly on December 11, 2024. The Statements of Objects and Reasons attached to the bill states that “the federal government has embarked upon administrative reforms aimed at improving efficiency and realising savings through rightsizing.\n\nFurther, delivery models of many government functions are being transformed as a result of new management paradigms such as outsourcing, public private partnerships, etc. and technological advancements through e-governance. It is, therefore, expected that certain divisions/departments/offices will be restructured, merged or abolished, consequent to administrative reforms designed for better governance.”\n\nIt says that the Civil Servants Act, 1973 envisages termination of civil servants in individual cases only and does not deal with situations in which a policy decision is taken, in public interest, in the context of wider administrative reforms and where it is not possible for the government to continue to retain human resource which is no longer required.\n\nThe current provision of the Act (Section 11A) only provides for alternative appointments for civil servants rendered surplus.\n\nThe proposed amendment in the Civil Servants Act, 1973 provides the enabling framework for the federal government to undertake meaningful reforms in the shape of reorganisation, restructuring or abolition without retention and adjustment of civil servants through the surplus pool mechanism.\n\n“It elaborates contours of a due process and necessitates a severance package for the affected civil servants, balancing individual rights with wider, public welfare objectives,” says the draft of the bill.\n\nThe committee approved the bill without amendments.\n\nThe committee also approved “The Asaan Karobar Bill 2025”. The participants appreciated the initiative of the Board of Investment (BOI) for bringing all laws and regulations in vogue at one place for ease of the business community.\n\nThe additional secretary BOI said Pakistan inherited most of its regulatory frameworks from the British era wherein several amendments were made with the passage of time. He said businesses in Pakistan routinely cited regulatory compliance as one of the critical challenges to their competitiveness.\n\nHe said the Asaan Karobar Bill had been introduced in parliament to address the concerns of businesses and to provide ease of doing business and to attract foreign and local investment. He said that upon enactment of the bill, a dedicated unit would be established in the BOI which would undertake the regulatory modernisation activities, including mapping, simplification and modernisation of the regulatory governance.\n\nThe committee also approved “The National School of Public Policy (Amendment) Bill 2025” without amendments.\n\nThe secretary Establishment Division said pursuance to a decision of the cabinet regarding replacement of the word “federal government” with appropriate authorities in the acts and rules, the instant bill was brought before the parliament. He said the bill aimed at amending the National School of Public Policy Act to bring it in consonance with the directions of the cabinet.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/091011478233b73.jpg?r=101154",
  "retrievedAt": "2025-08-17T20:11:54.054Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923459/na-body-approves-rightsizing-bill",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T03:48:50.000Z"
}
