{
  "title": "Judicial top brass forms body to devise ‘institutional response’ to enforced disappearances - Pakistan - DAWN.COM",
  "author": null,
  "content": "The National Judicial Policy Making Committee (NJPMC) constituted a “dedicated committee” on Friday to devise an institutional response to the emotive and chronic issue of enforced disappearances in the country.\n\nThe NJPMC was set up under an ordinance in 2002 to coordinate and harmonise judicial policy within the court system and in coordination with the Law and Justice Commission of Pakistan (LJCP). The committee also makes recommendations for bringing about an improvement in the capacity and performance of the administration of justice, setting performance standards for judicial officers and persons associated with performance of judicial and quasi-judicial functions, improvement in the terms and conditions of service of judicial officers, court staff and to ensure skilled and efficient judiciary.\n\nA press release issued today from the Supreme Court said the committee’s 53rd meeting was held under the chairmanship of Chief Justice of Pakistan (CJP) Yahya Afridi and attended by the high court chief justices, as well as Additional Attorney General for Pakistan (AGP) Mansoor Awan.\n\nThe members deliberated on “key policy issues and adopted several significant measures to improve judicial performance, technology integration in judicial processes and citizen-centric justice delivery”.\n\nAmong those measures was taking “serious notice of the enforced disappearances” and unanimously resolving that the judiciary “would not compromise on its constitutional duty to safeguard fundamental rights”.\n\nThe press release said a dedicated committee was constituted to formulate an institutional response, after taking into consideration the concerns of the executive, to be communicated through AGP Awan.\n\nThe detailed decisions of the meeting said: “The NJPMC strongly condemned enforced disappearances and unanimously resolved that the judiciary will neither compromise on its constitutional mandate, nor shall it fall prey to expediencies when it comes to safeguarding fundamental liberties, particularly in matters as grave as enforced disappearances.”\n\nThe committee constituted to devise the institutional response would include the director general and senior director (academics) of the Federal Judicial Academy, and the secretary of the Law and Justice Commission of Pakistan (LJCP).\n\nAGP Awam would communicate all concerns of the government to the committee with plausible legal options for consideration and review, after which the committee would submit its report to the NJPMC within 30 days.\n\nA total of 125 missing persons cases were submitted to the Commission of Inquiry on Enforced Disappearances in the first half of 2025, it emerged on Wednesday.\n\nThe commission was set up in 2011 to trace missing persons and fix responsibility on the individuals or organisations responsible for their disappearance.\n\nIn the month of June alone, a total of 27 missing persons cases were received nationwide, while 33 cases were disposed of.\n\nThe commission offered a monthly breakdown of the cases received and disposed; 26 cases were received in January and 209 disposed of; 12 new cases in February and 104 disposed of; 30 were received in March and 34 disposed of; 11 were reported in April and 42 disposed of; 19 were received in May and 62 disposed of.\n\nThe total number of cases received up till June 2025 was 10,592, while 1,914 cases of them were disposed of and 6,786 were traced, the commission said.\n\nA total of 4,771 missing persons have returned home, according to the report, while 1,017 people are being held in internment centres and 705 in prisons.\n\nIn December 2024, the Cons­ti­tutional Bench of the Sup­reme Court emphasised that only parliament holds the authority to add­ress and resolve the longstanding, yet unlawful, practice of enforced disappearances — a persistent issue that has plagued the nation for decades.\n\nCJP Afridi had said in May that “there should be a closure of this issue for all times to come”.\n\nRegarding the issue of external influence in the judiciary, the press release said: “The committee also decided to protect judicial officers from external influence and asked the high courts to establish structured mechanisms for reporting and redressal of such instances within a stipulated timeframe.”\n\nThe detailed decisions that on the agenda item of “institutional response to extraneous influence on judges of district judiciary”, the NJPMC “unanimously decided that there must be some reporting and redressal mechanism in place for judicial officers against external influence by executive functionaries/organisations”.\n\nIt was decided that the high courts would develop a reporting and redressal mechanism in this regard, within 30 days, under intimation to LJCP.\n\nThe Supreme Judicial Council (SJC) is expected to meet on July 12 to consider a number of pending issues. It is also expected to resume consideration of a letter by six judges alleging interference by intelligence agencies in judicial affairs and calling for a thorough investigation. The letter was sent by six judges of the Islamabad High Court (IHC) on March 25, 2024.\n\nThe SJC, at a previous session while considering different options concerning the letter, agreed to expand consultations, noting that the code of conduct of judges also applies to the heads of different institutions.\n\nThe letter had earlier prompted then-CJP Qazi Faez Isa to initiate suo motu proceedings after ex-CJP Tassaduq Jillani declined to lead a one-man commission to investigate the alleged meddling in judicial affairs. CJP Afridi, before assuming the top office, had recused himself from hearing the suo motu case, arguing that “inaction by Islamabad High Court chief justice or judges” should not drag the Supreme Court into imposing its jurisdiction under Article 184(3) of the Constitution.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/112134244b26740.jpg",
  "retrievedAt": "2025-08-17T20:10:50.078Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923551/judicial-top-brass-forms-body-to-devise-institutional-response-to-enforced-disappearances",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T17:16:27.000Z"
}
