{
  "title": "5 dead in Lahore; more rain forecast till 17th - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Metropolis witnesses 182mm rainfall in a few hours\n• Nation braces for fresh spell of heavy rain from July 13\n• Moist currents and westerly wave to intensify rains\n• Glacial melt raises river flood risk in northern areas\n\nLAHORE / RAWALPINDI: Five people lost their lives and at least 40 were injured in Lahore on Thursday as torrential monsoon rains lashed the city, submerging roads and low-lying areas.\n\nThe deadly downpour came as a fresh spell of heavy rainfall is forecast to hit several parts of the country from July 13 to 17, with authorities warning of urban flooding, landslides and rising river levels.\n\nThe National Emergencies Operation Centre (NEOC) warned of potential flooding in rivers due to a sharp rise in temperatures in northern regions, particularly Gilgit-Baltistan and upper Khyber Pakhtunkhwa. The warming trend is accelerating glacial and snowmelt, increasing river flows.\n\nAccording to the Pakistan Meteorological Department (PMD), moist currents are currently entering the country and are likely to intensify from July 13. A new westerly wave is also expected to approach the country on the evening of July 13.\n\nUnder the prevailing weather conditions, rain-wind/thundershowers accompanied by scattered heavy to very heavy falls are expected in several parts of the country.\n\nIn Azad Jammu and Kashmir, including Neelum Valley, Muzaffarabad, Rawalakot, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur, the rainfall is forecast from July 11 to 17.\n\nGilgit-Baltistan (Diamer, Skardu, Hunza, Gilgit and others) is likely to receive showers on the night of July 11 and again from July 13 to 16 with occasional gaps.\n\nIn Khyber Pakht­u­nkhwa, rain, windstorm and thundershower with scattered heavy falls (at times very heavy) is expected in Dir, Chitral, Swat, Kohistan, Malakand, Shangla, Battagram, Buner, Kohat, Karak, Bannu, Tank, Lakki Marwat, Dera Ismail Khan, Bajaur, Mohmand, Khyber, Waziristan, Orakzai, Mansehra, Abbottabad, Haripur, Peshawar, Charsadda, Nowshera, Mardan, Swabi, Hangu and Kurram from July 11 to July 17 with occasional gaps.\n\nIn Punjab and Islamabad, heavy to very heavy rainfall is predicted in major cities including Lahore, Rawalpindi, Faisalabad, Gujranwala, Sargodha and Sahiwal from July 11 to 17.\n\nSouthern Punjab districts such as Multan, Dera Ghazi Khan and Bahawalpur may witness rain on July 11 and again from July 13 to 17.\n\nIn Balochistan, areas including Quetta, Zhob, Lasbela and Khuzdar are forecast to receive rain on July 11 and between July 13 and 16.\n\nIn Sindh, moderate rain-wind/thundershower is expected in Tharparkar, Mirpur Khas, Sanghar, Sukkur, Larkana, Dadu, Jacobabad, Khairpur, Shaheed Benazirabad, Hyderabad and Karachi from July 15 to July 17 with occasional gaps.\n\nHazards, warnings\n\nThe PMD warned that heavy to very heavy rainfall could cause flash flooding in local streams and nullahs in Murree, Galiyat, Mansehra, Kohistan, Abbottabad, Buner, Chitral, Dir, Swat, Shangla, Nowshera, Swabi, Mardan, Islamabad, Rawalpindi, hill torrents of D.G. Khan, northeast Punjab, Kashmir and parts of Balochistan from July 14 to July 17.\n\nUrban flooding is likely in low-lying areas of Lahore, Rawalpindi, Gujranwala, Sialkot, Peshawar and Nowshera from July 13 to 17.\n\nLandslides and mudslides may disrupt roads in hilly regions of KP, Murree, Galiyat, Kashmir and Gilgit-Baltistan from July 14 to July 17.\n\nWindstorms and lightning may damage weak structures, including kutcha houses, electric poles, billboards, vehicles and solar panels.\n\nFarmers have been advised to plan agricultural activities accordingly, while travellers and tourists have been urged to avoid vulnerable areas and monitor weather updates.\n\nThe Met Office has requested all authorities concerned to remain on alert and take necessary measures to avoid loss of life and property.\n\nThe NEOC noted an increase in glacial melting in areas including the Ghujerab and Shimshal rivers (Hunza), Braldu River (Shigar), Husher and Saltaro rivers (Ghanche) and Uzhnu Gol (Chitral).\n\nIt advised the residents near rivers and streams to stay vigilant, especially during nighttime and heavy rainfall.\n\nLahore faces urban flooding\n\nLahore witnessed an unprecedented monsoon fury on Thursday, recording 182mm of rainfall in just a few hours, which submerged several major roads and low-lying areas.\n\nAccording to Rescue officials, five people died and 40 were injured in rain-related incidents across Punjab in the last 24 hours.\n\nThe Provincial Disaster Management Authority (PDMA) reported rainfall in Lahore for over seven hours. Rainfall recorded in other areas included Sialkot (77mm), Gujranwala (67mm), Chakwal (65mm), Jhelum (64mm), Hafizabad (60mm), Gujarat (52mm), Mandi Bahauddin (47mm), Attock (45mm), Faisalabad (51mm), Narowal (44mm), Okara (33mm), Toba Tek Singh and Sheikhupura (25mm), Rawalpindi and Kasur (23mm), Mangla (19mm), Sargodha (18mm), D.G. Khan (16mm), Jhang (11mm), Mianwali (10mm) and Sahiwal (8mm).\n\nPDMA Director General Irfan Ali Kathia said drainage was ensured “in the shortest possible time” in Lahore despite the heavy rainfall.\n\nHe said the Water and Sanitation Agency (Wasa) and district administrations remained on the ground to manage water removal from highways, underpasses and other vulnerable places.\n\nHe noted that this second monsoon spell will continue until July 13 and more rains are expected in divisions including Gujranwala, Faisalabad, Sargodha, Multan, Dera Ghazi Khan and Bahawalpur.\n\nMr Kathia said 36 people have lost their lives and 96 sustained injuries in rain-related incidents this season. A total of 42 houses were damaged and four livestock lost.\n\nMost deaths were caused by roof collapses in dilapidated buildings. He urged citizens to avoid unsafe structures, live electric wires and flood-prone areas.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68705709e1dda.gif",
  "retrievedAt": "2025-08-17T20:13:44.904Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923410/5-dead-in-lahore-more-rain-forecast-till-17th",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:15.000Z"
}
