{
  "title": "Power minister renews push to slash solar net metering - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Awais proposes delay in payback to ease grid surplus\n• Claims Rs191bn saved in FY25 as power losses dip due to governance reforms\n• Govt eyes 6,000MW surplus supply for crypto, data centres\n\nISLAMABAD: The Power Division is making another attempt to convince the federal cabinet to curtail returns on solar net metering and remove electricity duty on consumer bills being resisted by the provinces.\n\nSpeaking at a news conference on Thursday, Power Minister Awais Leghari said he would be presenting a revised plan to the federal cabinet in a week or two based on consultations with some stakeholders to stagger the recovery of investment on net metering to two to three years from the current one and a half years.\n\nMr Leghari also announced that the Power Division on Thursday moved a summary for cabinet approval to finalise rules for wheeling charges, a key step towards operationalising the competitive electricity trading market.\n\nHe added that the government was exploring plans to offer 5,000-6,000MW of surplus electricity at marginal costs to industries such as data centres and crypto mining, and discussions were underway with the International Monetary Fund (IMF).\n\nThe minister said that a change in the net metering arrangement would not reduce the electricity tariff, but there would be no further increase in rates. Unless measures are introduced, the expansion of solar systems could add to the surplus on the grid. The combination of the sale of surplus power and the containment of solar expansion would help grid stability, he said.\n\nMr Leghari said the consumers had adopted solar net metering under a government policy and would not be penalised, but its return had become unjustified. If not corrected, even the net metering consumers would be bearing billions of rupees worth of electricity bills in future.\n\nHe said the government had saved over Rs3 trillion from negotiations with the independent power producers, cancelled over 10,000MW of new power plants out of 17,000MW committed capacity and saved over Rs4tr in future payments, whereas correction of net metering was also on the agenda.\n\nMr Leghari said he had written letters to the chief ministers to convey that power distribution companies (Discos) would no longer act as collection agents of electricity duty for provinces.\n\nHe said that only one chief minister had so far responded, and once the remaining three give their feedback, a case would be presented before the federal cabinet for a final decision.\n\nMr Leghari said the Power Division had been able to reduce recovery, transmission and distribution losses through good governance.\n\nHe said the government suffered a Rs591 billion loss in fiscal year 2024 due to less billing and higher technical losses of Discos.\n\nThis money could have utilised in the development or any other meaningful sector, he added.\n\nThe minister said in fiscal 2025, this loss was brought by Rs191bn to Rs399bn through good governance.\n\nThe government has appointed board of directors to Discos “on merit and without any political consideration”.\n\nHe said Discos had been given the target of Rs100bn annual reduction over the next five years, but their losses had been cut by Rs191bn even before the start of that five-year period.\n\nThis was achieved through improvement in recoveries, he said, explaining that the Discos had suffered Rs315bn loss in FY24 when recovery against billing stood at 92.4 per cent.\n\nThe bill recovery was improved to 96.6pc in FY25, bringing down these losses to just Rs132bn, as the recovery rate of five Punjab and Islamabad companies was beyond 101pc.\n\nTransmission and distribution (T&D) losses, mostly attributed to electricity theft, fell slightly from Rs276bn in FY24 to Rs266bn in FY25, with losses decreasing from 18.3pc to 17.6pc.\n\nThe minister added that savings could have been higher — around Rs225 billion — had the government been able to appoint new boards for Hyderabad and Sukkur Electric, which remain delayed due to litigation.\n\nHe revealed the Lahore Electric Supply Company (Lesco) had uncovered massive electricity theft at four steel and furnace factories using tampered meters.\n\nHe claimed the factory owners wielded significant influence and attempted to remove security officials and Disco staff involved in the investigation. However, Prime Minister Shehbaz Sharif and government institutions backed the anti-theft campaign.\n\nThe minister said the Power Division and Discos would focus on recoveries, dismantle networks of theft and improve governance and overall efficiencies.\n\nResponding to a question, Mr Leghari said the Power Division believed that since K-Electric’s overwhelming reliance would now be on the national grid, the uniformity of tariff should extend to fuel costs as well as quarterly adjustments.\n\nHe said K-Electric’s import from the grid had increased to 1,600MW from 1,000MW, which would further go up by another 400MW with additional interconnection within a month.\n\nHe said the Power Division would engage with the power regulator and present a detailed point of view before the federal cabinet for an amicable and sustainable solution.\n\nThe power minister conceded that LNG import contracts were made almost a decade ago on the assumption that LNG-based power plants would operate on LNG and consume 100pc of imports.\n\nHowever, he stressed that no power plant should be operated without a fuel-based merit order. Therefore, the previous assumptions did not materialise.\n\n“We believe that violation of economic merit order is a mortal sin,” he said, adding that the only solution was to review LNG contracts as had been done in the case of independent power producers.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:13:44.042Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923412/power-minister-renews-push-to-slash-solar-net-metering",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:15.000Z"
}
