{
  "title": "Fact check: Absar Alam did not advocate recognition of Israel; viral clip is incomplete - Pakistan - DAWN.COM",
  "author": null,
  "content": "Posts from multiple users on social media platform X on Thursday shared a video clip, claiming it showed journalist Absar Alam urging Pakistan to explore the benefits of recognising Israel. However, the viral clip is incomplete and he is actually questioning whether recognising Israel would bring any real benefits to Pakistan.\n\nThe Abraham Accords, brokered by the United States in 2020, are landmark agreements for diplomatic relations between Israel and several Arab nations, including the United Arab Emirates, Bahrain, Morocco and Sudan. These accords paved the way for formal ties, such as embassies and trade deals, underpinned by mutual interests in security, economic collaboration, and technology exchange.\n\nWhile celebrated as a diplomatic shift in the Middle East, the accords also sparked debate and resistance in Pakistan. Foreign Minister Ishaq Dar and Defence Minister Khawaja Asif have both affirmed that Pakistan will not join, asserting that any recognition of Israel would contradict its longstanding support for a two‑state solution and could only be considered if it served Pakistan’s national interest.\n\nOn Thursday, anchor and YouTuber Tariq Mateen posted a clip of Alam from a Samaa TV podcast, overlaid with a text that read: “Absar Alam has now started listing the benefits of recognising Israel. These people, on their own, have already accepted Israel.”\n\nThe transcription of the clip is reproduced below:\n\n“If we recognise Israel, people say there will be benefits like reduced pressure on Balochistan, or that India and Israel might stop collaborating against us. Maybe we’ll get access to technology such as that of agriculture or weaponry. But is there any guarantee of that?\n\nIndia is also our enemy, and yet we have diplomatic ties with them — cultural exchanges, people-to-people interactions. Has that ever stopped India from supporting the TTP (Tehreek-i-Taliban Pakistan)? No. So diplomatic relations don’t necessarily safeguard our geographical or ideological boundaries.\n\nEvery country acts in its own self-interest. Right now, if someone visits the Indian High Commission, people dig into their family backgrounds to find out why. Tomorrow, if there’s an Israeli embassy here, people will visit that too. Are we going to start investigating everyone then?\n\nWhat exactly will we gain from this? I don’t understand. Will America suddenly consider us an ally? Write off our debts? Gift us F-35 fighter jets? What exactly will change?“\n\nThe post was viewed by over 100,000 users.\n\nThe clip was also shared here by a pro-PTI account with the caption: “The impostor who until yesterday was calling Imran Khan an agent of Israel is today listing the benefits of recognising Israel. That’s exactly why, in Pakistan, he is now referred to as a ‘pen-wielding dog’ — because neither his words nor his voice are truly his own. Like a tape recorder, he merely parrots whatever is fed to him by the military establishment,” gaining 64,000 views.\n\nOther shares of the same claim can be found here, here, here, here and here.\n\nA fact-check was initiated to determine the veracity of the claim due to its virality and keen public interest in matters related to the debate around whether Pakistan should recognise Israel or not.\n\nA keyword search for “Absar Alam podcast” on YouTube led to a video posted on Samaa TV’s channel on July 10, 2025, titled: “Abraham Accord 2: Trump & Netanyahu Celebrate | Big Message for Pakistan | Absar Alam Reveals All”.\n\nAt the seven-minute mark, the host raised the possibility of Pakistan recognising Israel, following in the footsteps of several Arab nations.\n\nAlam explained that Pakistan’s goodwill and relations with Arab countries should not dictate its stance on Israel, noting it wouldn’t be in Pakistan’s national interest to sign the Abraham Accords without ensuring the rights of the Palestinian people.\n\nThe viral clip, in which Alam is said to be explaining the supposed benefits of recognising Israel, actually shows him questioning any supposed benefits from recognising Israel and reflects the broader argument he made during the podcast.\n\n“We say we are a nuclear power with missile technology and a proud nation with 250 million people, the second largest Islamic country in the world, the only Islamic nuclear power, then we should at least walk the talk and take a principled stand. If the injustice against Palestinians continues and Gaza’s Muslims continue to be attacked and there is an Israeli embassy here with planes and tourists and officials landing here with meeting then I don’t think it will be a healthy sign.\n\n“The example is given of our many wars with India but this example is not justified. We and India were one country and then separated on ideological grounds. We have a quarrel with them on Kashmir but we had relations with them based on cultural and people-to-people basis. We have cultural, people-to-people and religious ties with Palestine, never with Israel in history.”\n\nHe rejected the assumption that diplomatic ties would automatically lead to national security or a strategic advantage, citing Pakistan’s continued tensions with India despite formal diplomatic relations in the past. He also deconstructed the usual arguments given in favour of supporting Israel.\n\nIn checking whether Alam had responded to the viral clip, reviewing his X account led to a July 10 post addressing Mateen directly.\n\n“Mr Tariq, if only you had listened to the entire clip before speaking, you would have realised your own dishonesty and inadequacy,” he said.\n\nTherefore, the fact-check determined that the claim that a viral video shows journalist Absar Alam advocating for and extolling the benefits of recognising Israel is misleading.\n\nIn the full interview, Alam questions whether recognising Israel would bring any real benefits to Pakistan and deconstructs the traditional arguments proposed about any supposed benefits from a formal establishment of relations.\n\nThis fact check was originally published by iVerify Pakistan — a project of CEJ-IBA and UNDP.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:11:04.840Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923507/fact-check-absar-alam-did-not-advocate-recognition-of-israel-viral-clip-is-incomplete",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T14:05:35.000Z"
}
