{
  "title": "PIA privatisation - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE government’s latest push to offload PIA signals a bold move, considering the failure of the first such attempt in October.\n\nMonths after serious investors had shied away from bidding for the national flag carrier, they now appear ready to put down their money for one of the state’s most financially troubled assets. The resumption of PIA’s flight operations to Europe after the EU lifted a four-year safety ban, its return to profitability and, importantly, the undisclosed assurances given by the authorities to address investors’ concerns over inconsistent policies, the company’s legacy issues, taxes, etc, seem to have done the trick.\n\nThe government has approved four parties to potentially bid for a 51-100pc stake in the airline. The pre-qualified bidders will proceed with the buy-side due diligence of the company, which may last between two to three months and lead to final bidding towards the end of the year. The prospective buyers, most of whom have formed consortiums to make joint bids, come from a diverse range of business backgrounds: fertilisers, real estate, power generation, cement, aviation, financial services, etc. It will be the first significant sale of an SOE since a Supreme Court decision suspended the sale of the Pakistan Steel Mills two decades ago — unless the deal falls through for some reason.\n\nSuccessive governments have advocated privatisation of publicly owned businesses for ensuring market development, strengthening competition, encouraging innovation and attracting private investments. Yet most have pursued it only under pressure from the country’s international creditors or as a means to raise funds to finance their deficits rather than as a policy decision to reduce the government’s footprint in the economy. The current exercise is also driven by pressures from the IMF. Hence, the likelihood of another pause in the sale of the other SOEs is hard to rule out once the PIA deal goes through.\n\nThat said, the fruits of the current privatisation push for the economy cannot be reaped without effective policy and regulatory reforms, removal of legal and institutional weaknesses, transparency, etc. The sale of state-run businesses to reduce the burden on the budget is only a short-term goal; the long-term one should be to encourage domestic and foreign private investment.\n\nPreviously, we have seen that privatisation has paid dividends when the process is accompanied by structural and governance reforms. The banking and telecom industries are two prominent instances of this success.\n\nThe enhanced investor interest in PIA is largely attributed to the SIFC’s ‘support’ for the process. While it does give the privatisation authorities a much-needed head-start, it will not be sustainable unless preceded by policy and regulatory reforms. The absence of foreign investors despite the SIFC in the PIA privatisation effort underscores this observation.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0821284843611c9.jpg?r=212939",
  "retrievedAt": "2025-08-17T20:12:16.692Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923426",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:27:09.000Z"
}
