{
  "title": "Police conduct probe as unidentified attackers booked for ANP leader Maulana Khan Zeb’s murder - Pakistan - DAWN.COM",
  "author": null,
  "content": "A first information report (FIR) was registered by the Counter-Terrorism Department (CTD) in Khyber Pakhtunkhwa’s Bajaur area against unidentified attackers involved in the assassination of Awami National Party (ANP) leader Maulana Khan Zeb, it emerged on Friday.\n\nThe ANP leader was shot dead on Thursday by unidentified assailants in KP’s Bajaur district, according to the police.\n\nBajaur District Police Officer (DPO) Waqas Rafiq told Dawn.com that the politician was shot dead in Shindai Mor while campaigning for the July 13 peace parade, adding that a policeman was also killed and three other people were injured in the attack.\n\nAccording to a copy of the FIR — dated July 10 and seen by Dawn.com — the unidentified attackers were booked under Sections 302 (murder), 324 (attempted murder) and 427 (mischief causing damage to the amount of Rs50) of the Pakistan Penal Code and Section 7 (terrorism) of the Anti-Terrorism Act, 1997.\n\nThe FIR states that Khan Zeb was returning home from campaigning for the July 13 peace parade when his vehicle was attacked by the unidentified gunmen, resulting in his death and that of a police constable.\n\nMeanwhile, the Bajaur DPO confirmed new updates in the investigation to Dawn.com, according to which the geo-fencing of two locations is underway and that forensic evidence was collected from the crime scene.\n\n“According to eyewitnesses, five suspects riding on two motorcycles fired on the vehicle,” DPO Rafiq confirmed, citing a police report. “Maulana Khan Zeb was the target of the attack.\n\n“Two locations are being geofenced and 35 bullet casings were recovered from the crime scene,” Rafiq said, adding that the initial complaint was registered by the station house officer at Khar Police Station.\n\nThe assassination was condemned by politicians in KP and the Human Rights Commission of Pakistan. The ANP itself declared three days of mourning and suspended political activities.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/0913071430744a4.jpg?r=130737",
  "retrievedAt": "2025-08-17T20:10:57.793Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923530/police-conduct-probe-as-unidentified-attackers-booked-for-anp-leader-maulana-khan-zebs-murder",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T15:27:50.000Z"
}
