{
  "title": "Bosnia commemorates Srebrenica genocide 30 years on - World - DAWN.COM",
  "author": null,
  "content": "Thousands of mourners on Friday commemorated in Srebrenica the genocide committed 30 years ago by Bosnian Serb forces, one of Europe’s worst atrocities since World War II.\n\nThe remains of seven victims were laid to rest during the commemorations, which mark the bloodiest episode of Bosnia’s inter-ethnic war in the 1990s.\n\nThey included those of Sejdalija Alic, one of more than 8,000 Muslim men and boys killed by Bosnian Serb forces after they captured the eastern town on July 11, 1995.\n\nHis granddaughter Anela Alic, whose father was also killed in the massacre and was buried earlier, came to attend the funeral.\n\n“I never saw my father … and today, my grandfather is being buried, just some of his bones, next to his son.\n\n“It’s a deep sadness… I have no words to describe it,” the 32-year-old added, in tears. She was born in early 1994 after her pregnant mother was evacuated in a Red Cross convoy from the ill-fated town.\n\nThe victims of Srebrenica, which was at the time a UN-protected enclave, were buried in mass graves. So far, about 7,000 victims have been identified and buried, while about 1,000 are still missing.\n\nIn a bid to cover up the crime, the Bosnian Serb forces had the remains removed to secondary mass graves, causing many of the bodies to be shredded by heavy machinery, according to experts.\n\n“For 30 years we have carried the pain in our souls,” said Munira Subasic, president of the association Mothers of Srebrenica. She lost her husband, Hilmo and 17-year-old son, Nermin, in the massacre.\n\n“Our children were killed, innocent, in the UN-protected zone. Europe and the world watched in silence as our children were killed.”\n\nThe seven victims buried under white tombstones on Friday at the memorial centre after a joint prayer included a 19-year-old man and a 67-year-old woman.\n\nThe remains of most of the victims are incomplete and in some cases consist only of one or two bones, experts said. Families have waited for years to bury their loved ones, hoping that more remains would be found.\n\nBut Mevlida Omerovic decided not to wait any longer to bury her husband, Hasib. He was killed at the age of 33, at one of five mass-execution sites of the massacre, the only atrocity of Bosnia’s 1992-1995 war, which was qualified as genocide by international justice institutions.\n\n“Thirty years have passed and I have nothing to wait for anymore,” said Omerovic, 55. She wants to be able to visit the grave of her husband, even though only his jawbone will be in the coffin.\n\nBy visiting the graves, the victims’ relatives try to find some comfort.\n\n“I have only this tombstone to caress, to pray next to it,” said Sefika Mustafi, standing next to the graves of her sons Enis and Salim, who were both teenagers when killed. “I’d like to dream about them, but it doesn’t work. I’ve said thousands of times, ‘Come my children, Come into my dream’ … I say it when I pray, when I come here, but it doesn’t work.”\n\nCanadian veteran Daniel Chenard, deployed with UN peacekeepers to Bosnia from October 1993 until March 1994, when the Dutch troops took over, attended commemorations haunted by the feeling of guilt for decades.\n\n“I forgave myself … I found peace. I always wanted to tell them (victims’ families): ‘I apologise … I’m sorry for abandoning you’.\n\n“We (UN troops) did what we could … but the tragedy still happened,” the 58-year-old said, in tears.\n\nBosnian Serb wartime political and military leaders Radovan Karadzic and Ratko Mladic were sentenced to life imprisonment by an international tribunal, notably for the Srebrenica genocide.\n\nBut Serbia and Bosnian Serb leaders continue to deny that the massacre was a genocide.\n\nLast year, an international day of remembrance was established by the United Nations to mark the Srebrenica genocide, despite protests from Belgrade and Bosnian Serbs.\n\nOn Friday, Serbian President Aleksandar Vucic voiced condolences to the Srebrenica victims’ families on behalf of the citizens of Serbia, calling the massacre a “terrible crime”.\n\n“We cannot change the past, but we must change the future,” he posted on X.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/11182836c2edaa7.jpg",
  "retrievedAt": "2025-08-17T20:10:55.449Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923526/bosnia-commemorates-srebrenica-genocide-30-years-on",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T14:30:03.000Z"
}
