{
  "title": "5 dead, 4 injured as vehicle plunges into ravine in KP’s Kurram: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least five people died and four others were injured when a pickup vehicle plunged into a deep gorge in Khyber Pakhtunkhwa’s Kurram district on Friday morning, police said.\n\nKurram Deputy Commissioner Ashfaq Khan told Dawn.com: “The accident occurred in the Para Chamkani Gondal, where five people died and four others sustained injuries.”\n\nHe said the vehicle was on its way to Sadda Bazaar Lower Kurram from Spin Ghar Manro when the incident occurred.\n\n“The vehicle lost control on a narrow and dangerous bend and fell off the road, as a result of which five people died on the spot while four were seriously injured,” he added.\n\nThe deceased were identified as Gul Wali, son of Abdul Hanan (driver); Naimatullah, son of Gul Khan; Naseeb, son of Hamad Jan, residents of Manro; Dolly Khan, son of Islam; and Riazuddin, son of Zahiruddin, residents of Kimal Baza Zangi.\n\nAccording to the deputy commissioner, locals voluntarily started relief operations to rescue the injured and recover the bodies soon after the incident.\n\nThe injured were immediately taken to the Sadda Hospital with the help of locals, where the condition of some of the injured is said to be critical, he said.\n\nFatal accidents are common on roads in the mountainous regions of the country due to traffic rule violations, treacherous terrain and poor infrastructure.\n\nA day earlier, at least five people were killed in a collision between a car and a truck on Chashma Road in Dera Ismail Khan district, rescue officials said.\n\nEight members of a family died on May 1 when a Rawalpindi-bound car plunged into a deep ravine in the Matta Banda area of Lower Kohistan district, police said.\n\nAt least 10 people died and nine others were injured on April 15 when a speeding trailer ran over a Peshawar-bound van on the Indus highway in KP’s Karak district.\n\nFive people were killed when a three-wheeler fell into a canal in the Gohati area of KP’s Swabi on April 7.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/11145210256f488.jpg",
  "retrievedAt": "2025-08-17T20:11:22.155Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923506/5-dead-4-injured-as-vehicle-plunges-into-ravine-in-kps-kurram-police",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T10:56:36.000Z"
}
