{
  "title": "Proceedings of references against 26 PTI MPAs kick off - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Punjab Assembly Speaker Malik Muhammad Ahmad Khan has formally commenced proceedings of the disqualification references filed against the 26 suspended members belonging to the opposition Pakistan Tehreek-i-Insaf (PTI).\n\nThe move marks a significant development aimed at “reinforcing parliamentary discipline” and “upholding the rule of law” within the provincial legislature.\n\nThe references against the opposition MPAs have been filed by PML-N MPAs Mujtaba Shuja, Ahmed Iqbal and Iftikhar Chachhar, under Article 63(2), read with Article 113 of the Constitution of the Islamic Republic of Pakistan.\n\nThe critical legal process could potentially lead to the permanent disqualification of these 26 lawmakers.\n\nPersonal hearings to begin at PA Speaker’s chamber today\n\nAccording to a spokesperson for the Punjab Assembly, the Speaker has taken steps to ensure a fair and transparent process. In adherence to Article 10A of the Constitution, all 26 suspended MPAs will be afforded an opportunity for personal hearings, scheduled for today (Friday, July 11, 2025) at 11am. The proceedings will be held in the Speaker’s chamber at the new assembly building.\n\nThe Speaker has reaffirmed his commitment to conducting all proceedings with complete adherence to the constitutional obligations, emphasising full transparency and fairness, says the spokesperson. He stresses that all respondents will be granted ample opportunity to defend themselves within the established legal and constitutional framework.\n\nUnder the constitutional provisions governing such matters, the Speaker is legally bound to render a decision on these references within 30 days of their receipt.\n\n“This is a significant constitutional development aimed at upholding parliamentary discipline and ensuring the supremacy of law and due process within the assembly,” says the Speaker, underscoring the importance of these proceedings for the integrity of the provincial assembly.\n\nThese proceedings will be closely watched, as their outcome may have serious implications for the political landscape of Punjab and could potentially set a precedent for future parliamentary conduct.\n\nThe 26 MPAs had been suspended for 15 sittings of the House for creating ‘chaos’ in the assembly during the budget speech of Finance Minister Mujtaba Shuja and hurling budget books at him. They also interrupted the address of Chief Minister Maryam Nawaz during the budget session, raising ‘indecent’ slogans.\n\nProtesting the move, Opposition Leader in the Punjab Assembly Ahmed Khan Bhachar declined to preside over the meetings of the Public Accounts Committee-I, of which he is the chairperson, until the move to suspend the PTI MPAs is withdrawn.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/281530079017bd5.png?r=165214",
  "retrievedAt": "2025-08-17T20:12:08.749Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923447/proceedings-of-references-against-26-pti-mpas-kick-off",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T03:35:17.000Z"
}
