{
  "title": "Report warns of ‘extreme risks’ for journalists in south Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Journalists in south Punjab face a wide spectrum of threats, including direct violence, censorship, legal intimidation, and economic exploitation, according to a report released on Thursday by the Freedom Network, a media watchdog group.\n\nThe research report, “Journalism in South Punjab: State of Media Freedom, Access to Information and Safety of Journalists and Other Media Professionals in South Punjab — Way Forward,” documented 28 cases of threats against journalists.\n\nThe cases include two murders and seven assaults resulting in injury, during the period from 2021 to September 2024.\n\nThe report detailed how legal challenges, such as frivolous lawsuits and false police reports, were used to intimidate journalists and stifle critical reporting in the area.\n\n“Findings of the research study have highlighted an alarming and complex set of challenges for journalists working in South Punjab,” Freedom Network executive director Iqbal Khattak told reporters at the launch event in Lahore.\n\nHe added in the region, also known as the ‘Seraiki belt’, are under “intense pressure from entrenched different actors”.\n\nThe report was part of the network’s series examining the state of media freedom in Pakistan’s peripheries.\n\n“Physical attacks, such as the murder of journalists like Ashfaq Sial in Muzaffargarh in May 2024, exemplify the extreme risks faced by reporters who dare to expose corruption and injustice,” the report stated.\n\nDespite the dangers, Mr Khattak said journalists in the region continue their work, often at great personal risk.\n\n“However, without systemic reforms, these challenges will continue to erode the role of journalism as a pillar of democracy,” he warned.\n\nThe report also found that south Punjab, despite its distinct identity, remained under-represented in national media discourse, with most major outlets prioritising urban centres like Lahore, Karachi, and Islamabad.\n\n“This marginalisation creates an information vacuum, where local issues often go unreported or are misrepresented,” the report said.\n\nThe decline of print journalism, once a cornerstone of regional media, was compounding the neglect, the report noted, citing rising costs, dwindling government support and competition from electronic and digital platforms.\n\nThe threats are multifaceted and come from powerful local actors, including “feudal lords, political elites, and extremist groups besides state actors, including powerful intelligence agencies, and bureaucracy,” according to the report.\n\nTo address the situation, the report recommends advocacy for media freedoms, networking for native media with national peers, assistance for digital media, support and resources for women in media, safety and digital training, and engagement between media and civil society to jointly work for solutions.\n\nEarlier on Thursday, Punjab Information Minister Azma Bukhari met with Freedom Network officials and said her government was in “total agreement” to provide protection to journalists through a legal framework.\n\nShe directed authorities to proceed with the process to pass a law in the provincial assembly.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/05/031412163cbe3ad.png?r=191810",
  "retrievedAt": "2025-08-17T20:13:07.954Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923398/report-warns-of-extreme-risks-for-journalists-in-south-punjab",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:28.000Z"
}
