{
  "title": "Heavy falls continue to disrupt Lahore routine - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Heavy downpour continued to disrupt city life on Thursday, inundating many localities.\n\nThe Water and Sanitation Agency (Wasa) emergency control room reported alarming flood levels across 20 critical locations, leaving thousands of commuters stranded and residents in low-lying areas battling waist-deep waters.\n\nThe worst-hit area, Lakshmi Chowk, witnessed terrifying scenes as water level rose to 36 inches within hours, swallowing vehicles and inundating shops.\n\nOther major trouble spots included Empress Road where 24-inch deep pools paralysed traffic for hours, and Chauburji Chowk where water reached 13 inches and forced the pedestrians to wade through it.\n\nThe residents of Garden Town suffered due to 18-inch standing water. “We have been without electricity for 12 hours and cannot even step out for groceries,” complained Rabia Ahmed, a mother of three.\n\nWasa claimed to continue operations in different areas of the city and cleared 11 locations including GPO and Bhaati Gate during rainfall.\n\nHowever, other critical points, including Qartaba Chowk, Railway Station and Allah Ho Chowk, remained partially flooded.\n\nThe government was also taking measure to evacuate families from slum areas along Ravi Road.\n\nThe city recorded an average 182mm rainfall and more precipitation forecast till July 13, authorities face criticism over drainage preparedness. “They clear the VIP areas first while we suffer for hours,” alleged a rickshaw driver, Abdul Razzaq.\n\nThe city also witnessed multiple rain-related incidents. In Harbanspura, a motorcyclist was injured due to a slippery road. Another person was injured near the New Ravi Bridge.\n\nSimilar motorbike slip incidents in Ali Raza Abad and Wahdat Colony left two more individuals injured.\n\nIn the Kashmiri Gate area, a child died due to electrocution after coming into contact with an electric pole. In another incident on Ashiana Road, a person was injured when a roof collapsed.\n\nIn a separate incident, the roof of a house collapsed in the Taxali area, resulting in the death of one person and injuries to three others. In Nishter Colony, another roof collapse also claimed one life and left three injured.\n\nThe citizens were of the view that departments were busy in clearing the major roads and underpasses but they were unable to come out of their houses as rain and sewage water accumulated in their streets.\n\nPunjab Minister for Housing Bilal Yasin and Secretary Housing Noorul Amin Mengal have been actively supervising the operation on ground.\n\nThe secretary issued urgent orders to deploy additional machinery in affected areas.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687086f217a76.jpg",
  "retrievedAt": "2025-08-17T20:12:09.721Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923448/heavy-falls-continue-to-disrupt-lahore-routine",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T03:36:14.000Z"
}
