{
  "title": "Sindh Human Rights Commission says blasphemy laws must not be used to settle scores - Pakistan - DAWN.COM",
  "author": null,
  "content": "UMERKOT: The Sindh Human Rights Commission (SHRC) has warned that repeated blasphemy accusations based on unverified social media content risks “provoking violence and destabilising communal peace.”\n\nThe commission said in a formal letter to Umerkot SSP that blasphemy laws must not be exploited to settle personal or sectarian scores as Article 20 of the country’s constitution protected the right to freely profess and practice religion.\n\nIt cautioned that the spread of doctored videos, fake screenshots and viral misinformation on digital platforms could become tools for fuelling hatred.\n\nThe commission urged the district police to take proactive, community-based steps to prevent escalation and recommended activating District Peace and Interfaith Harmony Committees led by deputy commissioner to serve as early-warning and conflict-resolution forums; appointing dedicated focal persons within the police to monitor, assess and quickly respond to religiously sensitive cases; ensuring due diligence when registering and investigating blasphemy FIRs to prevent their misuse, and taking strict action against any group or individual attempting to incite sectarian hatred.\n\nThe SHRC also requested a detailed report on police action and preventive measures by July 16, reminding authorities of Pakistan’s constitutional and international obligations to protect religious freedom and inter-sect harmony.\n\nKiln workers’ plightworries SHRC\n\nSHRC chairperson Iqbal Dehto expressed concern over lack of social security for citizens working in brick kilns across the province and their mistreatment.\n\nHe said that it was alarming despite existence of Bonded Labor System (Abolition) Act 2015 and Sindh Child Protection Authority Act 2011, ground realities remain largely unchanged for thousands of workers.\n\nHe was speaking at a seminar on “Trafficking in persons, bonded labour and child protection” jointly organsied by SHRC and Society for Protection of the Rights of the Child (SPARC) in Hyderabad on Thursday. He called for strengthened implementation, better inter-departmental coordination, and targeted investment to break chains of debt bondage and child labour.\n\n“We need comprehensive and integrated actions to uphold dignity and rights of the marginalised,” he urged.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/thumbnail/2025/08/11095605e9eac17.jpg",
  "retrievedAt": "2025-08-17T20:12:14.805Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923351/sindh-human-rights-commission-says-blasphemy-laws-must-not-be-used-to-settle-scores",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:27:15.000Z"
}
