{
  "title": "Israel kills 52 Palestinians in latest Gaza offensive - World - DAWN.COM",
  "author": null,
  "content": "• Hamas says presence of Israeli troops sticking point in truce talks\n• Rubio voices optimism over potential ceasefire\n\nGAZA CITY: Gaza’s civil defence agency on Thursday said at least 52 people, including eight children, were killed by Israeli forces in the Palestinian territory battered by more than 21 months of war.\n\nThe latest deadly strikes and gunfire came just hours after Hamas, which runs Gaza, announced it was willing to release 10 prisoners as part of indirect ceasefire talks with Israel.\n\nCivil defence official Mohammad al-Mughair told AFP that 17 people were killed in a strike in front of a medical point in Deir el-Balah in central Gaza.\n\nMughair said eight children and two women were killed in the strike.\n\nYousef Al-Aydi, 30, said he was among dozens of people, mostly women and children, waiting for nutritional supplements in front of the medical point.\n\n“Suddenly, we heard the sound of a drone approaching, and then the explosion happened,” he told AFP by phone.\n\n“The ground shook beneath our feet, and everything around us tur­ned into blood and deafening screams.”\n\n“What was our fault? What was the fault of the children?” asked Mohammed Abu Ouda, 35, who had also been waiting for supplies.\n\n“I saw a mother hugging her child on the ground, both motionless — they were killed instantly.”\n\nFour people were killed and several injured in a pre-dawn air strike on a family home in Al-Bureij camp in central Gaza, Mughair added.\n\nAFP footage from Al-Bureij showed a family including three young children sitting among rubble outside their tattered tent after an air strike hit a house next door.\n\nMughair reported 27 more people killed in bombardments across the territory, including 15 people in five separate strikes in the area of Gaza City.\n\nOne person was killed southwest of the southern city of Khan Yunis by “Israeli military fire”, Mughair said.\n\nThree more, including a woman, were killed by Israeli gunfire on civilians near an aid centre in the northwest of nearby Rafah, he added.\n\nMore than 600 people have been killed around aid distributions and convoys in Gaza since late May, when Israel began allowing in a trickle of supplies, the United Nations said in early July.\n\nSticking point\n\nHamas on Thursday said it opposes any ceasefire deal that includes a large Israeli military presence in Gaza, after offering to release some prisoners.\n\nIndirect negotiations aimed at securing a truce in Gaza between Hamas and Israel entered their fifth day in Qatar on Thursday, an official with knowledge of the talks told AFP.\n\nThe current negotiations — taking place after 21 months of fighting and multiple previous rounds of talks that failed to yield a breakthrough — began in the capital Doha on Sunday in hopes of clinching a deal based on a US-backed framework that envisages an initial 60-day truce.\n\n“Hamas and Israel remain in Qatar,” the official said on condition of anonymity because of the sensitivity of talks.\n\nHamas said disagreements over the free flow of aid into Gaza and Israel’s military withdrawal were sticking points, as were its demands for “real guarantees” for a lasting peace.\n\nSenior Hamas official Bassem Naim told AFP on Thursday: “We cannot accept the perpetuation of the occupation of our land and the surrender of our people to isolated enclaves under the control of the occupation army (Israel).\n\n“This is what the negotiating delegation is presenting to the occupation so far in the current round of negotiations in Doha.”\n\nHamas was particularly opposed to Israeli control over Rafah, on the border with Egypt, and the so-called Morag Corridor between the southern city and Khan Yunis, he added.\n\nUS Secretary of State Marco Rubio said he was “hopeful” about the prospect of a ceasefire in Gaza, telling reporters on Thursday that negotiations were “closer” than they had been in some time.\n\n“We’re hopeful… It appears that generally the terms have been agreed to, but obviously now you need to have talks about how you implement those terms,” Rubio said on the sidelines of a meeting of Southeast Asian countries in Malaysia.\n\n“I think perhaps we’re closer than we’ve been in quite a while, and we’re hopeful, but we also recognise there are still some challenges in the way.”\n\nHe acknowledged that previous rounds of talks had fallen apart at similar stages. “One of the fundamental challenges is Hamas’ unwillingness to disarm, which would end this conflict immediately,” Rubio said.\n\nThe top US diplomat added that “the Israelis have shown some flexibility”.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687055c929069.gif",
  "retrievedAt": "2025-08-17T20:13:37.792Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923405/israel-kills-52-palestinians-in-latest-gaza-offensive",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:23.000Z"
}
