{
  "title": "Four more rescued from Houthi-struck ship in Red Sea - World - DAWN.COM",
  "author": null,
  "content": "ATHENS: Rescuers pulled three more crew members and a security guard alive from the Red Sea on Thursday, a day after Houthis sank the Greek ship Eternity C.\n\nIt was the second Greek bulk carrier sunk this week by the Houthi militia, shattering months of relative calm off Yemen’s coast, the gateway to the Red Sea and a critical route for oil and commodities to the world.\n\nMany shipping companies have suspended voyages due to the fear of attack. The Houthis are believed to be holding six of the Eternity C’s complement of 22 crew and three guards, maritime security sources said.\n\n“These are blameless victims who were simply doing their job,” the UK-based Seafarers Charity association said.\n\n“Seafarers should be able to work safely at sea. Instead, they are being unfairly forced into the firing line.” Eternity C was first hit on Monday with sea drones and rocket-propelled grenades fired from speed boats. Four people are believed to have been killed in the attacks, maritime security sources say. If confirmed, the deaths would be the first fatalities in the area since June last year.\n\nFollowing a second attack on Tuesday morning, the crew were forced to jump into the water. Rescuers have been searching for survivors since Wednesday morning. The vessel’s operator, Cosmoship Management, has not responded to requests for comment.\n\nA total of 10 survivors from the Eternity C have been rescued so far -eight Filipino crew members, one Indian and one Greek security guard. The four people rescued on Thursday morning had spent nearly 48 hours in the water.\n\n“This fills us with more courage to continue to search for those missing, as the Greek vessel operator requested, and shows that our search plan was correct,” said, an official at the Greece-based maritime risk firm Diaplous.\n\nAnother 11 people are still missing.\n\nThe United States mission in Yemen has accused the Houthis of kidnapping crew members and has called for their immediate release. Published in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/110947599b2e541.jpg",
  "retrievedAt": "2025-08-17T20:12:39.172Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923392/four-more-rescued-from-houthi-struck-ship-in-red-sea",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:47.000Z"
}
