{
  "title": "Bangladesh’s ex-top cop pleads guilty to crimes against humanity - World - DAWN.COM",
  "author": null,
  "content": "• Former PM Hasina formally indicted\n• Govt accused of overlooking more than 2,000 crimes committed against religious minorities\n\nDHAKA: Bangladesh’s former police chief pleaded guilty to crimes against humanity committed during a crackdown on protests last year, while ex-prime minister Sheikh Hasina was formally indicted, prosecutors said after the trial resumed Thursday.\n\nUp to 1,400 people were killed between July and August 2024, according to the United Nations, when Hasina’s government attem­pted to crush a student-led uprising.\n\nBangladesh’s International Crimes Tribunal (ICT) is prosecuting former senior figures connected to Ha­­sina’s ousted government and her now-banned party, the Awami League.\n\nFormer inspector general of police (IGP) Chowdhury Abdullah Mamun “pleaded guilty to crimes against humanity”, Muhammad Tajul Islam, chief prosecutor at the ICT, told reporters.\n\nIslam said Mamun has agreed to assist the court by acting as a witness, giving “all the knowledge he has regarding the crimes committed during the July-August uprising”.\n\nThe court has approved separate accommodation to ensure Mamun’s safety. The tribunal on Thursday also rejected defence lawyers’ requ­est to have the charges against Hasi­­na and her interior minister Asaduz­zaman Khan Kamal dismissed.\n\nBoth Hasina and Kamal were formally indicted in the same case.\n\nAmir Hossain, the state-appointed counsel for Hasina and Kamal, however, remained hopeful.\n\n“The trial is at an initial stage, and there are several other phases,” he said.\n\nHasina, 77, fled by helicopter to India as the protests ended her 15-year rule. She has defied an ext­radition order to return to Dhaka, where her trial in absentia opened on June 1. Hasina faces at least five charges at the ICT, including “abetment, incitement, complicity, facilitation, conspiracy and failure to prevent mass murder during the July uprising”.\n\nProsecutors say that Hasina held overall command responsibility for the violence.\n\nShe was already convicted of contempt of court in a separate case on July 2, receiving a six-month sentence. Fugitive former minister Kamal is also believed to be in India.\n\nAttacks on religious minorities\n\nA rights group in Bangladesh accused the government on Thursday of overlooking more than 2,000 crimes committed against religious minorities in the country and excluding them from reforms.\n\nThe Hindu-Buddhist-Christian Unity Council has been voicing concern over targeted attacks on religious minorities since the fall of ousted former premier Sheikh Hasina last year.\n\n“We have recorded 2,442 incid­ents from August 4 last year to June 30 this year, involving murders, rapes and gang rapes, vandalism of temples, homes, and businesses,” Monindra Kumar Nath, general secretary of the council, told a news conference.\n\nThe council alleged such attacks have continued even after the int­e­rim government led by Nobel Peace Prize winner Muhammad Yunus took charge of the Muslim-majority country of 170 million people.\n\nHis administration has often dismissed the accusations, saying the crimes against minorities are politically motivated, the victims believed to have supported Hasina’s Awami League party in the past.\n\n“Instead of giving due attention to our concerns, the government chose to label them as false, fabricated, and exaggerated,” Nath said, alleging the accused were “enjoying impunity”.\n\nThe unity council criticised the government for excluding religious minorities from any of the reform commissions tasked with proposing measures to end all forms of discrimination in the society.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/09183814f1aee65.jpg?r=191347",
  "retrievedAt": "2025-08-17T20:13:36.594Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923406/bangladeshs-ex-top-cop-pleads-guilty-to-crimes-against-humanity",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:23.000Z"
}
