{
  "title": "US State Department starts firing over 1,350 workers in Trump’s shake-up of diplomatic corps - World - DAWN.COM",
  "author": null,
  "content": "The US State Department began firing more than 1,350 local employees on Friday as the administration of President Donald Trump presses ahead with an unprecedented overhaul of its diplomatic corps, a move critics say will undermine Washington’s ability to defend and promote its interests abroad.\n\nThe layoffs will cover 1,107 civil service and 246 foreign service officers based in the United States, according to an internal State Department notice sent to the workforce and seen by Reuters.\n\n“The department is streamlining domestic operations to focus on diplomatic priorities,” the notice said. “Headcount reductions have been carefully tailored to affect non-core functions, duplicative or redundant offices, and offices where considerable efficiencies may be found,” it added.\n\nThe total reduction in the workforce will be around 3,000, including voluntary departures, out of the 18,000 employees based in the US, according to the notice and a senior State Department official.\n\nThe move is the first step of a restructuring that Trump has sought to ensure US foreign policy is aligned with his “America First” agenda. Former diplomats and critics say the firing of foreign service officers risks America’s ability to counter the growing assertiveness from adversaries such as China and Russia.\n\n“President Trump and Secretary of State [Marco] Rubio are once again making America less safe and less secure,” Democratic Senator Tim Kaine from Virginia said in a statement.\n\n“This is one of the most ridiculous decisions that could possibly be made at a time when China is increasing its diplomatic footprint around the world and establishing an overseas network of military and transportation bases, Russia is continuing its years-long brutal assault of a sovereign country, and the Middle East is careening from crisis to crisis,” Kaine said.\n\nTrump in February ordered Rubio to revamp the foreign service to ensure that the Republican president’s foreign policy is “faithfully” implemented.\n\nHe has also repeatedly pledged to “clean out the deep state” by firing bureaucrats whom he deems disloyal. The shake-up is part of an unprecedented push by Trump to shrink the federal bureaucracy and cut what he says is wasteful spending of taxpayer money.\n\nRubio announced the plans for the shake-up in April, saying the State Department in its current form was “bloated, bureaucratic” and was not able to perform its mission “in this new era of great power competition”.\n\nHe envisioned a structure that he said would give back the power to regional bureaus and embassies and get rid of programmes and offices that do not align with America’s core interests.\n\nThat vision would see the elimination of the role of top official for civilian security, democracy, and human rights and the closure of some offices that monitored war crimes and conflicts around the world.\n\nThe reorganisation had been expected to be largely concluded by July 1, but did not proceed as planned amid ongoing litigation, as the State Department waited for the US Supreme Court to weigh in on the Trump administration’s bid to halt a judicial order blocking mass job cuts.\n\nOn Tuesday, the court cleared the way for the Trump administration to pursue the job cuts and the sweeping downsizing of numerous agencies. Since then, the White House Counsel’s Office and the Office of Personnel Management have been coordinating with federal agencies to ensure their plans comply with the law.\n\nLast week, more than 130 retired diplomats and other former senior US officials issued an open letter criticising the planned overhaul.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/112043134093f6e.jpg",
  "retrievedAt": "2025-08-17T20:10:48.122Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923544/us-state-department-starts-firing-over-1350-workers-in-trumps-shake-up-of-diplomatic-corps",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T15:46:20.000Z"
}
