{
  "title": "Bodies of slain passengers in Balochistan bus killing sent to Punjab hometowns: official - Pakistan - DAWN.COM",
  "author": null,
  "content": "The bodies of nine bus passengers who were kidnapped and killed in Balochistan’s Sardhaka area last night were recovered and transported to their hometowns in Punjab on Friday morning, officials said.\n\nLast night, at least nine passengers travelling on two Punjab-bound coaches were abducted and killed by unidentified armed men in the Sur-Dakai area, situated on the border between Balochistan’s Zhob and Loralai districts.\n\nProvincial government spokesperson Shahid Rind also confirmed the incident and said that Fitna-al-Hindu­stan — a term the government uses for terrorist organisations in Balo­chistan — had carried out attacks at three different places — Kakat, Mastung and Sur-Dakai.\n\nThe Balochistan Liberation Front, a banned outfit, later claimed responsibility for the attack. A spokesman for the group said it had killed the nine individuals after blocking the highway between Musakhail-Makhtar and Khajuri.\n\nAssistant Comm­issioner (AC) Naveed Alam told Dawn.com today that the bodies of all nine passengers were handed over to a political agent in the Sakhi Sarwar district of Dera Ghazi Khan to be handed over to their families.\n\nHe said that seven of the passengers had been identified, but two could not be due to a lack of documents.\n\n“The terrorists must have taken the passengers’ identification documents with them,” AC Alam said.\n\nOf the seven passengers identified, two were residents of Lodhran, while one passenger each was a resident of DG Khan, Gujrat, Attock, Khanewal and Gujranwala.\n\nThe country’s top leaders strongly condemned the incident and vowed action against the perpetrators “at all costs”.\n\nIn a statement today, President Asif Ali Zardari said: “This barbarity is part of Fitna-al-Hindustan’s evil conspiracy to spill blood in Pakistan,” state-run Radio Pakistan reported.\n\nHe reaffirmed commitment to “clear the land of Fitna-al-Hindustan and its facilitators at all costs”.\n\nSimilarly, Prime Minister Shehbaz Sharif said in a statement issued by his office: “We will deal with terrorists with full force. The blood of innocent people will be avenged.”\n\nThe premier added that the killing of unarmed civilians was a blatant act of terrorism by Fitna-al-Hindustan.\n\n“With resolve, unity, and strength, we will confront the scourge of terrorism and uproot it completely,” the prime minister said.\n\nBalochistan Chief Minister Sarfraz Bugti also strongly condemned the incident, calling it “blatant terrorism”.\n\n“The killing of innocent civilians based on Pakistani identity is an unforgivable crime,” Bugti said, vowing that the response would be “severe”.\n\n“The terrorists have proven that they are not human beings, but cowardly beasts,” he said, adding that the state “would not even let these murderers hide underground”.\n\nThe chief minister added: “All networks of terrorists who are the sponsors of Fitna-al-Hindustan will be destroyed.”\n\nNoting that this was a “state war”, he vowed decisive action.\n\nCM Bugti further vowed to crush “every plan of terrorism” with strength, determination and unity. “Balochistan will become a graveyard for enemies.”\n\nIn a statement on X late last night, Interior Minister Mohsin Naqvi condemned the incident, saying: “We will chase and eliminate Indian-sponsored terrorists who target innocent passengers.”\n\n“The conspiracies of Indian-sponsored terrorists and their accomplices must be foiled with the support of the nation.”\n\nAccording to sources, two passenger coaches en route to Punjab were intercepted in the Sur-Dakai area near the N-70 highway, close to Dab — a place along the Loralai-Zhob border. A group of armed men had blocked the road and stopped the two vehicles.\n\nThe armed assailants boarded the coaches, checked the identity cards of passengers and forced 10 persons off the vehicles at gunpoint.\n\n“They dragged out 10 passengers — seven from one coach and three from the other — and took them away (to an unknown place),” a surviving passenger told Levies. “I don’t know what they did to them, but I heard gunfire as we were leaving.”\n\nAfter abducting the nine passengers, the assailants allowed both coaches to leave the area.\n\nSecurity forces suspended traffic on the highway and began a large-scale search operation to locate the perpetrators.\n\nAccording to sources, the attackers checked the national identity cards of all passengers and specifically targeted individuals with Punjab addresses. They also opened fire on the coaches during the abduction to prevent any escape.\n\nCM Bugti presided over a high-level security meeting to assess the province’s overall law and order situation.\n\nInspector General of Police Balochistan Moazzam Jah Ansari and other senior security officials were in attendance. They presented comprehensive briefings outlining the motives behind the attack, progress in the investigation and steps taken by law enforcement in its aftermath.\n\nBugti vowed that those responsible would be brought to justice swiftly.\n\n“We will not spare anyone involved in this heinous act,” he declared. “There will be no leniency for those who shed innocent blood.”\n\nCM Bugti emphasised the need for seamless coordination between police and Levies forces, instructing that jurisdictional boundaries must not hinder operations. “A united and effective response is imperative to ensure such elements never re-emerge,” he said.\n\nHe also directed the strengthening of rapid response capabilities to better manage future threats.\n\n“There will be no compromise on the rule of law. We will meet the enemies of peace with full force.”\n\nOne of the surviving passengers, Sabir Toor, told Geo News that he and 10 members of his family were on their way to Lodhran from Quetta for their father’s funeral when the attack occurred.\n\nThe gunmen offloaded his two brothers, Usman and Jabir, from the bus in front of women and children of the family and killed them. “I cannot describe this hour of grief — we have three funerals in the family now.”\n\n“I urge security forces to get rid of these miscreants,” he said, adding that he and his brothers had been working in Quetta for the past 30 years and had no relations to any political party.\n\nThe Human Rights Commission of Pakistan (HRCP) expressed deep grievance over the incident, urging the state to seek a “political solution” to long-standing issues in Balochistan.\n\nIn a statement posted on X, the HRCP said, “This wanton violence against labourers and common citizens is deplorable and must cease immediately.”\n\nIn May this year, the government designated all terrorist organisations in Balochistan as Fitna-al-Hindu­stan.\n\nBalochistan has witnessed a spate of attacks targeting those hailing from Punjab. In two separate incidents in April 2024, nine people were killed after being forced off a bus near Noshki, while two labourers from Punjab were shot in Kech.\n\nIn February, seven Punjab-bound passengers were offloaded from a bus and shot dead in Barkhan district. The incident came days after 12 were killed in a blast targeting a bus carrying coal miners in Harnai.\n\nIn May last year, seven barbers from Punjab were shot dead near Gwadar, while August saw 23 travellers offloaded from trucks and buses and shot in the Musakhail district.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/11115616dbfc356.jpg",
  "retrievedAt": "2025-08-17T20:11:48.009Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923476/bodies-of-slain-passengers-in-balochistan-bus-killing-sent-to-punjab-hometowns-official",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T06:44:54.000Z"
}
