{
  "title": "Seizing the moment - Newspaper - DAWN.COM",
  "author": null,
  "content": "THERE has been over a decade of virtual silence from both the federal and provincial governments with regard to our rapidly rising population growth rates.\n\nFinally, some prominent public figures are expressing concerns about this issue. The health minister, in his budget speech, claimed that rapid population growth poses a greater problem than health. The finance minister has repeatedly identified climate change and rapid population growth as twin existential threats facing Pakistan. The minister for planning and development has remarked that we have hit the accelerator on population growth instead of pulling the brakes.\n\nThe Parliamentary Forum on Population, a cross-party initiative, has strongly supported the idea of tabling a resolution in the National Assembly to restore the balance between rapid population growth and available resources. Meanwhile, the media, though preoccupied with politics, now seems more willing to discuss population issues, particularly during prime time talk shows. The fear of backlash has diminished, leading to greater openness about this previously undiscussed topic.\n\nA significant policy announcement was the Punjab chief minister’s approval of merging the population welfare and health departments. This merger aims to enhance service delivery by eliminating duplicate service structures. Sindh boasts an outstanding minister overseeing both population welfare and health.\n\nHas the moment we have been waiting for finally arrived? Has it come too late compared to the rest of the developing world, leaving us decades behind? Should we now seize the moment? The answers to all three questions are yes.\n\nOn World Population Day today, we must reflect on how other states managed their populations.\n\nThe signals of distress from those who can effect change will only matter if they are followed by action. First and foremost, reducing population growth is not a top-down mandate and definitely not about population control. It is about managing the needs and rights of the people of Pakistan, not infringing upon their fundamental right to decide family sizes. Policies and programmes aimed at lowering population growth rates will be effective only if people are equipped with information and given the opportunity to make rational choices.\n\nThe new population narrative of ‘tawazzun’, fully endorsed by the Council of Islamic Ideology, emphasises recreating the balance between dwindling resources and a rapidly increasing population as a means of ensuring the rights of current and future citizens. The state has the responsibility of providing opportunities for education and employment for young adults, for women who face health risks from unplanned pregnancies, and for newborns to survive their first day of life.\n\nWe must learn from countries like Indonesia, Bangladesh and Iran, which successfully managed their populations and maintained human development goals as the rationale for lowering growth rates decades ago. Decades ago, they utilised population management to deliberately build healthier and more educated future generations through investments in voluntary family planning services and campaigns.\n\nPakistan’s realities have changed after the 18th Amendment, yet one reason for our stagnation is the lack of national consensus on our position reg­arding rapid population growth; there has been a lack of clarity about whether it is a positive or negative factor for Pakistan’s present and future well-being. The prime minister must publicly dec­lare the government’s position. A strong federal role, without encroaching on provincial authority, must be established. Forming a ‘Pop­u­lation and Development Commission’, headed by the prime minister and including all chief ministers, could set policy and ensure financing support, especially for under-resourced provinces and regions.\n\nThe provinces bear the primary responsibility for improving access to family planning services, particularly for poorer families. An eclectic effort is required to address the needs of millions facing unplanned pregnancies across Pakistan. A 2023 Population Council study found that 46 per cent of pregnancies in Pakistan are unplanned or mistimed, with this proportion unchanged since 2012. Millions of unplanned births could have been prevented if access to family planning had been expanded over the past decade.\n\nSocial protection programmes, such as BISP, have huge potential to reach the poorest families in remote areas, subsidising their access to services. This approach has proved effective in Punjab and should also be extended to poorer regions. We must incorporate family planning into the social protection package as a pro-poor policy. Ironically, both Mamta in Sindh and Agosh in Punjab are social protection programmes that focus solely on pregnancy care without leveraging the opportunity to provide family planning advice and services to non-pregnant and younger women.\n\nFocusing on population management in silos will not be effective. Empowering women is necessary and critically important for helping families achieve their desired family size. No country with a low gender parity index can expect progress in social or economic indicators. Women must be empowered to make critical decisions about their children and their own lives. Women and girls lack decision-making power in most aspects of their lives. For instance, most women and girls want to work, and yet only a small minority are able to do so.\n\nPakistan’s female labour force participation rate has stagnated at 24pc for many years. It is high time to change this by announcing incentives for employers and female quotas in the workplace. Even symbolic announcements prioritising women would signal a shift in public policy.\n\nSimilarly, efforts to improve public education cannot be overlooked. We are lagging behind with stagnating or even declining school enrolment rates. It is not surprising that key health indicators like infant and child mortality that are closely linked to female education, have hardly shown improvement in the last decade.\n\nFinally, key stakeholders have recognised that the significant weight of 82pc assigned to population numbers in the NFC award has had a pernicious impact. Addressing the NFC formula’s population weightage is crucial to avoid skewed census results driven by the political leadership’s desire for a larger share of the common pool and assembly seats. At the same time, reducing the NFC allocation does not guarantee services, especially for the poorest. Alternative resource-allocation mechanisms are needed to incentivise provinces to invest in more funding towards reducing infant and maternal mortality and fertility through high-quality, voluntary family planning services.\n\nWe must immediately seize the moment — our foremost priority must be to fulfil the fundamental rights and aspirations of the people.\n\nThe writer is Country Director, Population Council.\n\nPublished in Dawn, July 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687059d0ce308.jpg",
  "retrievedAt": "2025-08-17T20:12:07.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923425",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T00:26:52.000Z"
}
