{
  "title": "IWMB helped rehabilitate 381 animals since August 2021",
  "link": "https://www.app.com.pk/national/iwmb-helped-rehabilitate-381-animals-since-august-2021/",
  "date_published": "2024-01-30T14:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP): The Wildlife Rescue and Rehabilitation Centre of the Islamabad Wildlife Management Board (IWMB) has since its inception in August 2021 successfully rehabilitated 381 animals of different species suffering from maltreatment.\nThis was shared by IWMB Chairperson Rina Saeed Khan with mediapersons during their visit of the Centre, organized by the Board and Second Chance Widlife on Tuesday.\nRina Saeed Khan said the rescued and rehabilitated animals included mammals, birds and reptiles.\n“The IWMB only deals with wild animals (indigenous & exotic) which are treated in a non-humane way, orphaned and injured in order to implement the Islamabad High Court’s (IHC) judgment in W.P. 1155/2019 which specifically states,”No animal is treated in a manner that subjects it to unnecessary pain and suffering”.\nShe said that the IWMB operated under the Ministry of Climate Change and Environmental Coordination.\nIn 2020, she said, when the Islamabad Zoo was permanently shut down on the IHC’s orders the IWMB gradually converted its site into the only wildlife rescue centre, first of its kind in Pakistan, providing assistance to all species of wild animals in distress.\nIn November 2023, she said, the IWMB signed a Memorandum of Understanding (MoU) with the Second Chance Wildlife, a registered non-governmental organization, outsourcing the management of the Rescue and Rehabilitation Centre, which was now being operated with the full cooperation of IWMB staff.\n“The Centre is runs with the donations of civil society,” she added.\nRina Saeed Khan said currently 51 animals, including seven Black Bears, a Bengal Tiger, 15 Rhesus Monkey, a Indian Palm Civet Cat, a Steppe Eagle (Wing damaged unable to fly), 21 Indian Kite, a White Eyed Buzzard, a Booted Eagle, and three Spiny Tailed Lizard, were being rehabilitated at the Centre.\nShe said that the IWMB had plans to permanently house seven Black Bears which were under its care in a sanctuary space on site of the old zoo.\n“The Rhesus monkeys which can be rehabilitated are released back into Margallah Hills National Park along with other local rescued species like Indian Pangolins (15 released since 2020).\n“Leopard cats being trafficked in Karachi have also been successfully released into the MHNP along with several rehabilitated Indian porcupines, foxes, Golden Jackals, Civet cats and bird species like Indian Kites and Spotted Owls,” the IWMB chairperson said.\n“Many injured animals of the local species are also brought to the Rescue Centre, which after regaining health with the care of volunteers and staff are released into the wild habitat. Several local vets work at the Rescue Centre to take care of the health of such animals,” she said.\nShe recalled that the IWMB’s most famous rescue, she recalled, was of the leopard, which was captured from the DHA Islamabad and later released back into the habitat in 2022.\nSecond Chance Wildlife is currently conducting limited guided tours of the Rescue Centre for students and animal lovers while the IWMB has plans to open a Visitor Information Centre on the site of old zoo for general public once funds are arranged.\nThe Rescue Centre and Digital Visitor Information Centre together will form the Margallah Wildlife Centre.",
  "retrievedAt": "2025-08-11T00:05:00.344Z"
}
