{
  "title": "LESCO detects 413 power pilferers in 24 hours",
  "link": "https://www.app.com.pk/national/lesco-detects-413-power-pilferers-in-24-hours/",
  "date_published": "2024-01-30T13:43:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 30 (APP):Lahore Electric Supply Company (LESCO) has detected a total of 413 connections from where the customers were pilfering electricity in all its circles of five districts (Lahore, Sheikhupura, Nankana Sahib, Kasur and Okara) on the 143rd day of grand anti-power theft campaign.\nThe LESCO spokesman told media here Tuesday that the company has also submitted FIR applications against 412 electricity thieves, out of which 187 FIRs have been registered in respective police stations, while 09 accused have been arrested.\nGrand anti-power theft operations against electricity thieves are being conducted on the directives of the Federal Power Division and the LESCO Chief Executive Officer (CEO) Engineer Shahid Haider is supervising these operations. The LESCO chief vowed that the operations would continue without discrimination until the complete end of electricity theft. The electricity pilferers as well as the LESCO officers and employees who facilitate them are also being brought to justice.\nOn the 143rd consecutive day of the anti-power theft campaign, the spokesman added, large commercial consumers were also found involved in electricity theft and all of them were also disconnected and charged with detection units. Among the seized connections 12 were commercial, 03 agricultural and 398 domestic, and all these connections were disconnected and charged with a total of 335,213 units as detection bill amounting to Rs 11.052 million.\nApprising the media about some major power pilferers, he explained that LESCO charged Rs 500,000 detection to an electricity pilferer in Muridke; Rs 180,000 fine in the form of detection bill to a customer stealing electricity in Township Lahore; Rs 180,000 and Rs 175,000 detection bills respectively to two power thieves in Shahdara Town.\nDuring the 143 days of grand anti-theft campaign, the spokesman mentioned, the LESCO detected pilferage on 49,320 power connections and submitted 48,861 FIR applications against electricity thieves in the relevant police stations out of which 45,973 FIRs have been registered, while 17,403 accused have so far been arrested by the police. The LESCO has so far charged a total of 69,485,630 detection units worth Rs 2,693,974,334 to all the power pilferers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:05:41.312Z"
}
