{
  "title": "Ahmad Ishaque Jehangir assumes as DG FIA",
  "link": "https://www.app.com.pk/national/ahmad-ishaque-jehangir-assumes-as-dg-fia/",
  "date_published": "2024-01-30T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP): Ahmad Ishaque Jehangir, PSP, PPM, a seasoned and highly esteemed officer hailing from the Police Service of Pakistan (PSP), officially assumed the charge as the Director General of the Federal Investigation Agency (FIA).\nAccording to the press release issued here Tuesday, Ahmad Ishaque Jehangir brings a wealth of experience and a distinguished career in law enforcement to his new role, having previously served as the Additional DG in FIA’s Cybercrime Wing.\nWith an illustrious career marked by exemplary service in various capacities across all four provinces of Pakistan, he is widely recognized for his professionalism, honesty, and commitment to upholding the law.\nUpon assuming office at the FIA Headquarters in Islamabad, he paid homage to the sacrifices made by the agency’s martyrs at the Martyrs’ Memorial. Subsequently, he engaged with the ADGs and Directors, expressing his firm determination to enhance the institution’s capabilities and better service delivery.\nIn a statement, the Director General outlined his vision for the FIA, emphasizing the core values of honesty, duty and effective law enforcement.\nHe pledged to take urgent measures to enhance public service delivery and declared that under his leadership emphasis would be to provide the best services to the people.\nAddressing immediate challenges, he highlighted the need to combat human trafficking, cybercrimes, money laundering, corruption and other white collar crimes in the country.\nHe asserted that stern action would be taken against individuals spreading fake, objectionable, and hateful content on social media, in accordance with the law.\nHe emphasized the Agency’s commitment to preventing human trafficking and ensuring public awareness, and announced a joint strategy with national and international organizations to tackle international crimes such as human trafficking.\nRecognizing the critical role of professional training, the Director General FIA issued orders to focus on the specialized training of investigation officers and senior officers within the agency.\nHe emphasized a zero-tolerance policy against misconduct and stressed the importance of performing professional duties diligently.\nAny negligence in the performance of professional duties will not be tolerated. Stringent legal actions will be taken against officers involved in misconduct and negligence, he said.",
  "retrievedAt": "2025-08-11T00:05:18.163Z"
}
