{
  "title": "NCRC drafts legislative bill against child labor",
  "link": "https://www.app.com.pk/national/ncrc-drafts-legislative-bill-against-child-labor/",
  "date_published": "2024-01-30T16:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP):The National Child Rights Commission (NCRC) has drafted a comprehensive piece of legislation aimed at preventing child domestic labor.\nThe consultation on the proposed ‘Child Domestic Labour Draft Bill’ was held in a local hotel of  the federal capital. Esteemed stakeholders, including representatives from UNICEF, ILO, Ministry of Human Rights and various other organizations, gathered to contribute their expertise and insights, said a press release issued by the law ministry. The event was graced by the presence of Ms. Ayesha Raza, the Chairperson of the National Child Rights Commission (NCRC).\nThe issue is exacerbated by child labor in various sectors such as brick kilns, carpet factories, and the ominous nexus of narcotic terrorism. Children engaged in domestic labor are subjected to health risks, rights violations, disrupted education, and exposure to violence and brutality.\nRecognizing the gravity of this issue, the NCRC has taken an admirable initiative by drafting a comprehensive piece of legislation aimed at preventing and regulating child domestic labor.\nThe proposed bill takes a bold stance by criminalizing child domestic labor, marking it as a non-bailable offense.      Furthermore, it seeks to establish a uniform child rights legislation applicable across the entire country of Pakistan.\nOne of the key provisions emphasizes the urgent need to set a uniform age for children, aligning with the spirit of the Child Rights Convention, i.e., 18 years.\nThe Secretary Law, in acknowledgement of the significance of the cause, also attended the event. Additionally, the Ministry of Law and Justice has pledged its full support to facilitate the enactment of the Child Domestic Labour Law to address the multifaceted challenges posed by child labor. The proposed legislation aims to go beyond being merely punitive; it seeks to fully incorporate the commitments made in the Child Rights Convention.\nAs the consultation concludes, there is a shared sense of urgency among stakeholders to expedite the legislative process. The commitment of all participants signals a united front against child domestic labor. The proposed child domestic labour draft bill represents a significant milestone in Pakistan’s ongoing efforts to safeguard the rights and future of its children.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:05:08.599Z"
}
