{
  "title": "Preparations finalize to celebrate Kashmir Solidarity Day with enthusiasm",
  "link": "https://www.app.com.pk/national/preparations-finalize-to-celebrate-kashmir-solidarity-day-with-enthusiasm/",
  "date_published": "2024-01-30T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP):A meeting was held here on Tuesday to finalize the preparations regarding the celebration of Kashmir Solidarity Day on February 05 at home and abroad in a grand manner, with zeal and enthusiasm.\nIt was presided over by Secretary, Ministry of Kashmir Affairs Jawad Rafiq Malik. Additional Secretary Kashmir Affairs, Joint Secretary Gilgit-Baltistan Council, Joint Secretary Azad Jammu and Kashmir Council besides Ministry of Foreign Affairs, Ministry of Interior, Information and Broadcasting, PTV, PEMRA, Railway Division, Aviation Division, NHA, representatives of all four provinces, Azad Kashmir, Gilgit-Baltistan and senior officials of other important institutions also participated, said a news release.\nPresiding over the meeting, the Secretary of the Ministry of Kashmir Affairs said that it is our national duty to express solidarity with the oppressed people of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHe said that India has been oppressing innocent Kashmiris for the past seven decades despite that it has failed miserably in suppressing the spirit of self-determination of the people of Kashmir.\nHe encouraged the expression of solidarity with the Kashmiri brothers in this difficult time and expressed satisfaction over the preparations made by all the concerned institutions.\n“All institutions and the whole nation would participate in Kashmir Solidarity Day celebrations with full spirit and not only the message of solidarity will be conveyed to the other side of LoC but also the entire world will be convinced once again,” he added.\nIn the meeting, the representatives of all the relevant institutions informed the participants of the preparations made on the occasion of Kashmir Solidarity Day and expressed their commitment that they will leave no stone unturned to celebrate the day.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:04:50.722Z"
}
