{
  "title": "CDA services to go online to facilitate citizens",
  "link": "https://www.app.com.pk/national/cda-services-to-go-online-to-facilitate-citizens/",
  "date_published": "2024-01-30T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP):Capital Development Authority (CDA)  launched its new website to facilitate the general public, says a press release issued here on Tuesday.\nIn this regard, a ceremony was held at the authority’s headquarters which was attended by the CDA chairman, members of its Board, representatives of Islamabad Chamber of Commerce and Industries and officers of concerned formations.\nOn this occasion, the chairman said that the use of technology in the authority would improve service delivery.\nHe said that the launch of new and updated website was an important step towards digitalisation.\nHe further said that Land and Estate records are also being digitalised.\nCDA was introducing secure paper for issuing allotment and transfer letters to reduce the risk of forgery and tampering of records, he said.\nThe chairman further added that the initiative would help reduce complaints of corruption, fraudulent transactions and eradication of complaints like alteration in records.\nA tree management system has also been introduced as part of the technology based initiatives being taken in the authority. This system will be based on state-of-the-art Digital Trees Inventory software.\nSimilarly, for the first time all tree and plants data will also be digitized with the help of field force and satellite imagery.\nUnder which barren land can be identified along with trees and plants data so that the land of Islamabad can be kept free from illegal constructions and encroachment and plantation can be done there as per need.\nThe launch of the new website will further boost the confidence of overseas Pakistani’s as a new online property verification system has also been introduced to facilitate citizens in property transactions from the comfort of their own homes and they will be able to verify the property through the CDA website.\nMoreover, in the new website, all the authority’s services will be provided online so that citizens do not have to visit CDA offices.\nSimilarly, tendering process has also been made online. E-tendering will not only improve rate and efficiency but also bring innovation and transparency with online system.\nApart from this, due to the new website, citizens will be able to pay their water bills or other arrears including property tax at home. Similarly, in view of the convenience of the citizens, the data of the arrears of the last twenty years has also been updated in this website.\nOn the new website, all the rules and regulations of CDA will be available to every citizen in just single click.\nSimilarly, various CDA forms and documents will now be available online.\nSimilarly, after the launch of the new website, the booking of various places in Islamabad has been made online, which includes the booking of events, photo shoots and Simly Dam rest house.\nMoreover, the feedback option of the citizen facilities has also been kept in order to improve the performance of the institution.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:05:39.149Z"
}
