{
  "title": "US, Pakistan sign agreement to protect Pakistan’s cultural heritage",
  "link": "https://www.app.com.pk/national/us-pakistan-sign-agreement-to-protect-pakistans-cultural-heritage/",
  "date_published": "2024-01-30T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP):United States and Pakistan here on Tuesday signed an agreement to protect Pakistan’s cultural heritage.\nUS Ambassador to Pakistan Donald Blome and Pakistan Secretary of National Heritage and Culture Humaira Ahmed signed the  agreement, said a news release issued by the embassy.\nThe agreement establishes import restrictions on certain types of archaeological and ethnological materials originating from Pakistan and entering the United States.  The agreement facilitates the return of these cultural objects to the people of Pakistan. The cultural property agreement demonstrates the strong US and Pakistani commitment to disrupt the theft and trafficking of cultural objects and our shared goal of protecting Pakistan’s rich and diverse cultural heritage.\nThis agreement commits both parties to work together to counter looting and trafficking of objects, promote a clean market for Pakistani art and antiquities in the United States, and increase opportunities for the US museums and the American public to learn about and experience Pakistan’s history and culture.\n“This agreement protects unique and historically significant artifacts for future generations. It also demonstrates US support for the principles of tolerance and respect for diversity – principles by which the people of this region have lived for centuries,” said Ambassador Blome.\nToday’s signing underscores the United States’ global commitment to cultural heritage protection and preservation.\nThe United States has been unwavering in its commitment to protect and preserve cultural heritage around the world and to restrict trafficking in cultural property, which may be used to fund terrorist and criminal networks.\nTo date, the United States has returned over 175 cultural objects to Pakistan, and this agreement simplifies the process. Since 2001, the United States government has supported 35 cultural heritage preservation projects across Pakistan with more than $8.4 million USD.\nUS-funded preservation projects include the conservation of Gandhara archaeological treasures and Mughal architectural heritage, documentation of historic manuscripts, the digitization of museums, and the restoration of historically significant ‘Sufi’ shrines and ‘Hindu’ monuments among other projects.\nThis new bilateral cultural agreement highlights the diversity of the Pakistani people and sets the stage for further bilateral cooperation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:05:46.800Z"
}
