{
  "title": "CDA Chairman orders quarterly water quality test at filtration plants",
  "author": null,
  "content": "ISLAMABAD, Jan 18 (APP):Chairman Capital Development Authority (CDA), Muhammad Ali Randhawa, has directed quarterly water quality testing of filtration plants in the federal capital through third-party validation by the Pakistan Council of Research in Water Resources (PCRWR).\nWhile chairing a meeting on Saturday, CDA Chairman Muhammad Ali Randhawa was informed that water quality at all filtration plants is being maintained in accordance with WHO standards.\nThe Director General (DG) Water briefed the authority chairman on the restoration of water filtration plants and the installation of sewage treatment plants (STPs) in Islamabad to address water contamination in Rawal Dam.\nRandhawa directed the immediate repair and restoration of all water filtration plants in the capital.\nHe also instructed that a comprehensive survey of all filtration plants be completed without delay.\nTo ensure swift action, the chairman ordered the Member Finance to release necessary funds for the restoration and maintenance of the filtration plants.\nHe further proposed exploring the option of outsourcing their long-term upkeep.\nEmphasizing the urgency of controlling Rawal Dam’s water contamination, Randhawa called for the rapid installation of sewage treatment plants.\nOfficials informed the meeting that three STPs are being installed at Bari Imam, Bani Gala, and Simly Dam Road.\nThe tenders for these plants have already been opened, and the installation process will begin soon after bid scrutiny.\nAdditionally, the chairman directed all housing societies in Islamabad to install sewage treatment plants without delay.\nTo enhance environmental sustainability, Randhawa also instructed officials to explore additional wetland options in the city.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:47:14.981Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cda-chairman-orders-quarterly-water-quality-test-at-filtration-plants/",
  "dateList": "2025-01-18",
  "date_published": "2025-01-18T13:36:00.000Z"
}
