{
  "title": "PDMAs conduct local-level needs assessment, mock exercises in vulnerable areas: Gen Inam",
  "link": "https://www.app.com.pk/national/pdmas-conduct-local-level-needs-assessment-mock-exercises-in-vulnerable-areas-gen-inam/",
  "date_published": "2023-06-12T11:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): Chairman National Disaster Management Authority (NDMA), Lieutenant General Inam Haider Malik on Monday instructed the provincial disaster management authorities (PDMAs) to conduct a local-level needs assessment and mock exercises, deploy manpower and machinery, and work closely with relevant departments in areas at risk of Tropical Cyclone BIPARJOY effects.\nThe NDMA convened National Coordination Conference on Tropical Cyclone BIPARJOY presided by Chairman NDMA, Lt. General Inam Haider Malik to review the development of ‘Extremely Severe Cyclonic Storm’ (ESCS) BIPARJOY over Arabian Sea in PDMA Sindh Headquarter, Karachi participated by representatives of relevant stakeholders including Pakistan Meteorological Department (PMD), PDMAs Sindh and Balochistan, K-electric, Pakistan Maritime Security Agency (PMSA) HQ, District Disaster Management Authorities (DDMAs), Radio Pakistan and Associated Press of Pakistan (APP), a news release said.\nThe PMD officials briefed the forum that BIPARJOY had moved further northwards during last 12 hours and was now lying at a distance of about 600 kilometers (km) south of Karachi, 580km south of Thatta and 710km southeast of Ormara. The maximum sustained surface winds were 160-180 Km/hour and gusts 200 Km/hour around the system center. It added that favourable environmental conditions were supporting the system to maintain its severity.\n“The ESCS BIPARJOY is most likely to track further northward until 14 June morning, then recurve north-eastward and cross between Keti Bandar (Southeast Sindh). It is likely to cause above 100mm rainfall in Karachi and extreme rain spells in Sajawal, Badin and Thatta around 200-300mm from 13 June onwards,” the Met Office officials informed the forum.\nThe National Emergencies Operation Centre (NEOC) provided an update of potential impacts including heavy rains, thunderstorms and winds in south and southeast Sindh (Karachi, Thatta, Sujawal, Badin, Tharparkar and Mirpurkhas) from the evening of 13 June onwards; damage to weak structures due to winds; storm surge and urban flooding along the coast and rough to very rough sea conditions with high-intensity squalls that would prevent fishermen from venturing out into the open sea.\nThe NEOC was continuously monitoring and sharing information with all stakeholders and the public through webpage-based projections of BIPARJOY’s tracks and impacts on coastal areas.\nThe PDMAs of Sindh and Balochistan shared their contingency plan, humanitarian impact, mass communication efforts, risk assessment, and logistics support for areas at risk of disaster.\nThe Chairman NDMA informed the forum that NDMA was in close coordination with PMD, PDMA Sindh and Balochistan, Pakistan Navy, Pakistan Maritime Security Authority (PMSA), Pakistan Coast Guards (PCG) issuing advisories and guidelines to all concerned stakeholders at national and provincial levels to undertake proactive preparedness and mitigation measures.The NDMA urged the public to stay informed and follow local authorities’ guidance in any emergency situation due to the cyclone.",
  "retrievedAt": "2025-08-11T08:41:37.164Z"
}
