{
  "title": "NA Speaker for eradicating Child Labour to ensure country’s bright future",
  "link": "https://www.app.com.pk/national/na-speaker-for-eradicating-child-labour-to-ensure-countrys-bright-future/",
  "date_published": "2023-06-12T11:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP): Speaker National Assembly Raja Pervaiz Ashraf on Monday said that the bright future of the nation is interlinked with the eradication of the menace of Child Labour.\nIn a message on the occasion of International Child Labor Day, which is celebrated across the world on June, 12 every year under the auspices of the United Nations, he said, that each child should be given the opportunity for standardized education by eliminating all kinds of forced labor, mental and physical abuse, especially against children from society.\nHe also stressed on the need to take special initiatives to protect children from the menace of child labour.\nThe Speaker said that forced labor from children is tantamount to compromise and destroying their childhood as they are deprived of what is essential for development.\nThe speaker said that the constitution guarantees the protection of children’s rights and under the constitution, it is the responsibility of the government to provide facilities for children from 5 to 16 years to avail the opportunity for getting free education.\nHe said that Pakistan being a signatory of the International Convention for the Protection of Children should strictly adhere to international agreements to protect children from labour.\nOn the observance of World Day Against #ChildLabour, Speaker National Assembly Raja Pervez Ashraf urges the ending of cataclysmic ordeal of Bounded Child Labour in Pakistan.\nHe underlined that Parliament of Pakistan is committed to its International obligations towards the… pic.twitter.com/PL7FgV3gaz\n— National Assembly  (@NAofPakistan) June 12, 2023\nHe also pointed out that added that according to Pakistani laws taking forced labor from children is a punishable offence.\nPervez Ashraf has said that the Parliament of Pakistan became first regional Parliament to formulate Parliamentary Caucus on Child Rights to ensure child-friendly legislation.\nHe also said that the National Assembly of Pakistan commemorated the Diamond Jubilee celebrations on the completion of 75 years of Pakistan and a special convention of children was also organized on the occasion in which all sections of the society were involved.\nHe also emphasized the need to take all stakeholders on board for eliminating the menace of Child labor from Pakistan.",
  "retrievedAt": "2025-08-11T08:41:37.297Z"
}
