{
  "title": "Govt enhances BISP’s budget from Rs 404 to Rs 455 billion for FY 2023-24: Shazia Marri",
  "link": "https://www.app.com.pk/national/bisp-budget-enhanced-up-to-rs-455-billion-for-fy-2023-24-shazia-marri/",
  "date_published": "2023-06-12T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 12 (APP):Federal Minister for Poverty Alleviation and Social Safety (PA&SS) Shazia Marri Monday said the incumbent government had further enhanced the budget of Benazir Income Support Programme (BISP) budget from Rs 404 billion to Rs 455 billion for the financial year 2023-24.\nInforming the journalists about the budget increase during a press conference here, she said the Benazir Nashonuma Programme’s budget also saw a leap upwards from Rs 4.87 billion in 2021-22 to 21.88 billion in 2022-23 which was an increase by 349%, whereas, an amount of Rs 32.27 billion had been proposed in the upcoming budget of 2023-24.\nShe said the Benazir Nashonuma Programme had also registered 0.643 million children, pregnant women, and lactating mothers to date, and was all set to meet the target of 1.5 million during the next financial year 2023-24.\nShazia Marri emphasized the importance of the BISP’s role in uplifting the lives of the underprivileged and marginalized segments of the society. The BISP, which commenced in 2008 and was the brainchild of Shaheed Mohtarma Benazir Bhutto, had proven to be a highly successful programme.\n“It functions on non-political grounds, providing financial assistance to approximately 9 million women across the country which is targeted to be expanded to 9.3 million households after the recent increase in the budget,” she added.\nWhile talking about the budgetary allocations, she said over the years, the budget allocation for the BISP had witnessed significant growth, reflecting the government’s commitment to social welfare of the poor of the poorest.\nWhen the incumbent government, she said, came to power, the BISP’s budget allocation was Rs 235 billion, which had now been augmented to Rs 455 billion in a short span of over one year.\nThe minister also informed the audience that the quarterly cash transfer amount was enhanced from Rs 7,000 to Rs 8,750 during the last quarter, 25% increase. The government intended to further increase the stipend of Benazir Kafaalat Programme in light of the economic situation, she added.\nShe also announced to start a mobile service for the National Socio-Economic Registry (NSER) in remote areas of Sindh, Balochistan, South Punjab and Khyber Pakhtunkhwa. “The service which will be operational by July this year, will provide easy access to people in far-flung areas of these provinces.”\nShe said some 820,000 beneficiaries, who were filtered out of the BISP beneficiary list by the last government, were being re-examined after they appealed to be heard. Out of those, she added, “136,525 beneficiaries have successfully been enrolled again with the BISP and they will receive their stipend in the upcoming tranche”.\nDuring the press conference, Special Assistant to the Prime Minister on Poverty Alleviation and Social Safety Faisal Karim Kundi urged the Sindh government to follow all the instructions of relevant departments to protect the citizens from the cyclone impacts.\nWhile discussing the situation caused by Cyclone Biparjoy, Faisal Kundi said the government was closely monitoring the situation, with particular attention to areas such as Sajawal, Badin, and Thatta which were highly vulnerable. “These areas have been placed on high alert, and efforts are underway to ensure the safety of over 8 million people,” he added.\nThe SAPM urged the public to cooperate with the government and adhere to safety guidelines issued from time to time during the emergency situation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T08:41:51.289Z"
}
