{
  "title": "Will distribute a million laptops annually, if given mandate in next polls: PM",
  "link": "https://www.app.com.pk/national/will-distribute-a-million-laptops-annually-if-given-mandate-in-next-polls-pm/",
  "date_published": "2023-07-26T10:58:00.000Z",
  "source": "APP",
  "content": "KARACHI, July 26 (APP): Prime Minister Shehbaz Sharif on Wednesday said that if given a mandate in next general elections, his next government would distribute around one million laptops across the country annually as part of the vision to support the talented youth.\nThe prime minister, addressing a ceremony for the distribution of laptops and cheques for youth business loans, said with support from allies, a mechanism would be formulated – to be equally funded by centre and provinces – to distribute up to 1000,000 laptops across all provinces.\n“This is how the revolution will come… This is the only way to make the nation progress,” the prime minister told the ceremony also attended by Sindh governor, chief minister, federal ministers, MQM leaders, provincial ministers, diplomats, and representatives of bankers.\nHe said youths from across the country needed to be equipped with education and provided maximum resources for country’s swift progress.\nMentioning the launch of the capital venture initiative for freelancers on Tuesday, he lauded the youngsters’ talent for developing the projects like converting banana peels into different products and drones for agricultural use.\nHe said it would be sheer injustice if the talented youths were not provided with the required resources as they were the guarantee for the country’s prosperity.\nHe said the incumbent government was in the process of distributing 100,000 laptops announced for the fiscal 2022-23 while the provision for another 100,000 laptops had been made in the budget 2023-24 which would be distributed purely on merit, without any nepotism.\nPrime Minister Shehbaz said the caretaker government should also ensure the merit in laptops’ distribution keeping the excellence and enrollment in public sector universities as the only merit.\nHe said through hand-holding, the talented youths could bring in billions of dollars to the country within a short span of time which other industries could not do.\nThe prime minister also thanked the commercial banks for distributing Rs30 billion among youth within a few months in the form of business loans.\nCalling the existing volume of loans insufficient, he called for formulating a policy to make it mandatory for the banks to extend loan facilities to youth, farmers, and small shopkeepers.\nHe said the previous government gave away $3 billion in loans to business tycoons without thinking of the youngsters.\nPrime Minister Shehbaz also called for national unity and concerted efforts to rid the country of poverty as a robust mechanism in the form of a Special Investment Facilitation Council had already been established with a view to putting the country on the course towards economic restructuring and reforms.\nHe said the country could never progress without curbing corruption, power, and gas theft.\nHe said the SIFC would take the country to the destination that the forefathers had dreamt of.\nThe prime minister appreciated the Sindh Chief Minister Syed Murad Ali Shah for carrying out youth welfare projects and Sindh Governor Kamran Tessori for arranging courses for the youngsters at the Governor House.\nHe also thanked Minister for IT and Telecommunications Syed Aminul Haq for his hard work in the ministry to move the projects forward as well as SAPM Shaza Fatima Khawaja.\nIn his address, Sindh Governor Kamran Tessori thanked the prime minister for focusing the uplift of youth being the country’s future.\nHe said during the 15-month government, the MQM decided to support the government despite knowing the severity of challenges but with a commitment that the people of Karachi would also be among the beneficiaries of the economic development, after the improvement of situation.\nHe said the youngsters lacked the resources to become a supporting hand for their parents who had spent their hard-earned money to educate them.\nHe said the Governor House had made arrangements within its vicinity for youngsters where they are being taught IT-related courses to enable them to earn sufficient money.\nChief Minister of Sindh Syed Murad Ali Shah said the Sindh government was also executing similar projects for youth’s welfare in the province.\nHe said 70pc of the beneficiaries of laptop and business loans were women as the provincial government strongly believed in women’s empowerment.\nHe told the gathering that through the public-private partnership, the provincial government would establish a Technology Park at NED University that would cost Rs 25 billion.",
  "retrievedAt": "2025-08-11T09:00:06.613Z"
}
