{
  "title": "Pakistan slams Indian defence minister’s provocative remarks",
  "link": "https://www.app.com.pk/national/pakistan-slams-indian-defence-ministers-provocative-remarks/",
  "date_published": "2023-07-26T18:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 26 (APP): Pakistan on Wednesday condemned the provocative remarks made by Indian Defence Minister Rajnath Singh, in Drass, Ladakh, boasting readiness to cross the Line of Control and reminded the Indian leadership that it was fully capable of defending against any aggression.\n“We counsel India to exercise utmost caution as its belligerent rhetoric is a threat to the regional peace and stability, and contributes to destabilizing the strategic environment in South Asia,” the Foreign Office Spokesperson said in a press statement.\nThis was not the first time that India’s political leaders and senior military officers had made highly irresponsible remarks about Azad Jammu and Kashmir and Gilgit-Baltistan.\n“This kind of jingoistic statements must stop. The Indian leadership is reminded that Pakistan is fully capable of defending itself against any aggression,” it was added.\nThe spokesperson further said that the practice of dragging Pakistan into India’s populist public discourse, with a view to stoking hyper-nationalism and reaping electoral gains, needed to end.\nEverything from history to law and from morality to the situation on the ground belied India’s claims about Jammu and Kashmir, which was an internationally-recognized disputed territory.\nThe relevant UN Security Council resolutions stipulated that the final disposition of the territory would be made in accordance with the will of the people expressed through the democratic method of a free and impartial plebiscite conducted under the auspices of the United Nations.\n“India would be well-advised to faithfully implement these resolutions, rather than entertaining any notions of grandeur,” the spokesperson further said.\nThe Indian media quoted Defence Minister Rajnath Singh as saying that if need arose, the Indian army would not hesitate to cross the Line of Control.\nNarendra Modi led government was very clear and gave free hand to its armed forces to launch operations across the border, he boasted on Wednesday during his visit to Ladakh.",
  "retrievedAt": "2025-08-11T08:59:50.345Z"
}
