{
  "title": "Pakistan to host D-8 Ministerial Meeting on Tourism Cooperation from Aug 4",
  "link": "https://www.app.com.pk/national/pakistan-to-host-d-8-ministerial-meeting-on-tourism-cooperation-from-aug-4/",
  "date_published": "2023-07-25T19:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP): Pakistan Tourism Development Corporation (PTDC) is organizing the 4th D-8 Senior Officials Meeting and 3rd D-8 Ministerial Meeting on Tourism Cooperation on August 4-5, 2023 at Bhurbhan, Murree.\nThe meeting being held for the first time in Pakistan will be followed by the technical visit to the Federal Capital – Islamabad on August 6, 2023.\nIt was decided in the 2nd D-8 Ministerial Meeting held in Malaysia 2019, that Pakistan will host the 3rd D-8 Ministerial Meeting preceded by the 4th D-8 Senior Officials meeting.\nThe meeting was postponed in 2021 due to the Covid-19 pandemic. Awn Chaudhry – Advisor to Prime Minister on Tourism & Sports/ Chairman PTDC called on the Secretary General of the D-8 secretariat in March 2023 and decided to organize the meeting later this year.\nAwn Chaudhry – Advisor to Prime Minister on Tourism & Sports/ Chairman PTDC in the Inter-ministerial meeting on the preparation and organization for the D-8 Ministerial Meeting in Pakistan expressed that, Pakistan is holding this meeting with the aim to promote Pakistan’s Tourism Potential and exploring tourism trade opportunities of Member State.\nThe meeting can also open new avenues of socio-economic development.\nThe objective of this meeting is to identify potential pathways (incentives and initiatives) to enhance intra-D-8 tourism in line with the objectives and goals of the D-8, to bring together tourism experts of member states to strengthen their capacities and develop effective strategies for post-COVID-19 tourism era, to provide a platform for member states to exchange knowledge and best practices to facilitate cooperation opportunities and to explore possibilities to promote bilateral tourism among the member states.\nThe D-8 Organization for economic cooperation is an inter-governmental organization that was established in 1997. It comprises eight developing countries, namely Bangladesh, Egypt, Indonesia, Iran, Malaysia, Nigeria, Pakistan, and Turkey.",
  "retrievedAt": "2025-08-11T09:00:08.739Z"
}
