{
  "title": "“Contempt of Parliament Bill” strengthens Parliament: Qasim Noon",
  "link": "https://www.app.com.pk/national/contempt-of-parliament-bill-strengthens-parliament-qasim-noor/",
  "date_published": "2023-07-26T10:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP): Member of Pakistan Tehreek-e-Insaf and Chairman of Privileges Committee Rana Muhammad Qasim Noon on Wednesday expressed gratitude to the Speaker of the National Assembly and the Chairman of the Senate for the unanimous passage of the “Contempt of the Parliament” bill.\nSpeaking during the joint session of the Parliament, he emphasized that this legislation was a crucial step in strengthening the Parliament and upholding its supremacy.\nNoon told the House that the bill would ensure the writ of Parliament. “Parliament has to be respected. The members were insulted inside and outside the House but now we will not accept insults from anyone,” he said.\nHe stressed that it was a historic moment in the parliamentary history of the country.\nThe MNA said, “This bill will ensure the supremacy of the Parliament- the mother of all institutions, it will also ensure the proper functioning of the standing committees and the role of parliamentary oversight more effective,”.\nMian Raza Rabbani, representing Pakistan People Party, raised the issue of Pakistan International Airlines employees’ salaries. He criticized the exclusion of the salary matter from the Board of Directors’ meeting, considering it unjustifiable.Rabbani called upon the federal government to take immediate notice of the situation and put pressure on the PIA management to address the salary issue.\nAdditionally, Senator Syed Muzafar Hussain Shah from Pakistan Muslim League Functional (PML-F) urged the government to ensure the support price of cotton.\nHe claimed that the government’s announced price had not been adequately implemented in the open market, affecting cotton growers.",
  "retrievedAt": "2025-08-11T09:00:02.893Z"
}
