{
  "title": "Govt making all-out efforts for country’s development",
  "link": "https://www.app.com.pk/national/govt-making-all-out-efforts-for-countrys-development/",
  "date_published": "2021-02-20T15:03:00.000Z",
  "source": "APP",
  "content": "ATTOCK, Feb 20 (APP):The government was making all-out efforts for country’s development and also uplifting living standard of the people. Special attention was being given to education, health and social welfare.\nMinister for Social Welfare & Baitul Mal (SW&BM) Syed Yawar Abbas Bukhari said this while addressing a press conference here on Saturday.\nHe said that ministry was launching a pilot project in Lahore and Attock to make the youth skilled and to give them job opportunities.\nThe minister said that in the next phase this project will be launched in all the districts of the Punjab. He said information technology projects will be launched in Attock and Jand to promote IT and to ensure online job opportunities.\nYawar said shelter homes were being run in different districts in a better manner and thousand of needy people were being benefitted.\nTalking about the development of Attock district, he said that mother and childcare hospital having capacity of 350 beds will be constructed in Attock at the cost of Rs seven billion while DHQ Hospital Attock will be upgraded.\nHe said that Punjab government under the leadership of Chief Minister Usman Buzdar has inducted 36000 doctors and paramedics while 18 new hospitals will be built in different districts of the province.\nHe said health cards was the revolutionary step of the incumbent government and soon this facility will be provided to 35 million families of Punjab. Bokhari said, a new chartered university will be set up in Attock for which all the formalities were being completed.\nYawar Bokhari said that Attock to Haji Shah , Salar to China Chowk , Kamra to Gondal and Attock to Bahtar roads will soon be built while Rs 180 million will be spent on provision of gas facility and to over come low gas pressure in different areas.\nReplying a question, he said that we must set aside our vested interests, shun nepotism and work for the development of the country.",
  "retrievedAt": "2025-08-11T20:23:22.668Z"
}
