{
  "title": "NEPRA providing enabling regulatory environment for clean energy goals: Tauseef Farooqi",
  "link": "https://www.app.com.pk/national/nepra-providing-enabling-regulatory-environment-for-clean-energy-goals-tauseef-farooqi/",
  "date_published": "2021-02-20T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP):Distributed generation through net-metering is one of the most effective tools to enable renewable power generation at the grass-root level and is one of the key focus areas of NEPRA for meeting increased electricity demands sustainably.\nThis was stated by Chairman National Electric Regulatory Authority (NEPRA) while addressing launching of a research report by Institute of Policy Studies (IPS) titled ‘Barriers and Drivers of Solar Prosumage: A Case Study of Pakistan’ at NEPRA Headquarters, said a press release issued here Saturday.\nThe event – jointly hosted by NEPRA and IPS – was chaired by Chairman NEPRA Tauseef Farooqi, co-chaired by Chairman IPS Khalid Rahman, and addressed as panelists by Dr. Sardar Mohazzam, Managing Director, National Energy Efficiency & Conservation Authority (NEECA), Engr. Bahadur Shah, Member (M&E), NEPRA, Mirza Hamid Hasan, Chairman – IPS’ Steering Committee on Energy, Water & Climate Change, and Dr Gulfaraz Ahmed, former Federal Secretary, Petroleum and Natural Resources and founding Chairman of NEPRA.\nFarooqi, in his keynote speech, commended the IPS’ study for highlighting the barriers faced by consumers in processing their applications for net-metering and providing information about the responses of DISCOs and their overall performance in processing the net-metering applications.\nBeing an electricity regulator, NEPRA is paving the way for clean energy and establishing a liberalized power market for its consumers, Farooqi declared.\nHe further said that NEPRA envisions greening the power sector by promoting renewable power generation according to the government’s goals and objectives.\nHe regarded net-metering as one of the most effective instruments that has triggered the renewable power market development – particularly for the Solar PV market at the grass-root level.\nDistributed generation remains to be a key focus area for NEPRA to satisfy the ever-increasing electricity demand, he added.\nWith more than 120 MW installed capacity of solar prosumage so far, he said, the consumers are already being provided with an opportunity to become the producers of electricity themselves.\nChairman NEPRA also said that the regulator would look into and try to benefit from the recommendations provided in the study while continuing its efforts to improve the regulatory environment for the promotion of net-metering in Pakistan.\nA detailed presentation on the study was earlier delivered by IPS’ researchers, Ms. Naila Saleh and Hamza Naeem. It was followed by an expert panel discussion in which the panelists appreciated that the research work by IPS which had come a long way with a healthy participation from government and non-government sectors, solar vendors, service providing companies, private companies, academic and research institutions, international agencies, and financial\ninstitutions, such as Ministry of Energy (Power Division), National Electric Power Regulatory Authority (NEPRA), Alternative Energy Development Board (AEDB), Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ Pakistan), and several commercial banks.\nThe panelists highlighted the importance of promoting clean energy through cheap renewable energy resources, while emphasizing the need of increased use of solar power to curb the problems in the energy sector of Pakistan.\nThe experts also assessed barriers hindering the solar energy uptake in the country, whereas a consent was developed to cater these barriers through mutual efforts, as well as to promote renewable energy targets set in Alternative and Renewable Energy Policy (2019) by the Government of Pakistan.",
  "retrievedAt": "2025-08-11T20:23:15.567Z"
}
