{
  "title": "Dr. Nishtar oversees mobile wallet testing in the field to introduce cashless banking for the vulnerable",
  "link": "https://www.app.com.pk/national/dr-nishtar-oversees-mobile-wallet-testing-in-the-field-to-introduce-cashless-banking-for-the-vulnerable/",
  "date_published": "2020-08-27T05:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): Special Assistant to Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar along with Secretary Yousaf Khan and other Ehsaas officials Thursday visited Islamabad Model College for Girls, Tarlai to field test the innovative proposition of opening mobile wallets for Ehsaas beneficiaries.\nImplementation of this special purpose proposition is in its testing stages.\nThe test demonstration took place with Ehsaas beneficiaries at the Ehsaas Emergency Cash campsite in collaboration with partnering banks of Ehsaas- HBL and Bank AlFalah.\n“Through this innovative cash withdrawal facility, beneficiaries of Ehsaas Kafaalat will be able to open mobile wallets that will serve as fully functional branch less banking accounts”, said Dr. Nishtar while briefing media.\n“This in turn will pave the way for deepening of the digital financial ecosystem through improved service offerings for saving, borrowing, and risk mitigation.” She continued.\nThe idea of mobile money accounts is linked to the Ehsaas Kafalat program for financial deepening under ‘One Woman One Bank Account Policy’.\nEhsaas Kafaalat is the government’s safety net Programme through which it gives cash stipends to seven million most deserving and poorest women all over the country.\nThe mobile wallets will offer the option to Ehsaas beneficiaries to subsequently transfer funds from designated limited mandate accounts to their mobile wallet for further utilization.\nThis model will include a full-scale cashless and branch less banking saving accounts for beneficiaries, with the aim of being responsive to the needs of the beneficiaries.\nTo achieve this goal, Ehsaas will chalk out awareness and communications plan to increase the financial capability and literacy, amongst the vulnerable population.\nDuring the visit, the Dr. Nishtar took round of the Ehsaas campsite and met with the partnering banks’ agents and Ehsaas Emergency Cash beneficiaries present there to gauge the quality of ongoing disbursal arrangements.\nShe also listened to their concerns and gave on spot instructions to Ehsaas officials to facilitate them for easy cash transfers.\nFollowing the closure of Ehsaas Emergency Cash, registration desks will be re-opened nationwide in 15 districts and in 60 districts after September 15, 2020 so that no deserving person is left out from the Ehsaas programme.\nDr. Nishtar announced that those people who could not apply for Ehsaas Emergency Cash would be able to benefit from other Ehsaas programs as per the rule-based procedures through Ehsaas self-registration drive.\nGiven the closure of Ehsaas Emergency Cash payments on August 31, 2020, Dr. Sania Nishtar reaches out to the wider national audience every morning this week through national hook up radio program, Raabta.\nShe listened to the queries of Ehsaas Emergency Cash beneficiaries from far flung areas of the country and educates them about the supplementary measures being taken under Ehsaas to expedite payments in the field.",
  "retrievedAt": "2025-08-11T19:43:28.395Z"
}
