{
  "title": "PM directs finalizing proposal of setting up IT Clusters in major cities",
  "link": "https://www.app.com.pk/national/pm-directs-finalizing-proposal-of-setting-up-it-clusters-in-major-cities/",
  "date_published": "2020-08-27T17:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): Prime Minister Imran Khan on Thursday terming development of Information Technology sector a top priority of his government directed finalization of a proposal on setting up IT Clusters in major cities of the country.\nHe stated this while chairing a meeting on the promotion of information technology in the country, which was attended by Minister for Information Technology Syed Amin ul Haq, Minister for Information Senator Shibli Faraz, Minister for Industries Muhammad Hammad Azhar, Advisers Dr Abdul Hafeez Sheikh, Dr Ishrat Hussain, Abdul Razzak Dawood, Special Assistant Dr Shahbaz Gill, federal secretaries, Chairman FBR, Governor State Bank of Pakistan (SBP) and representatives of various companies belonging to the IT sector.\nThe prime minister was given a detailed briefing on the role of the IT sector in national economy, exports and the obstacles facing the development of the sector.\nThe prime minister directed the Chairman Federal Board of Revenue to review the problems related to tax faced by the companies in the IT sector on priority basis.\nHe said youth of the country had immense potential in the field of IT and the development of this sector would not only help the youth to utilize their potential and create job opportunities but also increase the country’s exports.\nThe meeting was informed that in the light of the directives of the present government, the compensation limit for freelancers by the SBP has been increased from $5,000 to $25,000 per month.\nThe Ministry of Information Technology has developed an integrated system of liaison with industry and stakeholders. The Right of Way policy is in the final stages and will soon be submitted to the Cabinet for approval.\nThe prime minister was informed that during financial year 2019-20, the exports of IT services were recorded at $1.23 billion as against $995 million earlier, making an increase of 23.7 percent.\nThe prime minister was informed that the Ministry had set a target of $5 billion for the IT sector for next three years.\nThe meeting was informed that work was underway on proposals to reduce taxes in IT sector and steps were being taken to promote the sector with support of Pakistani embassies.\nThe prime minister was informed that a Skill Training Program for Youth IT had been launched keeping in view the needs of the market. A portal has been set up for effective linkages between educational institutions, the industrial sector and government agencies.\nUnder the Digital Skills Training Program, 1.2 million youth have been given training.\nThe IT Export Award was organized to encourage people associated with the sector. Also, an IT park has been set up in Islamabad while a plan to set up another one in Karachi is in the process of approval.\nThe meeting was informed that 159 startups from five National Incubation Centers have completed their training.\nThe representatives of various IT companies presented suggestions for the development of the sector.",
  "retrievedAt": "2025-08-11T19:43:22.650Z"
}
