{
  "title": "Educational institutions to be opened top to bottom: NCOC",
  "link": "https://www.app.com.pk/national/educational-institutions-to-be-opened-top-to-bottom-ncoc/",
  "date_published": "2020-08-27T03:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): The National Command and Operation Center (NCOC) on Thursday said the educational institutions should be opened with top to bottom approach starting from universities, colleges and high schools.\nThe NCOC morning session held with a single point agenda of opening of educational institutions across Pakistan.\nThe representatives of educational institutions including pubilc, private and madaris were invited at NCOC morning session for taking all stakeholders on board, consultations and consensus based decisions for opening of various institutions from University to school levels.\nAll provincial including Azad Jammu and Kashmir (AJK) and Gilgit Baltistan (GB) focal representatives joined the meeting through video link.\nNCOC apprised the participants about present Covid situation at global, regional and Pakistan’s own COVID curve. Participants were informed about risk and challenges involved after opening of educational institutions as it involved children of all ages.\nThe participants were informed that these challenges were mapped after hectic and lengthy consultations with international experts, academia and Think Tanks particularly who were working on educational sector opening.\nSpeaking on the occasion, Federal Minister for Education and Professional Training Shafqat Mehmood said there were two basic challenges to open educational institutions in two areas including what were indicators for opening and what measures were taken to ensure health guidelines ensuring use of face mask, social distancing and hygiene measures.\nShafqat Mehmood said that final decision would be taken on 7th September after consensus and input from all stake holders.\nNCOC suggested strategy to participants about graduating opening of educational institutions basing on best practices and input from various experts.\nThe Forum proposed that educational institutions be opened on Top to bottom approach (University, College, High Schools etc) on rotation basis. Timings of various institutions be staggered with suspending various activities which involve contraction and mass gatherings including co – curricular activities, it added.\n“Educational institutions must ensure all Covid protocols and prepare accordingly before final decision.” NCOC apprised the participants that tracking, tracing and testing would help arrest any spread.For this enhance testing of symptomatic children, teachers and school staff would be very beneficial. All provinces, AJK and GB apprised the NCOC forum about measures being taken including consultations with various educational institutions in their respective areas including teachers training and Covid awareness.\nSpecial Assistant to the Prime Minister (SAPM) on Health Dr Faisal Sultan told the participants that while the eventual opening would be undertaken a consensus process, NCOC and Ministry of Health (MoH) would intimately monitor the disease statistics on daily basis, particularly to assess the likely impact of tourism and Muharram on the opening of educational institutions.\nDr Faisal said that an IT based monitoring mechanism be developed to ensure health guidelines and Covid containment measures.\nRepresentatives from various institutions thanked NCOC for inviting and consultative process. The representatives gave their detailed input on school opening measures and assured the forum about compliance of health guidelines particularly wearing of face mask, social distancing and hand washing protocols.",
  "retrievedAt": "2025-08-11T19:43:38.652Z"
}
