{
  "title": "NHA to become self-sufficient through austerity,transparency, automation",
  "link": "https://www.app.com.pk/national/nha-to-become-self-sufficient-through-austeritytransparency-automation/",
  "date_published": "2020-08-27T04:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): During the past two years, the management of National Highway Authority ( NHA) took several steps to bring transparency in the institution and to make it self-sufficient as per the vision of Prime Minister Imran Khan.\nAn official of National Highway Authority(NHA) told APP on Thursday that the organization was on the path of becoming a self-sufficient organization due to austerity, transparency, good governance and introduction of the latest technology during the Pakistan Tehreek-e-Insaf government.\nHe said that on the one hand the NHA saved substantial funds through the introduction of austerity measures and on the other hand its revenue has registered a significant increase.\nHe said that due to policies of the present government, revenue of the NHA increased from Rs.33.011 billion in 2018-19 to Rs.50.068 billion in the year 2019-20.\nTotal revenue earned by NHA during 2 years tenure of the present government was Rs. 83.079 billion.\nHe said NHA also made recoveries worth Rs 11.90 billion and after audit of various projects and saved Rs 3 billion in ongoing projects completion.\nHe added that for the first time in the history of NHA,the landmark geographic information System survey (GIS) was introduced and development of Geo database of its entire network located throughout the country was being done.\nHe said that the revenue of NHA also considerably increased with the help of Geographic Information System mapping process launched last year.\nThe project, he said,when completed would enable NHA to digitize the complete information regarding utilities and commercial amenities in the Right of Way (ROW)\nof the NHA network.\nHe said that after completion of the entire GIS mapping, a substantial increase in the NHA revenue is expected adding It would also bring transparency in the NHA revenue collection.\nThe official said that for ensuring transparency, e-tendering and e-billing and -e-procurement process were being launched.\nHe said that an e-billing system would save cost and time, increase efficiency,effectiveness and improve managerial control.\nHe said that the e-billing system was part of the Prime Minister’s vision for ending corruption, improving transparency and providing good governance.\nHe said that with the launch of NHA mobile application and now e-billing system, the NHA has opened all its record for the public and media.\nHe said that NHA mobile app was launched to provide necessary information particularly the projects implementation, execution, and progress in their desired region.\nThe primary objective launching this system containing facilities such as e-billing, e-tendering, and mobile app has been introduced in the ministry to enhance transparency.\nHe said as per the vision of the present government,after five years,the NHA would be able to build highways and motorways with its resources and Public Private Partnership mode without burdening the national exchequer.\nThe NHA, he said during the past one year successfully attracted private sector investment and has awarded projects worth over Rs 144 billion.\nBesides other benefits, the expected revenue earnings from these projects would be over Rs 391 billion, he said.\nThe NHA official said the modern concept of infrastructure development, Public Private Partnership (PPP) had become a popular mode of road construction also known as Build-Operate-Transfer (BOT) model in which the private sector builds a project and operate a facility for an agreed period of time ranging from 20 to 30 years.\nHe said that About 136 km Super Highway was a major NHA project converted to Karachi-Hyderabad Motorway on BOT basis.\nRecently opened for traffic 91 km Sialkot-Lahore Motorway was also built on the BOT model.\nAmong the upcoming PPP big projects of the NHA included Hyderabad-Sukkur Motorway. He said the ECNEC had given go-ahead to the construction of 306km-long Motorway at a cost of Rs 165.679 billion.\nThe Motorway, envisages construction of 6-lane wide,access-controlled motorway which will start from Hyderabad and terminate at Naro Canal Sukkur.\nHe said that NHA has also planned to build Sialkot-Kharian and Kharian Rawalpindi Motorways on BOT basis.\nSimilarly Balkasar-Mianwali road and Mianwali-Muzafargarh Road would be dualized under the PPP model, he said.\nHe said Multan-Muzaffargarh-D.G. Khan road was also being planned to be built on the PPP-BOT model.\nHe said NHA on the directives of Minister for Communications Murad Saeed launched an anti-encroachment drive on its Right of Way and successfully recaptured the encroached land.",
  "retrievedAt": "2025-08-11T19:43:38.652Z"
}
