{
  "title": "IPU president calls on governor",
  "link": "https://www.app.com.pk/national/ipu-president-calls-on-governor/",
  "date_published": "2020-08-27T05:26:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 27 (APP): Inter Parliamentary Union (IPU) President Gabriela Cuevas Barron called on Govenror Punjab Chaudhry Muhammad Sarwar and discussed democracy, governance and cooperation during a meeting at the Governor’s House on Wednesday night.\nGovernor Chaudhry Muhammad Sarwar also took up Kashmir issue, challenges faced in\nthe face of novel coronavirus (Covid-19) pandemic besides matters of mutual interest\nwith the visiting presidnet of the IPU.\nThe govenror urged the international community and the IPU to take notice of human rights violation by the Indian forces in the Illegally Occupied Indian Jammu and Kashmir, adding that Bharat had shamelessly persisted with human rights violation for the past seven decades.\nHe said the hapless Kashmiri Muslim were faced with the blight of lockdown long before the\nadvent of novel coronavirus (Covid-19) pandemic. Sarwar said Pakistan had been playing\na responsible role for durable peace in the region.\nThe governor said that parliamentary diplomacy had a huge role in promoting peace, prosperity, and development, adding that the PTI government, under the leadership of Prime Minister Imran Khan, was taking practical steps for strengthening parliament and other institutions.\nThe governor Punjab apprised Ms Gabriela about the Punjab government’s initiatives to\ncontain spread of novel coronavirus and provide relief to the distressed families\naffected by COVID19 beisdes ensuring provision of safety equipments to the healthcare\nworkers in the province.\nGabriela Barron lauded Sarwar’s philanthropic efforts during the pandemic, and said that\nsmart lockdown policy of the government helped fight the deadly virus in a better way.\nThe IPU president said Pakistan government’s measures to contain novel coronavirus pandemic were exemplary.\nShe said the cooperation between the parliament and the IPU on human rights would be\nstrengthened, adding that strong ties existed between the two institutions.\nPresident IPU Gabriela Cuevas Barron said the world could overcome problems through mutual cooperation and shared strategies, adding that countries of the world will have to be united in the fight against coronavirus.",
  "retrievedAt": "2025-08-11T19:43:29.433Z"
}
