{
  "title": "Armed forces, nation aware of digital terrorism by enemies, united in defeating notorious designs",
  "link": "https://www.app.com.pk/national/armed-forces-nation-aware-of-digital-terrorism-by-enemies-united-in-defeating-notorious-designs/",
  "date_published": "2024-07-05T18:27:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 05 (APP): The 265th Corps Commanders’ Conference (CCC) on Friday underscored that the onslaught of politically motivated digital terrorism, unleashed by conspirators, duly abetted by their foreign cohorts against state institutions was meant to induce despondency in the nation and sow discord through peddling of blatant lies, fake news and propaganda.\nThe armed forces along with the nation were, however, fully aware of all such machinations and stood united and committed in defeating the notorious designs of the enemies of Pakistan, it said.\nChief of Army Staff (COAS) General Syed Asim Munir presided over the CCC) here at the General Headquarters, an Inter Services Public Relations (ISPR) news release said.\nThe forum paid rich tribute to the supreme sacrifices of, Shuhada (martyrs) of the armed forces, law enforcement agencies and the citizens who had laid their lives for peace and stability in the country.\nThe conference undertook a comprehensive review of internal and external security situation of the country and had a detailed discussion on various aspects of the operation “Azm-e-Istehkam”, which was aimed at harnessing the national counter terrorism efforts in a synchronised manner to dismantle the nexus of terrorism and illegal spectrum for enduring stability and economic prosperity.\nThe forum noted with concern the unwarranted criticism by some quarters and deliberate misrepresentation of the vision, only for furthering their vested interests.\nIt also deliberated upon regional security situation, especially Afghanistan and reaffirmed its commitment to regional peace and security.\nThe forum expressed solidarity with the people of Kashmir and Palestine, and condemned serious human rights violations, war crimes and genocide being perpetrated in Kashmir and Gaza.\nIt affirmed that the military leadership was cognizant of the full spectrum of the challenges and resolved to shoulder its constitutionally mandated responsibilities with support of the resilient people of Pakistan.\nThe forum reiterated to continue full support of ongoing efforts in uplifting the socioeconomic growth and wholeheartedly assisting the government in curbing all illegal activities which hamper investors’ confidence, economic stability and growth.\nExpressing full satisfaction on the Pakistan Army’s commitment to national security, the COAS stressed upon maintaining high standards of professionalism and operational preparedness.\nThe Pakistan Army had always been fully prepared to thwart all internal and external challenges and play its due role in the stability and prosperity of Pakistan, regardless of the challenges posed, he added.",
  "retrievedAt": "2025-08-11T03:42:35.746Z"
}
