{
  "title": "Chairman Senate Yousaf Raza Gillani pays homage to Z.A Bhutto Shaheed",
  "link": "https://www.app.com.pk/national/chairman-senate-yousaf-raza-gillani-pays-homage-to-z-a-bhutto-shaheed/",
  "date_published": "2024-07-05T12:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP): Chairman Senate Syed Yousaf Raza Gillani on Friday paid homage to former Prime Minister Zulfiqar Ali Bhutto Shaheed with regard to July 5th when his government as toppled.\nAddressing the House, the Chairman said that the Pakistan’s constitution of 1973 was initially unicameral due to which the sense of deprivation was prevailing amongst the provinces and most the east Pakistan was being deprived.\nLatter Bicameral system was introduced in the Constitution due to which the House of federation came into existence, said the Chairman adding that all provinces had equal representation in the House of federation.\nHe said, all political parties signed Charter of Democracy (COD) in 2008 and agreed to restore the Constitution of 1973 in its original form.\n“I give the credit to all political forces of the country who restored the Constitution in its original form” said the Chairman Senate adding that today’s democracy in the country was because of the COD.\nEarlier, Senator Zameer Hussain Ghumro said that the legitimate government of Zulfiqar Ali Bhutto was toppled on July 5th, 1977 and the Constitution was abrogated.\nHe said the Supreme Court of Pakistan in its recent judgment, has declared Zulfiqar Ali Bhutto’s murder was a judicial killing. 5th July 1977 will always be remembered as the Black Day in the political history of Pakistan, he added.\nSenator Poonjo Bhel said that today was the Black Day but the country’s strength was hidden in the democratic process which should not be derailed at any cost.\nSenator Saifullah Abro said that the House should pass a resolution of condemnation against the dictator of that time who toppled the government of Zulfiqar Ali Bhutto.\nHe said that the judiciary’s role in the judicial murder of Zulfiqar Ali Bhutto must be condemned and those involved in his murder should be hanged at D-Chowk if alive and if died their coffins should be hanged at D-Chowk.\nSenator Syed Masroor Ahsan said that all political parties should learn from the horrific incidents of July 5th 1977 and should work together for the betterment of the country.",
  "retrievedAt": "2025-08-11T03:43:03.579Z"
}
