{
  "title": "Digitisation of taxation system govt priority to prevent evasion of billions: PM",
  "link": "https://www.app.com.pk/national/digitisation-of-taxation-system-govt-priority-to-prevent-evasion-of-billions-pm/",
  "date_published": "2024-07-05T11:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP): Prime Minister Shehbaz Sharif on Friday calling the digitisation of taxation system government’s priority to prevent tax evasion worth billions of rupees, directed the authorities concerned to immediately create a dashboard to monitor the ongoing digitisation and implementation of the reforms.\nThe prime minister, chairing a meeting to review the reforms process of the Federal Board of Revenue (FBR), instructed to bring the taxable non-filers into the tax net and revoke the discretionary powers of the customs appraisers, and sought an implementation report from FBR chairman within 24 hours.\nDuring the briefing on FBR’s digitisation, the meeting was told that during the FBR digitisation, 4.5 million taxable individuals have been identified who were not part of the tax net.\nIt was told that consequent to the government’s measures, over 300,000 more individuals have filed their tax returns within few week.\nBesides, the refunds of 4,000 companies have been stopped during last two weeks, following the detection of under-invoicing and forged sales tax refunds.\nThe prime minister said that the tax evaders as well as the officers and staffers facilitating them would be punished and vowed not to spare those plundering the public kitty. Besides, the taxpayers fulfilling their responsibility timely would be acknowledged too, he added.\nPrime Minister Shehbaz said that state-of-the-art scanners would be installed at the seaports to ensure transparency and prevent corruption in the system. He also sought a comprehensive report on the magnitude of tax evasion and the measures for its prevention.\nHe vowed to introduce a taxation system of international standard in the country and called for engaging well reputed professionals and experts for formulation of tax policy.\nThe prime minister sought a comprehensive strategy on FBR’s digitisation and reforms and the set targets in the next meeting.\nFederal ministers Muhammad Aurangzeb and Ahad Khan Cheema, Minister of State Ali Pervaiz Malik, PM’s Coordinator Rana Ehsan Afzal, FBR Chairman, CEO of Pakistan Business Council Ehsan Malik, CEO of Karandaz Waqasul Hassan and relevant senior officer attended the meeting. Dr Shamshad Akhtar, Naveed Andrabi, Asif Pir and Ali Malik joined the meeting via video link.",
  "retrievedAt": "2025-08-11T03:43:05.105Z"
}
