{
  "title": "NA body proposes to elevate nation’s healthcare system",
  "link": "https://www.app.com.pk/national/na-body-proposes-to-elevate-nations-healthcare-system/",
  "date_published": "2024-07-05T13:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 5 (APP):The National Assembly Standing Committee on National Health Services, Regulations and Coordination on Friday proposed strategic moves to elevate the nation’s healthcare system.\nWith a comprehensive agenda featuring transformative initiatives and critical assessments, the Committee underscored a renewed commitment for building a healthier future to all citizens, said a press release.\nThe second meeting of the Standing Committee was held under the Chairmanship of Dr Mahesh Kumar Malani, MNA. The Secretary, Ministry of National Health Services, Regulations and Coordination provided a comprehensive overview of its functions and the attached departments.\nBoth the Standing Committee and the Ministry acknowledged the critical role the committee plays in enhancing national health services and emphasized on mutual cooperation.\nDuring the briefing, the Ministry highlighted several ongoing and new initiatives aimed at improving health services across the country. Recognizing the federal roles in health, which are distributed across various divisions, the Ministry stressed the necessity of a state-level response to meet international health commitments.\nThe Committee took serious notice of lack of human resources, the absence of doctors during duty hours and the shortage of medical equipment in the government hospitals. Recommending equitable access to healthcare for all citizens, the Committee also pointed out gaps and substandard conditions within the healthcare sector.\nThe Committee expressed its concerns over the discrepancies in the performance of Pakistan Nursing Council, urging immediate improvements. The Committee also suggested integrating sensitization and awareness programs into the national educational curriculum. This initiative aims to inform the younger generation about disease prevention early on and to promote a healthier future. The Committee proposed establishing a robust health data management system to enhance monitoring and resource allocation.\nThe meeting was attended by MNAs, Raja Khurram Shahzad Nawaz, Ms. Zahra Wadood Fatemi, Ms. Farah Naz Akbar, Dr. Shaista Khan, Dr. Darshan, Dr. Shazia Sobia Aslam Soomro, Ms. Sabheen Ghoury, Gul Asghar Khan, Ms. Farukh Khan, Dr. Amjad Ali Khan, Shahram Khan, M. Shabbir Ali Qureshi and Ms. Aliya Kamran.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:43:20.793Z"
}
