{
  "title": "PIC orders HEC to finalize actions on scholarship misuse",
  "link": "https://www.app.com.pk/national/pic-orders-hec-to-finalize-actions-on-scholarship-misuse/",
  "date_published": "2024-07-05T17:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP):The Pakistan Information Commission (PIC) has ordered the Higher Education Commission (HEC) to expedite and finalize actions against the misuse of scholarships and the breach of public trust.\nThe order comes in response to an appeal filed by citizen Azmat Khan, highlighting the need for immediate governance measures.\nThe appellant has sought list of scholars who went abroad on HEC scholarships over the past decade. Specifically, the list should include details of scholars from 01-01-2013 to 31-12-2023, distinguishing between those pursuing M.Phil and PhD programs.\nAdditionally, the list should identify students who did not return or complete their study programs within the stipulated time period and detail the actions taken against them by the HEC.\nIn its response to the appeal, HEC cited Section 7(g) of the Right of Access to Information (RTI) Act, 2017, asserting that the sought information is exempt from disclosure as it could potentially lead to the harassment of individuals, particularly female scholars. Instead, HEC provided cumulative statistics for the period from January 1, 2013, to December 31, 2023.\nAccording to these statistics, a total of 3,001 scholars proceeded abroad on HEC scholarships. Out of these, 1,126 scholars successfully completed their studies, while 1,810 are still pursuing their education. However, 65 scholars completed/did not complete their studies and did not return to Pakistan after completing their programs.\nHEC in its response has expressed strong concerns regarding the scholars who either did not complete their degree programs or did not return, stating that legal proceedings have been initiated against them. Efforts to recover government funds are ongoing, with substantial recoveries already made.\nIn its order, the Pakistan Information Commission emphasized the importance of addressing the breach of trust and unfair utilization of public funds. The PIC highlighted that while HEC has reported ongoing actions, a specific timeline for these actions is necessary. The Chairman of HEC has been directed to finalize these actions and submit a comprehensive report to the Pakistan Information Commission.\nThis directive underscores the commitment of the Pakistan Information Commission to uphold the principles of transparency, accountability, and good governance as laid down in the preamble of the Right of Access to Information Act, 2017.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:42:57.574Z"
}
