{
  "title": "Naqvi takes decisions to transform Islamabad into a World-Class City",
  "link": "https://www.app.com.pk/national/naqvi-takes-decisions-to-transform-islamabad-into-a-world-class-city/",
  "date_published": "2024-07-05T08:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP):Federal Minister for Interior, Mohsin Naqvi has made key decisions to transform Islamabad into a world-class city while chairing an important meeting at the Capital Development Authority (CDA) headquarters on Friday.\nOn the Minister’s directives, CDA will now only purchase electric motorbikes in future to reduce environmental pollution. Additionally, eco-friendly electric buses will be introduced for the citizens of Islamabad.\nThe Interior Minister has also imposed a ban on the purchase of conventional motorcycles.\nInternational standard emergency services will be provided to the citizens of Islamabad and the administration of emergency services will be transferred from MCI to CDA.\nMoreover, the establishment of Capital Waste Management Company will also be expedited. Furthermore, the matters related to the establishment of Capital Waste Management Company will also be finalized soon.\nThe Interior Minister said that work on the Serena Chowk Underpass and F-9 Park Chowk Flyover projects will begin soon to alleviate traffic congestion issues in Islamabad. He added that the long-delayed Expressway project will be completed on a priority basis. He stated that development work in the non-developed sectors of Islamabad will also be completed, and possession will be handed over to the allottees.\nHe highlighted that work on the Islamabad Model Jail, which has been stalled for 17 years, is progressing rapidly, and the first phase will be completed within the stipulated time.\nThe Interior Minister said that Business Facilitation Centers are being established in Islamabad, where investors will be provided with all facilities under one roof.\nLand has also been allocated for the Health Tower in Sector H-16. The Interior Minister congratulated CDA team, including Chairman CDA, on achieving record tax collection but warned that no organization can run solely on plot and land sales; therefore it is essential to develop the assets of the organization.\nIn this regard, the Interior Minister directed that an investment plan be prepared and presented within seven days.\nThe meeting also reviewed the progress on various ongoing development projects, including the Kuri Enclave, renovation of Federal Secretariat building, Diplomatic Enclave, and Smart Parking projects.\nChairman CDA, Muhammad Ali Randhawa, briefed the Federal Minister for Interior on various projects. The meeting was attended by Chairman CDA, Muhammad Ali Randhawa, Deputy Commissioner Islamabad, Irfan Memon, and all members of CDA.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:43:50.334Z"
}
