{
  "article_id": "2025-01-16_d510060ecae0a1411250a803352eafcb",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885510/ihc-summons-top-officials-in-blasphemy-cases",
    "retrieved_at": "2025-10-12T00:52:37.106Z"
  },
  "metadata": {
    "title": "IHC summons top officials in blasphemy cases - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-16T02:01:35.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 345,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: The Islamabad High Court (IHC) on Wednesday expressed displeasure over the government's \"delayed and incomplete\" response to the alleged fabricated evidence in blasphemy cases, a matter that impacts hundreds of lives. Justice Sardar Ejaz Ishaq Khan summoned the cabinet secretary, secretary to the ministry of human rights, director general of FIA, interior secretary, chairperson of the National Commission on Human Rights, and the director general of IB to appear before the court on Jan 17, at 10am. The stern order follows a lack of clarity and proactivity from the respondents, despite the passage of nearly three months since the initial directive was issued on Sept 13, 2024. The interior ministry failed to provide a definitive statement regarding the receipt of an application for constituting a commission of inquiry. Court unhappy over govt's 'delayed, incomplete' response The Federal Investigation Agency (FIA) also did not adequately say whether the evidence in question might have been fabricated or planted. \"The incomplete response from the government leads much to be desired,\" the order noted. The court underscored the gravity of the situation, emphasising the need for an urgent and thorough investigation given the potential impact on countless young lives. In addition to summoning senior officials, the court issued notices to the additional attorney general for assistance in the matter. A January 2024 report issued by the Special Branch of Punjab Police was highlighted as a key document in the petition, prompting the court to issue a notice to the inspector general of police, Punjab. The IG was directed to ensure that a knowledgeable officer attends the next hearing. In September last year, the IHC expressed concern over allegations of a deliberate plot to entrap young men and women in false blasphemy cases for blackmail. The petition, supported by the Special Branch's report, revealed a disturbing pattern of abuse that demands urgent attention. According to the counsel for the petitioner, Usman Warriach, the report outlines how individuals were deliberately targeted, entrapped, and falsely accused of blasphemy as part of an organised blackmailing effort. Published in Dawn, January 16th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}