{
  "article_id": "2025-01-16_f8bf9b8ce33e9ecfcd1db14e78dd3a96",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885654/suzuki-motor-president-says-india-to-be-global-production-hub-for-evs",
    "retrieved_at": "2025-08-26T07:43:36.907Z"
  },
  "metadata": {
    "title": "Suzuki Motor president says India to be global production hub for EVs - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-16T12:52:54.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/1617480959b94a3.jpg",
    "categories": [],
    "word_count": 386,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "India will be the global production hub for Suzuki Motor's electric cars and it plans to export the vehicles back to Japan as well as other markets, such as Europe, despite a slowdown in sales of EVs, the carmaker's chief said on Thursday. India is the biggest market by sales and revenue for Suzuki Motor, present there through its majority stake in market leader Maruti Suzuki. On Friday, Maruti will launch its first EV in India - the e Vitara mid-sized SUV - which will be exported globally and also supplied to Suzuki's partner Toyota Motor Corp. \"For Suzuki, the scale merit in India is our strength, and we will fully leverage this advantage to supply high-quality and appealing products across various markets such as Europe, Japan, Middle East, Africa, Central and South America,\" Suzuki Motor President Toshihiro Suzuki told reporters in New Delhi. \"Globally, the EV market is sluggish but I think in India there is a potential that EV sales are going to grow,\" he said. EV sales growth in India slowed to 20 per cent last year from about 115pc in 2023, but it still outpaced overall car market growth of 4pc and the government has an ambitious target of boosting their market share to 30pc by 2030 from about 2.5pc of 4.3 million cars sold last year. Suzuki has responded to concerns over the range of vehicles and the charging network by rolling out chargers at its service centres and will expand into small EVs once it has perfected the technology and manufacturing, the carmaker's chief said. It will also develop other green technologies, such as hybrids, gas and hydrogen, Suzuki said. Suzuki Motor plans to invest more than $4 billion in India to double car production capacity to 4 million units a year by 2031, launch new models and defend its market share. Maruti has long-dominated India's car market with its small, affordable vehicles but its share has shrunk to about 40pc today from a high of over 50pc in 2020 as competitors, such as Hyundai Motor and Tata Motors brought feature-rich, premium SUVs to the market. \"India has become the third-largest auto market hence it is the focus of the entire world,\" Suzuki said. He said Maruti aimed to reclaim its 50pc share but did not give a time frame.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}