{
  "article_id": "2025-01-16_c3180bbd7df5386437d7e59796448171",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885638/met-army-chief-with-gandapur-all-demands-presented-pti-chairman-gohar",
    "retrieved_at": "2025-08-26T07:43:41.554Z"
  },
  "metadata": {
    "title": "Met army chief with Gandapur, all demands presented: PTI Chairman Gohar - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-16T09:36:16.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/16151011465797f.png",
    "categories": [],
    "word_count": 835,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "PTI Chairman Barrister Gohar Ali Khan said on Thursday that he and Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur held a meeting with Chief of Army Staff (COAS) General Asim Munir. \"If talks have begun, it's a welcoming gesture,\" Barrister Gohar said while speaking outside Adiala Jail. \"All demands have been presented.\" He said that the talks took place in Peshawar during the army chief's recent visit there. \"Direct talks with the establishment are welcome,\" he said. \"There is a positive development from the other side.\" PTI leader Asad Qaiser also told Dawn.com that the development took place. Talking about his participation in Monday's talks between the army chief and provincial politicians in Peshawar, Barrister Gohar said that any meetings he had were with PTI founder Imran Khan's permission and instructions. He said he met Imran today and briefed him in detail about the Monday talks. \"I never the disclose the purpose for whatever thing I'm going until I have Khan sahib's specific permission,\" Gohar added. \"Imran said the meeting was positive and better for the country's stability and that there should be talks and solutions to issues should be found through political processes.\" The same was confirmed by Imran's sister Aleema Khan while talking to the media outside Adiala Jail. Earlier in the day, Gandapur also told reporters that he, along with Gohar, had met Gen Munir. Responding to a question about \"backdoor negotiations\", the KP CM remarked, \"There is no need for backdoor talks when everything is happening out in the open. Questioned about the matter while talking to journalists, Planning Minister Ahsan Iqbal said that if the meeting occurred then it must have been in accordance with the law. \"Maybe the army chief told the prime minister because when the army chief meets [someone], he informs the prime minister,\" Iqbal said. However, a statement attributed to security sources issued on state broadcaster PTV News's X account claimed to provide the \"real story of the conversation\" the two PTI leaders had. \"The conversation with Barrister Gohar and Ali Amin Gandapur in Peshawar took place in the context of security and counter-terrorism issues in KP. Barrister Gohar tried to discuss political issues. Barrister Gauhar was told to discuss political issues with politicians. \"The conversation was presented out of context. An attempt has been made to give political colour to the discussion on security issues, which is regrettable,\" the statement said. Earlier this month, Gohar had said that his party established \"backdoor contacts\" with the military before their November 2024 protest but said the \"link had now been severed\". The relationship between the PTI and the establishment has turned exceedingly sour since the events of May 9, 2023, when the party's supporters held countrywide protests following Imran's brief arrest. During the protests, PTI supporters vandalised and torched military installations and government buildings, while also attacking the house of Lahore Corps Commander. Thousands were arrested as the government launched a crackdown on all those involved in the riots, with a total of 85 civilians sentenced to jail by a military court in December last year. But earlier this month, the military said that it had pardoned 19 of the convicts on humanitarian grounds. The May 9 riots had come on the heels of already worsening relations with the establishment, as well as the ruling coalition headed by long-time rival PML-N, whom Imran alleged hatched a conspiracy to oust him through a no-confidence vote in April 2022. After a series of protests by the PTI, coupled with repeated heated exchanges with the government, the two sides finally began negotiations in December. Today, the party finally presented its 'charter of demands' to the government in written form, as the third round of talks between the two began. The three-page document, a copy of which is available with Dawn.com, was signed by the six opposition members who attended today's huddle. The opposition put forward two main demands - (i) the formation of two judicial commissions, and (ii) \"support\" of the federal and provincial governments in bail, sentence suspensions, and acquittals of \"political prisoners\" identified by the PTI. The confirmation related to the meeting with the army chief was confirmed by the PTI leadership today following a report published by The News, which said that \"backchannel talks between the government and the PTI, which paused a few weeks back amid focus on the formal dialogue process between the two sides, have revived and entered an important stage.\" Citing an informed source, the report said that two PTI leaders - Barrister Gohar and Gandapur - had an \"exclusive meeting with three very important persons. The meeting, the venue of which was neither Islamabad nor Rawalpindi, was held last Monday.\" \"In the next meeting, a federal minister and two important persons will apparently meet the PTI side,\" it said. The developments come ahead of a much-awaited verdict in the 190m Al-Qadir Trust case against Imran and his spouse Bushra Bibi, which is expected to be announced tomorrow (Friday), after being postponed thrice.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}