{
  "article_id": "2025-01-16_268e391bc79c2707f4f5fa664d20ec80",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885476/kp-to-enforce-new-regime-to-combat-money-laundering",
    "retrieved_at": "2025-08-26T07:43:57.092Z"
  },
  "metadata": {
    "title": "KP to enforce new regime to combat money laundering - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-16T02:02:25.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 564,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "PESHAWAR: The Khyber Pakhtunkhwa government has decided to implement Anti-Money Laundering and Combating Financing of Terrorism (AML/CFT) regime in the province. Under this regime, government agencies involved in property development and transfer and local authorities managing public lands via auction besides revenue officers involved in land transfer will be registered as designated non-financial business and professions (DNFBPs) with Federal Board of Revenue (FBR). The decision was made in the meeting of provincial cabinet, said a statement issued here on Wednesday. It said that Financial Action Task Force (FATF) considered that DNFBPs should be used as a potential tool for channeling and parking of proceeds of crime. It said that those sectors had remained by and large undocumented and un-regulated in money laundering perspective and terror financing. It said that the sectors were identified as high risk and medium risk vulnerable for money laundering and terror financing under National Risk Assessment, 2023. Cabinet approves eight posts of police officers for security of Kurram road The statement said that the meeting, chaired by Chief Minister Ali Amin Khan Gandapur, was also attended by ministers, advisers, special assistants, chief secretary, additional chief secretaries and relevant administrative secretaries. It said that the cabinet approved signing of grant agreement for German-funded (KFW) billion-tree afforestation support project. \"This agreement is being signed for second phase of the project. The German Ministry of Economic Cooperation and Development (BMZ) through KfW has provided a grant of 13.5 million Euros for execution of the first phase of the project to KP government,\" it added. In 2022, BMZ had committed additional funds worth 20 million Euros as grant to second phase of the project to support protection of forest in the province. The meeting approved recommendations of the implementation report of technical committee for analysis of laboratory test results for disposal of Passco-imported wheat. It said that aflatoxin levels in all the tested samples collected by the committee were found safe and below the established permissible limits for processed wheat products. The cabinet approved re-inclusion of four Accelerated Implementation Programme (AIP) schemes of energy and power sector in Annual Development Pfrogramme, 2024-25. The schemes are related to construction of grid stations in South Waziristan, Khyber and Bajaur. The cabinet approved release of Rs118.50 million for operational expenditure of temporarily displaced persons' camp in Bakakhel, Bannu. It also sanctioned financial assistance of Rs2.80 million for Anwarzeb, a resident of Charsadda for kidney transplant. On the recommendation of Peshawar Development Authority, the cabinet decided to establish at least two graveyards in the vicinity of Peshawar on urgent basis. The cabinet approved transfer of Government Technical Institute (GTI) Shalman from administrative control of science technology and information technology department to elementary education department for the establishment of a model school with all modern facilities from Kinder Garden to higher secondary level. The cabinet called for taking up the proposed amendment by federal government to Irsa Act, 1992, by Council of Common Interests and approved creation of eight officer posts for security of Kurram Road under the district police officer. The cabinet approved the draft subsidiary agreement for joint project for strengthening resilience to climate change in Buner and Shangla. The chief minister directed authorities concerned to bring all vacant lands of the province under forest and provide sustenance in provision of water on sharing basis to the owners of barren land. Published in Dawn, January 16th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}