{
  "article_id": "2025-01-16_2b2311fdd24c55e4cb023ce77a936464",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885535/yunus-calls-for-return-of-billions-stolen-during-hasinas-rule",
    "retrieved_at": "2025-08-26T07:43:57.116Z"
  },
  "metadata": {
    "title": "Yunus calls for return of billions ‘stolen’ during Hasina’s rule - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-16T02:02:57.000Z",
    "image_url": "https://i.dawn.com/medium/2025/01/142232284a4e137.png?r=223324",
    "categories": [],
    "word_count": 232,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "DHAKA: Bangladesh's interim leader Muhammad Yunus on Wednesday demanded the return of stolen assets, decrying the scale of corruption under the ousted government of Sheikh Hasina, toppled in August last year. Hasina, 77, fled in August to India, where she has defied extradition requests from Bangladesh to face charges including mass murder. \"The theft of billions of dollars in public funds has left Bangladesh with a significant financial deficit,\" Dr Yunus said in a statement. \"The funds stolen from Bangladesh belong to its people. We will continue to work with our international partners to ensure that justice is done.\" Court acquits former Bangladesh PM Khaleda Zia in corruption case Yunus said he expected \"assets to be returned\", adding that the stolen funds have \"not only robbed the people of Bangladesh, but also disrupted the country's progress toward economic stability\". Bangladesh's anti-corruption commission (ACC) is investigating Hasina and her wider family, including her niece, British lawmaker and anti-corruption minister Tulip Siddiq. She resigned from her position on Tuesday. Khaleda Zia acquitted Bangladesh's Supreme Court acquitted former Prime Minister Khaleda Zia in a 2008 corruption case on Wednesday, clearing the way for the ailing leader to fight parliamentary elections in the troubled South Asian country. The verdict is the latest judicial victory for Khaleda and her family, one of two main groups that have dominated the country's politics. Published in Dawn, January 16th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}