{
  "article_id": "2025-01-16_5117240a14a354af84ed98c3e8c11586",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885577/ahsan-asks-banks-to-enhance-lending-to-smes-for-driving-up-exports",
    "retrieved_at": "2025-10-12T00:52:20.061Z"
  },
  "metadata": {
    "title": "Ahsan asks banks to enhance lending to SMEs for driving up exports - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-16T03:46:35.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678881535a2bc.jpg",
    "categories": [],
    "word_count": 427,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "KARACHI: Planning and Development Minister Ahsan Iqbal urged banks on Wednesday to establish an \"export development window\" offering soft loans primarily to small and medium enterprises (SMEs) to double exports under the newly launched five-year economic transformation programme, Uraan Pakistan. The minister emphasised the urgent need to increase exports from $30 billion to $100bn and to drive economic growth to 6 per cent through export expansion. He emphasised the crucial importance of the financial sector in promoting export growth, enhancing agricultural exports, fostering industrial development, and advancing critical areas such as IT, services, mining, workforce export, the blue economy, and innovation. \"Pakistan has attempted to take off three times in the past but always has failed due to political instability,\" he said while addressing the conference of chiefs of banks organised by the State Bank of Pakistan (SBP). \"We made the first attempt in the 1960s, but the 1965 war derailed it; the second in the 1990s failed due to political instability; and the third, in 2016, was disrupted by the political changes of 2018.\" The minister proposed that banks establish dedicated export windows to support SMEs, potentially generating $40-60bn in exports over the next five years. He urged banks to go beyond merely lending to the government and play an active role in driving export growth. \"Our businesses often prefer to remain in their comfort zones, generating billions of rupees from the domestic market,\" he said. \"The same applies to banks, which feel secure lending to the government. However, we have urged banks to redirect their credit towards SMEs. This strategy could create a win-win situation for both sides, as even with standard interest rates, loans from local banks can significantly benefit our SMEs.\" Over the next 22 years, the federal minister said, Pakistan has the potential to achieve significant progress, positioning itself as a compelling example of rapid development. He also called for launching scholarship programmes for the workforce in collaboration with the SBP and introducing laptop leasing schemes, similar to vehicle leasing, to foster growth and innovation. \"Similarly, we are working on a programme in collaboration with the SBP and other financial institutions to offer scholarships to students who gain admission to the world's top 25 universities but cannot afford the education,\" he said. He said that a National Economic Transformation Unit has been established at the Prime Minister's House to monitor the performance of each ministry in support of Uraan Pakistan. He added that a quarterly report will be compiled to assess progress and ensure continuous evaluation. Published in Dawn, January 16th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}