{
  "title": "PM advises party workers to hold peaceful demos; avoid confrontation",
  "link": "https://www.app.com.pk/national/pm-advises-party-workers-to-hold-peaceful-demos-avoid-confrontation/",
  "date_published": "2022-03-19T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 19 (APP): Prime Minister Imran Khan Saturday advised the party workers to hold peaceful demonstrations and avoid confrontation with the people of opposition parties as the holding of peaceful protest was a legal right.\nAddressing a groundbreaking ceremony of 38.3-kms, six lanes Rawalpindi Ring Road Project, the prime minister referred to the opposition’s politics and said it was necessary for the public, to differentiate between virtue and evil.\n“Is it rightful for those who have changed loyalties after accepting the dirty money!” he posed a question.\nThe prime minister without disclosing the further details said that estranged lawmakers of his party would soon return to their old fold. “Time has changed, as there is no more room for Changa Manga politics. On August 27, there will be a massive gathering of people to give a clear message of standing with the virtue by denouncing the vice,” he added.\nHe said the nation’s anger would keep on brewing with the opposition’s push for its no-confidence motion.\nThe prime minister said it was necessary for the public to realize what was happening in the country now. The public should realize the politics of ill-gotten wealth.\n“There is a market to purchase conscience of people through illegal pelf. The police force was summoned from the Sindh province to guard the Sindh House where illegal activities were happening,” he added.\nThe prime minister said huge bags of money had been doled out to purchase the loyalties of people.\n“The public should witness this kind of politics which had always pushed the country behind in terms of progress and prosperity,” he opined.\nThese people, he said, had plundered the national wealth and sent it abroad. No one among them ever felt ashamed.\nThese things did not happen in a democratic system, the prime minister said, adding in the West, or the United Kingdom where he spent most of his life, there was no place for corrupt elements.\nCongratulating the residents of Rawalpindi, he expressed the confidence that the ring road project would bring vital change in the whole area, through vast connectivity, by saving travel time and spurring business activities.\nHe said Lahore ring road had already brought huge changes and stressed upon undertaking of similar projects for the other cities of Punjab like Faisalabad and Sialkot as hubs of exports.\nThe prime minister noted that unchecked expansion of megacities had been creating myriad issues from availability of cultivable land to provision of safe drinking water and proper waste disposal system.\nHe said that he had directed the chief secretaries to prepare master plans of big cities which would be submitted shortly.\nHe further observed that the unplanned expansion of cities had also shrunk space for the cultivation of crops and green areas, adding the ring roads around the big cities would act as buffer zones against the growth of settlements.\nHe said such planning was necessary to save the agricultural lands for the future generations.\nAbout the Nullah Leh project, the prime minister announced that it would be launched within next three weeks as Rawalpindi city had witnessed expansion with traffic congestion issues. The project would be like rejuvenation of Rawalpindi by transforming it into a modern city.\nCiting Lahore, the prime minister said along with the expansion of megacities, came the issues arising out of lack of basic necessities, waste disposal, provision of potable water and depletion of groundwater table.\nHe emphasized upon turning focus on horizontal construction, regretting that Islamabad had grown in size by twice during the last ten years.\nThe prime minister said through the projects like Lahore Ravi city and the Central Business District, they had been utilizing the dead capital which would bring billions of dollars investment and huge employment opportunities.\nThe Ravi city project would check the unplanned urban sprawl with forestation drive and treatment of Ravi River water which had turned into a sewage nullah.\nHe further informed that the government also planned the construction of industrial zones along the ring roads.\nAddressing the ceremony, Chief Minister Punjab Sardar Usman Buzdar said the project was being executed by the PTI’s government which would have all the facilities.\nGiving further details of the project, he said it was awarded to FWO and would be completed within twenty-four months.\nHe said different public uplift projects worth Rs195 billion had been underway in the province.\nOn the occasion, Minister for Interior Shaikh Rasheed Ahmad while criticizing the political opponents, said the corrupt, looters and absconders could not defeat Imran Khan.\nHe said the opposition leaders would repent over their shabby efforts as they had gathered to save their skins only. They had failed to realize the real potential and qualities of Imran Khan.\n“It is my firm belief that Imran Khan will emerge as successful,” he added.\nThe minister requested the prime minister for early completion of Nullah Leh Expressway project to benefit the whole population of Rawalpindi city.\nMinister for Aviation Ghulam Sarwar Khan said the PTI’s government was completing ‘this project as gift’ to the people of Rawalpindi and Islamabad. The previous two governments had failed to accord any priority to public-oriented projects.\nThese uplift projects were being executed for the welfare of the people only. The ring road project would soon become a major artery for the whole country, he added.",
  "retrievedAt": "2025-08-11T14:34:00.797Z"
}
