{
  "title": "CCP approaches to review merger of Telenor with PTCL before spectrum auction: Shahz told NA",
  "author": null,
  "content": "ISLAMABAD, Feb 14 (APP):State Minister for Information Technology and Telecommunication Shaza Fatima Khawaja informed the National Assembly on Friday that the Competition Commission of Pakistan (CCP) had been approached to review the merger of Telenor with PTCL before the spectrum auction.\nResponding to a query during the session, she said that the Competition Commission of Pakistan is conducting a detailed review of the matter.\nShe added that the spectrum auction is expected to take place in the middle of the current year, and the government has urged the Commission to expedite its decision to enable stakeholders to plan their future strategies.\nShe said that the government is taking steps to attract more investors to the telecom sector. As part of these efforts, the Pakistan Telecommunication Authority (PTA) has initiated a public consultation process on the draft Fixed Satellite Services (FSS) license, inviting stakeholders to review and provide feedback.\nMeanwhile, Parliamentary Secretary Finance & Revenue Saad Waseem Sheikh informed the House that PTCL has submitted a pre-merger application to the Competition Commission of Pakistan (CCP) for approval of its proposed acquisition of 100% shareholding in Telenor Pakistan.\nHe explained that the application was filed under Section 11 of the Competition Act, 2010, and Regulation 6 of the Merger Control Regulations, 2016, initiating the Commission’s review process under the applicable legal framework.\nHe further informed the House that the CCP has completed Phase I of its review and has identified risks of substantial competition reduction in the telecommunications market.\nAs the review advances to Phase II, challenges have arisen in gathering accurate data, assessing market dominance, and evaluating increased market concentration and associated competition concerns.\nFollowing extensive consultations with industry stakeholders and multiple hearings, the Commission is now conducting a thorough analysis to determine the need for regulatory interventions.\nHe said that the Commission has faced difficulties in obtaining relevant financial data from PTCL, as the company does not provide separate financial accounts to the PTA for transactions between PTCL and Ufone.\nThis lack of transparency has raised concerns about potential cross-subsidization, necessitating a more rigorous assessment.\nFurthermore, PTCL holds a unique integrated license that allows it to offer a full range of telecommunication services, creating an uneven playing field compared to other telecom operators. This disparity has further heightened competition concerns, prompting the Commission to undertake a comprehensive evaluation.\nThe parliamentary secretary stated that the CCP is conducting an in-depth analysis of the telecommunications sector, focusing on market power concentration, competitive dynamics, and the potential impact of the proposed merger. He assured that the process remains inclusive, ensuring all stakeholders have ample opportunity to present their submissions.\nTo mitigate concerns regarding market concentration and abuse of dominance, the CCP is considering potential regulatory remedies. One key safeguard under review is the fair allocation of spectrum to prevent PTCL from gaining an undue advantage in coverage and service quality following the merger.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:45:08.217Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ccp-approaches-to-review-merger-of-telenor-with-ptcl-before-spectrum-auction-shahz-told-na/",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T08:16:00.000Z"
}
