{
  "title": "Integrated efforts to protect children urged",
  "author": null,
  "content": "ISLAMABAD, Feb 14 (APP):Coordinator to the Prime Minister on National Health Services, Regulations and Coordination, Dr Mukhtar Bharath on Friday urged to make integrate efforts to protect children from vaccine-preventable diseases.\nHe was addressing the national workshop on Expanded Program on Immunization (EPI) and the Polio Eradication Initiative (PEI) synergy framework and integrated plan development, organized in collaboration with the World Health Organization (WHO).\nDr Mukhtar stressed the need for strong commitment to enhancing collaboration between the EPI and\nHe emphasized the urgency of integrated efforts to protect every child in Pakistan from vaccine-preventable diseases with a special emphasis on achieving the goal of a Polio Free Pakistan.\nDr Bharath acknowledged the unwavering dedication of all provincial, areas, EPIs, Polio Emergency Operation Centres (EOCs), partner organizations (GAVI, World Health Organization, UNICEF, Gates Foundation) healthcare professionals, government agencies and specially the frontline health care workers working tirelessly to achieve immunization targets.\nHe underscored that the Synergy Framework is not merely a document, but a strategic roadmap designed to optimize resources, strengthen coordination, and ensure no child is left behind.\n“This is a shared responsibility that demands full commitment from all of us, especially at the provincial and district levels,” Dr Bharath stated.\nHe said that EPI and PEI must collaborate as one team, particularly in areas where service delivery remains a challenge.\nHe said that identifying zero-dose and under-immunized children is a priority, ensuring they receive their vaccines in a timely and effective manner.\nDr Bharath stressed the need for actionable and well-monitored strategies.\n“We will not just plan, we will track our progress. A tracker sheet will be developed to monitor implementation, address challenges, and hold provinces and districts accountable for results.”\nReiterating the government’s unwavering commitment to polio eradication and routine immunization, Dr Bharath called for a unified approach where partners, government bodies, health workers, and communities work collectively.\nHe said,”We must train our teams, align our strategies, and ensure every household, every community, and every child is reached.”\nDr Shabana Saleem, the Director General Health and FDI, echoed Coordinator’s vision, stating “the integration of EPI and PEI efforts is a significant step towards strengthening Pakistan’s immunization landscape.\nShe said that aligning the strategies and resources, EPI and PEI programmes will ensure that every child, especially those in hard-to-reach areas, receives life-saving vaccines against the 12 vaccine preventable diseases.\n“I commend all stakeholders specially GAVI, WHO, UNICEF and Gates Foundation for their dedication and urge continued collaboration at every level to achieve our collective goal of a healthier, disease-free future for our children.”\nShe said that the government in collaboration with its partners, remains dedicated to strengthening immunization services, ensuring equitable access, and ultimately eradicating polio from the country.\nMuhammad Anwarul Haq, National Coordinator, Polio Emergency Operation Centre said, “The EPI and PEI Synergy Framework marks a pivotal step in our fight against polio and other vaccine-preventable diseases.”\nHe said, “By fostering integration between routine immunization and polio eradication efforts, we can maximize our reach, especially in high-risk areas. Our collective commitment and data-driven approach will help us close immunity gaps and move Pakistan closer to a future free of polio and other preventable diseases.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:43:54.646Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/integrated-efforts-to-protect-children-urged/",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T16:38:00.000Z"
}
