{
  "title": "PM emphasises need to further strengthen collaboration with UN in climate change, development",
  "author": null,
  "content": "ISLAMABAD, Feb 14 (APP):Prime Minister Muhammad Shehbaz Sharif on Friday emphasised the need to further strengthen collaboration with the United Nations in the areas of sustainable development and climate change.\nHe reaffirmed Pakistan’s strong political commitment to advancing the objective of combating climate change in close collaboration and partnership with the international community and the UN.\nThe prime minister was talking to UN Resident Coordinator in Pakistan,  Mohamed Yahya, who paid a courtesy call on him.\nDuring the meeting, the prime minister appreciated the important work being carried out by the UN Country Team in Pakistan.\nHe conveyed his warm regards for UN Secretary General Antonio Guterres, while fondly recalling his strong leadership in galvanising global support for Pakistan during the 2022 floods.\nThe prime minister underscored that climate financing remained a crucial component of addressing the impacts of climate change, and expressed the hope that the developed nations would fulfill their commitments in that regard.\nHe said that Pakistan would continue working closely with the UN on important issues in the areas of climate change, including for the implementation of various projects.\nThe prime minister also emphasized the need for addressing the financing gap to achieve Sustainable Development Goals (SDGs), as well as for increasing the voice and representation of developing countries in the international financial institutions through reform of the global financial architecture.\nDeputy Prime Minister and Foreign Minister Muhammad Ishaq Dar, Minister for EAD Ahad Khan Cheema,  Minister for Planning Ahsan Iqbal, SAPM Syed Tariq Fatemi, PM’s Coordinator for Climate change Ms Romina Khursheed Alam and senior government officials also attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:44:46.405Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-emphasises-need-to-further-strengthen-collaboration-with-un-in-climate-change-development-2/",
  "dateList": "2025-02-14",
  "date_published": "2025-02-14T10:51:00.000Z"
}
