{
  "title": "China first destination for Pakistani students: Ambassador Haque",
  "link": "https://www.app.com.pk/national/china-first-destination-for-pakistani-students-ambassador-haque/",
  "date_published": "2021-10-17T10:56:00.000Z",
  "source": "APP",
  "content": "BEIJING Oct 17 (APP): Pakistan Ambassador to China, Moin ul Haque said that China has now become the first destination for Pakistani students with around 28,000 students enrolled in different Chinese universities,.\nWhile speaking on the occasion of the 4th Exchange Mechanism Conference under China-Pakistan Economic Corridor (CPEC) Consortium of Universities, he said, “Education and economic linkages are very important parts of this broad relationship.”\nMoin ul Haque said that the CPEC Consortium of Universities, which was established in 2017, is an integral part of China-Pakistan relations.\nInitially, 19 universities were part of the consortium while the membership has now extended in four years to 83 universities, with 61 from Pakistan, and 22 from China, China Economic Net reported.\n“This not only means the increase of the number of universities but also the inclusion of more academic disciplines, ranging from business administration, transport, engineering, brain development in many other disciplines,” he said.\nHe said amidst the challenges of COVID-19, both countries have continued cooperation and engagement in the important area of communication.\n“Today’s conference is very important: first, it is taking place in a year when our two countries are celebrating the 70 years of our diplomatic ties and an important milestone in the seven decades journey of the country.\nSecond it is the creation of the China Pakistan Higher Education Research Institute, which has been inaugurated today,” he added.\nMoin ul Haque said that the success of the consortium is also important in promoting the study of China-Pakistan history, language and culture channel, integration, and promoting understanding of Chinese economy and business practices and research on possible CPEC projects.",
  "retrievedAt": "2025-08-11T21:29:14.371Z"
}
