{
  "title": "Eco-changes Severely impacts on agricultural sector: Fakhar Imam",
  "link": "https://www.app.com.pk/national/eco-changes-severely-impacts-on-agricultural-sector-fakhar-imam/",
  "date_published": "2021-10-17T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP):Federal Minister for Food Security and Research Syed Fakhar Imam Sunday said the impact of climate change on the agricultural sector, including human life was a major challenge for Sustainable environmental development in the country.\nHe said the sustainable environmental growth was the key to improvement of the agricultural sector on which human life depends.\nThe minister said this while speaking as Chief guest at launching of seven-day awareness campaign on “Eat, Move and Live sustainability for sustainable living standards and better living in accordance with the environmental standards”, jointly organized by Sweden embassy in Islamabad and World Wildlife Fund (WWF) here.\nHe said the current economy was centered around the agricultural sector, including crops, livestock, fisheries and forestry. In the presence of all these factors, an economy could be termed a sustainable one. The minister said the climate change has also affected our agricultural sector, including major crops such as cotton and wheat, which were in dire need of extreme weather protection.\n“Right now we have 200 million livestock, which is very low,” he said and added that one of the major reasons behind the decline in livestock in the country was the lack of good food and medicine.\nFakhar Imam said that at present Pakistan was a country rich in natural beauty and natural resources.  “We have six major mountain peaks in the world, despite the existence of glaciers, today we are facing water scarcity for agriculture which is also due to climate change,” he informed.\nHe said that in the past, forests have been cut down in Pakistan while now the efforts were being made to replant the same. Similarly, there were some rare animals in our northern regions that need to be protected, he said and added “We need to educate our young generation about climate change so that we can have sustainable development in the future.”\nOn the occasion, Ambassador of Sweden to Pakistan Henrik Parson said the sustainable environmental growth was must for mitigating the major environmental threat to human life. “We have to make good changes in our lives according to the environment and change things that are not compatible with the environment,” he said.\nThe ambassador said that climate change has its effects on sustainable development life goals and it was also affecting different major aspects of the life. He said the agriculture, quality food, water scarcity and other life-threatening factors of climate change needed to be addressed on priority.\n“By stopping the use of plastic bags and other eco-adverse items, we can prevent carbon emissions from the atmosphere,” said Henrik Parsons. He said the present government of Pakistan has taken important steps to address the negative effects of climate change and to maintain quality of life in the country.\n‘Billion Tree Tsunami and Green Pakistan’ were the most important projects that would surely play an important role in fostering a sustainable and environmentally friendly life. He said Pakistan and Sweden had a lot of potential for work in the fields of environment and sustainable living.\nOn the occasion, Chairman of the Senate Standing Committee on Climate Change, Senator Seemi Ezdi said that sustainable environmental growth was only way forward for development in the society.\nIt was an effort to raise awareness of this issue and address missing links by encouraging individuals to make environment friendly choices.",
  "retrievedAt": "2025-08-11T21:29:12.438Z"
}
