{
  "title": "KP’s hydropower receipts almost half of Punjab’s last fiscal - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa, the largest hydropower producer in the country, received Rs33 billion in profits from hydroelectricity generation in the last fiscal, which was nearly half of the Rs65.8 billion given to Punjab during the same period, shows the finance ministry’s data.\n\nThe profits from generation of hydroelectricity, known as net hydel profits (NHP), are payable to provinces, where power plants are located, under the Article 161(2) of the Constitution.\n\nBudget documents showed that in 2024, the province projected its revenues from NHP, including current proceeds, arrears and un-reconciled arrears, at Rs111.3 billion, which was later revised to Rs113 billion. Similarly, in the current fiscal, the province has projected its NHP profits at Rs105.9 billion.\n\nAdviser to the chief minister on finance Muzzamil Aslam told Dawn that the federal government paid over Rs65.8 billion NHP to Punjab last fiscal compared to Rs33 billion released to KP.\n\nCM’s aide insists Centre, Wapda biased against province, discrimination must end\n\nHe said the centre’s NHP payments to Punjab were more than double than KP’s, showing the “bias and prejudice” of the federal government and Water and Power Development Authority towards his PTI-ruled province.\n\n“KP is generating most of the hydel electricity in the country but the federal government is releasing more funds for it to Punjab.\n\n“This discrimination must end. The claim of Khyber Pakhtunkhwa is higher but Punjab ended up bagging more funds,” he said.\n\nMr Aslam also said that a meeting called by the federal planning minister on the issue was scheduled to take place on August 5 but it was postponed.\n\nHe said the postponement of the meeting was a delaying tactic on part of the federal government to frustrate KP’s government and people.\n\nThe NHP payments is an old issue between the centre and KP, with competing claims.\n\nIn 2016, the then federal and KP governments signed a memorandum of understanding to resolve several pending issues, including the uncapping of NHP, its arrears as well as water and gas-related issues. It included payment of Rs70 billion in four installments on account of arrears and uncapping of the province’s NHP share from the Rs6 billion to over Rs18 billion with five per cent annual increase.\n\nHowever, the KP government claims that the centre didn’t follow the five per cent annual indexation of the uncapped NHP as per the agreement and, for its part, has been calculating the same as un-reconciled arrears. The un-reconciled arrears were pitched at over Rs41 billion in the last fiscal and Rs45.21 billion in the current fiscal.\n\nIn 2018, the KP government took the issue of the full implementation of the Kazi Committee Methodology (KCM) to the Council of Common Interest (CCI), which, in a meeting on April 24, 2018, constituted a committee, headed by the then deputy chairman of the Planning Commission to discuss the determination of NHP in light of its decisions.\n\nThe CCI formed an “out-of-box” committee to act on the committee’s report. The committee has so far held at least five meetings but no agreement has been reached over mechanisms to pay Rs1.5 trillion NHP to KP as per KCM for the period from 2016-17 to 2022-23.\n\nFor its part, KP suggested to the committee that the federal government pay NHP in line with Article 161(2) of the Constitution, Presidential Order No 3, decisions of the CCI from 1991, 1993, 1997, 1998, 2016, 2018 and 2022, and the calculation made by the Jehanzeb Khan committee in the report approved by the CCI on Dec 23, 2019.\n\nBesides, it has also been asking the federal government to fund the power house component of Wapda development projects through Public Sector Development Programme instead of revenues coming from Wapda generation tariff to make funds available for the payment of NHP to the entitled province.\n\nBesides, KP has also proposed that the centre transfer hydropower projects to it on analogy of the power generation policies of 1995 and 2015 and outstanding payment of NHP as per KCM to be made by the federal government till the date of transfer of HPP to the provinces, while the operation and maintenance can be retained by Wapda.\n\nPublished in Dawn, August 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2018/07/5b6000c850614.jpg",
  "retrievedAt": "2025-08-16T06:09:51.000Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930943/kps-hydropower-receipts-almost-half-of-punjabs-last-fiscal",
  "dateList": "2025-08-15",
  "date_published": "2025-08-15T01:56:27.000Z"
}
