{
  "title": "Man dies fleeing ICE raid in California - World - DAWN.COM",
  "author": null,
  "content": "A man who was believed to have been running from a raid by US immigration agents died on Thursday after being hit by a car on a freeway, police said.\n\nCity managers in Monrovia, near Los Angeles, said police had been called after there were reports of activity by Immigration and Customs Enforcement (ICE) agents at a Home Depot.\n\nDuring the raid, one man ran from the parking lot of the hardware store — a place where day labourers commonly gather looking for casual work — and onto a busy freeway during rush hour, Monrovia City Manager Dylan Feik told media.\n\nA spokesman for the California Highway Patrol (CHP) said the 40-year-old man was taken to a hospital, where he died from his injuries a few hours later.\n\nNeither CHP nor the city were immediately able to provide any details on the man’s identity.\n\nFeik said: “The city has not received any communication or information from ICE.” ICE did not immediately respond to an AFP request for information.\n\nMasked and armed agents from ICE and US Border Patrol began carrying out raids in and around Los Angeles earlier this year, as President Donald Trump looked to fulfil his election promise to carry out the most deportations in US history.\n\nThe raids, which target hardware stores, carwashes and other businesses where undocumented people seek work, sparked fury in the multicultural city.\n\nProtests in Los Angeles, some of which saw isloated instances of violence, were met with the mass deployment of soldiers by the federal government, even as local law enforcement said they could handle the unrest.\n\nA federal court in July ordered a halt to ICE’s roving patrols in several California counties, after rights groups argued that the raids appeared to be arresting people largely based on their race, the language they were speaking or the place they had gathered.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/031316045321f79.jpg?r=131713",
  "retrievedAt": "2025-08-16T06:08:22.950Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931066/man-dies-fleeing-ice-raid-in-california",
  "dateList": "2025-08-15",
  "date_published": "2025-08-15T12:54:41.000Z"
}
