{
  "title": "Trade with North America rebounds in FY25 - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s merchandise exports to North America grew by 9.97 per cent in FY25, reaching $6.415bn compared to $5.833bn in the previous year, driven largely by a surge in shipments to the United States.\n\nData compiled by the State Bank of Pakistan (SBP) attributes the rebound to increased exports of textiles and clothing to the US, which accounted for nearly 94pc of Pakistan’s total exports to the region. The remaining share was primarily directed towards Canada.\n\nIn contrast, FY24 saw a contraction of 8.42pc in exports to North America, dropping to $5.432bn from $5.93bn in FY23. Exports to the US had declined significantly to $5.17bn in FY23 — down 23.28pc from $6.74bn a year earlier — but have since recovered.\n\nThe turnaround in FY25 comes amid a slowdown in textile exports from regional competitors such as Bangla­desh and Vietnam, allowing Pakistan to regain market share in the US. Accor­ding to Pakistan Bureau of Statistics (PBS) data, exports to the US rose to $6.028bn in FY25 from $5.444bn a year earlier, marking a growth of 10.72pc.\n\nPakistan’s exports to Canada, however, remained subdued, recording a marginal decline of 0.80pc to $386.1m in FY25 from $389.2m in the previous year. In FY24, exports to Canada had dropped 8.77pc to $389.2m from $426.6m.\n\nExports to US rise over 10pc to $6.03bn, driven by textile and clothing shipments\n\nOn the import side, Pakistan’s purchases from North America rose sharply by 26.98pc to $2.588bn in FY25 from $2.038bn in the previous fiscal year. The bulk of these imports originated from the US, which exported goods worth $2.35bn to Pakistan in FY24, up 15.31pc from $2.038bn. Under a new agreement, Pakistan is set to import an additional $2.5bn worth of goods from the US to help address the trade imbalance.\n\nElsewhere in the Americas, Pakistan’s exports to Latin America declined by 7.52pc to $73.5m in FY25, down from $79.5m the previous year. This followed a sharp rise in FY24, when exports surged by 46.59pc to $77.8m from $53.1m in FY23.\n\nExports to Central America stood at $169.3m in FY25, reflecting a 2.89pc decline from $174.3m a year earlier. Mexico, the primary destination in the region, saw a 3.42pc drop in Pakistani exports to $130.05m from $134.7m in the same period last year.\n\nMeanwhile, exports to South America — including destinations such as Argentina, Brazil, and Uruguay — edged up by 4.87pc to $349.6m in FY25 from $333.3m in the corresponding months of the previous year, according to SBP data.\n\nPublished in Dawn, August 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/14104013e00ab95.jpg?r=104025",
  "retrievedAt": "2025-08-16T06:10:27.634Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930959/trade-with-north-america-rebounds-in-fy25",
  "dateList": "2025-08-15",
  "date_published": "2025-08-15T01:55:54.000Z"
}
