{
  "title": "Flood-hit Layyah braces for another surge - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Over 40 villages impacted; huge swathes of farmland washed away; locals say ‘flawed bridge design’ diverted river towards settlements\n• Official says flood damaged homes built in riverbed\n\nTWO weeks after a flood that washed away their houses, crops, and cattle, locals living along the banks of the Indus in Layyah district are still reeling from the ongoing ordeal — bracing for another river surge even though the previously-flooded fields have yet to be drained.\n\nAccording to the Pakistan Meteorological Department, the water level is rising in the Indus River at Tarbela, Kalabagh, and Chashma, and the flow is expected to rise to “medium to moderate levels” within the next 24 hours.\n\nOn July 28, more than 23 union councils in the district had submerged after a protective dyke built to support the newly constructed Layyah-Taunsa Bridge buckled under the raging floodwater. Now, the river flows through the areas once protected by this protective dyke.\n\nThe bridge, which connects the cities of Layyah and Taunsa, is 2km long, while the riverbed spans a width of app­roximately 24km. The government approved Rs10 billion for its construction in 2017. The area also has a ferry service, which takes a little over an hour to reach the other side.\n\nA visit to the area showed that roads leading to the bridge had been swept away, and three to four feet of water was standing in fields of sugarcane and sesame. The locals, without any help from the government, were preparing for another eventuality — shifting their belongings from damaged houses to other places, saying the land and their houses were damaged by the river daily.\n\nAccording to them, the river water did not enter their villages in the past and they blamed the ‘flawed bridge’ that altered its course and directed the water towards settlements. They feared that if the river further swelled, their houses and farmland would be permanently lost.\n\nA resident of Dulu Nashaib, Ameer Muhammad, told Dawn that there were about 40 homes in Kumharan Wala village. “All houses were washed away and they could not take away their belongings,” he said, adding that the river was flowing through the now-vanished village. “Hundreds of acres of sugarcane crop and dozens of houses were completely washed away and became part of the river,” he lamented.\n\nA resident of Chandhar village, Muhammad Iqbal, said they managed to retrieve some of their belongings before they were washed away by the floodwater after the dyke collapsed. They lost their crops in 2005 and 2010, but in this flood, all their belongings were gone. He claimed substandard material was used for the construction of the dyke and the contractor of the bridge and its connecting roads fled soon after the dyke was swept away.\n\nRuined harvest\n\nA government report revealed that 47 villages were affected, 75 houses were fully destroyed, and 29,788 acres of crops vanished in the flood. Besides the death of a person and four head of cattle, entire crops were damaged in some areas, including Mirani Paka. Sumra Nashaib, Dulu Nashaib, Lohanch Nashiab, Mirani Paka, and Mosan Shah now stand in ruins, with mud and brick houses reduced to debris.\n\nWith their harvest ruined, farmers stare at drowned fields in disbelief. Like others, Riaz Hussain was also sifting through the rubble of his house, hoping to salvage something.\n\n“The river never flowed here before the bridge,” said one villager, echoing widespread anger. “We warned them, and now we are paying the price.”\n\nVillages like Sehmal Nashaib lost 92 per cent of their crop, but compensation is still awaited. As many as 75 families in Karor tehsil alone, whose homes were ‘fully damaged’ have yet to receive help. The locals demanded immediate reconstruction of the dyke and flood barriers and compensation for crops, houses, and livestock, as well as a judicial inquiry into the bridge’s design and approval process.\n\nPervaiz Dulu, who runs a ferry service between the two cities, told Dawn that even after two weeks, the 800-foot-wide breach had still not been plugged by the government.\n\nOn the other hand, a local PPP leader claimed that the bridge’s construction went on despite legal challenges.\n\nDr Javed Kunjal told Dawn that he had challenged the construction of the bridge and also filed a writ petition before Lahore High Court, but no one listened. He said that they had pointed out flaws in the design and mentioned that it would erode the human settlements. He said that the natural path of the river was obstructed by the bridge and its supportive dykes.\n\n“How can a 24km wide river… be covered by a two kilometre bridge? The remaining part of the river was closed to build supportive dykes and roads for the bridge,” he said.\n\n“Despite legal challenges questioning the bridge’s engineering, construction was allowed to proceed,” he claimed.\n\nAccording to Punjab Irrigation Department Layyah XEN Abdul Rauf, the flood entered villages after the protective dyke washed away under the pressure of 400,000 cusecs of water. He said that the settlements were established in the floodplains, which always flooded during the high-flow season.\n\n“Locals should not be allowed to build houses and infrastructure there.” However, he did not address why the government was building roads in the riverbed.\n\nHe assured that the flooded river did not pose any threats to Layyah and Karor Lal Esan cities because their protective embankments were still 10km away. Meanwhile, the government allocated over Rs150 million for the construction of new and existing dykes to protect the area from flooding.\n\nPublished in Dawn, August 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689e9aee2c7ac.gif",
  "retrievedAt": "2025-08-16T06:08:57.319Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930993/flood-hit-layyah-braces-for-another-surge",
  "dateList": "2025-08-15",
  "date_published": "2025-08-15T02:28:41.000Z"
}
