{
  "title": "Afghan Taliban mark 4th year in power, buoyed by official recognition from Russia - World - DAWN.COM",
  "author": null,
  "content": "Afghanistan’s Taliban authorities marked the fourth anniversary of their takeover on Friday, buoyed by Russia’s first official recognition of their government, a step they hope other countries will follow.\n\nParades were planned in several cities, including in central Kabul, where helicopters were set to drop flowers and the white-and-black flags of the Taliban’s “Islamic Emirate of Afghanistan” fluttered across the city to mark their capture of the capital on August 15, 2021.\n\nTaliban members gathered on Thursday night at a square near the shuttered US embassy — seat of their enemy during their 20-year insurgency — waving flags and setting off fireworks, an AFP journalist said.\n\nThe military parade held last year with much fanfare at the Bagram airbase, once the linchpin for US-led operations, was cancelled this year, without public explanation.\n\nThe Taliban government remains largely isolated on the global stage over restrictions imposed under their interpretation of Islamic law, targeting women in particular.\n\nThe International Criminal Court issued in July arrest warrants for two senior Taliban leaders, accusing them of crimes against humanity over the persecution of women and girls, who are banned from most education and work, as well as parks, gyms and travelling without a male guardian.\n\nBut the authorities scored a victory in early July when Russia became the first country to officially recognise their administration.\n\nKabul also enjoys close ties, despite lacking official recognition, with countries including Central Asian states, China and the United Arab Emirates.\n\nOn the Western front, the Taliban government reported talks in Kabul with officials from Norway, Britain and the United States, among others.\n\nThe authorities face almost no internal opposition, though steep challenges stem from economic fragility, international aid cuts and the influx of four million Afghans expelled from neighbouring countries.\n\nIndependent experts appointed by the United Nations Human Rights Council on Thursday called on the international community not to normalise relations with the Taliban authorities and to reject their “violent and authoritarian rule”.\n\n“Operating without legitimacy, the Taliban enforces an institutionalised system of gender oppression, crushes dissent, exacts reprisals, and muzzles independent media while showing outright contempt for human rights, equality and non-discrimination,” the experts said in a statement.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/1512501908577cd.png",
  "retrievedAt": "2025-08-16T06:08:35.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931047/afghan-taliban-mark-4th-year-in-power-buoyed-by-official-recognition-from-russia",
  "dateList": "2025-08-15",
  "date_published": "2025-08-15T07:48:17.000Z"
}
