{
  "title": "Ehsaas Steering Committee approves transition of Waseela-e-Taleem Digital to secondary level",
  "link": "https://www.app.com.pk/national/ehsaas-steering-committee-approves-transition-of-waseela-e-taleem-digital-to-secondary-level/",
  "date_published": "2021-03-19T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP):Ehsaas steering committee has approved transition of Waseela-e-Taleem Digital to secondary level schooling in a meeting held under the chairmanship of Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar.\nDuring the steering committee meeting of Waseela-e-Taleem Digital, the committee members and experts took a decision to roll out an education stipend programme for secondary education under Ehsaas.\nThrough engaging discussions, the meeting took stock of existing secondary stipend programmes in the country.\nIt was discussed that the upcoming programme for secondary school stipends will be designed and executed in close coordination with provinces to avoid duplications.\nAlmost all provincial governments except Azad Jammu and Kashmir, Gilgit Baltistan and Islamabad Capital Territory are currently running secondary stipend programmes.\nThese programmes are limited to girls only and are also running in selected districts of provinces. And, stipends are granted universally irrespective of poverty.\nHowever, the Ehsaas secondary school stipend initiative in collaboration with provinces will translate into more school going children from disadvantaged populations, especially girls at the secondary level.\nCurrently, there are 18.7 million out of school children, in the age group 6 to 16, in the country.\nFurther, there is a high chance that COVID-19 induced livelihoods losses have caused over a million more dropouts.\nAccording to Demographic and Health Survey 2017 (Kaplan and Meier estimates), dropout rate is highest for the poorest two quintiles in secondary education. Hence Ehsaas is working on a financial access to secondary education programme.\nThe programme will be structured in line with Ehsaas Stipend policy which allows higher stipend amount for girls as compared to boys. For further necessary approvals, this Ehsaas proposition will be taken to Economic Coordination Committee (ECC).\nTalking to press after the meeting, Dr. Nishtar said, “This is especially important as we shift our focus from the completion of primary school to continuing on to secondary school particularly for girls.\n” She further added, “Aiming to tackle very low enrolment rates in age bracket 11-16 years and high dropout rate in grades 5-10, Ehsaas is considering expansion of Waseela-e-Taleem Digital for secondary education stipends. The transition of schooling will have a very positive impact on school enrollment and continuation in school for children from poor populations.”\nAt the meeting, Dr. Nishtar was joined by Secretary BISP, senior officials and representatives from Federal Ministry of Education and Professional Training, Foreign Commonwealth and Development Office, the World Bank, Asian Development Bank and Education Departments from provinces including Balochistan, KP, Sindh and Punjab along with Waseela-e-Taleem Digital team of Ehsaas.\nPoverty is one of the most persistent barriers to acquiring education. Education Conditional Cash Transfers (CCTs) are an important component of Ehsaas and are included in the Ehsaas framework as Policy #73 ‘Education CCTs.",
  "retrievedAt": "2025-08-11T20:31:04.081Z"
}
