{
  "title": "NA speaker extends full support to AWKUM for research on scientific issues",
  "link": "https://www.app.com.pk/national/na-speaker-extends-full-support-to-awkum-for-research-on-scientific-issues/",
  "date_published": "2021-03-19T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP):National Assembly (NA) Speaker Asad Qaiser on Friday extended his all out support to Abdul Wali Khan University Mardan (AWKUM) for strengthening of research facilities for promotion of research on socioeconomic and scientific and technology issues facing the country.\nTalking to AWKUM Vice Chancellor Prof Dr Zahoor-ul-Haq and his team, he said analysis of economic and other policies would help government to forge their future strategies, felicitated vice chancellor and faculty members of the AWKUM on that achievement.\nThe industrialisation was the key to economic prosperity and success of any nation. Advent of the China Pakistan Economic Corridor would lead Pakistan especially Khyber Pakhtunkhwa to progress thus AWKUM had a pivotal role to play in that regard.\nHe said securing 150th position amongst universities of world emerging economies was a remarkable achievement of the AWKUM. Securing such a position demonstrated dedication and commitment of the management, faculty and students of the university.\nDr Zahoor-ul-Haq apprised the speaker that the university had been ranked 150th by Times Higher Education among Emerging Economies Universities Rankings 2021.\nHe further informed that AWKUM also had the honour of being one of the two Pakistani universities to stand within the rank of first 150 top universities in emerging economies.\nEarlier the university was ranked number one in the country and 510 in the world.\nProfessor Dr Zahoorul Haq informed that based on research performance, AWKU had been ranked 200th in world ranking. He added that the university was also ranked 24th in Asia and 3rd in South Asia.\nHe said this achievement indicates that AWKU faculty was talented and productive as teachers and researchers. He thanked the speaker and the provincial government Khyber Pakhtunkhwa for their continued support to the university.\nLater, vice chancellor presented a momento of the university to the speaker. Senator Shibli Faraz and MNA Anwar Taj were also present on the occasion.",
  "retrievedAt": "2025-08-11T20:31:03.205Z"
}
