{
  "title": "NAB determined to achieve corruption free Pakistan goal: Chairman",
  "link": "https://www.app.com.pk/national/nab-determined-to-achieve-corruption-free-pakistan-goal-chairman/",
  "date_published": "2021-03-19T17:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP): National Accountability Bureau Chairman Justice (Retd) Javed Iqbal said that the bureau was determined to achieve the goal of corruption free Pakistan.\nIn a statement, he said NAB was fulfilling its national duty to eradicate corruption.\nSince its inception, bureau has deposited Rs. 714 billion in the national exchequer.\nThe conviction ratio in NAB cases was 68.8%, which was an excellent achievement as comparing to such other anti-corruption agencies.\nHe asked the officers to double their efforts to bring these elements to justice and collect the money looted from them by innocent Pakistani citizens and deposit it in the national treasury.\nHe said the NAB had devised a combined investigation team (CIT) comprising two investigation officers, one legal consultant and one financial expert.\nHe said the CIT works under the supervision of director, additional director and case officers.\nHe said the strategy of CIT was lending quality with the establishment of the state of the art forensic Science laboratory in Islamabad to further improve the standards of inquiries and investigations.\nHe said the laboratory provided various services like digital forensic, question documents and finger prints.\nNAB has set up its own Pakistan Training and Research Academy in which special training was being imparted to Investigation Officers and Prosecutors as per modern requirements to deal with white collar crimes and money laundering cases.\nAn Anti Money Laundering Cell has been set up at the headquarters. While special cells have been set up at the NAB headquarters and all the regional bureaus to listen to the complaints of the business community.\nNAB respects business community which is playing vital role in progress and prosperity of the country.\nNAB has no affiliation with any political party group or individual as it belongs only to the state of Pakistan.\nChairman NAB directed all regional bureaus that NAB officers should respect all those who come to NAB as NAB is a humanitarian organization.",
  "retrievedAt": "2025-08-11T20:30:54.333Z"
}
