{
  "title": "1mln children to be enrolled during current drive: minister",
  "link": "https://www.app.com.pk/national/1mln-children-to-be-enrolled-during-current-drive-minister/",
  "date_published": "2021-03-19T12:28:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 19 (APP):Punjab Minister for School Education Dr Murad Raas said on Friday that in the first 45 days of the enrollment drive, 246,000 children had been enrolled in schools.\nHe said this while addressing a press conference, along with Special Assistant to Chief Minister (SACM) Punjab on Information Dr Firdous Ashiq Awan here.\nHe said that under the current enrollment drive, the target of enrolling one million children would be achieved.\nDr Murad Raas said that during the last four months, the School Education Department asked parents to provide B-Farm of their children, adding that so far 92 per cent of B-farms of children had been provided by the parents.\nThe minister said that all B-farms would be verified from the National Database and Registration Authority (NADRA). He said that ‘Mera School Programme’ was an initiative for all those citizens who wanted to see improvement in country’s educational system.\nHe said that missing facilities would be provided in schools under the Mera School Programme.\nIn Nov 2020, registration process of private school was launched, and till now more than 50,000 applications for registration of private schools had been received through online school registration system (PEPRIS or Private Education Provider Registration and Information System), he added.\nDr Murad said digitalization process of the School Education Department was under way.\nEarlier, SACM Dr Firdous Ashiq Awan said that through a uniform curriculum across country, a class-based education system would be eliminated. She said, “Awareness can be created only through education.”\nShe said that the Pakistan Tehreek-e-Insaf (PTI) government was reviving education department with the help of technology. The SACM said that coronavirus infection rate had gone beyond 8 per cent which was alarming. She appealed to people to follow the standard operating procedures (SOPs) to stay safe from COVID-19 pandemic.\nTo a question, she said that those who use politics for personal motives would face the same fate which Pakistan Democratic Movement (PDM) had faced.\nPrime Minister Imran Khan had started the second innings which was aimed at country’s economic development, she added.",
  "retrievedAt": "2025-08-11T20:31:02.897Z"
}
