{
  "title": "CPEC considered as pilot project for development,prosperity of Pakistan : CG China Li-Bijiyan",
  "link": "https://www.app.com.pk/national/cpec-considered-as-pilot-project-for-developmentprosperity-of-pakistan-cg-china-li-bijiyan/",
  "date_published": "2021-03-19T17:23:00.000Z",
  "source": "APP",
  "content": "MITHI, Mar 19 (APP): The Consul General China Li-Bijiyan has said that CPEC had been considered as a pilot project in the development and prosperity of Pakistan which proved result oriented.\nHe expressed these views while addressing the ‘Thar Festival’ which started here on Friday. The Chinese Consul said that Thar has a great investment potential which can bring remarkable change not only in Pakistan but in the rest of the world for its rich natural resources.\nThe festival organized by the District Administration in collaboration with Sindh Engro Coal Mining Company, Thar Foundation, Hubco, Sino Sindh Resources, Shanghai Electric, Pakistan Army and Pakistan Rangers Sindh and some other organizations under theme “Thar will change Pakistan”.\nOn the first day of the colourful festival various events were organized to entertain the participants who thronged to witness the mega event.\nMNA Dr Mahesh Kumar Malani along with MPA Qsim Siraj Soomro, MPA Fakeer Mohammad Bilani, Deputy Commissioner Thar Mohammad Nawaz Soho and with the officials of the sponsors of the mega festival infuriated the colour festival.\nIn a keynote address, Consul General Li Bijian said that the year 2021 marks the 70th anniversary of China Pakistan diplomatic relationships and this friendship would get stronger in the future.\nUnder the China Pakistan Economic Corridor Projects (CPEC), he said we had successfully completed Phase One and now entering the second phase.\nHe said mining and power projects in Thar were moving very smoothly and had created thousands of job opportunities for the local people.\nLi Bijian also visited Thar Coal Block II Projects of Sindh Engro Coal Mining Company and reviewed Thar Foundation development schemes.\nHe was briefed by Director Site Operations, Ahmed Munib about the inclusive development model at Thar Coal Projects.\nAddressing the festival, Dr. Malani highly lauded the efforts of the organizers of the mega event and said that such events with very activities would not only promote the culture, traditions, music, and other various aspects of the desert district but also to inculcate trends of the competition among the students of the district.\n“We are trying our best to give exposure to the talent of Thar and an opportunity to people from other regions to come and see the various other hidden aspects, he said.\nHe said that with the sincere efforts of the Sindh government, Thar was not only generating power but had become the hub of tourism after a number of the results were established in Nagarparkar, Mithi and in some other towns.\nMPA Qasim Siraj Soomro said that it was the great achievement of those people who put their resources and energies to organize such an event in Mithi to provide enough to participants and gave opportunities to various other organizations to display the true beautiful colours of Thar at their different stalls.\nMPA Faqir Sher Mohammad Bilalani said that such events were the need of the hour at the time when the desert district was all set to change Pakistan and the destiny of its people.\nHe said that mining companies like SECMC and its Thar Foundation had achieved tremendous targets and fulfilled their commitments both to the government to produce power and providing the maximum relief to the people of the Islamkot taluka.\nDC Tharparkar, Mohammad Nawaz Soho expressed gratitude to organizers for arranging such an event and hoped that in coming two days celebrations, more activities and shows would be presented .He observed that such events would provide a platform for the people from different walks of life for active participation.",
  "retrievedAt": "2025-08-11T20:30:55.053Z"
}
