{
  "title": "Railways to make optimum efforts to vacate its land: Minister Swati",
  "link": "https://www.app.com.pk/national/railways-to-make-optimum-efforts-to-vacate-its-land-minister-swati/",
  "date_published": "2021-03-19T15:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP):Minister for Railways Azam Khan Swati on Friday said optimum efforts would be made to vacate Pakistan Railways land from the grabbers from Lakki Marwat to Kohat.\nTalking to media here after an agreement signing ceremony between Pakistan Railways and Frontier Works Organization (FWO), he said the apex court chief justice was taking personal interest to vacate the Railways land from the encroachers.\n“We are planning to take the land of Pakistan Railways on public private partnership to make the organization into profitable entity,” the minister added.\nAzam Swati urged Prime Minister Imran Khan and Special Assistant to the Prime Minister on Climate Change Malik Amin Aslam to plant fruit trees on the railways land.\n“I assured the prime minister in writing that I will make Pakistan Railways into profitable entity within nine months out of which three months have passed and hope that we will make the department profitable within the next six months,” he said.\nThe minister said Pakistan Railways had set a target of Rs30 billion which would be achieved soon, adding that Pakistan Railways and FWO would work together to facilitate the passengers.\n“The prime minister has repeatedly asked for media briefing about the department and we had planned when Pakistan Railways and Pakistan International Airlines (PIA) will come out of deficit,” he said.\nThe minister said the previous governments had also destroyed the Pakistan Steel Mills (PSM) and other national institutions of the country.\nHe said Pakistan Railways was going to organize a programme regarding joint venture on land of the department at Rawalpindi Chamber of Commerce on March 26, in which Governor Sindh Imran Ismail would participate.\nAazm Swati said Safari Train from Rawalpindi to Attock was a good initiative which not only help the department earn reasonable income but also fetch foreign reserves for the country.\nAddressing the ceremony, Secretary Railways Habib ur Rehman Gilani said after a long time the government was improving railway track and introducing infrastructure projects.\n“We are implementing a joint venture with the FWO,” he added.\nFWO Director General Major General Kamal Azfar said quality, savings and time were trademark of the FWO and there was no compromise on quality and work.\nKamal Azfar thanked Pakistan Railways for their trust on the FWO.",
  "retrievedAt": "2025-08-11T20:30:58.631Z"
}
