{
  "title": "Security of Swabi seminaries, mosques enhanced - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWABI: The police have enhanced security of seminaries and mosques across the district, sources told Dawn here on Saturday.\n\nThey said that the Khyber Pakhtunkhwa police chief had given instructions in this connection soon after the suicide attack on the mosque within the Darul Uloom Haqqania in Nowshera district on Feb 28.\n\nSwabi city DSP Ijaz Khan Abazai visited various madressahs, where he had detailed discussions with the caretakers and clerics over what possible steps could be taken to avoid any untoward incident during Ramazan, the sources said.\n\nSimilarly, they said police officials also visited the leading religious institutions like Madressah Markaz Darul Qur’an, Panjpir, Jamia Darul Uloom Al-Qur’an, Shahmansoor, and Khanaqah Darul Uloom.\n\nThe sources said the police officials were tasked with ensuring security of the mosques, especially during the Taraweeh prayers and Friday congregations. They said that SHOs would be responsible for the security of seminaries situated in their respective jurisdictions.\n\nMeanwhile, the police have launched patrolling during the Taraweeh prayers to avoid any unpleasant incident.\n\nCaretaker of a madressah hailed the step and said that it was perhaps the first time that security of seminaries had been enhanced.\n\nISRAELI ATROCITIES CONDEMNED: Maulana Fazal Ali, central naib emir of Jamiat Ulema-i-Islam-Fazl on Sunday demanded of the world community to take notice of Israel’s continued violations of the ceasefire agreement in Gaza.\n\nSpeaking at a party meeting, he said people of Gaza had rendered great sacrifices for the protection of the holy land.\n\nHe said the Muslim countries should put their heads together and work for emancipation of Palestine.\n\nHe said Palestinians should be supported to build their homes, hospitals, educational institutions and roads. He said the idea of US President Donald Trump to relocate Palestinians should be fully resisted because it was a conspiracy hatched by the US and Israel.\n\n“How the Palestinians could be relocated to Egypt, Jordan or Saudi Arabia,” he said, warning: “An imposed solution would be an empty solution.”\n\nMr Ali said people of Gaza should never be left alone in the difficult phase of their rehabilitation and resettlement.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:04:04.896Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896678/security-of-swabi-seminaries-mosques-enhanced",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:31:08.000Z"
}
