{
  "title": "Placement on no-fly list sans evidence illegal: IHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Isla­m­abad High Court (IHC) has directed the authorities concerned to strictly adhere to the procedure for placing any citizen on the no-fly list, emphasising that citizens’ names should not be added to the list “arbitrarily”.\n\nJustice Babar Sattar declared that placement of a citizen’s name on the Passport Control List (PCL) without tangible evidence to be illegal and unconstitutional, ordering the immediate removal of the petitioner’s name from the list and restoring his right to travel freely.\n\nWhile deciding the petition of Nadir Mukhtiar recently, Justice Sattar found that the Directorate of Immigration and Pass­ports had violated due process and fundamental rig­hts by restricting the petitioner’s ability to travel abroad without proper legal justification.\n\nAdvocate Nisar Ahmed Shah had filed the petition on behalf of Mr Mukhtiar, who had been deported from the UAE in mid-2024 following a local altercation. Upon his return to Pakistan, he obtained a valid Pakistani passport and a work visa for Oman.\n\nHowever, on Dec 5, 2024, despite clearing immigration and receiving the exit stamp at Islamabad Inter­na­tional Airport, he was prevented from boarding his flight due to his name being placed on the PCL.\n\nAfter his requests for removal from the list were ignored, he filed a writ petition in the IHC, challenging the legality of the travel restrictions.\n\nJustice Sattar ruled that the Directorate of Immigration and Passports had acted beyond its legal authority and violated constitutional rights by placing Mr Mukhtiar on the PCL without issuing him a notice or providing him an opportunity to be heard.\n\nThe judge noted that no legal justification was given for placing Mr Mukhtiar on the PCL. The directorate failed to follow the procedural requirements under the Passport Rules 2021, which violated articles 9, 10-A and 15 of the Constitution, guaranteeing personal liberty, due process and freedom of movement.\n\nNo formal order was issued regarding the impounding, confiscation or cancellation of his passport, the court added.\n\nThe court declared the placement of Mr Mu­khtiar’s name on the PCL illegal and ins­t­ructed the relevant authorities to immediately remove his name from the list. The judgement also directed the director general of Immi­gr­ation and Passports to ensure that citizens are not arbitrarily added to the PCL in the future.\n\n“The petitioner’s fundamental rights have been violated without any legal basis,” the ruling stated, adding that authorities must follow due process before restricting a citizen’s travel.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/090743324d52396.png",
  "retrievedAt": "2025-08-25T15:04:34.614Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896695/placement-on-no-fly-list-sans-evidence-illegal-ihc",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:29:55.000Z"
}
