{
  "title": "Exchange firms see $5bn inflow by end of Ramazan - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Inflows of remittances are higher than ever and the exchange companies alone could accumulate $5 billion by the end of Ramazan, said exch­ange companies on Saturday.\n\n“We have already sold $3.5 to $4bn to the banks during the first 8 months of FY25 while Ramazan would add more to the total,” said Zafar Paracha, Secretary General of the Exchange Companies Association of Pakistan.\n\nThe country received $20.9bn in remittances in July-January FY25 compared to $15.8bn a year ago, up 32.27pc, exceeding the $5bn growth projection for FY25 in the first seven months.\n\n“We are sure by the end of Ramazan we would be able to sell $5bn to the banks, which would be a great achievement,” said Mr Paracha.\n\nThe exchange companies have been asking the government to facilitate overseas Pakistanis for boosting inflows instead of doling out subsidies to exporters.\n\nHowever, the strong lobby of exporters is getting benefits but has failed to bring any significant increase while the remittances have already exceeded the export proceeds.\n\n“We are sure more incentives and some policy changes could double the remittances,” said Mr Paracha.\n\nSome money market experts questioned the government’s wisdom in putting the country under the clutches of the IMF for a bailout package of $7bn. A forensic audit of the economy is being carried out by a visiting IMF mission to decide the release of the second tranche of $1.1bn under the Extended Fund Facility.\n\n“The IMF will provide $7bn in 37 months while the overseas Pakistanis provide $35bn in one year,” remarked a market expert, requesting anonymity.\n\n“These Pakistanis should be given more care than the IMF,” said an exchange company owner. The higher inflows of remittances have stabilised the exchange rate and helped the State Bank maintain foreign exchange reserves by purchasing dollars from the interbank market. The SBP bought about $3.8bn from banks in the first four months of the current fiscal year.\n\nHistorically, the central bank buys dollars to keep substantial reserves to stabilise the exchange rate. However, the money market experts said the amount raised by the SBP is too big compared to the commercial borrowings the country has made during the period.\n\nMr Parach said the average monthly inflows through the exchange companies during the first 8 months of the current fiscal year were $400 to $450 million.\n\nOne of the key reasons for the higher remittances was the government’s crackdown against illegal currency businesses. At the same time, money-laundering has also gone down, said a currency expert.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:04:19.016Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896728/exchange-firms-see-5bn-inflow-by-end-of-ramazan",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:30:15.000Z"
}
