{
  "title": "PM Shehbaz pledges gender equality, unveils endowment fund - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Announces initiative to integrate women into SME sector\n• Women entrepreneurs to get low-cost loans\n• Facilitation centres, training institutes to be set up\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Saturday reaffirmed his commitment to gender equality, stressing that women’s empowerment could only be achieved through equal access to education, skill development and employment opportunities.\n\n“It’s our mission and an unwavering commitment to ensure emancipation of the country’s female population,” he said while addressing an event in Islamabad marking International Women’s Day, observed globally on March 8 to celebrate women’s achievements and advocate for their rights.\n\nProminent women from various fields, including cabinet members, legislators, entrepreneurs and activists, attended the event at the Prime Minister’s House. It was organised by the Ministry of Human Rights and the National Commission on the Status of Women (NCSW) in collaboration with the United Nations Population Fund (UNFPA).\n\nDuring the event, PM Shehbaz launched Islamabad’s first-ever Gender Parity Report, prepared by the NCSW and UNFPA. The report identifies challenges and solutions in key areas such as education, health, governance, political representation and justice.\n\nThe prime minister pledged collaboration with provinces to enh­ance women’s participation in economic programmes and announced the establishment of a Working Women’s Endowment Fund to support women in overcoming contemporary workplace challenges.\n\n“Our 50 per cent female population can become a productive workforce if provided a level playing field,” he said.\n\nTo facilitate working women, he highlighted the establishment of daycare centres in public and private departments across Islamabad, with plans to expand these facilities further.\n\nThe premier regretted that a large number of highly qualified women in the country quit professional careers in their struggle to balance work and families, resulting in a huge loss of skilled human resources.\n\nPM Shehbaz paid tribute to Pakistani women who have played significant roles in female empowerment, mentioning Fatima Jinnah and Begum Raana Liaquat Ali Khan, former PM Benazir Bhutto, Bilquis Edhi, Dr Ruth Pfau, Asma Jahangir and other trailblazers.\n\nThe prime minister recalled his party’s past efforts for women’s emancipation, including Punjab’s first anti-violence centres for women, increased women’s quota in government department boards, higher stipends for girl students, eradication of child labour at brick kilns, and enrolling 90,000 children into schools.\n\nRanking review\n\nMinister for Law Azam Nazeer Tarar said that in line with the prime minister’s directive, ministries and departments were tasked last year with ensuring women-inclusive policies, leading to increased women representation in departmental boards.\n\nHowever, he acknowledged that Pakistan ranks 145th out of 146 countries on the Global Gender Gap Index, second only to Afghanistan. He called for a review of the ranking, arguing it did not reflect ground realities.\n\nUN Resident Coordinator Moha­med Yahya reaffirmed the UN’s support for Pakistan in achieving Sustainable Development Goals (SDGs) 2030, particularly those related to gender equality.\n\nHe stressed that gender equality must be recognised not as a women-specific issue but as a human issue.\n\nChairwoman of the Special Committee on Gender Mainstr­eaming Dr Nafisa Shah highlighted that women’s representation in government bodies remains below the targeted 33pc benchmark, stressing the need for greater inclusion in governance and policymaking.\n\nSecurities and Exchange Commission of Pakistan (SECP) Chairman Akif Saeed highlighted the PM’s Women Empowerment Package, under which private companies implementing family-friendly workplace policies were recognised as role models.\n\nThe prime minister also presented Family-Friendly Workplace Awards to the 10 best private companies, including Alpha Beta Core Solutions, Arfa Karim Technology Incubator, and Aviation MRO.\n\nSME integration, low-cost loans\n\nPM Shehbaz also unveiled a major initiative to integrate women in cottage industries and small businesses into the Small and Medium Enterprise (SME) sector.\n\nThe announcement was made during a review meeting on ongoing reforms under the Small and Medium Enterprise Development Authority (SMEDA), held in Lahore on Saturday.\n\nSpeaking at the meeting, the prime minister emphasised the need for women’s economic empowerment and directed authorities to provide essential capital and facilities on a priority basis to businesswomen in the cottage industry.\n\nHe also announced measures to offer low-cost loans to women under the Youth Loan Scheme, enabling them to expand their businesses.\n\nThe prime minister ordered the establishment of facilitation centres and training institutes to support women engaged in small-scale businesses and ensure their easy access to these resources.\n\nTo strengthen this initiative, he announced the formation of a special committee tasked with developing a comprehensive plan for empowering women through business opportunities.\n\nThe committee will soon present its recommendations to the prime minister.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67ccb9ac64f8a.jpg",
  "retrievedAt": "2025-10-12T01:52:09.085Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896696/pm-shehbaz-pledges-gender-equality-unveils-endowment-fund",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:29:54.000Z"
}
