{
  "title": "President upholds ombudsperson’s order in workplace harassment case - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The president has dismissed an appeal filed by four government officials accused of workplace harassment, upholding the interim order of the federal ombudsperson in the case.\n\nAs per legal provisions, any person or party aggrieved by a decision, order, findings, or recommendations of an ombudsperson may file a representation to the president within thirty days.\n\nInitiating a legal battle concerning workplace harassment and gender discrimination, Dr Saima Huma Tanveer, director of PASTIC, filed a complaint against four senior officials of the Pakistan Science Foundation (PSF) and the Pakistan Museum of Natural History (PMNH).\n\nThe case, lodged under the Protection Against Harassment of Women at Workplace Act, 2010 (Amended 2022), had raised concerns about gender bias, professional misconduct, and the failure of internal committees to address grievances in a timely manner.\n\nDr Saima alleged that she faced gender-based discrimination from Dr. Hafeezullah Khan, director of Science Popularisation at PSF; Haider Zaman Khattak, secretary at PSF; Dr Malik Muhammad Afzal, deputy director at PMNH; and Dr S. Lal Shah, director of Public Service Division at PMNH.\n\nAccording to the complainant, she was subjected to discriminatory practices, exclusion from opportunities, and professional belittlement solely due to her gender. She formally filed her complaint on April 25, 2024, and May 6, 2024. However, despite legal mandates requiring a prompt inquiry within 30 days, no action was taken for several months.\n\nThe Federal Ombudsperson for Protection Against Harassment of Women at the Workplace (FOSPAH) reviewed the complaint and issued an interim order on September 23, 2024. The order stated that the complainant’s allegations indicated a discriminatory mindset among the accused. While allegations alone do not establish guilt, the complainant must be given the opportunity to present evidence.\n\nIt was noted that the internal inquiry committee failed to act within the legally mandated timeframe, indicating negligence. The complaint was deemed maintainable, allowing the case to proceed to further hearings and evidence collection. The case was scheduled for the complainant’s evidence hearing on October 7, 2024.\n\nLater the officials, represented by legal counsel, appealed to the president, arguing that the case was an administrative and service matter, not one of harassment under the FOSPAH Act.\n\nThey also contended that there was no direct evidence proving harassment or discrimination and that the complainant had no direct affiliation with PMNH and was unlawfully attempting to retain a position outside her jurisdiction. Furthermore, legal cases were cited to argue that FOSPAH had no jurisdiction over service-related disputes.\n\nOn January 7, 2025, a hearing was held, attended by the accused, the complainant, and their respective legal representatives.\n\nThe petitioners’ counsel acknowledged that while specific allegations existed against some of the accused, others should be removed from the case due to a lack of evidence. However, it was later revealed that no formal application for removal had been filed. After reviewing the arguments, the ombudsperson found no infirmity in the initial order and upheld the decision to proceed with the case. The representation was subsequently dismissed.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:04:04.994Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896665/president-upholds-ombudspersons-order-in-workplace-harassment-case",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:31:01.000Z"
}
