{
  "title": "Syria president calls for unity after reports of mass killings - World - DAWN.COM",
  "author": null,
  "content": "Syrian President Ahmed al-Sharaa called for national unity and peace on Sunday amid a growing international backlash following the killing of Alawite civilians in the worst violence since the overthrow of Bashar al-Assad.\n\nUnited Nations rights chief Volker Turk said the killings “must cease immediately”, while the Arab League, the United Nations, the United States and other governments have condemned the violence.\n\nThe presidency announced on Telegram that an “independent committee” had been formed to “investigate the violations against civilians and identify those responsible for them”, who would face the courts.\n\nClashes between the new security forces and loyalists of the former government erupted on Thursday in the heartland of the Alawite minority to which Assad belongs and have since escalated into reported mass killings.\n\nSpeaking from a mosque in Damascus, Sharaa said: “We must preserve national unity [and] civil peace as much as possible and, God willing, we will be able to live together in this country.”\n\nThe Syrian Observatory for Human Rights war monitor has reported that 745 Alawite civilians were killed in the coastal Latakia and Tartus provinces.\n\nThe Britain-based Observatory said they were killed in “executions” carried out by security personnel or pro-government fighters and were followed by looting. The fighting has also killed 125 members of the security forces and 148 pro-Assad fighters, according to the Observatory, taking the overall death toll to 1,018.\n\nThe interior ministry said on Sunday that government forces were conducting “sweeping operations in Qadmous and the surrounding villages” in Tartus province to “pursue the remnants of the toppled regime”.\n\nState news agency SANA quoted a defence ministry source as saying there were violent clashes ongoing in Tanita, another Tartus village.\n\nAn AFP photographer in the city of Latakia reported a military convoy entering the Bisnada neighbourhood to search homes.\n\nIn Baniyas, a city to the south, resident Samir Haidar, 67, told AFP two of his brothers and his nephew were killed by armed groups that entered people’s homes, adding that there were “foreigners among them”.\n\n“They gathered all the men on the roof and opened fire on them,” Haidar said.\n\nDefence ministry spokesman Hassan Abdul Ghani said on Saturday that the security forces had “reimposed control” over areas that had seen attacks by Assad loyalists.\n\nThe mass killings followed clashes sparked by the arrest of a wanted suspect in a predominantly Alawite village, the Observatory said, reporting a “relative return to calm” in the coastal region on Saturday.\n\nThe head of the World Health Organisation, Tedros Adhanom Ghebreyesus, said medical facilities had been damaged in the clashes and that the UN agency was “working to deliver medicines and trauma supplies”.\n\nChief US diplomat Marco Rubio said Syria “must hold the perpetrators of these massacres against Syria’s minority communities accountable”, while Germany’s foreign ministry said the Syrian authorities had “a responsibility to prevent further attacks”.\n\nA defence ministry source told SANA that troops had blocked roads leading to the coast to prevent “violations”, without specifying who was committing them. Latakia province security director Mustafa Kneifati told the news agency: “We will not allow for sedition or the targeting of any component of the Syrian people.”\n\nSharaa’s group Hayat Tahrir al-Sham (HTS), which led the toppling of Assad in December, has its roots in the Syrian branch of Al-Qaeda and remains proscribed as a terrorist organisation by many governments, including the United States.\n\nSince the rebel victory, it has vowed to protect Syria’s religious and ethnic minorities.\n\nThe UN’s Turk said in a statement there had been a “continuous spike in hate speech both online and offline” in Syria and insisted there was an “urgent need for a comprehensive transitional justice process”.\n\nIsraeli Foreign Minister Gideon Saar, speaking to German newspaper Bild, said Europe “must wake up” and “stop granting legitimacy” to the new Syrian authorities who he insisted were still “jihadists”.\n\nThe Alawite heartland has been gripped by fear of reprisals for the Assad family’s brutal five-decade rule, which included widespread torture and disappearances. Social media users have shared posts documenting the killing of Alawite friends and relatives.\n\nThe Observatory, which relies on a network of sources in Syria, reported multiple “massacres” in recent days, with women and children among the dead. The Observatory and activists released footage showing dozens of bodies piled outside a house. Other videos appeared to show men in military garb shooting people at close range.\n\nAFP could not independently verify the images or accounts.\n\nDuring a sermon on Sunday in Damascus, the Greek Orthodox Patriarch of Antioch John X said Christians were among those killed and called on Sharaa to “put a stop to these massacres … and give a sense of safety and security to all the people of Syria, regardless of their sect”.\n\nAron Lund of the Century International think tank said the violence was “a bad omen”. He said the new government lacks the tools, incentives and local support base to engage with disgruntled Alawites.\n\n“All they have is repressive power, and a lot of that … is made up of jihadist zealots who think Alawites are enemies of God,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/09150622ddfec6a.jpg",
  "retrievedAt": "2025-08-25T15:04:02.716Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896811/syria-president-calls-for-unity-after-reports-of-mass-killings",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T10:16:42.000Z"
}
