{
  "title": "Salah fires Liverpool 16 points clear, Forest beat City - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Premier League leaders Liverpool needed two Mohamed Salah penalties to beat bottom-of-the-table Southampton 3-1 on Saturday, while Nottingham Forest took a giant step towards the Champions League with a 1-0 win over Manchester City.\n\nLiverpool stretched their lead at the top to a massive 16 points, despite a sloppy first 45 minutes.\n\nFresh from a smash-and-grab 1-0 Champions League victory over Paris St-Germain, Liverpool boss Arne Slot made just three changes.\n\nHowever, the Dutchman was forced into making three half-time alterations to kickstart the champions-elect.\n\nSouthampton have taken just nine points from 28 games all season, but stunned Anfield when Will Smallbone fired the visitors in front in first-half stoppage time.\n\nAlisson Becker was Liverpool’s hero at the Parc des Princes on Wednesday but the Brazilian and Virgil van Dijk got in each other’s way to allow Smallbone to roll into an unguarded net.\n\nSlot turned to Harvey Elliott, Alexis MacAllister and Andy Robertson at the break, and the changes had the desired effect with two goals in three minutes before the hour mark.\n\nDarwin Nunez levelled with a sharp near-post finish from Luis Diaz’s cross.\n\nNunez was then upended inside the area and Salah converted from the spot.\n\nThe Egyptian slotted home a second penalty two minutes from time to take his tally for the season to 32 goals.\n\nSecond-placed Arsenal have two games in hand on the leaders, the first of which comes away to Manchester United on Sunday.\n\nBut it appears a matter of when not if Liverpool will clinch just their second league title in 35 years.\n\nEarlier on Saturday, Forest pulled four points clear of City in third thanks to Callum Hudson-Odoi’s late winner at the City Ground.\n\nThe former Chelsea winger fired past Ederson on 83 minutes from Morgan Gibbs-White’s pass to spark jubilant scenes of celebration as Forest beat the English champions for the first time since 1997.\n\nTwo-time European champions, Forest have not experienced the continent’s top competition since 1980.\n\nBut they are closing in on the Champions League with a top-five finish almost certain to be enough thanks to the strong performance of English teams in Europe this season.\n\n“We are not here to joke”, Hudson-Odoi posted on social media. “Goal, MOTM (man-of-the-match), three points!”\n\nCity remain fourth and are looking over their shoulders after a ninth league defeat of the season.\n\nPep Guardiola’s men are likely to be overtaken by Chelsea, when they host struggling Leicester City on Sunday.\n\nElsewhere, Crystal Palace shrugged off the loss of top scorer Jean-Philippe Mateta to a serious ear injury to beat Ipswich Town 1-0 thanks to Ismaila Sarr’s winner.\n\nThe Eagles have won nine of their last 11 games in all competitions and climb to 11th.\n\nBrighton and Hove Albion boosted their own Champions League hopes courtesy of Joao Pedro’s 98th-minute penalty to beat Fulham 2-1.\n\nRaul Jimenez’s spectacular strike opened the scoring for Fulham, but Jean Paul van Hecke levelled before half-time.\n\nPedro’s spot-kick lifts the Seagulls to sixth and within one point of City.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67cce6a958874.gif",
  "retrievedAt": "2025-08-25T15:04:06.600Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896731/salah-fires-liverpool-16-points-clear-forest-beat-city",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:30:41.000Z"
}
