{
  "title": "Tax rationalisation must for boosting exports: Pakistan Textile Exporter Association - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The value-added textile and clothing sector has asked the government to lower tax rates to boost export competitiveness.\n\nThis demand was part of a string of proposals submitted to the finance ministry by the Pakistan Textile Exporter Association (PTEA) for incorporation in the budget 2025-26.\n\nThe value-added manufacturers urged the government to remove the double taxation on the export sector. The exports have started declining, worrying industry players.\n\nIn the last budget, the association maintained that banks collected 1pc advance tax against export proceeds, which is declared as a minimum tax instead of a final tax. Simultaneously, an advance tax at the rate of 1pc has been levied through the insertion of sub-section (6C) in section 147.\n\nHowever, local suppliers are liable to pay a 1pc advance tax on local supplies of textile goods and 0.5pc for yarn traders. The treatment meted out to the exporters is discriminatory and against the principles of equity and natural justice, according to PTEA.\n\nPTEA submits proposals for budget FY26\n\nThe PTEA demands that advance tax on export proceeds be reduced to 1pc to ease the financial burden on exporters. Moreover, the final tax regime should be restored for the exporters, and the super tax should be abolished.\n\nThe current Export Facilitation Scheme (EFS) ceiling through EXIM Bank is capped at Rs235 billion. This should be increased in phases to at least Rs1.2 trillion to meet capital requirements. This expansion is crucial to enhancing textile exports to $35bn by 2030.\n\nThe excessive protection provided to local polyester fibre manufacturers has caused significant losses to the value-added export sector and the same must be eliminated to ensure competitiveness and also enable Pakistani exporters to tap synthetic valued-added garments, which has the highest demand and consumption globally.\n\nIt was pointed out that reducing duties in line with regional competitors — Vietnam, China, Turkiye — would enhance the value-added textile sector’s ability to compete globally and attract synthetic garment exports.\n\nThe cash withdrawals should be capped at 10pc based on a company’s previous year’s annual turnover to encourage digital transactions.\n\nIt was proposed to allow back-to-back LCs against master LCs with a mandatory 35pc value addition to promote value-added exports without additional securities.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:04:18.413Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896725/tax-rationalisation-must-for-boosting-exports-pakistan-textile-exporter-association",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:30:15.000Z"
}
