{
  "title": "US trade tensions with Mexico, Canada will make FIFA World Cup more exciting: Trump - Sport - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Political and economic tensions between the United States and its 2026 World Cup co-hosts Canada and Mexico will make the tournament more exciting, US President Donald Trump said after signing an executive order to create a task force for the event.\n\nSpeaking in the Oval Office alongside FIFA president Gianni Infantino, Trump said the task force, which he will chair, would co-ordinate with federal agencies in planning, organising and executing the 48-team global football tournament.\n\nEarlier this week, the Trump administration imposed across-the-board 25% tariffs on goods from Canada and Mexico before announcing on Thursday a one-month reprieve for both countries on goods compliant under a North American trade pact.\n\nWhen asked about the World Cup in light of the current trade tensions between the three nations, Trump said on Friday, “I think it’s going to make it more exciting. Tension is a good thing, it makes it much more exciting.”\n\nThe exemptions for the two largest US trading partners, expire on April 2, when Trump has threatened to impose a global regime of reciprocal tariffs on all US trading partners.\n\nTrump said the task force would assist in planning for what his executive order described as the “largest sporting event in history.”\n\n“We’re going to be establishing a task force, a very important task force — White House — and that’s on the FIFA World Cup of 2026 which, as you know, is a big event,” Trump said.\n\nInfantino meanwhile said the 2026 World Cup — and this summer’s FIFA Club World Cup in the United States — would create 200,000 jobs and have an economic impact of $40 billion.\n\n“And more than that, we will give joy and happiness to the entire world, and this is priceless, definitely,” Infantino added. “So thank you, Mr President, for setting up this task force, because it is important that everyone that comes to America feels safe, feels welcome, and that’s why it’s important that the government puts together this White House Task Force.”\n\nInfantino meanwhile added that the scale of next year’s World Cup — which is being expanded to include 48 teams — was equivalent to staging three NFL Super Bowls a day for one month.\n\n“That’s really amazing when you think of it,” Trump remarked. “I’ve never heard that expressed.”\n\nThe World Cup will run from June 11 to July 19, 2026. The expanded tournament will feature 104 matches instead of the previous 64 games, including an additional knockout round.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67cce800a8544.gif",
  "retrievedAt": "2025-10-12T01:52:11.019Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896741/us-trade-tensions-with-mexico-canada-will-make-fifa-world-cup-more-exciting-trump",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:30:40.000Z"
}
