{
  "title": "Islamabad police officials booked two months after ‘abduction’ of citizen - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A kidnapping case has been registered against unidentified officials of Islamabad police more than two months after they allegedly picked up a citizen from the rural area of Islamabad, Dawn has learnt.\n\nThis was the second kidnapping case registered against officials of the capital police in about two weeks.\n\nThe case has been registered at the Bhara Kahu police station in response to a complaint lodged by Sanaullah. According to the FIR, the complainant stated that two vehicles of police along with some private cars abducted his brother from the house of a relative at 17 Meel.\n\nTalking to Dawn, Sanaullah, a wholesale cloth dealer, said his brother Wasidullah had come to Islamabad from Bannu and was staying with a relative when he was abducted by a police team riding official vehicles, including those belonging to the Bhara Kahu police station, along with private cars on December 31, 2024.\n\nHe lodged a complaint with the Bhara Kahu police, but the police refused to register a case. Sanaullah said he then approached senior officers, including the station house officer, subdivisional police officer, superintendent of police, senior superintendent of police and the deputy inspector general of police, seeking registration of a case, but got no positive response from anyone of them.\n\nLater, he added, he approached some influential persons from KP and after a few days came to know that the Bhara Kahu police had registered a kidnapping case on March 7.\n\nHe said his brother had come to Islamabad to purchase land and was also carrying cash, but he (Sanaullah) did not know about the exact amount. Wasidullah had met a number of people to purchase land but at noon on Dec 31 unidentified policemen in uniform and police vehicles along with some private cars took him away from his relative’s house. His relative and some other people in the area were witness to the kidnapping, he added.\n\nHe said he had asked the police officers to furnish the reasons behind the abduction of his brother and make it a formal arrest and produce him in court if he was wanted in connection with any illegal activity.\n\nIt may be noted that in the last week of February, unidentified police officials along with others were booked for kidnapping a citizen.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:04:04.967Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896668/islamabad-police-officials-booked-two-months-after-abduction-of-citizen",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:31:01.000Z"
}
