{
  "title": "Dispute between ex-SHC CJ Sajjad Ali Shah, judicial officer lands in Supreme Court - Pakistan - DAWN.COM",
  "author": null,
  "content": "• SHC registrar moves appeal against reinstatement of ex-district and sessions judge, seeks clarity on tribunal’s domain\n• Ex-judge says dismissed without chance of hearing, argues complainant also acted as adjudicator\n\nISLAMABAD: The Supreme Court is seized with a dispute, wherein a former judicial officer from Sindh in his struggle to be reinstated back to his office is posing a challenge to a decision made by the highest adjudicator in his province — a former chief justice of the Sindh High Court.\n\nFormer District and Sessions judge Aijaz Ali Khaskheli, who joined the judicial service in 1996 in Sindh, was removed from office in 2016 by then SHC CJ Sajjad Ali Shah, who was later elevated to the Supreme Court before reaching superannuation in 2022.\n\nThe controversy at hand is an appeal, which has been moved by former SHC chief justice through the SHC registrar, seeking clarity on a law point, whether a service tribunal can interfere into the lawful exercise of discretion by the competent authority (CJ-SHC) in awarding punishment.\n\nMr Khaskheli, who was removed as judge of the accountability court in Hyderabad in 2016, is the respondent in the appeal. He was appointed as a civil judge in 1996 in Sindh and later promoted to the position of district and sessions judge in 2014. In 2016, the respondent judge was suspended and subsequently dismissed from service following disciplinary proceedings initiated by the then SHC CJ on the allegations of misconduct.\n\nSubsequently, the former judicial officer approached the Sindh Subor­dinate Judicial Service Tribunal, which on Sept 30, 2024, ruled in his favour. The tribunal found that the disciplinary proceedings were procedurally flawed and that the penalty of dismissal was disproportionate to the alleged misconduct.\n\nThe tribunal also highlighted that the then chief justice, who was the complainant in the case, had acted as both the initiating and punishing authority, violating the principle of ‘nemo judex in causa sua’, which means no one should be a judge in their cause.\n\nThe appeal was taken up for hearing by a two-judge Supreme Court bench consisting of Justice Irfan Saadat Khan and Justice Aqeel Ahmed Abbasi in December last year. The respondent judge was represented by Advocate Malik Naeem Iqbal, whereas Advocate Shahid Anwar Bajwa appeared on behalf of the registrar.\n\nControversy over removal\n\nThe controversy erupted when the respondent judge issued an “unlawful notice” to the then Hyd­erabad commissioner asking the latter for personal attendance. The notice stated that the funds relating to the compound wall of a bungalow occupied by the respondent judge were withheld by the commissioner.\n\nThe commissioner approached the office of the registrar, who brought the matter to the attention of the then-CJ. The respondent judge was subsequently dismissed from the service.\n\nWhen the service tribunal decided in favour of the respondent judge last year, the matter landed in the apex court, with the SHC registrar arguing that the tribunal’s decision should be overturned. The petitioner contended the tribunal erred in its application of the law and that the dismissal was justified.\n\nOn the other hand, the respondent judge informed the apex court through his legal counsel that the disciplinary proceedings were fundamentally flawed as the SHC CJ, who initiated the complaint, also acted as the punishing authority. This violates the principle of natural justice and requires that no one should be a judge in their own cause, he added.\n\nThe response furnished by the respondent also contended that the disciplinary proceedings were initiated without first repatriating him to his parent department, as required by the Sindh Civil Servants (E&D) Rules, 1973. It was further argued that the accused was removed without a regular departmental inquiry, which was mandatory under the relevant disciplinary rules.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:52:04.864Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896772/dispute-between-ex-shc-cj-sajjad-ali-shah-judicial-officer-lands-in-supreme-court",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:30:07.000Z"
}
