{
  "title": "Poliovirus detected in sewage samples from 14 districts - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Sewage samples collected from 14 districts have tested positive for the poliovirus, indicating the presence of the virus in these areas.\n\nAccording to an official of the Reg­ional Reference Laboratory for Polio Eradication at the National Institute of Health (NIH), samples were colle­cted from 43 districts across Pakistan.\n\nThe lab official confirmed the detection of wild poliovirus type 1 (WPV1) in sewage samples of Gwa­dar, Kech, Khuzdar, Qila Saifullah, Nasirabad, Quetta, Usta Muham­mad, Lahore, Sargodha, Karachi East, Karachi South, Abbottabad, Bannu and Tank.\n\nMeanwhile, samples from Muzaf­far­abad, Gilgit, Diamer, Islamabad, Dukki, Mastung, Barkhan, Hub, La­h­­ore, Guj­rat, Bahawalpur, Rawal­pi­ndi, Sahiwal, Okara, Mianwali, Att­o­­ck, Jhang, Bah­a­walnagar, Khane­wal, D.I. Khan, Manse­hra, Pesha­war, Swat, Nowshera, Batta­g­ram, Dir Lower, Charsadda, Mardan and North Waz­iristan tested negative for poliovirus.\n\nThe Pakistan Polio Eradication Prog­ramme held an event on Int­ernational Women’s Day 2025 to recognise the role of female health workers in polio eradication initiatives across the country.\n\nThe event, held at the National Emergency Operations Centre (NEOC) in Islamabad, acknowledged the dedication of more than 58.4pc female polio workers who work in some of the most challenging environments.\n\nThe event was attended by national and provincial coordinators and senior officials.\n\nWomen health workers shared their perspectives from across the country through video messages.\n\nThe polio programme leadership reaffirmed the commitment to im­­proving the working conditions and protection of women in the field.\n\nThe prime minister’s focal person on polio, Ayesha Raza Farooq, em­­phasised the government’s commitment to creating a safe and empowering environment for female frontline workers.\n\n“Today, as we commemorate International Women’s Day, I want to reaffirm our collective commitment to ensuring a safe, dignified, and enabling environment for every female frontline worker.”\n\nShe said the polio programme has developed a comprehensive Anti-Harassment Policy, aligned with the Protection against Harassment of Women at the Workplace Act, to safeguard the well-being and professional growth of women workers.\n\n“Every worker has the right to a respectful workplace, free from harassment,” she stated.\n\nWhile addressing the event, Anwarul Haq, the national coordinator of NEOC, paid tribute to the resilience and dedication of female frontline workers.\n\n“This year’s theme resonates dee­ply with us at the National Emer­gency Operations Centre as we honour female polio workers who are considered as the backbone of Pakistan’ss polio eradication efforts.” He added that women health workers work tirelessly, often in difficult and high-risk areas, to ensure every child receives the life-saving polio vaccine.\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:52:09.021Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896771/poliovirus-detected-in-sewage-samples-from-14-districts",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:30:07.000Z"
}
