{
  "title": "Gaza protesters force their way into Trump’s Scottish golf resort - World - DAWN.COM",
  "author": null,
  "content": "LONDON: US President Donald Trump’s prized Turnberry golf resort in Scotland has been vandalised by protesters who sprayed “GAZA IS NOT 4 SALE” in huge white letters on the lawn.\n\nThe activists also damaged greens and sprayed blood-red paint over the luxury resort’s clubhouse overnight on Saturday.\n\nThe Palestine Action group said it was a “direct response to the US administration’s stated intent to ethnically cleanse Gaza”.\n\nTrump sparked outrage last month when he suggested the US “take over” Gaza and turn it into the “Riviera of the Middle East”, while forcing its Palestinian inhabitants to relocate to Egypt or Jordan.\n\nThe activists cited an AI-generated video the US president shared online last week, which showed the razed Palestinian territory rebuilt as a Trump-branded seaside resort.\n\nOne scene showed Trump and Israeli Prime Minister Benjamin Netanyahu sipping cocktails in swimsuits by a pool.\n\n“Whilst Trump attempts to treat Gaza as his property, he should know his own property is within reach,” Palestine Action said on social media.\n\nPolice Scotland said it was investigating after receiving a report of damage at around 0440 GMT on Saturday.\n\nThe Turnberry property in southwest Scotland is one of two resorts that Trump owns in the country, his mother’s ancestral home.\n\nA spokesman for Trump Turnberry said: “This was a childish, criminal act but the incredible team at Trump Turnberry will ensure it does not impact business.\n\n“Turnberry is a national treasure and will continue to be the number one beacon of luxury and excellence in the world of golf.”\n\nPublished in Dawn, March 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:52:06.824Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896759/gaza-protesters-force-their-way-into-trumps-scottish-golf-resort",
  "dateList": "2025-03-09",
  "date_published": "2025-03-09T01:30:31.000Z"
}
