{
  "article_id": "2025-01-06_1e64b022b426cddfd7191f70c498e401",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nips-organizes-seminar-to-highlight-strong-pak-us-ties/",
    "retrieved_at": "2025-08-27T11:24:50.800Z"
  },
  "metadata": {
    "title": "NIPS organizes seminar to highlight strong Pak-US ties",
    "author": null,
    "date_published": "2025-01-06T14:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 281,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 6 (APP):The NUST Institute of Policy Studies (NIPS) on Monday organizes a seminar to highlight the enduring and dynamic relationship between Pakistan and United States, underscored the continuing relevance of two states partnership for regional peace, stability and security. The seminar was organized a keynote address on aPak-U.S. Relationsa by Pakistanas Ambassador to the United States, Rizwan Saeed Sheikh and Rector NUST Dr Muhammad Zahid Latif, greeted the honourable guest upon arrival, and briefly apprised him about the universityas multidimensional knowledge capabilities, said a press release. The event moderated by Dr Ashfaque Hasan Khan, DG NIPS, the session was attended by statesmen, former senior civil and military officials, veteran ambassadors, public officials, academics, think tank experts, scholars, researchers, and students. There was an expert consensus during the session that pragmatic cooperation and mutual respect are key in unlocking long-term opportunities for bilateral ties. The deliberative exchange emphasized the importance of adopting a forward-looking and merit-based approach to further strengthening the bilateral relations. There was a clarion call during the discussion for increased academic, think tank, S&T, and innovation-based collaborations between Pakistani and American knowledge-based institutions. By leveraging knowledge diplomacy, both countries can deepen common understanding and address pressing global and regional challenges effectively. The attendees also stressed the significance of increased Pak-U.S. business-to-business exchanges and enhanced trade linkages. It was agreed unanimously that greater cooperation in the sectors of agriculture, higher education, advanced ICTs, renewable energy, healthcare, and minerals would be mutually advantageous. The discussants considered that the bilateral dialogue on regional security and stability was a good thing. The session concluded while stressing the importance of fostering greater bilateral engagement for regional and global growth development, and prosperity.",
    "summary": "The NUST Institute of Policy Studies (NIPS) held a seminar to highlight the strong relationship between Pakistan and the United States, emphasizing the importance of their partnership for regional peace and security. Key speakers included Pakistan's Ambassador to the United States, Rizwan Saeed Sheikh, and Rector NUST Dr. Muhammad Zahid Latif. The seminar focused on pragmatic cooperation, mutual respect, and increased collaboration in various sectors to strengthen bilateral ties.",
    "keywords": [
      "Pakistan",
      "United States",
      "NIPS",
      "bilateral relations",
      "cooperation",
      "seminar",
      "knowledge diplomacy"
    ]
  },
  "entities": [
    {
      "text": "NUST Institute of Policy Studies",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Pakistan",
      "label": "LOCATION",
      "wikidata_id": "Q1042"
    },
    {
      "text": "United States",
      "label": "LOCATION",
      "wikidata_id": "Q30"
    },
    {
      "text": "Rizwan Saeed Sheikh",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "NUST",
      "label": "ORGANIZATION",
      "wikidata_id": "Q7071725"
    },
    {
      "text": "Dr Muhammad Zahid Latif",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Dr Ashfaque Hasan Khan",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "DG NIPS",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    }
  ]
}