{
  "article_id": "2025-01-06_1bb776c55311808da0d59a9d2bf83238",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/agreement-inked-for-establishment-of-national-reference-laboratory-for-department-of-plant-protection/",
    "retrieved_at": "2025-08-27T11:24:21.488Z"
  },
  "metadata": {
    "title": "Agreement inked for establishment of National Reference Laboratory for Department of Plant Protection",
    "author": null,
    "date_published": "2025-01-06T16:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 356,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KARACHI, Jan 06 (APP):Federal Minister for National Food Security & Research, Industries and Production, Rana Tanveer Hussain on Monday witnessed the signing of an agreement regarding establishment of National Reference Laboratory for Department of Plant Protection (NRL- DPP). The agreement was inked between the International Center for Chemical and Biological Sciences (ICCBS), University of Karachi and Federal Ministry of National Food Security and Research (MNFS&R) at HEJRIC ICCBS KU. The NRL- DPP will be established under the umbrella of IAC at HEJ ICCBS through the financial support of the MNFS&R while the Director ICCBS will be the sole administrative authority of the NRL-DPP. The Federal Secretary Food Security Wasim Ajmal Chaudhry, Federal Secretary Industries and Production Captain Saif Anjum, Director General Plant Protection Waqas Alam and other notables also attended the signing ceremony. Vice Chancellor University of Karachi Prof. Dr. Khalid Iraqi, former federal minister Prof. Dr. Atta-ur-Rehman and Director ICCBS Dr. Farzana Shaheen were also present. Under the agreement, the HEJ will provide testing facilities on a commercial basis for pesticide residue and related analysis through IAC. The NRL-DPP shall serve as a national facility for quality check of samples against pesticide residue and related testings and shall meet the demand of emerging challenges in food and drug testing through new and innovative method development. A Technical Evaluation Committee of NRL-DPP shall be constituted initially for five years for monitoring of overall progress of the project. The committee will continue regular meetings every year to assess the progress of the NRL-DPP. The committee will continue or be reconstituted every year for five years with the permission of the Board of Governors of ICCBS and MNFS&R. Technical staff shall be nominees of ICCBS for a period of five-year tenure which may be extendable. All technical and non-technical staff will be hired as per government rules. The hiring and firing remain under administrative control of the Director ICCBS and the staff is treated as employees of the ICCBS for administration and discipline. In the future, H.E.J. will work for accreditation of the MNFS&R NRL-DPP. The MNFS&R will be responsible for the expenditure of the entire accreditation process.",
    "summary": "An agreement was signed for the establishment of a National Reference Laboratory for the Department of Plant Protection (NRL-DPP). The laboratory will be established at the International Center for Chemical and Biological Sciences (ICCBS), University of Karachi, with financial support from the Federal Ministry of National Food Security and Research (MNFS&R). The NRL-DPP will serve as a national facility for quality checks of samples against pesticide residue and related testing.",
    "keywords": [
      "National Reference Laboratory",
      "Plant Protection",
      "ICCBS",
      "MNFS&R",
      "pesticide residue"
    ]
  },
  "entities": [
    {
      "text": "Rana Tanveer Hussain",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Department of Plant Protection",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "International Center for Chemical and Biological Sciences",
      "label": "ORGANIZATION",
      "wikidata_id": "Q6072175"
    },
    {
      "text": "University of Karachi",
      "label": "ORGANIZATION",
      "wikidata_id": "Q331575"
    },
    {
      "text": "Federal Ministry of National Food Security and Research",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Wasim Ajmal Chaudhry",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Captain Saif Anjum",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Waqas Alam",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Prof. Dr. Khalid Iraqi",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Prof. Dr. Atta-ur-Rehman",
      "label": "PERSON",
      "wikidata_id": "Q7248839"
    },
    {
      "text": "Dr. Farzana Shaheen",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "HEJ",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "KARACHI",
      "label": "LOCATION",
      "wikidata_id": "Q1034"
    }
  ]
}