{
  "article_id": "2025-01-06_e2fc5037a632f10444cb28924cdfa96f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/punctuality-of-trains-reached-96-percent/",
    "retrieved_at": "2025-08-27T11:25:57.491Z"
  },
  "metadata": {
    "title": "Punctuality of trains reached 96 percent",
    "author": null,
    "date_published": "2025-01-06T07:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 305,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 6 (APP):The overall punctuality ratio of trains has improved from 76 to 96 percent in four months owing to close monitoring and stern measures taken by Pakistan Railways at the divisional and ministry levels. aWith the punctuality of trains and concrete measures taken by the department in last three months, the number of passengers has increased by over 20 million, which is ample proof of the departmentas achievement,a an official in the Ministry of Railways told APP. He said, aPakistan Railways is also set to introduce the aTrain Driver Assistant Systema (TDAS) to help train drivers a clear view of the railway tracks up to an impressive distance of 700 meters.a aThe technology aims to enhance the safety, punctuality and efficiency of train operations during adverse weather conditions, particularly in the presence of dense smog and fog,a he added. The system, he said, aTDAS is set to revolutionize the way trains navigate through foggy landscapes. It promised not only to avert potential accidents but also to facilitate smooth train travel when visibility is severely compromised.a He said, aThe capabilities of this digital system extend beyond improved visibility; it can also identify and monitor vital elements such as signals, level crossings, gates, track obstructions, and other potential hazards within the same 700-meter radius.a The official said, aThis comprehensive approach to training management promises to reduce the risk of accidents significantly.a Initially, he said the department was planning to install the anti-fog device in four engines. However, Pakistan Railways has outlined a strategic expansion plan, with the ultimate goal of equipping all trains with this life-saving technology in the coming year. He said, aIn a move to combat the persistent challenge of fog-related train delays, Pakistan Railways has joined hands with the University of Engineering Taxila (UET) to introduce a cutting-edge aDigital Railway Driving System.a",
    "summary": "The punctuality ratio of trains in Pakistan has improved significantly, from 76% to 96%, due to the efforts of Pakistan Railways and its partners. The introduction of the Train Driver Assistant System (TDAS) is expected to enhance safety and efficiency during adverse weather conditions.",
    "keywords": [
      "Pakistan Railways",
      "Train Driver Assistant System",
      "TDAS",
      "punctuality",
      "safety",
      "efficiency"
    ]
  },
  "entities": [
    {
      "text": "ISLAMABAD",
      "label": "LOCATION",
      "wikidata_id": "Q1166"
    },
    {
      "text": "Pakistan Railways",
      "label": "ORGANIZATION",
      "wikidata_id": "Q1875110"
    },
    {
      "text": "Ministry of Railways",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "University of Engineering Taxila (UET)",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    }
  ]
}