{
  "article_id": "2025-01-06_bfc673d113e6c31742a4c5e87cfa5a74",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-reviews-psqcas-performance-over-past-three-years/",
    "retrieved_at": "2025-08-27T11:24:35.902Z"
  },
  "metadata": {
    "title": "NA body reviews PSQCAâs performance over past three years",
    "author": null,
    "date_published": "2025-01-06T14:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 289,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 6 (APP):The National Assemblyas Standing Committee on Science and Technology on Monday discussed the meetingas agenda included a comprehensive briefing by the Pakistan Standards and Quality Control Authority (PSQCA), which reviewed the Authorityas performance over the past three years. The meeting was chaired by its chairman MNA Khawaja Sheraz Mehmood and the presentation highlighted PSQCAas achievements, challenges in achieving its objectives particularly in technology, innovation, and industrial collaboration and provided an overview of its operational setup, resource allocation, and structural challenges, said a press release. The Committee stressed upon the appointment of a permanent Director General (DG) of PSQCA, and also drew attention to the permanent leadership is critical for the efficient functioning of the Authority. The Committee emphasized the need to address this issue promptly. Furthermore, the committee expressed dissatisfaction on, no permanent heads in other key institutions under the Ministry of Science and Technology. It urged the Ministry to expedite the appointment process, emphasizing that improved governance and institutional performance rely on having permanent leadership in place. The committee also recommended that the Minister of Science and Technology attend all future committee meetings to ensure productive discussions and meaningful outcomes. The committee reaffirmed its commitment in strengthening Pakistanas science and technology sector by addressing governance challenges and ensuring effective management of related institutions. The committee pledged to continue its efforts to enhance the performance and accountability of institutions under the Ministry, recognizing their vital role in the countryas socio-economic development. The meeting was attended by MNAs Muhammad Afzal (via Zoom), Shahnaz Saleem Malik, Irfan Ali Leghari, Ramesh Lal, Sher Afzal Khan, Khurram Shahzad Virk, Mian Ghous Mohammad, and Muhammad Moazzam Ali Khan, along with senior officers from the Ministry of Science and Technology and PSQCA.",
    "summary": "The National Assembly's Standing Committee on Science and Technology reviewed the Pakistan Standards and Quality Control Authority's (PSQCA) performance over the past three years. The committee stressed the urgent need for a permanent Director General for PSQCA and permanent leadership in other key institutions under the Ministry of Science and Technology. They also recommended that the Minister of Science and Technology attend future committee meetings to improve governance and outcomes.",
    "keywords": [
      "PSQCA",
      "National Assembly",
      "Pakistan",
      "Director General",
      "Science and Technology",
      "leadership",
      "governance"
    ]
  },
  "entities": [
    {
      "text": "National Assembly",
      "label": "ORGANIZATION",
      "wikidata_id": "Q127985"
    },
    {
      "text": "Pakistan",
      "label": "LOCATION",
      "wikidata_id": "Q1"
    },
    {
      "text": "PSQCA",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Khawaja Sheraz Mehmood",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Ministry of Science and Technology",
      "label": "ORGANIZATION",
      "wikidata_id": "null"
    },
    {
      "text": "Islamabad",
      "label": "LOCATION",
      "wikidata_id": "Q1166"
    },
    {
      "text": "Muhammad Afzal",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Shahnaz Saleem Malik",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Irfan Ali Leghari",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Ramesh Lal",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Sher Afzal Khan",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Khurram Shahzad Virk",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Mian Ghous Mohammad",
      "label": "PERSON",
      "wikidata_id": "null"
    },
    {
      "text": "Muhammad Moazzam Ali Khan",
      "label": "PERSON",
      "wikidata_id": "null"
    }
  ]
}