{
  "title": "IHC questions maintainability of petition for registration of Al-Qadir Trust",
  "author": null,
  "content": "ISLAMABAD, Feb 18 (APP):The Islamabad High Court (IHC) on Tuesday declared that the petition regarding the registration of Al-Qadir Trust University couldn’t be heard as it has already been confiscated on direction of trial court.\nThe court asked the lawyer to satisfy it on next hearing that how the case is maintainable after the verdict of trial court.\nActing Chief Justice Sardar Muhammad Sarfraz Dogar heard the case seeking registration of Al-Qadir Trust University under the Charity Act. Jahanzeb Sukhera, lawyer of Al-Qadir University Trust, appeared before the bench.\nAt the outset of hearing, the court remarked that the sentences have been passed in the Al-Qadir Trust case and the trust has been confiscated. The trust has gone into the custody of the Punjab government, it is confiscated, now there is nothing in this case, the bench remarked.\nActing Chief Justice Sarfraz Dogar said that appeals against the trial court’s decision have not been scheduled. Until the trial court’s decision is not declared null and void, this application cannot be heard, he said.\nLawyer Jahanzeb Sukhera said that this application has been filed by Al-Qadir Trust University. Apart from this application, other applications are also pending in the Islamabad High Court. He prayed the court to grant him time so that he could get instructions from his client.\nThe acting chief justice said that you also have to tell how this application is admissible after the decision of the trial court. Later, the court adjourned the hearing of the case for one month while grating time to the petitioner’s lawyer.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:51:16.313Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ihc-questions-maintainability-of-petition-for-registration-of-al-qadir-trust/",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T12:51:00.000Z"
}
