{
  "title": "Govt. committed to achieve $5bn bilateral trade target with Turkiye: PM",
  "author": null,
  "content": "ISLAMABAD, Feb 18 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday said that Pakistan and Turkiye were two brotherly nations and they were committed to take the bilateral trade volume between the two countries to $5 billion target.\nAddressing a meeting of the cabinet, the prime minister referred to the recent visit of Turkish President Recep Tayyip Erdogan and said that he had always supported Pakistan at all global fora.\n“President Erdogan had been a strong voice for Palestine and Kashmir. Pakistan and Turkiye enjoy brotherly ties and both countries also hold regular consultations and support each other at all fora,” he added.\nThe prime minister said that a number of MoUs were also signed during Turkish president’s visit and urged the ministry of commerce and other relevant ministries to work jointly for the achievement of bilateral trade target of 5billion dollars.\nHe said that a flyover which was completed in 84 days in Islamabad was named after President Tayyip Erdogan as a sign of affection by the people of Pakistan.\nThe prime minister also welcomed a recent Gallop’s survey, according to which about 55 percent of people had reposed confidence in the government’s pro-business policies.\nHowever, he stressed that they had to move forward and work hard to accomplish the economic agenda and its key components including Uraan Pakistan.\nThe prime minister, about his meeting with a delegation of World Bank directors, said that they had unanimously expressed their satisfaction over the reforms agenda and the macro-economic stability.\nThey had praised the government and its credit went to every member of the cabinet, he added.\nThe prime minister said peace in the country was linked with the economic prosperity which would move the wheel of progress rapidly.\nFor economic stability, conducive environment was a requisite, he added.\nThe prime minister also paid tribute to the security forces whose officers and personnel were sacrificing their lives for the protection of the country.\nHe said yesterday, he had attended the funeral of Shaheed Lt. Hassan Arshaf in Lahore who laid down his life while fighting against Fitna al-Khwarij and sending a number of Khwarij to hell.\nThe prime minister reiterated that the complete eradication of terrorism from the country was their mission.\nThese sacrifices of security personnel would be remembered forever, he said, adding lasting peace in Pakistan would move the country on path of progress and prosperity.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:50:32.297Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-committed-to-achieve-5bn-bilateral-trade-target-with-turkiye/",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T13:11:00.000Z"
}
