{
  "title": "Trial of Civilians under Army Act; SC to continue hearing of the ICAs tomorrow",
  "author": null,
  "content": "ISLAMABAD, Feb 18 (APP):The hearing of the case related to the trial of civilians under Army Act will continue tomorrow in the Supreme Court of Pakistan while Advocate Aziz Bhandari, Counsel for founder PTI will argue before the court tomorrow.\nSalman Akram Raja, Counsel for Arzam Junaid, a convict in May 9 unrest, continued his arguments before the seven-member Constitutional Bench of the Supreme Court of Pakistan for almost five days and concluded Tuesday. The Court has adjourned the proceedings for tomorrow.\nThe Constitutional Bench of the Supreme Court, headed by Justice Amin ud Din Khan and comprising Justice Jamal Mandokhail, Justice Muhammad Ali Mazhar, Justice Hasan Azhar Rizvi, Justice Musarrat Hilali, Justice Naeem Akhtar Afghan and Justice Shahid Bilal Hasan.\nAfter Advocate Salman Raja completed his arguments, the Court asked the lawyers who would like to appear before the Court and present his case. Advocate Aziz Bhandari responded to the court and said that he doesn’t intend to go in such a depth as Salman Raja did. He will adopt most of the arguments of Salman Raja and will add only a few. He further pleaded before the court that he will submit most of his arguments in written.\nDuring the course of proceedings, Justice Jamal Mandokhial appreciated Salman Akram Raja for admiring a judgement of the Supreme Court regarding interpretation of Article 63-A of the Constitution.\nIt may be worth mentioning that the said judgment was written and delivered by former Chief Justice of Pakistan Justice Qazi Fiaz Isa.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:51:16.324Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/trial-of-civilians-under-army-act-sc-to-continue-hearing-of-the-icas-tomorrow/",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T12:45:00.000Z"
}
