{
  "title": "Dr. Naheed Qamar and Mola Bakhsh Chandio to receive Aks-e-Khushbu awards",
  "author": null,
  "content": "ISLAMABAD, Feb 21 (APP):Renowned poet, Dr. Naheed Qamar and distinguished prose writer, Mola Bakhsh Chandio are set to be honored with the prestigious Aks-e-Khushbu Awards for 2023.\nThe award ceremony is scheduled to take place on February 22, Saturday, where distinguished literary personalities and poetry enthusiasts will gather to celebrate their achievements.\nThe event is expected to be a remarkable occasion highlighting the power and beauty of poetic and prose expression in contemporary times.\nDr. Naheed Qamar will receive the award for her acclaimed poetry collection, Abad Ka Kinara, while Mola Bakhsh Chandio will be recognized for his book Auraq-e-Zindagi, which has been widely praised for its engaging narrative and philosophical depth.\nDr. Naheed Qamar’s poetry has been widely appreciated by literary circles, with prominent literary personalities acknowledging the philosophical undertones and artistic finesse of her work.\nVeteran writer and intellectual Mustansar Hussain Tarar has praised her poems for their profound reflection on the existential journey of humankind.\nAnother noted critic, Khushbu Jafri, has lauded her poetry for its unique narrative style and deeply resonant themes.\nAdditionally, Mola Bakhsh Chandio’s work has received significant acclaim. Literary critic Mazhar-ul-Islam has compared Auraq-e-Zindagi to classic literary works, appreciating its depth and storytelling style.\nThe Aks-e-Khushbu Awards, known for honoring excellence in Urdu literature, recognize poets and prose writers whose works leave a lasting impact on the literary landscape.\nThe awards for Dr. Naheed Qamar and Mola Bakhsh Chandio stand as a testament to their literary brilliance and enduring contribution to Urdu literature.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:57:59.765Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/dr-naheed-qamar-and-mola-bakhsh-chandio-to-receive-aks-e-khushbu-awards/",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T16:39:00.000Z"
}
