{
  "title": "Alisha Khan Barech named finalist for Global Award",
  "author": null,
  "content": "ISLAMABAD, Feb 21 (APP):Alishba Khan Barech from Nushki, Pakistan has been selected as a finalist for the 2025 Women Changing the World Awards.\nAmong 751 short listed nominations, the judges have selected her as a finalist for the Young Woman of the Year Award, recognizing her extraordinary contributions to literature, advocacy, and youth empowerment, said a press release issued here Friday.\nThe Women Changing the World Awards presented by Oprah Winfrey’s all- time favourite guest, Dr Tererai Trent, celebrate and recognize women achieving outstanding success in areas such as sustainability, humanitarian work, leadership, advocacy, tech, product development, education, health and innovation.\nThe awards are designed to recognize the growing number of women who are leading the way in making the world a better place for us all and inspire other women to answer the call to take action.\nDr Trent explains, “These exceptional women are here to awaken hearts, give permission to recapture dreams, and inspire the women of the world to come together to forge a brighter path for all. The rising of women is the awakening of everybody.”\nHailing from Nushki, near the Afghan border—a region often associated with militancy—Alishba is determined to redefine its legacy. Instead of a militant, she hopes to be the one who shapes its narrative. She is Pakistan’s youngest novelist, having written her debut novel at 11, and the country’s youngest memoirist, beginning her memoir at 14. By 16, she became Pakistan’s youngest self-published author.\nHer journey extends beyond literature—she has served as a UNICEF Pakistan ambassador for polio eradication, a youth ambassador for mental health in UNICEF’s On My Mind campaign, and a youth ambassador for the Quetta Gladiators. Currently, Women Changing the World Awards & Global Summit wcwawards.com she is a youth advisor to the Prime Minister of Pakistan and a member of the National Youth Council. UNICEF honored her as a Trailblazer Author during the Girl of the Day campaign.\nRecently, she earned a merit scholarship and acceptance into the prestigious John Locke Summer University 2024, becoming the first female Pashtun from Balochistan to achieve this milestone.\nA self-taught writer, she was crafting multi-thousand-word novels at 11 while her peers were writing 150-word school stories. Her passion for storytelling was matched by an early fascination with politics and global affairs.\nAt 16, she self-published her book, earning recognition from UNICEF. At 17, she wrote an op-ed in Dawn encouraging polio vaccination in resistant communities. Her work as a UNICEF youth ambassador led her to advocate for mental health, sharing her own struggles to inspire others.\nNow, as a youth advisor to the Prime Minister, she serves as a bridge between marginalized communities and policymakers, ensuring her generation’s concerns are not just acknowledged but acted upon. Her work is vital in reclaiming narratives that have long been misrepresented. At 14, she penned her memoir—not the one dictated by global media, but her own.\nIn her novel, she explored the significance of intangible assets—truth, family, and health—just as much as material wealth.\nIn her memoir, she detailed what it meant to be a Muslim facing Islamophobia, a Pashtun misrepresented as a Taliban sympathizer, and a resident of Balochistan, a region often reduced to stereotypes of poverty and conflict.\nThese experiences shaped her advocacy, from writing op-eds on polio eradication to recording Pashto awareness campaigns with Voice Women Changing the World Awards & Global Summitwcwawards.com of America.\nHer commitment extends to climate change, leading her to author a two-book series on ocean destruction, incorporating visuals from Balochistani photographers to amplify the message.\nMost recently, as a youth advisor to the Prime Minister, she has focused on amplifying her generation’s concerns, particularly the media blackout of Balochistan. Her work is driven by an unwavering urge to challenge perceptions and reshape narratives.\nDr Trent’s vision for these awards is to empower women everywhere to reclaim their sacred dreams and call-in women across the globe to unite and pave the way towards a better future for all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:58:45.479Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/alisha-khan-barech-named-finalist-for-global-award/",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T13:09:00.000Z"
}
