{
  "title": "Court orders salary deductions in APP’ DSNG vehicle scandal",
  "author": null,
  "content": "ISLAMABAD, Feb 21 (APP):The lower court on Friday ruled in a high-profile case involving the illegal purchase of a vehicle by the national news agency, Associated Press of Pakistan (APP).\nThe court directed the recovery of funds from the salaries of officials implicated in the scandal, marking a significant step in addressing financial misconduct within the agency.\nDuring a hearing, Judicial Magistrate Malik Muhammad Imran cleared the Associated Press of Pakistan (APP) of liability in the illegal procurement of a DSNG vehicle. Instead, the court ordered the recovery of the misused funds from the salaries of the officials involved.\nIn today’s hearing, APP Managing Director Muhammad Asim Khichi, accompanied by his lawyer Husnain Haider Thaheem, appeared in court to present the agency’s case.\nThaheem informed the court that the APP MD had formed an inquiry committee, led by Director China News Service Yawar Abbas Bukhari, to investigate the matter. The committee recorded statements from all relevant individuals and found former IT Director Muhammad Ghawas Khan, senior clerk Atiq-ur-Rehman, and legal section in-charge Muhammad Zubair responsible for the irregularities. The committee recommended disciplinary action against the accused.\nThe lawyer further argued that a private company, NetSite, had acquired the machinery installed in the DSNG vehicle and demanded payment from APP. Instead of recovering the losses from the corrupt officials, the company filed a case against APP, seeking payment. Thaheem further argued that the agency was unfairly blamed for the misconduct of its employees.\nAPP’s legal advisor emphasized that the agency had been saved from a significant financial loss, crediting MD Muhammad Asim Khichi for his efforts. The court agreed with Thaheem’s arguments and ordered the recovery of the misused funds from the salaries of the implicated officials. The hearing was adjourned until April 7.\nThe scandal involved the purchase of a non-custom paid vehicle instead of a new one from a showroom, violating established rules and causing a loss of 12 million rupees to the agency. The officials misused their authority and breached procurement regulations, leading to the financial damage.\nThis case is part of a broader anti-corruption drive under Prime Minister Muhammad Shehbaz Sharif’s zero-tolerance policy.\nFederal Minister for Information and Broadcasting Attaullah Tarar has directed APP MD Muhammad Asim Khichi to take strict action against corrupt elements within the agency. So far, corruption worth approximately 1.5 billion rupees has been uncovered, with cases pending in various courts.\nThe ruling underscores the government’s commitment to accountability and transparency, setting a precedent for addressing financial misconduct in public institutions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:58:38.596Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/court-orders-salary-deductions-in-app-dsng-vehicle-scandal/",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T13:48:00.000Z"
}
