{
  "title": "Experts call for financing in climate-resilient WASH services",
  "author": null,
  "content": "ISLAMABAD, Feb 21 (APP):Policy experts emphasized the establishment of a National WASH Account to systematically track financial flows, enhance accountability, and support data-driven policy-making.\nThey also highlighted the need for stronger public-private partnerships, innovative financing models, and greater community engagement to create sustainable and inclusive WASH services,said a press release issued here on Friday.\nThe event, organized by WaterAid Pakistan in partnership with the Sustainable Development Policy Institute (SDPI), also marked the launch of the policy brief, “Sustainable Financing Mechanism for Climate Resilient WASH.” The dialogue brought together policy-makers, stake-holders, and WASH experts to provide policy-makers and policy influencers with evidence to make informed decisions about sustainable financing mechanisms for climate-resilient WASH.\nMr Ali Rehmat from SDPI in his presentation of the policy recommendations derived from the policy brief, stated that Pakistan faces a significant financing gap in ensuring universal access to water, sanitation, and hygiene (WASH). He added that achieving Sustainable Development Goal 6 (SDG-6) requires sustained investments in infrastructure, service delivery, and climate resilience.\nThe lack of long-term financing mechanisms and an overreliance on short-term donor funding pose major challenges. Leveraging climate finance presents a strategic opportunity to close this gap and establish a robust, sustainable financing mechanism for climate-resilient WASH services.\nDr Shafqat Munir Ahmad, the Deputy Executive Director of the Sustainable Development Policy Institute (SDPI) and co-author of the policy paper emphasized that Pakistan is facing significant financial and policy challenges in developing climate-resilient and inclusive WASH services.\nThe country requires between $7 billion and $14 billion annually for climate adaptation efforts, which include enhancing disaster preparedness, improving water management systems, and developing resilient infrastructure.\nTo bridge the financing gap, he highlighted the necessity for innovative financial mechanisms, strengthened financial accountability, and increased private sector participation. The absence of cost recovery mechanisms, fragmented policy frameworks, and limited institutional capacity continue to impede sustainable WASH development.\nMr Mohsin Mushtaq Chandna, DG Debt, Ministry of Finance, emphasized the stark financial disparity between federal and provincial governments in terms of resources. While the federal government faces significant debt servicing burdens, provincial governments maintain surplus budgets.\nHe argued that since WASH falls under provincial jurisdiction, provinces must take ownership of financing and implementation rather than depending on federal interventions.\nDr Hifza Rasheed, Director General (WQ) of PCRWR, highlighted key issues surrounding water supply, pricing, wastewater treatment, and policy implementation. She noted that while Pakistan has multiple policies—including the National Water Policy (2018), Climate Change Policy, Agriculture Policy, and Food Security Policy—they focus more on requirements than the resources needed to fulfill them. She called for stronger institutional support for water quality surveillance, emphasizing the need for a national-level monitoring body. She suggested that PCRWR, given its research expertise, should assume this role.\nMr Sarmad Iqbal from International Rescue Committee Pakistan identified critical gaps in compliance, project implementation, funding, and research. He described the WASH sector as suffering from a “sporadic eruption of actions” rather than following a structured trajectory.\nHe called for a consolidated body of knowledge to provide evidence-based insights for sustainable WASH mechanisms. He further noted that decision-making remains inconsistent, often shifting between departments without a clear long-term vision.\nHe stressed that effective governance must involve forward-thinking strategies rooted in technical expertise.\nAmbassador Jauhar Saleem, President of the Institute of Regional Studies, pointed out that most climate financing consists of re-purposed funds rather than new financial commitments. He argued that Pakistan cannot depend on a significant influx of international aid and must instead develop domestic financial solutions to address climate-related challenges.\nAftab Alam, Founder of Resilient Future International, emphasized the need to integrate funding sources into policy proposals to ensure successful implementation. He noted that evaluations of disasters, from the 2005 earthquake to the 2022 floods, have consistently pointed to two major issues: inadequate local response capacity and poor stakeholder coordination. He warned that without learning from past mistakes and implementing necessary improvements, these challenges would persist.\nMs Ismat Gul Khattak, Chief Advisor at NASTP, advocated for the promotion of small-scale microfinancing to empower community-based organizations and individuals. She stressed the importance of accountability and transparency in fund management, urging the establishment of robust mechanisms to ensure the effective and efficient use of financial resources.\nDr Ghazala Khan, CEO of The Next Generation Leaders, drew attention to the impact of poor hygiene on maternal health. She highlighted that 650,000 pregnant women were unable to access healthcare, leading to preventable deaths and hygiene-related complications. She called for targeted health interventions, particularly for women in disaster-affected and displaced communities.\nIn his concluding remarks, Mr Khurram Hassan from WaterAid Pakistan reinforced the need for accountability in WASH services, particularly given overlapping mandates at federal and provincial levels.\nHe called for the strengthening of institutional, financial, and social accountability mechanisms. Additionally, he highlighted the pressing need to build technical and institutional capacity at the local level to ensure the effective implementation of climate-resilient WASH initiatives. While challenges remain, he affirmed that today’s discussions demonstrated that viable solutions are within reach.\nThe event concluded with a collective commitment to strengthening governance, financing, and accountability in Pakistan’s WASH sector to ensure sustainable, climate-resilient solutions for all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:58:00.747Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/experts-call-for-financing-in-climate-resilient-wash-services/",
  "dateList": "2025-02-21",
  "date_published": "2025-02-21T16:22:00.000Z"
}
