{
  "title": "Firdous Ashiq Awan urges UN to ban blasphemous caricatures against Islam",
  "link": "https://www.app.com.pk/national/firdous-ashiq-awan-urges-un-to-ban-blasphemous-caricatures-against-islam/",
  "date_published": "2020-11-05T18:51:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 05 (APP): Special Assistant to Chief Minister (SACM) on Information Dr. Firdous Ashiq Awan has stressed the need for lacing the youth with right kind of religious knowledge to defeat propaganda against Islam and finality of prophethood of Hazrat Muhammad Khatam-un-Nabiyeen (PBUH).\nAddressing “Rehmatul-lil-Aalameen (Mercy for all the Worlds) Conference at Aiwan-e-Iqbal here on Thursday, she said, “We, as Muslims, strongly condemn the blasphemous sketches and such malicious acts which are unbearable, and demand from the United Nations Organization (UN) to impose ban on such blasphemous actions under the guise of freedom of expression,” adding that the Muslim Ummah has been united in condemning the French President for his anti-Islam stance.\nThe conference was held under the auspices of Pakistan Tehreek-e-Insaf (PTI) Central Punjab. PTI CP President Ejaz Ahmad Chaudhry, religious scholars Mufti Ramzan Sialvi, Maulana Abdul Khabeer Azad, Dr. Muhammad Hussain Akbar, Qari Zawar Bahadur and Ulema and Scholars as well as a large number of people from all walks of life attended the conference.\nThe SACM on Information said Prime Minister Imran Khan had given a strong message regarding respect and honour of Holy Prophet (PBUH), adding that Premier Khan, in his letter to different heads of Muslim States, had urged a unanimous response against the statements of leaders of European countries.\nDr. Firdous Ashiq Awan said, “It is a day of renewal of pledge that our faith is incomplete unless we have full faith in the finality of prophethood of the last Prophet Hazrat Muhammad (PBUH), adding, “We must watch for those who are the infidels and don’t believe in the finality of prophethood.”\nThe love, respect and affection with the Holy Prophet Hazrat Muhammad (PBUH) is part of a Muslim’s faith, adding that no Muslim can tolerate any kind of blasphemy against finality of prophethood.\nShe said that Prophet Hazrat Muhammad (PBUH) ignited the flame of knowledge in the darkness of illiteracy in the world, adding that Prophet Hazrat Muhammad (PBUH) was sent as mercy for all the worlds and not for one nation or generation.\n“Prime Minister Imran Khan is a true devotee of Prophet Hazrat Muhammad (PBUH), adding that people need to understand PM Imran Khan’s relationship with Pakistan.\nShe said the country, under the influential leadership of Prime Minister Imran Khan, talks of love and brotherhood by eroding the tradition of political hatred and division.\nFirdous said the kind of treatment Muslim are being meted out in the neighbouring India is clear to everyone, adding, “We pray to Allah Almighty to free the Kashmiri people of the Indian Illegally Occupied Jammu and Kashmir (IIOJK).”\nShe said that Chief Minister Punjab has established a Rehmatul-lil-Aalameen scholarship fund worth 500 million rupees and under this scholarship, stipend will be given to the position holders and matric pass destitute girl students for further studies.\nThe conference passed unanimous resolutions regarding Namoos-e-Risalat (PBUH), respect for heavenly books besides Ahl-e-Bait and companions (R.A) of Prophet Hazrat Muhammad (PBUH) and recommended severe punishments for those involved in blasphemous act against Namoos-e-Risalat (PBUH).",
  "retrievedAt": "2025-08-11T19:58:41.008Z"
}
