{
  "title": "WECs contributes to make women self-reliant",
  "link": "https://www.app.com.pk/national/wecs-contributes-to-make-women-self-reliant/",
  "date_published": "2020-11-05T15:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar Thursday said Women Empowerment Centers (WECs) are significantly contributing to reduce the women’ dependence on government-led social safety nets.\nShe said that WECs successfully brought women into the mainstream of economic development and financial inclusion.\n“It is heartening to see that WEC’s skills training courses enable the young girls to start their own businesses and\nearn livelihoods for their families,” she said during her visit to the Ehsaas Women Empowerment Center (WEC) in Burma Town.\nShe said ensuring equality, training women, and providing access to opportunities to deserving women is the core thinking behind WECs.\nEvery year, as many as 250 girls are graduated from each WEC to start their business or a job.\nShe disclosed that as part of major reforms brought under Ehsaas, the training courses offered by WECs will be certified by the National Technology Board by the end of this year.\nThis will significantly enhance the credibility and acceptance of the women’s livelihoods skills in the local economy, she said.\nThe WEC operates under the supervision of Pakistan Bait ul Mal that is one of the four main executing agencies of Ehsaas.\nAt the centre, Dr. Nishtar met the deserving yet talented girls and women who were enrolled in complementary skills training courses- computer literacy, beautician, dress designing and making, hand and machine embroidery etc.\nShe listened to the voices, concerns and suggestions of the girls.\nThe SAPM was joined by Secretary Poverty Alleviation and Social Safety Division and Managing Director Pakistan Baitul Mal during her visit.\nThe WEC was imparting local skills training to the girls and women belonging to the low-income groups in two-shifts bi-annually.\nStrengthening and expansion of WECs is one of the tangible measures being taken for the socio-economic empowerment of women under the umbrella of Ehsaas.\nWhile under the supervision of Pakistan Baitul Mal, the disadvantaged women are empowered through skills development in the fields of livelihoods, education, economy, and self-reliance at 157 WECs nationwide.\nThe key focus of Ehsaas is on closing the gender gap and women empowerment. Ehsaas seeks to link the existing\nand emerging livelihoods and community level programs in ways that promote diverse income opportunities and\nenhance women’s control of resources in the household.\nPBM and Pakistan Poverty Alleviation Fund (PPAF) are exploiting synergies to link trained women with interest\nfree loans to make WEC graduates self-reliant.\nThe size of loans ranges from Rs. 25,000 to Rs. 100,000 depending upon the viability of each business.\nIrum Younas, a dress designing trainee at the centre noted that after receiving the skills training, she can earn enough money to meet her family’s basic needs.\n“These skills will enable me to earn a decent livelihood and to support my family”, shared Umme Kulsoom, trainee enrolled for basic computer course.",
  "retrievedAt": "2025-08-11T19:58:43.657Z"
}
