{
  "title": "Jammu Martyrs Day on Nov 6 to remember great sacrifices of over 200,000 IIOJK Muslims",
  "link": "https://www.app.com.pk/national/jammu-martyrs-day-on-nov-6-to-remember-great-sacrifices-of-over-200000-iiojk-muslims/",
  "date_published": "2020-11-05T15:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 5 (APP): Kashmiris and Pakistanis on both sides of the Line of Control (LoC) and those living abroad will observe Jammu Martyrs Day on November 6 to remember the great sacrifices of over 200,000 martyrs of the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nOn November 6, 1947, Muslims of Jammu including men, women and children were seemingly dispatched towards Pakistan in trucks but Indian army, forces of Maharaja and Hindu extremists at Samba Reasi and other places martyred them in gruesome manner.\nThis time Jammu Martyrs Day has come at time when the people of IIOJK have accelerated their legitimate struggle in the aftermath of revocation of article 370 and 35A on 05 August 2019.\nSince 1989 India has been manifested in brutal tactics like crackdowns, curfews, illegal detentions, massacre, targeted killings, sieges, burning the houses, torture, disappearances, rape, breaking the legs, molestation of Muslim women and killing of persons through fake encounter.\nIndian forces have employed various draconian laws like the Jammu and Kashmir Disturbed Areas Act, and the Armed Forces Special Powers Act and Public Safety Act in killing the Kashmiri people, and for the arbitrarily arrest of any individual for an indefinite period.\nBesides Human Rights Watch, in its various reports, Amnesty International has also pointed out grave human rights violations in IIOJK.\nNew Delhi’s main aim was to deflect the attention of the international community from the new phase of Kashmiri Intifada, while pressure has been mounting on the Modi government both domestically and internationally to resolve the issue of Kashmir with Pakistan.\nMeanwhile Mushaal Hussain Malick, the wife of Jammu Kashmir Liberation Front (JKLF) Chairman Yasin Malik on Thursday dubbed November 6, 1947 as genocides in modern history.\nThe Chairperson Peace and Culture Organization in her statement said that November 6 was the blackest day in the history of IIOJK as barbaric forces martyred over 200,000 Muslims in the occupied territory.\nShe said that the houses of Kashmiri Muslims were burnt out while women were abducted.\nThe whole Muslim population of Muslim majority areas (Jammu, Kathua, Udhampur, Reasi and others) were eliminated. As a result of the massacre, Muslims became a minority in 123 villages of Jammu where Muslims were in majority, she added.\nIn addition to this, weapons of Muslim military were removed in the Jammu city and the Jammu cantonment Muslim Brigadier was replaced with Hindu Dogra officer.\nMushaal said that no respite has been witnessed in the Indian brutalities and war crimes since November 6, 1947. The forces have martyred thousands of Kashmiri people besides destroying their properties and now they are again converting the Muslim majority into minority areas.\nShe lamented that despite the massacre of Muslims, the world powers and human rights organizations did not take any action that gave fascist India to further\nits barbarism and inhuman acts.\nThe Chairperson said that had the world community hold India accountable for the genocide, the Kashmiri people wouldn’t have been suffered today.\nShe said that the world powers and human rights organizations should take priority in the Kashmir issue over trade with India. It was the only way to stabilize a country’s defence, she added.",
  "retrievedAt": "2025-08-11T19:58:43.772Z"
}
