{
  "title": "Speaker NA stresses on parliamentary, political engagement with Bosnia Herzegovina",
  "link": "https://www.app.com.pk/national/speaker-na-stresses-on-parliamentary-political-engagement-with-bosnia-herzegovina/",
  "date_published": "2020-11-05T15:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 5 (APP): Speaker National Assembly Asad Qaiser met Chairman of Presidency of Bosnia and Herzegovina Sefik Dzaferovic here on Thursday and discussed matters relating to enhancing bilateral engagement and cooperation.\nTalking to the visiting dignitary, Speaker Asad Qaiser said that Pakistan shared religious, cultural and brotherly affinities with the people of Bosnia and Herzegovina and relations between the two countries were manifested by mutual support at times of need.\nHe said that political and parliamentary engagement between both the countries would further solidify the relations and open new vistas of mutual cooperation.\nReferring to the establishment of Pakistan-Bosnia Parliamentary Friendship Group in National Assembly, the Speaker said that bilateral engagement at level of friendship groups would help explore new areas of mutual cooperation in diverse sectors.\nThe Speaker proposed a parliamentary moot in Islamabad to ponder upon areas of possible cooperation. He said that Bosnian Mission in Islamabad and Pakistani Mission in Sarajevo could play an apt role in that regard.\nIt was also agreed to frequent bilateral parliamentary exchanges.\nMentioning the immense economic opportunities created under the umbrella of CPEC, Speaker Asad Qaiser said that CPEC had provided opportunity for Pakistan to become a logistic and economic hub for South Asia, Central and Western Asia, Middle East and Western China.\nThe Speaker said that opportunities were available for foreign investors to take advantage of immense economic potential in Pakistan. He said that Bosnian investors could invest in energy, manufacturing and trade sectors.\nHe further remarked that trade between Pakistan and Bosnia did not commensurate the economic activities on both sides, for which measures needed to be initiated.\nChairman of the Presidency of Bosnia and Herzegovina, Sefik Dzaferovic said that his country attached importance to its relations with Pakistan since Pakistan was one of the few countries to extend assistance to his country after it came into being and later during the stabilization process.\nHe said that his country also strongly desired to cement its bilateral relations with Pakistan. The Chairman Presidency agreed said that the interaction between the parliamentarians would further pave the way for enhancing cooperation in diverse sectors.\nHe said that Bosnia had been subjected to worst human crises in the past, however due to concerted efforts of the consecutive governments and with the cooperation of people, the country had been led on the path of progress.\nMr. Sefik agreed that the trade between Bosnia and Pakistan stood at Euros 4.5 million for which measures needed to be taken to improve the volume of trade and expand cooperation in different fields.\nHe said agreements signed between both the sides during his instant visit would soon be materialized and trade and economic cooperation would increase in every field.\nHe expressed his gratitude to warm hospitality accorded to him during his visit to Islamabad.",
  "retrievedAt": "2025-08-11T19:58:42.361Z"
}
