{
  "title": "Incentives for wheat growers crucial to Pakistan’s food security: NA Speaker",
  "link": "https://www.app.com.pk/national/incentives-for-wheat-growers-crucial-to-pakistans-food-security-na-speaker/",
  "date_published": "2020-11-05T16:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 5 (APP): Speaker National Assembly Asad Qaiser Thursday said that the meaningful and timely incentives for wheat growers was indispensable to Pakistan’s national food security.\nHe made these remarks while chairing a meeting of the National Assembly Special Committee on Agricultural Products convened to deliberate upon minimum support price for wheat, strategy for enhancing production of wheat and other Rabi crops.\nThe meeting was attended by Federal Minister for National Food Security and Research Syed Fakhar Imam, Federal Minister for Economic Affairs Khusro Bakhtiar, Balochistan Agriculture Minister, Chairman PARC, Secretary Food Punjab, Secretary Agriculture KP, MD PASSCO and members of the committee.\nA significantly larger majority of the committee members recommended that the minimum support price for wheat should be fixed at Rs 1800/40 kg while members from Sindh recommended Rs.2000/40 kg as minimum support price for wheat.\nThe members highlighted that lack of decent profitability in wheat production would deter farmers from cultivating wheat crop resulting in Pakistan’s national food security crisis.\nThe members stressed that undue delay in the fertilizer subsidy disbursement mechanism would adversely affect the cumulative output of wheat and the country would be forced to import expensive wheat next year.\nThe committee recommended that each province should immediately share its proposed subsidy disbursement mechanism with the Ministry of National Food Security and Research for onward submission to the Ministry of Finance for release of the funds.\nAsad Qaiser assured that the matter would be taken up with the Ministry of Finance in the next meeting of the committee within one week.\nOn the request of Khyber Pakhtunkhwa and Balochistan, the committee recommended that Punjab Seed Corporation and Government of Sindh should provide wheat seed to KP and Balochistan within one week as per agreement and according to the demand in order to avoid potential wheat crisis.\nThe Agriculture Minister of Balochistan stated that given Balochistan’s agricultural landscape, the federal government should extend a supportive arm to Balochistan.\nHe regretted that the subsidy on tubewells and funds for solarization of tubewells, despite announced, were not released.\nThe Special Committee on Agricultural Products unanimously adopted a resolution urging the federal government to replicate the relief in energy prices provided to Micro, Small and Medium Enterprises (MSME) and Large\nScale Manufacturing (LSM) industry for the hardest hit farmers within the month of November, 2020 so that farmers can take benefit of this relief in the current planting season.\nThe committee through its resolution expressed grave concern over lack of any action taken in pursuance of the Prime Minister’s directions to provide relief to farmers on tubewells across the country.\nFederal Minister for National Food Security and Research, officials of the Ministry and provincial governments briefed the panel on current situation, cost, import, support price and interventions for enhancing wheat production next year.\nThe committee would meet next Friday to review implementation status of its recommendations.",
  "retrievedAt": "2025-08-11T19:58:42.301Z"
}
