{
  "title": "Mushaal Mullick highlights HR abuses in IIOJK at Norwegian parliament",
  "link": "https://www.app.com.pk/national/mushaal-mullick-highlights-hr-abuses-in-iiojk-at-norwegian-parliament/",
  "date_published": "2023-11-03T17:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 3 (APP): Special Assistant to Prime Minister on Human Rights and Women Empowerment Mushaal Hussein Mullick addressed a seminar at the Norwegian parliament wherein she highlighted the unabated brutalities of the Indian troops in the Indian Illegally Occupied Jammu and Kashmir.\nCo-hosted by Parliament’s Foreign Affairs and Defence Standing Committee Member Dag-Inge Ulestein and President of Foundation Dialogue for Peace Aamir Javed Sheikh, the seminar was held in connection with the Kashmir Black Day observed on October 27, said a press release received on Friday.\nMushaal Hussein Mullick, wife of jailed Hurriyat leader Muhammad Yasin Malik reiterated her call for India to give Kashmiris their rights and stop their persecution.\nShe also highlighted the plight of illegally detained Hurriyat leaders and activists languishing in different jails of India and the territory, adding that the Kashmiri detainees were being tortured in jails.\nMushaal said Indian troops are committing brutalities on the people of the occupied territory and reiterated that the resolution of the Kashmir dispute was imperative not only for durable peace in the world.\nShe also appealed to the United Nations and other international rights organizations to give the people of Kashmir and Palestine their right to self-determination so that permanent peace could be established in the world.\nRazia Sultana, the 11-year-old daughter of Mushaal Mullick and the incarcerated Kashmiri leader Yasin Malik, also addressed the seminar.\nIn their respective addresses, Ambassador of Pakistan Sadia Altaf Qazi, Dag-Inge Ulestein, Kjell Magne Bondevik, former Prime Minister of Norway and Faheem Kayani, President of Tehreek-e-Kashmir UK, highlighted the Indian brutalities in IIOJK.",
  "retrievedAt": "2025-08-11T10:21:42.569Z"
}
