{
  "title": "PM directs holding of regular CSS special exams to fill up posts reserved for minorities, marginalized areas",
  "link": "https://www.app.com.pk/national/pm-directs-holding-of-regular-css-special-exams-to-fill-up-posts-reserved-for-minorities-marginalized-areas/",
  "date_published": "2023-11-03T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 3 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Friday directed the formulation of a comprehensive policy for the appointment of competent civil servants in remote areas of the country including Balochistan.\nHe also ordered the restoration of rotation policy of civil servants in line with its original spirit and to ensure its strict implementation.\nThe prime minister was chairing a meeting to review progress on filling up vacant seats reserved for marginalized areas in civil bureaucracy through special examinations as well as rotation policy.\nPM Kakar directed to regularly hold the competitive examinations to fill the vacant seats in civil bureaucracy reserved for minorities and people from marginalized areas.\nHe stressed persistent awareness campaigns to encourage minorities to participate in the competitive examination for government jobs.\nThe prime minister said the country’s constitution provides equal rights and opportunities to minorities and people belonging to underprivileged areas.\nHe said the government was fully committed to ensuring equal opportunities for progress for every citizen.\nThe meeting was briefed about the recently held special examination of the Central Superior Services (CSS). It was informed that 15,000 candidates appeared in the examination, out of which 3,500 belonged to Balochistan. The examination has over 60 seats reserved in quota for Balochistan.\nThe meeting was attended by PM’s Adviser Ahad Khan Cheema, the PM’s secretary, the Secretary Establishment, and the Secretary Federal Public Service Commission.",
  "retrievedAt": "2025-08-11T10:21:35.556Z"
}
