{
  "title": "Journalists helping to achieve Sustainable Development Goals: António Guterres",
  "link": "https://www.app.com.pk/national/journalists-helping-to-achieve-sustainable-development-goals-antonio-guterres/",
  "date_published": "2023-11-02T19:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 02 (APP): United Nations Secretary-General António Guterres said that Journalists and the media fulfill a vital role in society, upholding and enabling democracy and holding power to account.\nThey are essential to strong and accountable institutions and to achieving the Sustainable Development Goals, he said this in a message on the International Day to end impunity for crimes against Journalists.\nHe highlighted the important position that puts journalists at risk and commitment to investigating and revealing the truth means they are often targeted for attack, illegal detention, and even death.\nIn 2022, according to UNESCO, at least 88 journalists were killed for doing their jobs – a sharp increase from the preceding years. The current conflict in Israel and the Occupied Palestinian Territory is taking a horrific toll on journalists.\nBut the majority of journalists who are killed are not war reporters; they are working in countries that are at peace, investigating corruption, trafficking, human rights violations, and environmental issues.\nI am deeply alarmed by these figures and by the rise in threats of all kinds against journalists. Detention of journalists is at an all-time high. Online harassment of journalists, particularly women, is being used as a tool to silence them.\nHe said that we need better safeguards to defend the journalists who are keeping us informed.\nOn the International Day to End Impunity for Crimes against Journalists, we call on all States to prevent violence against journalists, to provide a safe environment for them to go about their jobs, to bring to justice those who commit crimes against journalists and media workers, and to ensure support for victims and survivors.\nToday and every day, we are grateful to the journalists and all media professionals who risk their health and lives to keep us informed, and to keep the truth alive, he said.",
  "retrievedAt": "2025-08-11T10:21:39.023Z"
}
