{
  "title": "Solangi for media’s role to reverse negative impacts of climate change",
  "link": "https://www.app.com.pk/national/solangi-for-medias-role-to-reverse-negative-impacts-of-climate-change/",
  "date_published": "2023-11-03T08:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 03 (APP): Federal Minister of Information and Broadcasting Murtaza Solangi on Friday urged official media to join hands with private media houses to create awareness about negative impacts of climate change.\nAddressing the inaugural ceremony of establishment of climate change desk at PTV, he said today the first step had been taken by PTV management for which it deserved appreciation.\nLauding the PTV management for acting swiftly, he said that that the climate change desk has been established and connected with regional stations and dedicated reporters have been appointed.\nThe minister urged the private media to adopt this model on coverage of climate change issues.\nThe minister issued directives to Ministries of Climate Change and Information and Broadcasting to work together on this front.\nHe said that Information Service Academy should start providing training to reporters, researchers on this subject.\nMurtaza Solangi also called for mobilization of social media and other digital platforms in fight against climate change. He said that the journalists working in climate change desk should visit the regions affected by climate change and meet the local people.\nHe proposed that media persons should also engage parents, teachers and experts in different fields as entire society has to be mobilized regarding climate change.\nThe minister said that climate change was a big threat for the planet earth establishment of Climate Change Desk in PTV was a great step in the right direction.\nPakistan Television should telecast special programmes and documentaries about the disastrous impacts of climate change.\nMurtaza Solangi said that general elections will be held in February next year and the caretaker government had no favourite party in the electoral race. He said it was responsibility of the Ministry of Information and Broadcasting to ensure that all registered political parties were given coverage without any discrimination on official media.\nAccording to the spirit of the constitution, the elected representatives have the prerogative to run the affairs of country, Murtaza Solangi remarked.\nThe caretaker government, he added, was fully committed for holding free and transparent elections in the country.\nSecretary Information and Broadcasting and MD PTV Zahoor Ahmed in his speech said that climate change and disaster reporting were specialised fields.\nHe said that the PTV would provide training to its staff deputed on climate change in collaboration with Ministry of Climate Change and development partners. He said that climate change reporting was a day to day activity and it was vital to work on disaster preparedness. He said that in the nations having better preparedness, loss of life in natural disasters was minimised whereas in Pakistan countless precious lives were lost due to lack of preparedness and weak early warning system. He assured the minister that the PTV would work on reorientation of its news system and attach priority to climate change related news.\nEarlier the minister cut the ribbon to formally inaugurate the Climate Change Desk in the PTV. The desk has been established for extensive coverage of news about environmental issues and highlight its negative impacts.\nBesides Secretary Information and Broadcasting Zahoor Ahmed and Secretary Ministry of Climate Change Syed Asif Hyder Shah, senior officers from the ministry and PTV attended the ceremony.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:21:35.118Z"
}
