{
  "title": "Ishaq Dar, Dr. Shahzad Waseem call for free, fair, transparent elections",
  "link": "https://www.app.com.pk/national/ishaq-dar-dr-shahzad-waseem-call-for-free-fair-transparent-elections/",
  "date_published": "2023-11-03T08:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 03 (APP): The Leader of the House, Ishaq Dar, and the Leader of the Opposition, Dr. Shahzad Waseem in the Senate on Friday called for holding free, fair, and transparent elections in the country.During a point of order, both leaders stressed the importance of ensuring a level playing field for all political parties participating in the electoral process.\n“Elections in the country should be free, fair, and transparent, leaving no room for doubt about their credibility,” they asserted.\nIshaq Dar pointed out that during the 2018 elections, the Pakistan Muslim League was not given a fair playing field. Nevertheless, the PML-N bravely contested the election despite facing numerous challenges.\nIn response to a point raised by Dr. Waseem, Ishaq Dar explained that the constitution mandates that elections be held within 90 days in the event of the assembly’s dissolution. However, he pointed out that following the unanimous approval of the new census by the Council of Common Interest, it became incumbent upon the Election Commission of Pakistan (ECP) to carry out delimitation. He further clarified that delimitation is also a constitutional requirement for the ECP.\nFurthermore, Ishaq Dar revealed that the government had not allocated any funds for holding elections in the fiscal year 2022-23. However, he said that the required funding had been allocated for the fiscal year 2023-24 by the PDM government.\nRegarding not releasing funds for holding elections in Punjab and Khyber Pakhtunkhwa, he explained that he was bound to follow the resolution passed by the National Assembly, stating, “I have no choice but to follow the resolution of the National Assembly.”\nIshaq Dar said that the Pakistan Tehreek-e-Insaf government derailed the IMF program during their tenure. He said that the PTI government had strategically laid landmines for the Pakistan Democratic Movement (PDM) government on the economic front, and there were elements who sought to push Pakistan into a situation similar to Sri Lanka’s economic challenges.\nHe also highlighted the accomplishments of the PDM government in the economic domain, particularly in the reinstatement of the IMF program.\nOpposition Leader in the Senate, Dr. Shahzad Waseem, welcomed the decision to announce the election date and expressed confidence in the people’s ability to determine the country’s direction.\nHe commended all stakeholders for unanimously agreeing on the election date and urged political parties to consider young leaders when awarding tickets, acknowledging their pivotal role in shaping the nation’s future. Dr. Waseem called on the caretaker government to ensure the upcoming election is conducted transparently, leaving no room for doubts about its fairness.\nHe said this will help remove uncertainty on the political front. He said that given the challenges faced by Pakistan, it is imperative to move forward with a new mindset and the spirit of reconciliation.\nHe also extended his appreciation for the Chief Justice of Pakistan’s decision regarding the election date and urged its prompt implementation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:21:36.146Z"
}
