{
  "title": "President directs FIO to ensure conflict of interest disclosure before selling insurance policies",
  "link": "https://www.app.com.pk/national/president-directs-fio-to-ensure-conflict-of-interest-disclosure-before-selling-insurance-policies/",
  "date_published": "2023-11-03T11:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 3 (APP): President Dr Arif Alvi on Friday asked the Federal Insurance Ombudsman (FIO) to ensure that insurance companies disclosed the conflict of interest to the purchaser of the insurance policy before selling the policy as there had been instances of grave mis-selling of policies which required a serious relook at product structure and front-loaded commission of the agents of insurance companies.\nThe president gave these directions while deciding upon a representation filed by the Pak-Qatar Family Takaful Ltd (the petitioner company) against the order of the Federal Insurance Ombudsman (FIO).\nAs per details, Anwar ul Haq (the complainant) had alleged that he purchased the Kafalah Takaful Plan from the petitioner company in February 2017 for the sum assured of Rs 4.5 million and an annual premium of Rs 750,000/-.\nHe had been paying the annual premiums regularly till the year 2022 and the total amount of his deposited premiums was Rs. 4.5 million. On account of unavoidable circumstances, he requested the company for the withdrawal of his deposited premiums with all benefits and profit but to no avail.\nFeeling aggrieved, he approached FIO, which passed the order in his favour directing the company to pay Rs 4.3 million to the complainant. The company, then, filed a representation with the President against the order of FIO.\nThe president held a personal hearing of the case and after listening to both sides, gave his decision. In his decision, he observed that it was an admitted fact that the company received Rs 4.5 million from the complainant, invested the money in business, and earned considerable profit.\n“The equitable principle of enrichment envisages that one should not unjustly enrich himself at the expense of the others”, he added. He further pointed out that it was also a principle of equity that ‘He who suffers no loss deserves no gain’. He said that it would be unjust to deprive the complainant of his contribution in the profit but the company unjustifiably declined its refund on the pretext of the prevailing cash value of the policy which was only Rs. 3,112,258/-.\n“Time and again, there have been instances of grave miss-selling of insurance policies that necessitate a serious relook at product structure and front-loaded commissions of the agents of insurance companies. Frontend commission structure coupled with complex insurance products that obfuscate the insured’s understanding is found to be at the heart of mis-selling”, the president noted.\nHe further said that it was usually the insured that ended up with the wrong end of the stick, given the high surrender costs. He regretted that the insured had to suffer even if he stayed on policy and even when he opted out because he ended up paying a heavy surrender penalty, adding that the intermediaries, who get to pocket a fat commission, rarely suffered.\nThe president stated that mis-selling of insurance policies was now a well-documented fact and with a fat commission structure that was also front-loaded, agents selling these policies had very little to lose. He highlighted that sometimes the insured didn’t understand the terms and conditions of the policy well and the agent was unable to explain its nuances given the overly complicated structure of insurance-cum-saving-plans. He stated that sometimes the agents deliberately misled the customers into buying the wrong plan and sometimes the sale was an outright fraud.\nThe president, therefore, concluded that it was incumbent upon FIO that directions may be issued to insurance companies that they must disclose the conflict of interest of agents to the customer at the time of selling the policy.\nHe added that the customer should be informed that how much commission was to be paid to the insurance agent out of the first premium received from them so that they may know as to what was the interest and ratio of profit of agent before deciding to purchase the policy or otherwise. “Since the times of the Holy Prophet (PBUH), traders were asked by him not to lie about profit when selling a product. In this case, there is no transparency for the buyer”, he maintained.\nThe president rejected the instant representation by modifying FIO’s impugned order that the petitioner company was directed to refund Rs. 4.5 million instead of Rs 4.3 million to the complainant within 30 days of the receipt of the order.",
  "retrievedAt": "2025-08-11T10:21:25.957Z"
}
