{
  "title": "Impression of post-press conference acquittal from May 9 arson accusations not true: PM",
  "link": "https://www.app.com.pk/national/impression-of-post-press-conference-acquittal-from-may-9-accusations-not-true-pm/",
  "date_published": "2023-11-03T17:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 3 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Friday said that the impression of acquittal from the accusations of May 9 arsons after addressing a condemnatory press conference was not completely true, as ultimate exoneration would be determined by the courts.\n“This is an impression. I know many people, who also condemned the May 9 violence, are still facing the legal challenge. Therefore, this is not completely true that they walk free after addressing a press conference,” the prime minister said in an interview with a private television channel.\nHe said it was impossible to get riddance once “you get implicated in an FIR (first information report), without going through the legal process”.\nTo a question, he reiterated his earlier position that as per the law, the power of finalizing the election date rested with the Election Commission. Even now, the date was finalised by the ECP which had the powers to hold consultations including with the head of the state, he added.\nHe said all the political parties were allowed to hold rallies as no additional laws were in place to disrupt gatherings of any party. Sometimes, the political parties also created such impressions to attract their voters which was nothing serious but a part of the politics.\nHe said the political parties, including Pakistan Tehreek-e-Insaf, Jamaat-e-Islami and Pakistan Peoples Party, were free to field their candidates and contest the polls.\nThe caretaker government would ensure a level playing field for all the parties and the national and international observers would also validate the fairness of the elections, he maintained.\nAsked about the action against smugglers and hoarders, the prime minister said it yielded positive results in the form of historic improvement in the stock market and dollar depreciation which reduced the country’s debt by Rs 4,000 billion, besides declining the prices of rice, sugar, ghee and other commodities.\nHe said the smuggled goods deprived the government of tax revenue and impacted local industry but after the operation, the local industry had started receiving orders which would also create employments and enhance tax collection.\nAsked about the action against those involved in the said crimes, Prime Minister Kakar said it was a challenge due to the lack of evidence admissible in the court. However, the situation could be addressed through necessary legal amendments, he remarked.\nAs the interviewer asked whether his meeting with former cricketer Shahid Afridi was linked with the expiry of the incumbent Pakistan Cricket Board chairperson’s term on November 4, the prime minister said it was a social interaction.\nAbout any extension in the tenure of Zaka Ashraf, he said the government would make any decision after the World Cup was over and would keep working under a “doctrine of necessity” till that time.\nRegarding the repatriation of illegal foreigners, he said the policy was not meant for any vendetta rather aimed at regulating the movement which was in the interest of both the countries. He said sometimes, human rights organizations also unnecessarily criticized the policy which, otherwise, kept mum when immigrants were left to drown in the Mediterranean.\nHe said there was no perpetual ban on foreigners being repatriated as they could be back to Pakistan after obtaining their travel documents and visas.\nHe said a mechanism had been developed at NADRA to eliminate any abuse or pollutants in family trees while respecting the rights of the Pashtun people of Pakistan. The scientific DNAs were also being suggested to ascertain their originality.\nTo a question, he said the government was making efforts to fully privatise some entities or at least leave behind the process at a mature stage for the next government.\nRegarding the Pakistan Steels Mill, he said two or three models were being considered.\nAsked about the enforced disappearances, he said the state had an inherent right of apprehension which was wrongly called enforced disappearance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:22:06.199Z"
}
