{
  "title": "Weekly inflation up by 0.71 percent",
  "link": "https://www.app.com.pk/national/weekly-inflation-up-by-0-71-percent/",
  "date_published": "2023-11-03T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 3 (APP): The weekly inflation, measured by the Sensitive Price Indicator (SPI), witnessed an increase of 0.71 percent for the combined consumption group during the week ended on November 02, the Pakistan Bureau of Statistics (PBS) reported on Friday.\nThe SPI for the week under review in the above-mentioned group was recorded at 279.08 points as compared to 277.11 points during the past week, according to the PBS data.\nAs compared to the corresponding week of last year, the SPI for the combined consumption group in the week under review witnessed an increase of 29.88 percent.\nThe weekly SPI with the base year 2015-16 =100 covers 17 urban centers and 51 essential items for all expenditure groups.\nThe SPI for the lowest consumption group up to Rs 17,732, increased by 0.85 percent and went up to 286.19 points from last week’s 283.77 points.\nThe SPI for consumption groups from Rs 17,732-22,888; Rs 22,889-29,517; Rs 29,518-44,175 and above Rs 44,175 increased by 0.86 percent, 0.77 percent, 0.76 percent and 0.64 percent respectively.\nDuring the week, out of 51 items, prices of 12 (23.53%) items increased, 14 (27.45%) items decreased and 25 (49.02%) items remained stable.\nThe items, which recorded a decrease in their average prices on a week-on-week (WoW) included gur (2.66%), banana (1.78%), cooking oil 5 litre (1.62%), vegetable ghee 1 kg (1.23%), lpg cylinder (1.05%), pulse masoor (0.93%), wheat flour (0.62%), washing soap (0.41%) and mustard oil (0.32%).\nThe items that recorded an increase in their average prices on a week-on-week (wow) basis, included tomatoes (25.58%), onions (25.25%), chicken (10.79%), potatoes (1.61%), tea lipton (1.58%), eggs (1.30%), garlic (0.50%), rice basmati broken (0.19%), georgette (0.28%) and firewood (0.05%).\nOn a Year-on-Year (YoY) basis, the items that witnessed decrease in prices included, tomatoes (26.26%), onions (13.98%), pulse gram (5.50%), mustard oil (4.47%) and vegetable ghee 1 kg (1.97%).\nThe commodities which recorded an increase in their average prices on YoY basis included gas charges for Q1 (108.38%), cigarettes (94.46%), chilies powder (84.11%), rice basmati broken (78.08%), wheat flour (76.51%), sugar (62.60%), rice irri-6/9 (62.27%), gents sponge chappal (58.05%), tea packet (55.79%), garlic (54.51%) and gur (53.53%).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:21:54.335Z"
}
