{
  "title": "TLP threatens to paralyse Balochistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Tehreek-i-Labbaik Pakistan (TLP) on Saturday warned it would paralyse Balochistan if the government continued its crackdown on party workers and stressed that Pakistan “must never recognise Israel”.\n\nSpeaking at a press conference in Quetta, TLP Quetta division leaders Haji Muhammad Zarif Rizvi and Amir Tariq Mahmood Abbasi said mass arrests and raids aimed at stopping their planned “Labbaik Ya Aqsa Million March” would not deter the party’s support for the Palestinian cause.\n\nThey condemned what they described as severe repression of peaceful activists by the federal and Punjab governments, alleging that authorities opened fire on unarmed demonstrators, injuring hundreds and arresting many.\n\nSays Pakistan must not recognise Israel\n\nThe protests, they said, were solidarity demonstrations for Palestinians but were met with “indiscriminate shooting” and heavy-handed tactics that violated fundamental rights.\n\nThe leaders alleged raids on the home of TLP chief Saad Hussain Rizvi, harassment of women and students and a night-time police operation at the movement’s central office at Jamia Masjid Rehmatul Lil Alameen in Lahore involving gunfire and tear-gas shelling. They called such actions an attempt to crush a constitutionally protected right to protest.\n\nTLP officials said the party had announced a “Labbaik Ya Aqsa Million March” for Oct 10 in support of Palestinians but claimed that nationwide crackdowns beginning on Oct 7 led to mass arrests aimed at preventing the demonstration.\n\nThey issued demands for the immediate release of detained activists, justice for families of victims and action against officials responsible for alleged abuses.\n\nWarning that continued repression would trigger a province-wide shutdown in Balochistan, the leaders insisted the movement remained peaceful and vowed to proceed with the million march in Islamabad.\n\nThey reiterated that Pakistan must not recognise Israel, which they labelled a “terrorist state”, calling any move towards recognition a betrayal of the Ummah.\n\nPublished in Dawn, October 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/12104607b8020c1.webp",
  "retrievedAt": "2025-10-16T23:31:51.971Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948301/tlp-threatens-to-paralyse-balochistan",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T01:54:13.000Z"
}
