{
  "title": "48 Pakistani universities make it to Times Higher Education ranking - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: This year 48 universities from Pakistan have made it to the Times Higher Education (THE) World University Rankings for 2026.\n\nThe Quaid-i-Azam University, Islamabad, is ranked between 401 and 500 category, followed by Bahauddin Zakariya University, Multan, which improved by 400 points to be in the 601-800 ranking.\n\nOther institutions ranked between 601 and 800 include Air University, COMSATS University, Islamabad, Government College University, Faisalabad, National University of Sciences and Technology, Sukkur IBA, University of Lahore, and University of Veterinary and Animal Sciences, Lahore.\n\nFifteen institutions ranked between 801–1000 include Abdul Wali Khan University of Mardan, Capital University of Science and Technology, Ghulam Ishaq Khan Institute of Engineering Sciences and Technology, Government College University Lahore, International Islamic University, Islamabad, Iqra University, Khwaja Fareed University of Engineering and Technology, RYK, Lahore University of Management and Sciences, The Islamia University of Bahawalpur, University of Central Punjab, University of Engineering and Technology Taxila, University of Gujrat, University of Malakand, University of Management and Technology, and University of the Punjab.\n\nQuaid-i-Azam on top, Zakariya second\n\nTen institutions ranked between 1001-1200 include Bahria University, Hazara University, Mansehra, Institute of Space Technology, PMAS Arid Agriculture University Rawalpindi, Riphah International University, The University of Haripur, University of Education, Lahore, University of Engineering and Technology, Peshawar, University of Okara, and University of Peshawar.\n\nEight others were ranked between 1201-1500 and six 1501 plus.\n\nThe 2026 rankings of the best universities in the world includes 2,191 institutions from 115 countries and territories.\n\nOxford retains the number one spot for the 10th consecutive year, driven by a strong research environment score. Princeton rises to joint third place, and is the only US university to achieve its best-ever finish this year. China has five universities in the top 40, up from three last year, but top universities remain steady. Hong Kong occupies a record six spots in the top 200 as a result of improvements in teaching metrics. India now has the second highest number of ranked universities for the first time, only behind the US.\n\nThe Times Higher Education World University Rankings are the only global performance tables that judge research-intensive universities across all their core missions: teaching, research, knowledge transfer and international outlook. It uses 18 carefully-calibrated performance indicators to provide the most comprehensive and balanced comparisons, trusted by students, academics, university leaders, industry and governments. One of the metrics (study abroad) currently has zero weight but they intend to include it in future.\n\nBZU Vice Chancellor Prof Dr Zubair Iqbal said the THE ranking improvement is result of collective efforts of the faculty, administration and employees.\n\nHe said the quality of research has been improved significantly and faculty members are encouraged to get projects for BZU. Various research incentives have also been provided to faculty.\n\nPublished in Dawn, October 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T23:31:47.293Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948344/48-pakistani-universities-make-it-to-times-higher-education-ranking",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T03:21:44.000Z"
}
