{
  "title": "Former Sindh Assembly speaker Agha Siraj Durrani passes away at 72 - Pakistan - DAWN.COM",
  "author": null,
  "content": "PPP leader and former speaker of the Sindh Assembly Agha Siraj Durrani passed away on Wednesday at the age of 72, according to a statement by Sindh Chief Minister Murad Ali Shah.\n\nIn a statement issued by the Sindh CM House, Shah expressed deep sorrow and grief over Durrani’s passing. Murad called Durrani “a sincere, loyal and principled leader of the party, saying he played an important role in strengthening the Sindh Assembly and stabilising democracy.\n\n“Agha Siraj Durrani made public service the axis of his politics,” he said, expressing his condolences to the bereaved family.\n\n“The services of the late Agha Siraj Durrani will always be remembered,” he said.\n\nPresident Asif Ali Zardari also expressed “deep sorrow” over Durrani’s passing.\n\n“The president paid tribute to his political and public services, noting his role in strengthening democracy and serving the people of Sindh,” said a post by the Presidency on social media platform X.\n\nPrime Minister Shehbaz Sharif also paid tribute to the late Durrani for his services as the Sindh Assembly speaker, saying that his contributions to politics and public welfare would “always be remembered”, APP reported.\n\nForeign Minister Ishaq Dar remembered Durrani as a “seasoned parliamentarian and devoted public representative”.\n\nDar said in a post on X that he was deeply saddened by Durrani’s demise.\n\n“May Allah Almighty grant him the highest place in Jannah and give strength to his family and loved ones to bear this huge loss,” he added.\n\nKarachi Mayor Murtaza Wahab, in a post on X, also expressed his sorrow at Durrani’s passing, calling him an “honourable man who stood by the PPP and the leadership during the toughest of times”.\n\nNational Assembly Speaker Sardar Ayaz Sadiq said Durrani was a “wise and astute politician”, saying that his services for the promotion and strengthening of democracy would be remembered.\n\n“The void created by the passing of Agha Siraj Durrani will not be filled for a long time,” Sadiq added.\n\nBorn in 1953, Durrani completed his matriculation from Karachi’s St. Patrick’s School in 1971, and subsequently received his Bachelor of Commerce degree from Karachi and his LLB degree from Karachi’s Sindh Muslim Law College.\n\nAlong with his older brother Agha Salahuddin, he had contested the 1985 party-less elections, held under General Ziaul Haq, from Shikarpur and lost. In 1990, he was arrested on charges of embezzlement in several cases during Nawaz Sharif’s first government and remained in jail for some time.\n\nHe had served two consecutive terms as the Sindh Assembly speaker, from 2013-2018 and from 2018-2023.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/151136167599137.webp",
  "retrievedAt": "2025-10-16T23:44:01.189Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949072/former-sindh-assembly-speaker-agha-siraj-durrani-passes-away-at-72",
  "dateList": "2025-10-12",
  "date_published": "2025-10-15T06:42:32.000Z"
}
