{
  "title": "Pakistan recover to 313-5 after South Africa strike back in first Test - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan rode on a brilliant 93 from Imam-ul-Haq to reach 313-5 after a brief fightback from South Africa on the opening day of the first Test in Lahore on Sunday.\n\nShan Masood hit 76, but Haq missed out on his hundred as Pakistan slumped to 199-5 as four wickets fell quickly.\n\nMohammad Rizwan, 62 not out, and Salman Agha, unbeaten 52 at the close, rebuilt the innings during an unbroken sixth-wicket stand of 114 in the final session on a spin-friendly Gaddafi Stadium pitch.\n\nRizwan hit two fours and two sixes in his 12th Test half-century while Agha had two fours and a six in reaching his 10th fifty.\n\nPakistan dominated most of the first two sessions, but then had a mini- collapse from 163-1 to 199-5 as they lost four wickets for 36 runs, the last three without adding a run either side of the tea interval.\n\nSpinner Prenelan Subrayen trapped Masood lbw for 76, including nine fours and a six, to end a 161-run stand with Haq.\n\nLeft-arm spinner Senuran Muthusamy then had Haq caught at short-leg by Tony de Zorzi, after a 236-minute knock that included seven fours and a six.\n\nNext ball — the last before tea — Muthusamy had Saud Shakeel caught and bowled to bring South Africa back into the game at 199-4.\n\nLocal hero Babar Azam fell for 23, trapped leg-before by off-spinner Simon Harmer after the interval to make it 199-5 and leave a good 10,000 holiday crowd disappointed.\n\nSouth Africa could have been in a better position had they not dropped Masood on 61 and Haq on 72 with Subrayen the unlucky bowler on both occasions.\n\nWith the pitch likely to turn, Masood opted to bat after winning the toss and named specialist spin duo Noman Ali and Sajid Khan in the team Pakistan lost opener Abdullah Shafique leg before to pace spearhead Kagiso Rabada off the third ball of the day.\n\nSouth African captain Aiden Markram turned to his spinners in the sixth over and by lunch had used all three — Subrayen, Harmer and Muthusamy.\n\nBut there were no further dramas in the opening session as Pakistan reached 107-1 at lunch after Haq had brought up his 10th Test fifty.\n\nThe two-match series is part of the new World Test Championship two-year cycle. South Africa won the title by beating Australia in June.\n\nThe two-match series is part of the new World Test Championship two-year cycle. South Africa won the title by beating Australia in June.\n\nThe Shan Masood-led hosts, who finished an embarrassing last in the nine-team table of the 2023-25 WTC, must raise their game significantly in all departments if they are to resist Aiden Markram-captained tourists who claimed their maiden WTC crown by beating Australia in the final at Lord’s last year.\n\nThe Gaddafi Stadium did not host any Test in the previous WTC cycle after the venue was used for the third and final Test between Pakistan and Australia in March 2022. South Africa, on their last tour to Pakistan in 2021, lost a two-Test series 2-0.\n\nWhile both the captains expected a spin-friendly track at the Gaddafi Stadium, there were doubts over the inclusion of key Pakistan off-spinner Sajid, who was suffering from a viral infection but did practise with the team yesteday.\n\nAhead of the game, Shan said taking 20 wickets, rather than piling up big scores, will be key to winning the Test series. “We don’t want flat tracks where matches end in draws,” he remarked.\n\nIn his presser, Markram acknowledged Pakistan’s plan to prepare spinning pitches at home and said that his players were ready for the challenge. “As a team not heavily exposed to these conditions, it is going to be exciting and a great opportunity for us to get things right here.”\n\nPakistan: Shan Masood (captain), Imam-ul-Haq, Abdullah Shafique, Babar Azam, Mohammad Rizwan, Salman Ali Agha, Saud Shakeel, Hasan Ali, Shaheen Shah Afridi, Noman Ali, Sajid Khan\n\nSouth Africa: Aiden Markram (captain), Dewald Brevis, Tony de Zorzi, Simon Harmer, Wiaan Mulder, Senuran Muthusamy, Kagiso Rabada, Ryan Rickelton, Tristan Stubbs, Prenelan Subrayen, Kyle Verreynne\n\nUmpires: Chris Brown (NZ) and Rod Tucker (AUS)\n\nTV umpire: Sharfuddoula Saikat (BAN)\n\nMatch referee: Ranjan Madugalle (SRI)",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/12175835e6be369.webp",
  "retrievedAt": "2025-10-16T23:31:47.042Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948370/pakistan-recover-to-313-5-after-south-africa-strike-back-in-first-test",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T05:19:50.000Z"
}
