{
  "title": "PMDC increases fee by 5pc, warns colleges against violation of notification - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan Medical and Dental Council (PMDC) has fixed Rs1.89 million as the maximum fee for the students of medical and dental colleges for the session 2025-26, increasing the fee by 5 percent.\n\nHowever, parents, who admitted their students in year 2023-24, said they have stillbeen paying Rs2.7 million or even more, and have appealed to the decision makers to intervene into the matter.\n\nAccording to the fresh notification of PMDC, the council under its Act 2022, has capped the tuition fee for MBBS and BDS programmes at Rs 1.8 million and shall be applicable for entire programme from Session 2024-25. Furthermore, 5pc fee increase shall be applicable for Session 2025-26 with subsequent annual increases linked to the Consumer Price Index (CPI) inflation rate from Session 2026-27 onward, as recommended by the Medical Education Committee constituted by the prime minister.\n\nDocument shows that the fee for the year 2024-25 was Rs1.8 million but will be increased by 5pc to Rs 1,890,000 as annual increase recommended by the committee.\n\nParents claim paying Rs2.7m fee increased in 2023-24, but revised at Rs1.8m for 2024-25 session\n\n“Each private medical and dental institution shall display the fee structure publicly at least three months before initiating the admission process, in compliance with Section 20(7) of the PMDC Act, 2022,” it stated.\n\n“The council further decided that strict compliance shall be observed for all private institutions. Any breach will result in penal consequences. Colleges are further directed, in their own interest, that charging or displaying a tuition fee structure contrary to this notification on their official websites will be deemed unlawful and may entail consequential action, including but not limited to suspension of accreditation, student admissions, or further legal action under Section 33 of the PMDC Act, 2022,” it stated.\n\n“Moreover, any party aggrieved by the implementation of the captioned tuition fees, if not charged in accordance with this notification, may lodge a complaint through the PMDC Complaint Portal (https://pmdc.pk/ContactUs/Complaint),” the notification stated.\n\nAfter a hue and cry by the parents, last year Senate Standing Committee on Health had taken notice of the exorbitant increase in fees of medical and dental colleges.\n\nPML-N Senator Irfan Siddique was the one who raised the issue at every platform due to which not only a subcommittee was constituted to look into the issue but Prime Minister Shehbaz Sharif also took notice and constituted a committee headed by deputy prime minister Ishaq Dar which played a role to reduce the fee.\n\nLast year PMDC notified that maximum fee of the medical and dental colleges will be Rs1.8 million and this year it has been increased by 5pc due to which colleges can charge upto Rs1.89 million for upcoming session.\n\nOn the other hand parents have shown reservations that while PMDC ensured Rs1.8 million fee for those students who got admission in year 2024-25, why the students who got admissions in year 2023-24 were being forced to pay Rs2.7 million and even more.\n\nParents, requesting anonymity, have appealed to Prime Minister Shehbaz Sharif and President PMDC to intervene and address the issue.\n\nLast year representative body of private colleges i.e. Pakistan Association of Private Medical and Dental Institutions (PAMI) had rejected the decision of the PMDC to cap annual fee at Rs1.8 million.\n\nPAMI claimed that since 2022 salaries and wages had increased by 65pc, utilities 103pc, repair and maintenance 92pc, other expenses by 66pc and total cost has been increased by 65pc.\n\nIt claimed that public sector colleges were spending from Rs4 million to Rs5.7 million on each student every year. It alleged that a rigid fee structure posed risks compromising quality, causing financial instability and impacting healthcare as it would reduce hospitals’ ability to provide quality services.\n\nPublished in Dawn, October 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T23:31:48.982Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948249/pmdc-increases-fee-by-5pc-warns-colleges-against-violation-of-notification",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T01:54:51.000Z"
}
