{
  "title": "Vacherot beats cousin Rinderknech to clinch Shanghai Masters title - Sport - DAWN.COM",
  "author": null,
  "content": "Monaco’s world number 204 Valentin Vacherot completed a fairytale run at the Shanghai Masters on Sunday, rallying from a set down to defeat his cousin, Frenchman Arthur Rinderknech, 4-6 6-3 6-3 in the final and secure his first ATP title.\n\nThe 26-year-old’s victory made him the first player from Monaco to win an ATP singles title and set a record as the lowest-ranked player to triumph at an ATP Masters 1000 event.\n\nThe victorious Vacherot was overwhelmed with emotion, before sharing a heartfelt embrace with his older cousin Rinderknech, 30.\n\nVacherot had earned a little under $600,000 in career prize money but lifting the trophy in Shanghai will see him pocket over $1.12 million.\n\nVacherot’s remarkable run to the title also means he will be ranked world number 40 on Monday while Rinderknech, ranked 54th, is set to rise into the top 40.\n\n“I’m just all like, crying, it’s just, it’s unreal what just happened. I have no idea what’s happening right now, I’m not in a dream, it’s just crazy. I’m just so happy of my performance these past two weeks,” Vacherot said.\n\n“I think there’s just two winners today, one family that won, and I think for the sport of tennis, this story is just unreal.\n\n“I wish there could be two winners, but unfortunately there’s only one, and for myself, I’m really happy that it’s me.”\n\nThe cousins had given fans plenty to cheer about in the previous round Vacherot stunning record 24-times Grand Slam champion Novak Djokovic and Rinderknech overcoming 2021 US Open winner Daniil Medvedev.\n\nWith Swiss maestro and former champion Roger Federer watching from the stands, Rinderknech broke first to lead 2-1 in the opening set, capitalizing on a flurry of unforced errors from Vacherot.\n\nThe momentum continued to flow Rinderknech’s way as he covered the court with impressive athleticism, racing to a 3-1 lead before extending it to 4-2.\n\nVacherot mounted a spirited fightback to narrow the gap to 5-4, but Rinderknech held his nerve to stave off his cousin’s comeback attempt and seal the first set in 41 minutes.\n\nIn a tight second set, momentum swung back and forth with the duo locked at 3-3 before Vacherot crunched a backhand winner to break Rinderknech and surge ahead 5-3, keeping his cool to force a decider.\n\nVacherot came alive in the third set, breaking early to establish a 2-0 lead.\n\nAlthough Rinderknech reduced the deficit to 3-2, he required a medical timeout to treat his back. Vacherot pressed on, sealing victory with a forehand winner down the line.\n\n“That it’s the guy that I’ve been training with in Texas A&M (University), that I’ve been growing up with on vacation and everything,” Vacherot said.\n\n“It was really tough, he did a better job than me in the first set … And yeah, just find a way to turn that around and then make the match a little bit myself towards the end.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/121827513867965.webp",
  "retrievedAt": "2025-10-16T23:31:45.543Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948425/vacherot-beats-cousin-rinderknech-to-clinch-shanghai-masters-title",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T13:33:47.000Z"
}
