{
  "title": "Political upheaval - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE long lull on the political front may have just been the build-up to a fresh storm. About a week after KP Chief Minister Ali Amin Gandapur complained to incarcerated PTI founder Imran Khan about the latter’s sister — reportedly going so far as to accuse her of attempting to ‘hijack’ the party with the help of an intelligence agency — he has been told to step down as provincial chief executive.\n\nMr Gandapur had laid bare his grievances concerning Aleema Khan in his first meeting with the jailed former prime minister in many months, primarily accusing her of ‘dividing’ the party and not doing enough to rein in his critics. It may be recalled that this meeting took place shortly after the PTI’s Sept 27 political rally in Peshawar, during which party workers had protested rather boorishly as Mr Gandapur addressed the crowd. The outgoing chief minister appears to have taken the insult to heart.\n\nIt had been becoming clear that Mr Khan might soon have to choose between the two, and even though he did briefly prohibit them from bickering, ultimately, he seems to have felt that blood runs thicker than water. One wonders how Mr Gandapur feels about this rather unceremonious dismissal. He appears to have been constantly under pressure from the PTI’s support base for not taking a more aggressive stance against the federal government and the state. This pressure had grown as Mr Khan’s incarceration continued to drag on.\n\nThe party’s new nominee for the position, Sohail Afridi, is said to be a more combative person, but how much can he do in the same position? It seems Mr Gandapur’s critics never came to terms with the fact that official titles and roles often come with their own very heavy restrictions. One must wait to see what the change of command will portend for the party.\n\nOne thing that does not seem to have changed is the constant conflict that surrounds the PTI chief. And, because of this, chaos still defines everything the party does. A major decision has been taken rather abruptly, and few really seem to know why. The party’s general secretary, Salman Akram Raja, has framed it as a desire for a ‘fresh start’ after the failure of Mr Gandapur’s government to implement Mr Khan’s vision.\n\nSome are taking Mr Afridi’s nomination as a signal of the overall direction that the PTI may be orienting itself towards. The party recently announced Mahmood Khan Achakzai and Raja Nasir Abbas as its nominees for opposition leaders in the National Assembly and the Senate. It was seen as a provocation. With Mr Afridi’s addition to the PTI’s list of most important representatives, the party will be perceived to be taking a hard line. It would be interesting to see what developments unfold in the days to come.\n\nPublished in Dawn, October 9th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:18:15.681Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947580/political-upheaval",
  "dateList": "2025-10-12",
  "date_published": "2025-10-09T02:23:58.000Z"
}
