{
  "title": "Motorways to Islamabad opened as TLP protesters remain camped in Muridke - Pakistan - DAWN.COM",
  "author": null,
  "content": "Authorities on Sunday opened multiple roads across Punjab as Tehreek-i-Labbaik Pakistan (TLP) protesters continued their sit-ins in Muridke and Sadhoke for the third consecutive day, continuing attempts to reach Islamabad to stage a protest in ‘solidarity with Palestinians’.\n\nThe M1 motorway connects Peshawar to Islamabad, while the M2 motorway connects Lahore to Islamabad and the M3 motorway links Lahore to Abdul Hakeem in Khanewal district, where it joins the M4 leading to Faisalabad and Multan.\n\nA day ago, the main TLP procession reached Muridke after breaking through police security, hours after violent clashes in Lahore left over four dozen police personnel injured. The marchers then staged a sit-in at Muridke, blocked by trenches dug along the GT Road.\n\nIn an update on Sunday evening, motorway police issued an alert stating that the Sialkot Motorway was now open, but that the roads going from Chowk Yateem to Scheme Morr and Babu Sabu remained closed.\n\nEarlier, authorities reopened the M1, M2 and M3 motorways for traffic on Sunday.\n\n“Citizens can travel on the Swat Expressway, Hazara Motorway and Hakla DI Khan Motorway,” the police said in a traffic alert. “Containers have been removed from all internal and external routes.”\n\nThe motorway police concluded the alert by stating that information can be received from their 130 helpline and official social media accounts.\n\nRoads that have been reopened today include parts of Margalla Road, Jinnah Avenue and Seventh Avenue, as well as Korang Road to Bani Gala; Jinnah Road to Park Road; Garden Avenue to Tulip Banquet Hall; Chand Tara Flyover to Club Road (Murree Road); Fazal-i-Haq Road, Nazimuddin Road, Embassy Road; Ninth Avenue from JUP to Shaheen Chowk via internal access from Margalla Road, and others.\n\nTLP spokesperson Usman Naushahi told Dawn.com that protesters remained in Muridke and Sadhoke, saying, “We have not gone further yet.”\n\nWhile internet service is slow in the area, mobile data services are working, according to citizens.\n\nMeanwhile, the federal government moved over 1,200 paramilitary personnel to Punjab to intercept protesters, who have been marching on the capital from Lahore via GT Road.\n\nYesterday, police said a gathering of 300 people, carrying TLP flags, posters, and banners, reached the crossing from Dhoke Abbasi and surrounding areas.\n\nThe rally chanted anti-government slogans and delivered speeches, provoking people to join the TLP protest. The protesters also blocked the GT Road and refused to clear it when asked by the police. In response, the police used force, arresting 90 protesters and seizing sound systems, while others escaped.\n\nLast night, the police also decided to lift some blockades from a few roads.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/121333420b658a5.webp",
  "retrievedAt": "2025-10-16T23:31:45.598Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948389/motorways-to-islamabad-opened-as-tlp-protesters-remain-camped-in-muridke",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T09:09:25.000Z"
}
