{
  "title": "Rulers little concerned about ordinary citizens: Justice Mansoor Ali Shah - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Justice Syed Mansoor Ali Shah, senior puisne judge of the Supreme Court, on Saturday deplored that successive governments in Pakistan had shown little interest in improving the lives of ordinary citizens, saying policymaking remained trapped in “elite capture”.\n\n“Everything that is done is elitist to satisfy or protect industry or perhaps pressure groups, but an ordinary person is not in the picture,” he said, speaking at Breathe Pakistan’s session “Judicial Activism and Litigation for Clean Air in Pakistan.”\n\nSenior lawyer Faisal Siddiqui conducted the session.\n\nThe judge said he realised, during his whole career as a lawyer and a judge, “the ordinary person is not relevant.”\n\nSays environmental watchdog fully captured by govt\n\nJustice Shah, who is known for his work on public interest and the environment, said he was not against development, but it should be done in an intelligent way.\n\nHe lamented that the Environmental Protection Agency (EPA), the regulatory body to control projects, was a department fully captured by the government. He said a famous judgement known as the “Imrana Tiwana case” held that there was total regulatory capture.\n\n“Do you think the EPA can tell the provincial government that this project is not allowed?” Justice Shah said, highlighting the regulatory capture.\n\nHe also questioned the capacity and qualification of the people running the EPA.\n\nHe noted that the bureaucrats heading environment departments have no expertise required to deal with climate issues.\n\nJustice Shah held civil society responsible for the lack of public interest litigation pertaining to air pollution and climate change. He said civil society had not done much to protect the environment.\n\n“You should be more active, you should have come to courts, pursued cases and fought for your rights. If you are not going to fight for your right, nobody is going to bother about you,” he said, addressing civil society.\n\nHe maintained that civil society and regulatory functions were weak and the government was not interested in people.\n\nCapacity building of judges\n\nJustice Shah also called for the capacity building of judges in the higher courts, saying, “the environment is a niche litigation.”\n\nHe said the judiciary had few judges dealing with environmental matters as the whole corpus of the judiciary did not know much about the environment. He said the most serious existential threat Pakistan was facing was climate change.\n\nThere cannot be a more serious threat to Pakistan than climate change right now or air pollution and we are not bothered, he lamented.\n\nHe expressed his disappointment that Prime Minister Shehbaz Sharif and Chief Minister of Punjab Maryam Nawaz, who were invited to the conference, did not attend the event to tell the audience about their plans. He said they might be busy, but it shows what interests they have as far as climate change and air pollution are concerned, as these issues affect millions of people.\n\nJustice Shah stated that the country would need “climate courts” in the future. He also called for establishing “climate finance” to cater to the chronic issues of the environment. He reiterated that there was a serious governance issue on the part of the executive, coupled with a nice relaxed civil society.\n\nGaps in law enforcement\n\nAddressing the same questions, Supreme Court Justice Ayesha A. Malik also pointed out lapses on the part of the executive and the regulatory bodies. She said there were big gaps in the enforcement and the implementation.\n\nThe judge highlighted the issues she encountered hearing cases related to the establishment of brick kilns and poultry farms. She admitted that persons doing lawful businesses also need fair regulation.\n\nShe noted that in most of the cases related to environmental issues, the regulator appeared to have worked with no urgency and commitment.\n\nJustice Malik regretted that the government did not have the capacity to dispose of the corpses after killing the dogs, which itself is wrong.\n\n“You do not have an arrangement to deal with the carcass. You do not know what to do with it. Then why are you killing the dogs in the first place?” the judge asked.\n\nShe noted that the jurisprudence for judges evolves when a problem keeps coming before them. She called the gap in the enforcement and implementation a bigger challenge for all.\n\nLahore High Court Justice Jawad Hassan noted that Pakistan’s judiciary always led the way internationally on its judgements. He said Pakistan had its Constitution almost 53 years ago, but it never had the right to the environment in that Constitution. He said the 26th Amendment had only last year inserted Article 9A in the Constitution, which gives every citizen a right to a clean, healthy and sustainable environment.\n\nHe pointed out that decades ago there was litigation before the court for the enforcement of the motor vehicle ordinance, and the law had not been implemented by the government until last year, and now everybody had EPA stickers on their vehicles.\n\nIn an observation, which Justice Shah incidentally disagreed with, Justice Hassan said the government had woken up now just because of what the judiciary had been doing.\n\nHe was also of the opinion that the government had started taking robust measures for the enforcement of the environmental laws.\n\nPublished in Dawn, October 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1208282157f8445.webp",
  "retrievedAt": "2025-10-16T23:44:10.073Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948280/rulers-little-concerned-about-ordinary-citizens-justice-mansoor-ali-shah",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T01:54:06.000Z"
}
