{
  "title": "Zelensky urges Trump to replicate Gaza deal for Kyiv - World - DAWN.COM",
  "author": null,
  "content": "• Emergency crew restore power to many parts of Ukraine after attack on grid\n• US, UK, and Nato conduct air patrol along Russia’s border\n\nKYIV: Ukrainian President Volodymyr Zelensky urged US President Donald Trump on Saturday to use the diplomatic success he achieved in the Middle East as a model to end the ongoing conflict in Ukraine, saying that if Trump could stop one war, “others can be stopped as well.”\n\nThe appeal came during a phone call between the two leaders, just a day after Moscow launched what Ukrainian officials described as a large-scale attack targeting critical energy facilities across 10 regions, including the capital Kyiv.\n\n“If a war can be stopped in one region, then surely other wars can be stopped as well, including the Russian war,” Zelen­sky wrote on Facebook, describing what he characterised as a “very positive and productive” conversation with Trump.\n\nThe timing of the appeal underscores Ukraine’s growing concern that its nearly three-year conflict with Russia has slipped down the international agenda, overshadowed by the Gaza crisis and other global flashpoints.\n\nDiplomatic momentum has stalled in recent months, with both sides accusing the other of undermining potential negotiations.\n\nRelations between the two leaders have warmed dramatically since Febru­ary, when they sparred during a now infamous televised meeting at the White House.\n\nTrump has since grown more hostile towards Moscow while expressing sympathy for Ukraine.\n\nIn September, he wrote on Truth Social that Kyiv should try to “take back” all its occupied territory with Europe’s and Nato’s help.\n\nUS First Lady Melania Trump said Friday she had secured the release of Ukrainian children abducted by Russia after establishing an extraordinary back channel of communication with Putin.\n\nPower restored\n\nMeanwhile, emergency crews restored power to many parts of Ukraine after an overnight Russian drone and missile attack on Friday struck energy facilities, plunging large districts of Kyiv and other areas into darkness and cutting water supplies.\n\nFriday’s strikes, which Ukrainian officials said killed at least five people and disrupted power supplies in the southern Odesa region.\n\nMoscow has targeted Ukraine’s energy grid each winter since it invaded in 2022, cutting power and heating to millions of households and disrupting water supply in what Kyiv says is a brazen war crime.\n\nRussia denies targeting civilians and says Ukraine uses the energy sites to power its military sector.\n\nUkrainian drone attacks meanwhile killed two people in Russia, according to regional officials. Both countries have accused each other of frustrating progress towards a peace deal in recent months.\n\nRussia blames Kyiv and its European allies for the impasse, accusing them of undermining peace negotiations with Washington.\n\nUkraine and Europe accuse Russia of playing for time so it can seize more Ukrainian territory.\n\nRussia launched its full-scale invasion of Ukraine in February 2022, describing it as a “special military operation” to demilitarise the country and prevent the expansion of NATO.\n\nKyiv and its European allies say the war is an illegal land grab that has resulted in tens of thousands of civilian and military casualties and widespread destruction.\n\nJets fly near Russian border\n\nBritain said on Saturday that two Royal Air Force aircraft flew a 12-hour mission earlier this week alongside US and Nato forces to patrol the border of Russia, amid a series of recent Russian drone and aircraft incursions into Nato airspace.\n\n“This was a substantial joint mission with our US and Nato allies,” defence minister John Healey said.\n\n“Not only does this provide valuable intelligence to boost the operational awareness of our Armed Forces, but sends a powerful message of Nato unity to Putin and our adversaries,” Healey added.\n\nPublished in Dawn, October 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T23:44:17.245Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948285/zelensky-urges-trump-to-replicate-gaza-deal-for-kyiv",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T01:54:06.000Z"
}
