{
  "title": "23 troops martyred, 200 Taliban and affiliated terrorists killed in border skirmishes with Afghanistan: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Twenty-three Pakistani troops have been martyred and 200 Taliban and affiliated terrorists have been killed in border clashes following an attack from the Afghan side, the Inter-Services Public Relations (ISPR) said in a statement on Sunday.\n\nThe statement comes after overnight skirmishes between the two sides, which began “on the night of Oct 11/12, 2025, [after] Afghan Taliban and India-sponsored Fitna-al-Khawarij launched an unprovoked attack on Pakistan, along the Pak-Afghan border”.\n\nFitna-al-Khawarij is a term the state uses for terrorists belonging to the banned Tehreek-i-Taliban Pakistan (TTP) while Fitna-al-Hindustan is a term designated by the state for terrorist organisations in Balo­chistan.\n\nKey developments\n\n“During overnight skirmishes, 23 brave sons of Pakistan embraced shahadat (martyrdom) while defending the territorial integrity of our beloved country against this outrageous action, while 29 soldiers [were] injured.\n\n“According to credible intelligence estimates and damage assessment, more than 200 Taliban and affiliated terrorists have been neutralised, while the number of injured is much higher,” the ISPR statement said.\n\nAfghanistan claims it carried out the attack as a “retaliatory” measure, accusing Islamabad of conducting air strikes in its territory earlier this week. For its part, Islamabad has not confirmed whether it was behind the air strikes but maintains that Kabul should “stop harbouring the Tehreek-i-Taliban Pakistan on its soil”.\n\nIn response to Islamabad’s repeated calls to bar terrorists from using its territory for cross-border attacks, Afghanistan denies the allegation of allowing terrorist outfits to use it soil.\n\nBut, the ISPR statement today said Afghanistan’s “cowardly action” of the overnight attack, which included fire and a few physical raids, was aimed at destabilising the border areas to “facilitate terrorism, furthering the nefarious designs of the terrorists”.\n\nAccording to a late-night report by state-run Radio Pakistan, which cited security sources, “Afghan forces carried out unprovoked firing at several locations”, Angoor Adda, Bajaur, Kurram, Dir, Chitral in Khyber Pakhtunkhwa and Bahram Chah in Balochistan along the Pak-Afghan border.\n\n“Exercising the right of self-defence, the alert armed forces of Pakistan repelled the assault decisively all along the border and inflicted heavy casualties on Taliban forces and affiliated khwarij,” the ISPR said.\n\n“Precision fires and strikes, as well as physical raids, were directed against Taliban camps and posts, terrorist training facilities and support networks operating from [the] Afghan territory, including elements linked to Fitna-al-Khawarij, Fitna-al-Hindustan and ISKP/ Daesh.\n\n“All possible measures were taken to avoid collateral damage and to protect civilian lives.”\n\nThe ISPR said that as a result of the unrelenting operations, multiple Taliban locations were destroyed along the border.\n\nProviding further details, it said 21 hostile positions on the Afghan side of the border were also briefly physically captured and multiple terrorist training camps, used to plan and facilitate attacks against Pakistan, were rendered inoperative.\n\n“The infra-structural damages to Taliban posts, camps, headquarters and support networks of terrorists are extensive, all along the border and range from tactical to operational depth.”.\n\nThe ISPR further said: “The armed forces of Pakistan remain ever ready to protect the territorial integrity, life and property of the people of Pakistan. Our resolve to defend Pakistan’s territorial integrity and to defeat those who threaten our security is unwavering.”\n\nIt underlined that while the people of Pakistan preferred constructive diplomacy and dialogue over violence and belligerence, “we will not tolerate the treacherous use of Afghan soil for terrorism against Pakistan”.\n\n“We have noted with concern that this serious provocation has occurred during the visit of the [Afghan] Taliban foreign minister to India, the biggest sponsor of terrorism in the region.\n\n“In the interest of regional peace and security, we call upon the Taliban government to take immediate and verifiable actions to neutralise the terrorist groups, inter alia, Fitna-al-Khawarij, Fitna-al-Hindustan and ISKP/ Daesh operating from their territory.”\n\nOtherwise, it asserted, Pakistan will continue to exercise its right to defend its people by persistently neutralising terror targets.\n\nIt said that the Taliban government should “shun any ill-begotten notions and prioritise well-being, peace, prosperity and development of the Afghan people over irresponsible sabre-rattling”.\n\nThe ISPR concluded its statement, saying: “Last night’s episode vindicates Pakistan’s long-standing position that the Taliban government is actively facilitating the terrorists.\n\n“If the Taliban government continues to sponsor terrorist outfits, in cohorts with India, for the shortsighted objective of destabilising the region, the people and the state of Pakistan will not rest until the menace of terrorism emanating from Afghanistan is completely eliminated.”\n\nEarlier, state broadcaster PTV News reported details of the Afghan posts targeted by the Pakistan Army. The sources said the army had launched “successful strikes at Durrani Camp, Manojba Camp Battalion Headquarters and Manojba Camp-2, Ghaznali Headquarters in Noshki Sector and neutralised them completely”.\n\n“Dozens of Taliban soldiers and Khwarij positioned in the camps and headquarters have been reportedly killed,” the report added.\n\nSecurity sources said that the army had also devastated the Afghan Taliban’s “most important Asmatullah Karar Camp” at Spin Boldak. They noted that the camp was the Taliban’s “one of the biggest” from where terrorist activities against Pakistan were carried out.\n\nAfghan Taliban and Khawarij hiding in the camp reportedly suffered “heavy losses”.\n\nMeanwhile, state broadcaster Radio Pakistan shared footage of a “second engagement and destruction” of the Asmatullah Karar camp at Spin Boldak.\n\nThe second Battalion Headquarters of the Afghan Taliban in the Brabcha area, from “where Khawarij and Fitna-al-Hindustan terrorists were launched into Pakistan”, was also targeted, as per the sources.\n\nIn a series of posts on X, PTV News said Afghanistan’s Barikot base camp, Manojba Camp-3, Karzai post, and Shapola Khula Taliban post were also destroyed.\n\nAccording to Radio Pakistan, security forces also occupied an “important” Afghan post in the Zhob sector and hoisted the Pakistani flag. “Humvee-armoured personnel carrier of the Afghan Taliban deployed at the post was destroyed as well in the attack,” the report said.\n\nTargeting an Afghan Tank position at the mountain peaks opposite Kurram, the forces eliminated “several tanks of the Afghan Taliban”, the state media reported, citing security sources.\n\nIn an earlier Radio Pakistan report, security sources said Afghanistan’s Jandusar Post, Turkmenzai camp and Kharchar Fort had also been “completely destroyed”.\n\nOn the other hand, Pakistan’s posts also came under attack in the Baramcha area of Chagai district, which borders Afghanistan’s Helmand province. “Afghan forces opened indiscriminate fire at Pakistani border posts with heavy weapons late on Saturday night,” a senior official said.\n\nSecurity sources stated that Afghan forces also tried to infiltrate into Pishin and Zhob districts. However, the attempts were defeated by Pakistani forces in the area.\n\nFollowing the border fighting, Afghan government spokesman Zabihullah Mujahid urged Pakistan to “desist from using force as such actions will have negative consequences”.\n\nAddressing a press conference in Kabul, Mujahid alleged that “certain elements within the Pakistani security establishment want to destabilise Afghanistan”.\n\nHe further warned that Kabul “possessed weapons to respond”, adding that the Afghanistan Islamic Emirate had made “efforts to resolve issues with Pakistan”.\n\nEarlier, the Afghan military said in a statement that “in retaliation for the air strikes by Pakistani forces”, Taliban border forces in the east are “engaged in heavy clashes against Pakistani forces’ posts in various border areas”.\n\nTaliban officials from the provinces of Kunar, Nangarhar, Paktika, Khost, and Helmand — all located on the border between Pakistan and Afghanistan — had confirmed the clashes.\n\nThe Afghan Ministry of Defence also confirmed earlier that Afghan forces had launched “retaliatory operations against Pakistani security forces” tonight.\n\n“The operations ended at midnight. If the opposing side violates Afghanistan’s territory again, our armed forces are ready to defend their territory and will respond firmly,” said the statement.\n\nKabul said on Sunday that it had halted attacks at the request of Qatar and Saudi Arabia, Reuters reported.\n\nSeparately, it was reported that the Torkham border crossing had been closed for all kinds of traffic after the overnight firing exchanges at various locations, according to locals on the Pakistani side.\n\nAfghan official Qureshi Badloon also confirmed the closure to Dawn.com from Nangarhar.\n\nSeparately,Reuters, citing local officials, reported that two main border crossings with Afghanistan, at Torkham and Chaman, and at least three minor crossings, at Kharlachi, Angoor Adda and Ghulam Khan, were closed on Sunday.\n\nEarlier in the day, as reports with details of the skirmishes continued to emerge, President Asif Ali Zardari and Prime Minister Shehbaz Sharif asserted there would be “no compromise” on Pakistan’s sovereignty.\n\nPresident Zardari, in a statement, noted that there were United Nations reports that “proved” terrorist attacks were carried out from the Afghan soil. However, he also stressed that bilateral respect and joint counter-terrorism efforts were the key to long-term regional peace.\n\nAsserting that no compromise will be made on Pakistan’s sovereignty, President Zardari said the country remained “firmly committed to safeguarding its national interests, regional sovereignty and security”.\n\nHe noted that attacks launched “from the territory of the Interim Afghan government by India-backed Khawarij terrorists are a well-documented reality confirmed in successive United Nations Security Council (UNSC) monitoring reports”.\n\nThe president pointed out that Pakistan had repeatedly “made it clear that its civilians and security personnel are being targeted through the nexus of the Indian sponsored Khawarij and other terror groups”.\n\nPresident Zardari urged the interim Afghan government to take “concrete and verifiable action” against anti-Pakistan terrorist elements operating from the Afghan soil, the statement added. He termed the menace of terrorism “sponsored by India” as the “greatest threat to regional peace and stability”.\n\n“Terrorism is a shared challenge and its burden cannot be placed on any single country,” the president was quoted as saying.\n\nIn his statement, President Zardari termed it unfortunate that the current Afghan interim administration had “turned away from the just struggle of the oppressed people” of India-occupied Kashmir, “thereby doing injustice to both history and the Muslim ummah”.\n\nHe reaffirmed that Pakistan will “never accept any disputed or misleading position on Jammu and Kashmir” and reiterated that India’s “unlawful claims over the territory” are contrary to international law and UNSC resolutions.\n\nThe president highlighted Pakistan’s hosting of millions of Afghan refugees for over decades, saying it “demonstrated Islamic fraternity and exemplary neighbourliness”.\n\nHowever, he added that the “dignified repatriation of Afghan citizens” was in the interest of both countries and essential for sustainable peace.\n\n“President Zardari reaffirmed that Pakistan will continue to support the educational and humanitarian needs of the Afghan people, but no compromise will ever be made on Pakistan’s national sovereignty,” the statement said.\n\nThe president emphasised that Pakistan had extended “every possible facilitation to Afghanistan in trade, economic connectivity, and people-to-people exchanges”. Mutual cooperation and economic partnership are the foundation for lasting peace and regional prosperity, he noted.\n\nPresident Zardari underscored that Pakistan desires a peaceful, stable, and prosperous Afghanistan. He said brotherly relations must be based on mutual respect, security cooperation and a shared commitment to regional peace.\n\nHe expressed hope that the interim Afghan government will prevent its soil from being used by “Khawarij and India-backed terrorist elements against Pakistan”, stressing that only joint and practical measures can guarantee enduring peace in the region.\n\nPM Shehbaz, too, strongly condemned the “provocation by Afghanistan in Pakistan’s border areas”.\n\n“There will be no compromise on Pakistan’s defence, and every provocation will be met with a strong and effective response,“ he asserted.\n\n“We are proud of the professional excellence of our armed forces,” the premier said, hailing the army’s “strong and effective response to Afghanistan’s aggression”.\n\n“The Pakistan Army not only gave a powerful response to Afghan aggression under the bold leadership of Field Marshal Syed Asim Munir, but also destroyed several of their posts, forcing them to retreat,” the prime minister said.\n\n“Our defence is in strong hands, and we know well how to defend every inch of our motherland,” PM Shehbaz said, adding that the army has always given a “crushing response to every form of external aggression”.\n\nThe prime minister also highlighted that Pakistan had “repeatedly provided Afghanistan with information regarding terrorist elements such as Fitna-al-Khawarij and Fitna-al-Hindustan, who are using Afghan soil to launch attacks against Pakistan”.\n\n“Terrorist organisations are being supported by certain elements within Afghanistan,” he stated, expressing hope that the Afghan interim government will ensure its territory is not used by terrorist elements against Pakistan.\n\nIn one of the first official statements by Pakistan, Interior Minister Mohsin Naqvi lauded the security forces for their “prompt” response.\n\n“Firing by Afghan forces on civilian population is a blatant violation of international laws. Pakistan’s brave forces have given a prompt and effective response that no provocation will be tolerated,” Naqvi said on X.\n\n“Pakistan’s forces are alert and Afghanistan is being answered with stones for bricks. The people of Pakistan stand with the brave armed forces like a lead wall. Afghanistan will also be given a befitting reply like India.”\n\nExpressing his “deep concern” over the attack from the Afghan side, Deputy PM Ishaq Dar said “unprovoked firing and raids along Pak-Afghan border by the Taliban government is a serious provocation”.\n\n“Pakistan’s befitting response and strikes are against Taliban infrastructure and to neutralise Fitna-al-Khawarij and Fitna-al-Hindustan terrorist elements operating from Afghan soil,” he asserted in a post on X.\n\n“Our defensive response is not targeted towards peace-loving Afghan civilian population. Unlike Taliban forces, we are exercising extreme caution in our defensive responses to avoid loss of civilian lives,” Dar added.\n\nHe expressed Pakistan’s expectation from the interim Afghan government to take “concrete measures against terrorist elements and their perpetrators that wish to derail Pak-Afghan relations”.\n\n“Pakistan will take all possible measures to defend its own territory, sovereignty and its people,” the deputy premier pledged.\n\nFormer foreign minister and PPP chairperson Bilawal Bhutto-Zardari also called upon Afghan authorities to “act with restraint and responsibility in the interest of regional peace”.\n\n“Unprovoked aggression by Afghan forces along our border poses a serious threat to regional peace and stability, while undermining collective efforts toward shared prosperity,” he said in a statement.\n\nBilawal said Pakistan’s armed forces had responded with resolve, restraint, and professionalism, reflecting Pakistan’s enduring commitment to peace and stability while safeguarding every inch of national territory and protecting civilian lives.\n\nHe further urged the Taliban authorities in Kabul to take concrete and verifiable action against terrorist outfits operating from Afghan soil, warning that such groups threaten not only Pakistan but also the security and future of the entire region.\n\n“Pakistan desires a peaceful, stable, and prosperous Afghanistan. We urge the Taliban leadership to engage in practical, result-oriented dialogue and cooperation to secure enduring peace and stability in our shared neighborhood,” he said.\n\nBilawal expressed hope that the interim Afghan government would ensure that Afghan soil was not used against Pakistan and that both countries would work together in the spirit of mutual respect to promote peace, stability, and prosperity across the region and beyond.\n\nAfter the border clashes were reported, multiple countries urged Pakistan and Afghanistan to exercise restraint.\n\nSaudi Arabia, with which Pakistan recently signed a mutual defence deal, expressed concern at the skirmishes.\n\n“The kingdom calls for restraint, avoiding escalation, and embracing dialogue and wisdom to contribute to reducing tensions and maintaining security and stability in the region.\n\n“The kingdom affirms its support for all regional and international efforts aimed at promoting peace and stability, and its continued commitment to ensuring security, which will achieve stability and prosperity for the brotherly Pakistani and Afghan peoples.”\n\nIranian top diplomat Abbas Araghchi called on Afghanistan and Pakistan “to exercise restraint” amid ongoing clashes.\n\n“Our position is that both sides must exercise restraint,” Araghchi said during a live interview with state television, adding that “stability” between the countries “contributes to regional stability”.\n\nQatar’s foreign ministry urged both sides to prioritise dialogue, diplomacy, and restraint, and to work towards containing differences in a manner that helps to reduce tension and avoid escalation, in order to achieve regional security and stability.\n\nThe foreign ministry reiterated Qatar’s support for all regional and international efforts aimed at strengthening international peace and security, and affirmed its commitment to ensuring security and prosperity for the people of the two countries.\n\nThe border clashes come against the backdrop of Pakistan suffering multiple casualties among security forces in intelligence-based operations against terrorists, while Afghanistan accused the former of violating its sovereignty.\n\nThe issue of terrorists using Afghan soil against Pakistan, along with frequent border skirmishes, has long strained ties between the two countries, with Islamabad repeatedly urging the interim Afghan government to stop allowing its territory to be used for attacks.\n\nIslamabad maintains that its patience is wearing thin after a series of deadly attacks inside Pakistan that it blames on militants operating from Afghan territory.\n\nAn instance of Pakistan asserting its position was when Defence Minister Khawaja Asif had said on Thursday in the National Assembly, “Enough is enough, Pakistan government and armed forces’ patience has worn out.”\n\nWhile Kabul maintains that it does not provide safe havens to terrorists, Afghan officials blamed Pakistan on Friday of bombing a civilian market in the Paktika airspace near the Durand Line and also violating the territory of capital Kabul. This was after an explosion was reported in Afghanistan on Thursday.\n\nThe Foreign Office in Islamabad avoided directly acknowledging the incident in Kabul during a weekly briefing on Friday, instead framing Pakistan’s counter-terrorism actions as legitimate self-defence against militants operating from Afghan soil.\n\nSpeaking at a separate news conference in Peshawar, held almost simultaneously with the FO briefing, the ISPR director general also declined to confirm or deny whether the military had carried out any strikes in Kabul. He nonetheless underscored Pakistan’s right and resolve to defend itself. “Afghanistan is being used as a base of operations for carrying out terrorism in Pakistan. There is also evidence of this,” he said.\n\nAfghan Foreign Minister Amir Khan Muttaqi, who was on a visit to India when the border clashes began, had condemned Thursday’s incident and Pakistan’s alleged role in it during a press conference in New Delhi.\n\nIt was India’s — with which Pakistan’s ties have historically been tense — first high-level engagement with the Taliban government since it took power in 2021. On Friday, New Delhi also announced that it would be reopening its embassy in Kabul after four years.\n\nThese developments followed a four-day military escalation between Pakistan and India in May — one of the deadliest in recent years — which led to a new low in relations between the two countries.\n\nAdditional reporting by Nadir Guramani",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/12160824fff12de.webp",
  "retrievedAt": "2025-10-16T23:44:13.288Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948219/23-troops-martyred-200-taliban-and-affiliated-terrorists-killed-in-border-skirmishes-with-afghanistan-ispr",
  "dateList": "2025-10-12",
  "date_published": "2025-10-11T19:23:12.000Z"
}
