{
  "title": "PM Shehbaz to visit Egypt tomorrow, will attend signing ceremony of pact aimed at ending ‘grave situation in Gaza’: FO - World - DAWN.COM",
  "author": null,
  "content": "The Foreign Office said on Sunday that Prime Minister Shehbaz Sharif would visit Egypt tomorrow (Monday) to participate in the Sharm el-Sheikh Peace Summit and attend the signing ceremony of the peace agreement aimed at ending the “prevailing grave situation in Gaza”.\n\n“At the invitation of the president of Egypt, HE Abdel Fattah Al-Sisi, and the president of the United States, HE Donald Trump, the prime minister of Pakistan, Muhammad Shehbaz Sharif, will visit Egypt on October 13, 2025 to participate in the Sharm el-Sheikh Peace Summit and attend the signing ceremony of the peace agreement aimed at ending the prevailing grave situation in Gaza,” the FO statement said.\n\nThe prime minister would be accompanied by Deputy Prime Minister and Foreign Minister Ishaq Dar, as well as other senior ministers during the visit, it added.\n\nThe summit is taking place amid positive signs of Palestinians getting respite from the two-year-long Israeli onslaught. During this period, more than 67,000 Palestinians have been killed and the toll continues to rise as more bodies are recovered.\n\nIt comes after US President Trump mediated a truce with the help of eight Muslim nations between Hamas and Israel and paved the way for the end of genocide in Gaza through a 20-point plan.\n\nThe FO statement today also underscored this, stating: “The Sharm el-Sheikh Summit is the result of the diplomatic efforts that began on the sidelines of the UN General Assembly’s 80th Session in New York last month.\n\n“The prime minister of Pakistan, along with the leaders of seven Arab-Islamic countries (Egypt, Jordan, Qatar, Saudi Arabia, the UAE, Indonesia, and Turkiye), attended a summit-level meeting with the president of the United States on September 23, 2025 to explore avenues for achieving peace in Gaza.”\n\nThe FO further recalled that through a joint statement, these Arab-Islamic countries “welcomed President Trump’s efforts to achieve peace and reaffirmed their joint commitment to work with the United States to achieve a comprehensive and sustainable ceasefire and to address the critical humanitarian conditions in Gaza”.\n\nIt added that PM Shehbaz’s participation in the summit in Egypt, “reflects Pakistan’s historic, consistent, and unwavering support for the just cause of the Palestinian people for their right to self-determination as well as for achieving lasting peace and stability in the region”.\n\n“Pakistan hopes that the Sharm el-Sheikh Peace Summit will pave the way for full Israeli withdrawal, protection of Palestinian civilians, an end to their displacement, release of prisoners, addressing of the prevailing grave humanitarian situation, as well as reconstruction of Gaza.\n\n“Pakistan also hopes that such efforts will contribute to a credible political process aimed at achieving an independent, viable, and contiguous State of Palestine, with Al-Quds Al-Sharif as its capital, based on pre-1967 borders, in line with relevant UN resolutions and the Arab Peace Initiative,” the FO statement said.\n\nTrump, along with his Egyptian counterpart Sisi, will chair the Monday summit set to be attended by world leaders, including the head of the United Nations.\n\nThe gathering in the Red Sea resort town will bring together “leaders from more than 20 countries”, Sisi’s office said.\n\nIt will seek “to end the war in the Gaza Strip, enhance efforts to achieve peace and stability in the Middle East, and usher in a new era of regional security”.\n\nBritish Prime Minister Keir Starmer, his Italian counterpart Giorgia Meloni and Pedro Sanchez of Spain will also attend the summit.\n\nFrench President Emmanuel Macron and Turkish President Recep Tayyip Erdogan will also travel to Sharm el-Sheikh, according to their offices.\n\nThe European Council will be represented by its president, Antonio Costa, a spokesperson said.\n\nJordan’s King Abdullah II is also expected to attend, according to state media.\n\nIsrael and Hamas, however, will not attend the summit.\n\nWith additional input from Reuters and AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1220072550da749.webp",
  "retrievedAt": "2025-10-16T23:31:42.828Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948433/pm-shehbaz-to-visit-egypt-tomorrow-will-attend-signing-ceremony-of-pact-aimed-at-ending-grave-situation-in-gaza-fo",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T15:08:36.000Z"
}
