{
  "title": "Beijing blames US for raising trade tensions, defends rare earth curbs - World - DAWN.COM",
  "author": null,
  "content": "China called President Donald Trump’s latest US tariffs on Chinese goods hypocritical on Sunday and defended its curbs on exports of rare earth elements and equipment, but stopped short of imposing new levies on US products.\n\nOn Friday, Trump responded to Beijing’s most recent export controls by imposing additional tariffs of 100 per cent on China’s US-bound exports, along with new export controls on critical software by November 1.\n\nThe revived trade tensions have rattled Wall Street, sending Big Tech shares tumbling, worried foreign companies dependent on China’s production of processed rare earths and rare earth magnets, and could derail a summit between Trump and Chinese President Xi Jinping tentatively scheduled for later this month.\n\nThe Chinese commerce ministry’s statement on Sunday was Beijing’s first direct response to Trump’s lengthy Truth Social post on Friday, where he accused Beijing of suddenly raising trade tensions after an uneasy truce was reached six months ago between the world’s two largest economies, allowing them to trade goods without sky-high tariff rates.\n\n“Our relationship with China over the past six months has been a very good one, thereby making this move on Trade an even more surprising one,” Trump said.\n\nThe commerce ministry said in an equally lengthy statement that its export controls on rare-earth elements followed a series of US measures since bilateral trade talks in Madrid last month.\n\nBeijing cited the addition of Chinese companies to a US trade blacklist and Washington’s imposition of port fees on China-linked ships as examples.\n\n“The US actions have severely harmed China’s interests and undermined the atmosphere of bilateral economic and trade talks, and China is resolutely opposed to them,” the ministry said.\n\nBeijing stopped short of explicitly connecting these US actions to its export curbs on rare-earth elements, saying its curbs were motivated by concern about these materials’ military applications at a time of “frequent military conflicts”.\n\nIt also held off on announcing a corresponding levy on China-bound US imports, unlike earlier in the year, when both superpowers progressively ratcheted up tariffs on each other until the US rate was 145pc while China’s was 125pc.\n\n“Willful threats of high tariffs are not the right way to get along with China. China’s position on the trade war is consistent: we do not want it, but we are not afraid of it,” the commerce ministry said, adding China would take corresponding measures if the US did not correct its course.\n\nChina’s decision not to immediately respond in kind to Trump’s opening salvo in this latest round of trade tensions could leave the door open for both countries to negotiate a de-escalation, analysts said.\n\n“By clarifying the rationale behind its retaliatory measures, Beijing is also outlining a potential path forward for negotiations. The ball is now in the US court,” said Alfredo Montufar-Helu, managing director at strategic advisory firm GreenPoint.\n\nBut Hutong Research said in a note on Saturday that if Beijing chooses not to respond to Trump’s 100pc tariff hike, it may signal that Beijing no longer prioritises a long-term deal with him, reflecting diminished confidence in his ability to restrain hawks or stick to commitments.\n\n“Key watchpoints now: Whether Beijing moves to freeze or complicate the TikTok sale, given its political symbolism. Proceeding with the sale under current conditions would be seen as a major concession,” the research firm said.\n\nThe commerce ministry also countered Trump’s narrative that China was using its dominance in processed rare earths and rare earth magnets to attack all countries, not just the US.\n\n“We have been contacted by other Countries who are extremely angry at this great trade hostility, which came out of nowhere,” Trump said on Friday on Truth Social.\n\nChina produces over 90pc of the world’s processed rare earths and rare earth magnets. The 17 rare earths are vital materials in products ranging from electric vehicles to aircraft engines and military radars.\n\nExports of 12 of them are restricted after China’s commerce ministry on Thursday added five — holmium, erbium, thulium, europium and ytterbium — along with related materials.\n\nThe commerce ministry statement on Sunday sought to reassure foreign companies spooked by the latest export curbs, promising to promote compliant trade by granting general licenses and license exemptions.\n\n“China’s export controls are not export bans,” it said. “Any export applications for civilian use that comply with regulations will be approved, and relevant enterprises need not worry.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/121302474534c48.webp",
  "retrievedAt": "2025-10-16T23:31:45.022Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948382/beijing-blames-us-for-raising-trade-tensions-defends-rare-earth-curbs",
  "dateList": "2025-10-12",
  "date_published": "2025-10-12T08:29:11.000Z"
}
