{
  "title": "28,626 candidates face intense scrutiny ahead of Saturday deadline",
  "link": "https://www.app.com.pk/national/28626-candidates-face-intense-scrutiny-ahead-of-saturday-deadline/",
  "date_published": "2023-12-26T17:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 26 (APP): The scrutiny of nomination papers for 28,626 candidates contesting for 1,085 general and reserved seats of the National and provincial assemblies is underway, which will conclude on Saturday.\nAccording to the Election Commission of Pakistan (ECP), some 7,713 candidates are vying for 266 general National Assembly seats, and 609 for 70 women and minority seats.\nAbout 7,242 men and 471 women will compete for the general seats.\nLikewise, 18,546 candidates have entered the race for 593 general provincial assembly seats, besides 2,367 for 156 reserved seats. Total 17,744 men and 802 women will contest for provincial assembly seats.\nAbout 8,592 men and 437 women vie for 297 general seats in the Punjab Assembly; 4,060 men and 205 women for 130 general seats in the Sindh Assembly; 3,349 men and 115 women for 115 general seats in the Khyber Pakhtunkhwa Assembly, and 1,743 men and 45 women for 51 general seats in the Balochistan Assembly.\nMore than 1,500 candidates have submitted nomination papers for 22 National Assembly and 47 Provincial Assembly seats in Karachi.\nThe ECP approved nomination papers of 131 candidates running in constituencies of the twin cities of Rawalpindi and Islamabad.\nIn Islamabad, 24 candidates contesting three National Assembly constituencies have passed the scrutiny process. Simultaneously, in Rawalpindi, some 107 candidates have successfully undergone scrutiny for three National and nine provincial assembly constituencies.\nIn Rawalpindi, several notable individuals, including Fayyaz-ul-Hasan Chauhan of Istehkam-e-Pakistan Party (IPP), Daniyal Chaudhry of Pakistan Muslim League-Nawaz (PML-N), Qamarul Islam, Nasir Butt, Mian Aslam from Jamaat-e-Islami, and independent candidate Chaudhry Nisar, have their nomination papers accepted. Furthermore, Sheikh Rashid Shafiq from Awami Muslim League also received approval for his nomination papers.\nIn Rawalpindi’s NA-35, NA-55, and NA-56 constituencies, 30 candidates for National Assembly seats have got their papers approved. Additionally, across provincial constituencies from PP-10 to PP-17, a total of 90 candidates gained validation for their nomination papers.\nThe ECP will publish the final list of candidates on January 11, with the allocation of election symbols slated for January 13.",
  "retrievedAt": "2025-08-11T11:13:14.483Z"
}
