{
  "title": "Shaheed BB’s sacrifice for restoration of democracy to be remembered: NA Speaker",
  "link": "https://www.app.com.pk/national/shaheed-bbs-sacrifice-for-restoration-of-democracy-to-be-remembered-na-speaker/",
  "date_published": "2023-12-26T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 26 (APP):Speaker National Assembly Raja Pervez Ashraf on Tuesday said that the sacrifice rendered by Shaheed Benazir Bhutto for the restoration and strengthening of democracy in the country would ever be remembered in the political annals of history.\nHe said that Shaheed Benazir Bhutto sacrificed her life for the restoration and strengthening of democracy in the country.\nHe said that Shaheed Benazir Bhutto had the honour of being the first elected woman Prime Minister of the Islamic world. He expressed these views on the 16th martyrdom anniversary of Shaheed Benazir Bhutto.\nHe said that Shaheed Benazir Bhutto was conscious of threats and dangers posed by anti-national elements but she remained resolved to resist terrorism and extremism.\n“BB had fought against terrorism for the development and prosperity of the country and the strengthening of democracy,” he said.\nRaja Pervez Ashraf said that Shaheed Benazir Bhutto was the pioneer of democratic struggle in Pakistan and she always stood for the protection of the downtrodden classes of the society, the rights of minorities, and the development and independence of women.\nShe was an advocate of civil liberties harmony and unity in the federal units.\nThe speaker further said that Benazir Bhutto’s mission was to establish a democratic system and a society based on equality.\nShe carried forward the mission of the People’s Leader Shaheed Zulfikar Ali Bhutto, and said that Shaheed Benazir Bhutto remained committed to her mission with patience and courage till the last breath of her life.\nRaja Pervaiz Ashraf said that Shaheed Benazir Bhutto promoted the politics of tolerance and dialogue instead of imposing ideas.\nHer struggle to fight and eliminate the scourge of terrorism is of key importance.\nThe speaker said that by adopting the mission of Ms. Benazir Bhutto Shaheed, we can take the country on the path of development. After the martyrdom of Shaheed Benazir Bhutto, the way Asif Ali Zardari and Bilawal Bhutto led the party and the country is admirable. He expressed his determination that the mission of Ms. Benazir Bhutto Shaheed will be completed.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:13:57.071Z"
}
