{
  "title": "Senate session adjourned due to lack of quorum",
  "link": "https://www.app.com.pk/national/senate-session-adjourned-due-to-lack-of-quorum/",
  "date_published": "2023-12-26T08:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 26 (APP): The Senate session on Friday was adjourned due to a lack of quorum and ruckus that forced the chair to wind up the meeting of the House without taking any substantial agenda item.\nAfter Senator Saadia Abbasi succeeded in presenting her motion to establish the first Parliamentary Caucus on Water Resources, the Senator requested the chair to talk about it which was turned down by the chair.\nChairman Senate, Muhammad Sadiq Sanjrani directed the Caretaker Minister for Information and Broadcasting, Murtaza Solangi to table his bill for amendment titled “The Motion Pictures Ordinance, 1979 [The Motion Pictures (Amendment) Bill, 2023].”\nAs the Minister for Information initiated to present his bill, and started reading the text of the Bill, the Senators from different political parties started commotion, hence hampering his speech. However, Minister Murtaza Solangi continued and noted that the amendment was pertaining to censorship and regulation of the exhibition of films by means of cinematographs.\nAmid the rising ruckus, the Minister responded to the dissenting Senators saying, “The issuance of any ordinance is the prerogative of the government under Article 89 of the Constitution, and it is important for us to lay these ordinances in the form of bills and it’s the House’s job to make any decision on it.”\nAfter an interjection from the members of the House, the Senate Chairman directed to point out the quorum and start of the headcount. However, after falling short of quorum the House was adjourned till December 29, 2023, to meet again at 1030 hours.\nSpeaking on the occasion, Senator Mushtaq Ahmed of Jamaat-e-Islami Pakistan (JIP) said as per the article 230 of the Election Act (Chapter XIV “Caretaker Government”), the caretaker government was only authorized for handling day to day matters and by presenting ordinances, it was violating the Election Act.\nHe said that the interim government was intervening in strategic legislation, adding, “The tabling of the ordinance by the caretaker government at this moment is bypassing the constitution, parliament, law, masses and the demos.”\nHe further added that the interim government was not allowed to make legislation under the pressure of the World Bank and the International Monetary Fund (IMF) without the knowledge of the masses and the Parliament.\nThe Senate Chairman noted that it was a legislative document only and should be allowed to be sent to the Committee for further deliberations.\nLeader of the Opposition, Senator Dr Shahzad Waseem (PTI) said the caretaker government could not enact legislation and termed the ordinance as “unacceptable”.\nSenator Humayun Mohmand of Pakistan Tehreek-e-Insaf (PTI) said, “If we will give an inch to them, they will take the yard. These bills are not of crucial importance and can be lingered on for 40 days, after the new regime will come to power then it can be presented before the House.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:14:05.329Z"
}
