{
  "title": "Saudi Arabia begins registration of foreign pilgrims for Hajj 2024",
  "link": "https://www.app.com.pk/national/saudi-arabia-begins-registration-of-foreign-pilgrims-for-hajj-2024/",
  "date_published": "2023-12-26T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 26 (APP):Saudi Arabia announced that it has begun official registration of foreign pilgrims for Hajj 2024.\n“Muslim pilgrims from all over the world can now register along with their families for Hajj 1445/2024 through the Nusuk Hajj application under the Ministry of Hajj and Umrah,” the Center for International Communication (CIC), under the  Saudi Arabia’s Ministry of Media revealed.\nPilgrims from the continents of Asia, Africa, Europe, North America, South America and Oceania can apply for the pilgrimage through Nusuk Hajj application. More details about the registration can be had from hajj.nusuk.sa website, Saudi Gazette reported.\nNusuk Hajj is the gateway to a journey of a lifetime. It is the one-stop-shop platform, overseen by the Ministry of Hajj and Umrah. It offers pilgrims a variety of Hajj packages offered by authorized service providers, ensuring a seamless lifetime spiritual experience.\nThe pilgrims can register their names through the website after creating their account by giving an email address and selecting the current country of residence from the provided list, which includes all countries served for Hajj 2024.\nIt is noteworthy that the Hajj of 2023 was the first full-capacity annual pilgrimage in the post-pandemic period. A total of 1,845,045 pilgrims, including 1,660,915 foreign pilgrims and 184,130 domestic pilgrims, performed the last Hajj. Among them, the number of male pilgrims accounted for 969,694 while the number of female pilgrims reached 875,351. Pilgrims from Asian countries totalled 1,056,317, accounting for 63.5 per cent while the number of pilgrims from Arab countries stood at 346,214, representing 21 per cent of the total pilgrims.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:13:37.983Z"
}
