{
  "title": "Number of corona cases starts declining in Islamabad: NCOC",
  "link": "https://www.app.com.pk/national/number-of-corona-cases-starts-declining-in-islamabad-ncoc/",
  "date_published": "2020-07-07T21:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 08 (APP):The National Command and Operation Center (NCOC) on Wednesday said the number of coronavirus cases had started declining in the Federal Capital since the end of the previous month.\nAccording to the NCOC update, no death was reported in the Capital with sharp decline in new novel coronavirus (COVID-19) cases. Some 93 COVID-19 cases were reported in previous 24 hours taking the overall toll to 13,650 in the city with 140 deaths and 9,655 recoveries.\nDirector General Health Services, Municipal Corporation Islamabad (MCI) Dr Hassan Orooj said multiple factors were behind the drop of cases. Though the people had become careful and lockdowns also worked, however now they did not rush for testing as it was observed earlier.\nDr Hassan Orooj said the number of COVID-19 cases had dropped due to low number of testing. Earlier, the people were proactive in going for the test, however, now their number had reduced.\n“Earlier the people were rushing to the city hospitals but now the trend has changed,” he added.\nHe said one of the reasons behind low number of testing was the ‘fear’ amongst them for which they avoided COVID-19 test.\nHe said the people needed to follow the standard operating procedures (SOPs) and take preventive measures during Eid-ul-Azha. The corona positive cases would increase during the event if the people avoided social distancing, he warned.\nDr Hassan Orooj said another factor for low cases was the lockdown in areas which resulted in containing the virus. Mostly the patients were being reported from G and I sectors of the capital, he added.\nThe NCOC figures showed that the total active number of COVID-19 cases in the city were 13,577, with 140 deaths recorded and 9,403 patients recovered.\nThe average number of deaths in the city in the previous three days remained three, however, it dropped to one last week, said the data.\nA Ministry of National Health Services spokesperson said the drop of cases was a positive development, which was the result of efficient Track and Tracing by the health authorities in the federal capital territory.\\\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:27:53.253Z"
}
