{
  "title": "PM stresses global strategy to ‘soften’ pandemic’s impact on vulnerable labour populace",
  "link": "https://www.app.com.pk/national/pm-calls-for-joint-global-strategy-to-address-pandemics-economic-impact-on-labourers-2/",
  "date_published": "2020-07-08T05:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 8 (APP):Prime Minister Imran Khan on Wednesday said coronavirus pandemic had hit labourer community the most wordwide and stressed a joint global strategy to address the challenges pertaining to this highly vulnerable populace.\nSpeaking at the virtual Global Summit on ‘COVID-19 and the World of Work’, organized by International Labour Organization, Imran Khan said lockdown in countries had left a big population jobless, most of them labourers, daily wagers and self-employed.\n“We need a joint strategy on how to soften the impact on labourers world over,” he told the gathering of world leaders and heads of top world organizations, via video-link here from his office.\nThe five-day ILO Global Summit became the largest-ever online gathering of workers, employers and governments that discussed on how to address the economic and social impacts of the pandemic.\nImran Khan said as businesses were getting bankrupt amid coronavirus pandemic, the small and medium industries were to be affected the most in long run.\nLIVE #APPNews : Prime Minister #ImranKhan addressing ILO Virtual Global Summit on #Covid19 & the World of Work . @PakPMO @ilo #ILOSummit #betterfutureofwork #PMIKLeadingTheWorld #COVIDー19 https://t.co/GDsMzCmCbn\n— APP  #StayHomeSaveLives  (@appcsocialmedia) July 8, 2020\n“The future is very uncertain and we don’t know how long the economy will take to recover from this lockdown,” he said, adding that labourers remained the most vulnerable section of society in the wake of pandemic.\nImran Khan mentioned that this “informal and unregistered sector of economy” was a big challenge for his government along with their families dependent on their income.\nHe feared slowdown in agricultural sector leading to food crisis, however mentioned that the construction sector in the country was opened fairly quickly.\nImran Khan said his government through its social welfare programme Ehsaas, approached the registered deserving families and disbursed among them assistance money for livelihood, making the largest ever transaction in country’s history in a short span of time.\nContrarily, India’s strict ‘curfew-like’ lockdown pushed millions below poverty line, he said.\nThe Prime Minister said Pakistan and several other countries greatly relied on the remittances received from its expatriates and stressed a strategy to convince the host countries for a “sympathetic approach” before laying off the workers.\nHe lauded the initiative of ILO Global Summit Conference for “being held at a critical juncture and offering a platform for countries to learn from each others’ experiences of dealing with the pandemic.”\nHe termed the conference a beginning towards finding of solutions and expressed hope that constant exchange of ideas would help mitigate the sufferings of the labourers world over.",
  "retrievedAt": "2025-08-11T19:27:53.294Z"
}
