{
  "title": "Pakistan invites India to file ‘review & reconsideration’ petition on spy Kulbhushan Jadhav",
  "link": "https://www.app.com.pk/national/pakistan-invites-india-to-file-review-reconsideration-petition-on-spy-kulbhushan-jadhav/",
  "date_published": "2020-07-08T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 8 (APP):Pakistan on Wednesday invited India to initiate the process of ‘review and reconsideration’ on the sentence of its serving navy officer Commander Kulbhushan Jadhav as the 60-day time limit following an ordinance by Pakistan ends on July 19.\nIn compliance with the final verdict of International Court of Justice (ICJ), Pakistan had enacted the said ordinance on May 20, allowing the Indian government, Jadhav and his legal representative to file a review petition in Islamabad High Court within 60 days.\nAdditional Attorney General Ahmed Irfan along with Director General South Asia & SAARC Zahid Hafeez Chaudhry here at a joint press conference at Foreign Office said “On June 17, Commander Jadhav was invited to file a petition of review and reconsideration, which he refused and decided to continue with his mercy petition that he had filed soon after his sentence”.\nJadhav, a serving commander of Indian Navy associated with Indian spy agency Research and Analysis Wing, was arrested on March 3, 2016, from Balochistan on allegations of espionage and terrorism. He was given a death sentence by a Pakistan military court on April 10, 2017.\nThe Additional Attorney General said India had requested Pakistan to fight the case through Indian lawyers, however as per legal limitations, only Pakistani lawyers licensed with that particular court could appear before the bench. The Indian side was contacted immediately after the ordinance through a written correspondence, he added.\n“So far, we cannot say that India has not filed the review petition as legal avenues have still not been exhausted,” he said, expressing hope that India as a responsible state would proceed with the matter.\nThe Additional Attorney General said the government of Pakistan was not aware if India had engaged any lawyer to file a petition of review and reconsideration against Pakistan court’s sentence to Kulbhushan Jadhav.\nHe mentioned probabilities of filing the review petition by any of the three modes, i.e. by Jadhav himself, by his legally authorized lawyer or the by Government of India.\nDirector General South Asia and SAARC Zahid Hafeez said Pakistan had already offered India the second consular access to Commander Kulbhushan Jadhav.\nHe said usually the consular access was granted once, however Pakistan as a “humanitarian gesture was extending another such offer for the second time”.\nThis time, he said, the offer was made for Jadhav’s meeting with his wife and father. Earlier, a meeting was arranged between his wife and mother on December 25, 2017 in Islamabad.\nZahid Hafeez said it was obligatory upon the Government of Pakistan to inform Kulbhushan Jadhav about his rights under Article 36 of Vienna Convention and also provide him access of legal representation.\nHe said Pakistan had taken a number of measures to comply with the decision of ICJ.\nZahid said on August 2, Pakistan invited India for consular access, to which the latter responded after one month.\nTo a question on how Pakistan was apprising the world about India’s involvement in terrorist activities, he said international community was cognizant of such heinous acts on part of India.\nPakistan will continue to expose Indian and RAW-sponsored designs at international level, he added.",
  "retrievedAt": "2025-08-11T19:27:53.265Z"
}
