{
  "title": "COVID-19 claims 22 more lives, infects 1736 others: CM Sindh",
  "link": "https://www.app.com.pk/national/covid-19-claims-22-more-lives-infects-1736-others-cm-sindh/",
  "date_published": "2020-07-08T01:30:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jul 08 (APP):Sindh Chief Minister Syed Murad Ali Shah Wednesday said that COVID-19 infected 1736 other people raising the tally to 99,362 and claimed 22 more lives lifting the death toll to 1637.\nThis he said in a statement issued here from CM House.\nHe said that 9318 samples were tested which detected 1736 new cases constituting 19 percent detection rate.\nHe added that so far 533,540 tests have been conducted against which 99,362 cases were diagnosed that came to a 19 percent detection rate. “Our current and overall detection rate stands at 19 percent which is high and worrisome,” he said.\nAs many as 23 more patients died due to coronavirus. So far, 1637 patients have died which constituted 1.6 percent death rate, he added.\nSyed Murad Ali Shah said that currently, 41,352 patients were under treatment, of them 39,199 were in home isolation, 352 at isolation Centers and 1801 at different hospitals of the province.\nHe added that the condition of 655 patients was stated to be critical, of them 75 have been shifted to ventilators.\nThe CM Sindh said that 1697 patients recovered overnight and returned to normal life. So far, 56373 patients have recovered that constituted a 57 percent recovery rate, he said.\nSyed Murad Ali Shah while giving district-wise breakup of the new cases said, out of 1736 cases 764 were detected from Karachi. They include 317 South, 179 East, 110 Central, 65 Malir, 58 Korangi and 35 West, he added.\nHe added that Hyderabad has 123, Ghotki 122, Khairpur 77, Dadu 53, Kambar 46, Shaheed Benazirabad 40, Shikarpur 38, Jamshoro 36, Sukkur 33, Kashmore 32, Tando Allahyar 30, Umerkot 29, Jacobabad 22, Larkana 16, Mirpurkhas 14, Badin eight, Naushehroferoze seven, Sanghar four, Matiari and TM Khan one each.\nSyed Murad Ali Shah urged people of Sindh to be cautious to save yourself and others.",
  "retrievedAt": "2025-08-11T19:28:00.990Z"
}
