{
  "title": "Pakistani iconic humanitarian ‘Abdul Sattar Edhi’ remembered on his anniversary",
  "link": "https://www.app.com.pk/national/pakistani-iconic-humanitarian-abdul-sattar-edhi-remembered-on-his-anniversary/",
  "date_published": "2020-07-08T02:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 8 (APP):Renowned philanthropist and social worker Abdul Sattar Edhi was remembered on his fourth death anniversary today (July 8) with people from all walks of life commemorating his services for the humanity.\nEdhi, who founded the world’s largest volunteer ambulance network, died on July 8, 2016 in Karachi after a prolonged illness, Private news channel reported.\nThe philanthropist may have been gone but his legacy lives on. Edhi, who was born in 1928, migrated to Pakistan in 1947 along with his family and dedicated his life to the poor from the age of 20 when he himself was penniless in Karachi.\nHe devoted his life to social welfare and eventually became recognized globally for all his hard work. And now, he will be loved by children as the animated character Edhi Baba.\nHe started off as a free dispensary in 1951 that went on to become the largest charity organization in Pakistan.\nIn his own words, Edhi “begged for donations” at the start of his work and “people gave”. From having one ambulance which he drove himself, the Edhi Foundation now has 2,400 ambulances and three air ambulances stationed across the country.\nIn fact, in 1997 the Edhi Foundation entered the Guinness World Records as the “largest volunteer ambulance organization”.\nThe foundation also runs more than 300 welfare centers across the country that operate as food kitchens, rehabilitation homes, shelters for abandoned women and children and clinics for the mentally handicapped.The Edhi Foundation also runs eight outpatient hospitals, a child adoption centre and morgues.\nEdhi received the Ramon Magsaysay Award for public service in 1986 and was honoured with the Nishan-e-Imtiaz in 1989.\nQuran Khuwani was also offered at Edhi centers across the country.",
  "retrievedAt": "2025-08-11T19:27:56.361Z"
}
