{
  "title": "Pakistani man gets 30 years of jail for knife attack aimed at French magazine Charlie Hebdo - World - DAWN.COM",
  "author": null,
  "content": "A Paris court on Thursday sentenced a Pakistani man to 30 years in jail for attempting to murder two people outside the former offices of Charlie Hebdo in 2020 with a meat cleaver.\n\nWhen he carried out the attack, 29-year-old Zaheer Mahmood wrongly believed the satirical newspaper was still based in the building, which was targeted a decade ago for publishing blasphemous caricatures of Islam.\n\nIn fact, Charlie Hebdo had moved in the wake of the storming of its offices by two Al-Qaeda-linked masked gunmen, who killed 12 people including eight of the paper’s editorial staff.\n\nThe killings in January 2015 shocked France and triggered a fierce debate about freedom of expression and religion, fuelling an outpouring of sympathy in France expressed in a wave of “Je Suis Charlie” ( “I Am Charlie “) solidarity.\n\nOriginally from the Kothli Qazi village in Punjab, Mahmood arrived in France illegally in the summer of 2019.\n\nThe court had earlier heard how Mahmood was influenced by deceased Tehreek-i-Labbaik Pakistan (TLP) founder Khadim Hussain Rizvi, who had called for the beheading of blasphemers.\n\nMahmood was convicted of attempted murder and terrorist conspiracy and he will be banned from France when his sentence is served.\n\nThe 2015 bloodshed, which included a separate but linked hostage-taking that claimed another four lives at a supermarket in eastern Paris, marked the start of a dark period for France.\n\nIn the years that followed extremists inspired by Al-Qaeda and the Islamic State group repeatedly mounted attacks, setting the country on edge and inflaming religious tensions.\n\nTo mark the opening of the trial into the 2015 massacre, Charlie Hebdo republished anti-Islam cartoons on September 2, 2020.\n\nLater that month, urged by Rizvi to seek revenge for the blasphemous caricatures, Mahmood arrived in front of Charlie Hebdo’s former address.\n\nArmed with a butcher’s cleaver, he gravely wounded two employees of the Premieres Lignes news agency.\n\nThroughout the trial, his defence argued that his actions were the result of a profound disconnect he felt from France, given his upbringing in the fervently Muslim Pakistan countryside.\n\n“In his head, he had never left Pakistan,” Mahmood’s defence lawyer Alberic de Gayardon said on Wednesday, conceding that “each of his blows aimed to kill”.\n\n“He does not speak French, he lives with Pakistanis, he works for Pakistanis,” Gayardon added.\n\nCharlie Hebdo’s decision in 2020 to republish the cartoons triggered a wave of angry demonstrations in Pakistan, where blasphemy is punishable by death.\n\nFive other Pakistani men, some of whom were minors at the time, were on trial alongside Mahmood on terrorist conspiracy charges for having supported and encouraged his actions.\n\nThe French capital’s special court for minors handed Mahmood’s co-defendants sentences of between three and 12 years.\n\nNone of the six in the dock reacted to the verdict.\n\nBoth victims were present at the sentencing but did not wish to comment on the trial’s outcome.\n\nEarlier in the trial, one of the two, alias Paul, told the court of the long rehabilitation he undertook after his near-death experience.\n\n“It broke something within me,” the 37-year-old said.\n\nNeither he nor the other victim, named only as Helene, 32, have accepted Mahmood’s pleas for forgiveness.\n\nMahmood’s lawyers have yet to indicate whether their client will appeal the verdict.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:54:45.686Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887373/pakistani-man-gets-30-years-of-jail-for-knife-attack-aimed-at-french-magazine-charlie-hebdo",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T06:08:59.000Z"
}
