{
  "title": "Peshawar-DI Khan Motorway promises economic uplift of region: Gandapur - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa Chief Minister Ali Amin Khan Gandapur on Thursday said the Peshawar-Dera Ismail Khan Motorway, a flagship project of his government, would serve as a milestone for the economic development of the region.\n\nChairing a meeting about the proposed motorway here, the chief minister said that the project would boost economic and commercial activities, provide high-quality transport facilities to the people, and create employment opportunities.\n\nThe meeting reviewed various options for implementing the flagship project, decidedto initiate a process for land acquisition, and issued directions to the finance department for the release of an initial amount of Rs2 billion for the purpose, according to an official statement issued by the Chief Minister’s Secretariat.\n\nIt also decided that land acquisition would begin simultaneously from both Peshawar and Dera Ismail Khan sides.\n\nFinance dept told to release initial amount of Rs2bn for purpose\n\nDuring the briefing, Mr Gandapur was informed that the 365km motorway would feature six lanes, 19 interchanges, and two tunnels, connecting seven districts to be completed with an estimated cost of Rs348 billion.\n\nThe chief minister directed authorities to work out the most feasible option for the execution of the mega project.\n\nThe meeting was also attended by the chief minister’s adviser on finance, Muzammil Aslam, additional chief secretary for planning Ikramullah Khan, and senior officials from the departments of finance, planning, and communications.\n\nMeanwhile, the chief minister, in another meeting on Thursday, said that ensuring public health was the government’s foremost responsibility and that no compromises would be made in that respect.\n\nHe said that no business would be shut down or hindered unnecessarily but not at the cost of public health andthat those factories manufacturing and selling food items must comply with food safety standards at all costs.\n\nHe said the Khyber Pakhtunkhwa Food Safety and Halal Authority presented a report to the chief minister regarding substandard chips, pops, nimkos and spices in the province.\n\nThe chief minister directed the Halal Food Authority and other concerned departments to improve their monitoring and checking systems.\n\nPublished in Dawn, January 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:59:04.636Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887350/peshawar-di-khan-motorway-promises-economic-uplift-of-region-gandapur",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T04:32:58.000Z"
}
