{
  "title": "Journalists, rights bodies denounce Peca changes - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PPP lawmakers vote for amendment bill, at odds with party’s own HR cell\n• Media bodies accuse govt of reneging on commitments\n\nKARACHI/ISLAMABAD: After the party itself supported the passage of the bill in the National As­­sembly, the PPP’s human rights cell expressed its disagreement with am­­­endments to the cybercrime law.\n\nJournalists and rights bodies have also criticised the government for passing the amendments without taking stakeholders on board.\n\nDuring voting on amendments to the Pakistan Electronic Crimes Act (Peca) in the assembly on Thu­r­­sday, PPP members could be hea­rd saying “aye” and expressing their support for the passage of the law.\n\nPPP lawmakers vote for amendment bill, at odds with party’s own HR cell\n\nThe JUI-F was the only party to oppose the bill in the assembly.\n\nOn the other hand, PPP HR Cell President Farhatullah Babar has said the changes to Peca were aimed at further stifling the freedom of expression by setting up multiple authorities under executive control.\n\n“This would [enlarge] the footprint of unaccountable intelligence agencies and [give] sweeping powers to the executive not only over the contents of the message but also the messengers, namely the social media platforms,” Mr Babar added.\n\nHe said as per the amendments, the authority to regulate social media content will form joint investigation teams, including members from unnamed intelligence agencies, to probe journalists, social media users and general public.\n\nReaction from media bodies\n\nMeanwhile, journalists and digital rights activists said the amendments criminalise dissent and further restrict freedom of expression.\n\nA joint statement by a coalition of journalists and media bodies vowed to challenge the law in court and launch a protest movement.\n\nA special meeting of the Joint Action Committee, which includes the PFUJ, PBA, CPNE, AEMEND and APNS, accused the federal government of “breaching” its promise by getting the controversial bill passed without consultation.\n\n“The focus of this bill is not just social media, but also electronic and print media’s digital platforms, with the aim of criminalising dissenting opinions.”\n\nThe coalition urged the government to consult stakeholders and defer the bill’s approval in the Senate.\n\nIn a statement, Global Network Initiative (GNI) Executive Director Jason Pielemeier urged the government to reconsider its “rushed approach” and undertake “open, transparent, and multi-stakehol­d­­­er” consultations on the regulation.\n\nThe statement added that the expanded definition of unlawful content — which now also included “fake or false information” and “aspersion” against constitutional institutions and their officers — can lead to “significant impacts on the freedom of opinion, expression, and press in Pakistan.\n\nThe statement reminded that Pakistan was bound by the International Covenant on Civil and Political, which protects the freedom of expression.\n\nThe organisation urged the government to engage in “meaningful dialogue” and hold “transparent public consultation” on this issue.\n\nSeparately, different factions of the PFUJ also called the amendments “unwanted and against the spirit of the Constitution”.\n\n“The changes are a deliberate attempt to suppress the media, social media, and the media community,” PFUJ President Afzal Butt and Secretary General Arshad Ansari said in a joint statement.\n\nHaji Nawaz Raza and A.H. Kha­nzada, leaders of another PFUJ faction, said the entire journalist community “rejected” the amendment.\n\nThe Karachi Press Club also condemned the law and called it a “threat to the freedom of expression.”\n\nKPC President Fazil Jamili and Secretary Sohail Afzal Khan said the government should empower the media for accurate reporting rather than stifling free speech.\n\nPublished in Dawn, January 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:55:25.075Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887276/journalists-rights-bodies-denounce-peca-changes",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T02:51:36.000Z"
}
