{
  "title": "Police form special team to find killer of missing child in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The police have formed a seven-member team, headed by Sadar Division SP, to solve the ‘killing’ of a four-year-old, whose body was found in a pond in the same area at least two months after he had gone missing in Rawat.\n\nThe team led by SP Nabeel Khokar included an expert from the Homicide Investigation Unit and was formed after an initial report of the incident was sent to Chief Minister Maryam Nawaz and Inspector General of Police Dr Usman Anwar. After the boy was discovered last week, the police added Section 302 which pertains to murder to the kidnapping case. Even though the body was found last week, the police have not been able to send the ‘body samples’ for forensic investigation as those are still in the possession of the Rawat police.\n\nAfter its visit to the pond and the house in Rawat from where the body had disappeared, the police team believed that a small child could not go there alone as the pond was about 20 minutes walk from the house. It may be noted that the boy had arrived in Rawat with his mother on November 23 to attend a wedding.\n\nAfter his disappearance, a case was registered on the complaint of the boy’s uncle Umar Rauf. However, about two months later, the body was found floating in a pond in the same area. Upon its discovery, the Rawalpindi police initially declared the death of the boy due to ‘drowning’ after falling into the pond while playing.\n\nInvestigators believe boy could not have gone to the pond alone where his body was found\n\nArshman’s uncle Umar Rauf, however, said that the child had very thick hair on his head, but when the body was found, he was completely bald. Similarly, the trousers and shoes were also different after he was found, he added.\n\nIn light of the initial investigation that the body appeared to be twelve to fifteen days old besides other evidence, the murder section had been added to the FIR.\n\nThe seven-member special team formed by Rawalpindi CPO Khalid Hamdani included Sadar SDPO Dania Rana, Rawat HIU in-charge Inspector Zaheeruddin Babar, Rawat SHO Inspector Zahid Zahoor, former investigation officer Wasim Sarfraz, an officer from the CIA, and IT lab experts.\n\nAccording to sources, the police team has expanded the scope of the investigation and has been questioning the residents from the surrounding areas. The police have also detained four people for further interrogation, they said, adding that the police were also collecting data on those who occasionally visited the area, especially those who visited the area during the day when the boy went missing.\n\nThe police investigation also revealed that the place where the child’s body was found was far from the house where the wedding was taking place, making it impossible for a four-year-old child to reach there under any circumstances. However, the police have not yet been able to find any success in the case.\n\nOn the other hand, after the chief minister took notice of the death, the Rawalpindi police also sent a detailed report to the Chief Minister’s Secretariat, describing the progress so far made in the investigation.\n\nPublished in Dawn, January 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:54:49.380Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887328/police-form-special-team-to-find-killer-of-missing-child-in-rawalpindi",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T04:11:10.000Z"
}
