{
  "title": "Trump says he will order Fema overhaul on tour of disaster-hit North Carolina - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump said on Friday he would like to get rid of the main federal agency that responds to natural disasters during a visit to areas of North Carolina that were devastated by Hurricane Helene in September.\n\nTrump, on his first trip since reclaiming the presidency on Monday, accused the Federal Emergency Management Agency (Fema) of bungling emergency relief efforts in North Carolina. He vowed to sign an executive order to begin the process of fundamentally overhauling or eliminating the agency.\n\n“Fema has turned out to be a disaster,” he said during a tour of a neighbourhood destroyed by Helene where trees were downed and homes had boarded-up windows. “I think we recommend that Fema go away.”\n\nFema brings in emergency personnel, supplies and equipment to help areas begin to recover from natural disasters, and funding for the agency has soared in recent years as extreme weather events increase the demand for its services.\n\nThe agency, which has 10 regional offices and employs more than 20,000 people across the country, was run for the last four years by Democrat President Joe Biden’s administration.\n\nDuring a briefing about recovery efforts, the Republican Trump promised to speedily help North Carolina “get the help you need” to rebuild. He said he would prefer that states be given federal money to handle disasters themselves rather than rely on Fema to do the job.\n\nTrump complained that Biden did not do enough to help western North Carolina recover from the hurricane, an accusation the Biden administration rejected as misinformation.\n\nTrump also sharply criticised Democratic officials’ response to wildfires in Los Angeles that have caused widespread destruction this month. His Republican colleagues in Congress have threatened to withhold disaster aid for the region.\n\nTrump was due to visit Los Angeles later in the day while three massive blazes still threaten that region.\n\nIn an interview with Fox News on Wednesday, Trump threatened to withhold aid to California and repeated a false claim that the state’s governor, Gavin Newsom, and other officials have refused to provide water from the northern part of the state to fight the fires.\n\n“I don’t think we should give California anything until they let the water flow down,” Trump said. He has falsely claimed that Newsom, a Democrat, prioritised the preservation of endangered fish over public safety. Newsom has said there is no connection between the fish and the fire.\n\nThe governor told reporters on Thursday that he planned to be on hand at Los Angeles International Airport to greet Trump. “I look forward to being there on the tarmac to thank the president and welcome him,” Newsom said.\n\nTrump has accused Newsom and Los Angeles Mayor Karen Bass — who was out of the country when the fires broke out — of “gross incompetence,” pointing to what he called a lack of preparation and ineffective or harmful water management policies.\n\nWater shortages caused some hydrants to run dry in affluent Pacific Palisades, hindering the early response. When the fires broke out, one of the reservoirs that could have supplied more water to the area was empty for a year. Officials have promised an investigation into why it was dry.\n\nMayor Bass and fire officials have said the hydrants were not designed to deal with such a massive disaster and stressed the unprecedented nature of the fires.\n\nTrump has focused some of his criticism on California’s complicated policies for sharing the plentiful water supply found in the northern part of the state with the parched south. The diversion results in the discharge of some water into the ocean, something Trump has depicted as a callous waste.\n\nNewsom has dismissed those attacks as groundless, and experts have said that the diversions, in part designed to protect agricultural interests, have played little or no part in the difficulties encountered in fighting the fires.\n\nSince the fires broke out on January 7, they have killed 28 people and damaged or destroyed nearly 16,000 structures, authorities say. Much of Southern California remains under a red-flag warning for extreme fire risk due to strong, dry winds.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:54:42.633Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887430/trump-says-he-will-order-fema-overhaul-on-tour-of-disaster-hit-north-carolina",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T18:48:15.000Z"
}
