{
  "title": "GB dominates ice sports championship at Naltar - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: The National Ice Sports Championship featuring thrilling competitions such as ice hockey, speed skating, curling, figure skating and relay races concluded at Naltar Valley on Friday.\n\nTwelve teams from across the country participated in the competitions, including seven male teams and five female teams from Sindh, Khyber Pakhtunkhwa, Punjab, Islamabad, Gilgit-Baltistan, GB Scouts and Pakistan Air Force (PAF).\n\nGilgit-Baltistan emerged as the dominant force in the cham-pionship, securing a total of 12 medals — three gold, five silver and four bronze.\n\nNaltar Valley, located in the Karakoram Range, is the oldest ski resort in Pakistan, situated at an altitude of 10,500 feet, about 34km from Gilgit city. Known for its snow-capped peaks and vibrant lakes, the valley offers a perfect blend of adventure and serenity.\n\nThe PAF, National Winter Sports Association and Gilgit-Baltistan Winter Sports Association have been organising ice sports competitions annually.\n\nSeven-day winter fest begins in Hunza\n\nIn this championship, the Gilgit-Baltistan Winter Sports Association (GBWSA) was crowned champion in the women’s ice hockey category, while GB Scouts claimed the men’s title.\n\nIn speed skating, GB Scouts triumphed in the men’s competition, while GBWSA secured gold in the women’s event.\n\nSindh took gold in the women’s figure skating category, while GB Scouts won the men’s figure skating competition.\n\nIn the relay races, GB Scouts clinched victory in the men’s event, and GBWSA emerged victorious in the women’s relay race. In curling, KP claimed the men’s title, and PAF won the women’s event.\n\nAs the host province, GB was permitted to field two male and two female teams in the championship.\n\nThe closing ceremony, held on Wednesday at Naltar, celebrated the achievements of all participants and marked the successful conclusion of this prestigious national event.\n\nFollowing the conclusion of the championship, the seven-day Winter Fest in Gilgit began on Thursday in Murtazabad, Hunza. This event was organised by the GB government in collaboration with GBWSA.\n\nOther snow sports competitions in areas like Astore, Ghizer, Nagar and Hunza also recently concluded, with winning teams from these regions set to participate in the winter fest.\n\nAccording to Zamir Abbas, the secretary of GB tourism and culture, the GB government, in collaboration with local communities and NGOs, has been organising winter festivals for many years.\n\nThese events aim to promote winter tourism, enhance local players’ skills and provide entertainment opportunities for residents.\n\nHe said these events positively impact the local economy, with several areas organising winter sports competitions on a self-help basis. Winter sports activities have also attracted a large number of tourists to the region.\n\nPublished in Dawn, January 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6792e11331b67.gif",
  "retrievedAt": "2025-08-26T07:55:24.758Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887273/gb-dominates-ice-sports-championship-at-naltar",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T03:00:10.000Z"
}
