{
  "title": "5th aid convoy departs for Kurram amid tight security arrangements: official - Pakistan - DAWN.COM",
  "author": null,
  "content": "A convoy of 70 vehicles carrying relief supplies departed for Kurram on Friday amid tight security arrangements along the route, officials said.\n\nAfter an attack on a convoy in Lower Kurram’s Bagan area killed over 40 people in November, ensuing clashes stemming from decades-old land disputes have claimed at least 130 more lives in the district.\n\nThe volatile security situation led to the closure of a main road for weeks, resulting in a shortage of essential goods and medicines in Upper Kurram’s Parachinar. While a ceasefire deal was signed between warring tribes on January 1, attacks on a government convoy and an aid convoy this month put peace in peril.\n\nIn response, authorities launched a limited “counter-terrorism operation” in the Lower Kurram tehsil, with camps for temporarily displaced persons (TDPs) ordered to be set up as over 1,000 families would be displaced.\n\nThe first convoy had arrived in the Parachinar on January 8 after remaining stuck on the Hangu-Kurram border for several days following an attack on Kurram DC Mehsud. 10 people were killed when a convoy of 35 vehicles was attacked in Kurram last week. A fourth convoy of 61 vehicles carrying relief supplies reached Kurram on Wednesday under tight security.\n\n“A convoy of 70 vehicles carrying essential supplies had departed from the Torpal checkpost towards Kurram under the supervision of Hangu Regional Police Officer Abbas Majeed Marwat and Kohat Division Commissioner Mutasim Billah Shah,” Hangu Deputy Commissioner (DC) Gohar Zaman Wazir said.\n\nThe vehicles were carrying fruit, vegetables, ghee, sugar, chicken, eggs and various food items, DC Wazir said.\n\nSecurity personnel have been deployed at various places for the safety of the convoy, according to Hangu District Police Order (DPO) Muhammad Khalid.\n\nMeanwhile, police arrested Tehsil Chairman Agha Muzammil Hussain Fasih this morning and a first information report (FIR) was registered against him for holding a sit-in protest, Kurram DPO Ahmad Shah said.\n\nOn Wednesday, the Khyber Pakhtunkhwa government vowed to take “indiscriminate action” against any and all perpetrators of violence in Kurram district as the demolition of illegal bunkers resumed.\n\nThe government also decided to arrest elements disrupting peace and their facilitators, ensuring legal action against them. Special contingents may be deployed to secure the Kurram Road, and the police will finalise plans for temporary and permanent recruitment to maintain security, according to a statement issued from the KP Chief Minister’s Office.\n\nA military-led operation against miscreants in the Ochat, Charkhel, Dadka­mar and Zarana areas of Kurram concluded on We­d­n­esday after four days.\n\nThe district administration claimed to have confiscated a huge cache of arms and destroyed eight bunkers. Officials warned of strict action in case of any violations of the peace agreement.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2412051517fb3ef.png",
  "retrievedAt": "2025-08-26T07:54:44.548Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887376/5th-aid-convoy-departs-for-kurram-amid-tight-security-arrangements-official",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T07:43:15.000Z"
}
