{
  "title": "French mother sentenced to life for daughter’s death by starvation - World - DAWN.COM",
  "author": null,
  "content": "A French woman was sentenced on Friday to life in prison for starving her daughter to death, who died of a heart attack in 2020 at the age of 13 after years of abuse.\n\nSandrine Pissarra, 54, was convicted of inflicting acts of torture and barbarity against her daughter Amandine at the trial in the southern city of Montpellier. She must serve a minimum of 20 years behind bars before being eligible for parole, according to the terms of the sentence.\n\nThe verdict, the maximum sentence for the crime and in line with what prosecutors demanded, was agreed by a panel of three professional judges and six members of the public serving as a jury.\n\nPissarra’s ex-partner, Jean-Michel Cros, 49, was sentenced to 20 years in prison for depriving Amandine of care. His sentence, which carried no possibility of parole, was more severe than the 18 years demanded by prosecutors although he could have faced up to 30 years.\n\nWhen Amandine died on August 6, 2020, she weighed just 28 kilogrammes while being 1.55 metres tall. She had also suffered extreme weight and muscle loss as well as septicaemia, according to the medical report after her death. She had also lost several teeth and had her hair pulled out.\n\nAmandine had been locked for weeks in a windowless storage room and deprived of food.\n\nFrom a very young age, Amandine was the victim of blows, including with brooms, punches, kicks, hair pulling, repeated shouting, insults and jostling, prosecutor Jean-Marie Beney said.\n\nFor Pissarra, “domestic tyrant, dictator of the home, executioner of Amandine, there can only be one sentence — a life term with a minimum of 20 years served in prison,” said the prosecutor.\n\nQuestioned the day after her daughter’s death in the village of Montblanc southwest of Montpellier, Pissarra said Amandine suffered from eating disorders — a claim not confirmed by anyone else.\n\nShe said that on the day of her death, Amandine had agreed to swallow only a piece of sugar, a little fruit puree and a high-protein drink before she started to vomit and then stopped breathing.\n\nThe mother, who had been running a nail salon, has eight children from three relationships. She has been in custody since May 2021.\n\nThe prosecutor had termed Cros meanwhile a “cowardly collaborator” who “deprived Amandine of care until her death”.\n\nThe investigating magistrate in charge of the case said in a report there was “no doubt” Amandine endured violence from her mother, “the sole purpose of which was to drag her into shameful and humiliating agony”.\n\nAmandine had from a young age been targeted by her mother, who deprived her of food, inflicted endless “writing punishments” on her and locked her in a storage room under the surveillance of cameras, it said.\n\nAccording to the psychiatric assessment, Sandrine Pissarra, described by those around her as angry and violent, was seeking to “transfer her hatred” of Amandine’s father onto her daughter’s body.\n\nOne of the mother’s lawyers, Jean-Marc Darrigade said earlier that while there was an indisputable “individual responsibility” on her part, “there is also a collective responsibility”.\n\nHe had asked the jurors to pronounce a “fair, reasonable sentence”, which would allow her to “return to society” without being “an old lady”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:54:42.336Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887428/french-mother-sentenced-to-life-for-daughters-death-by-starvation",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T18:09:38.000Z"
}
