{
  "title": "Afghan Taliban reject ICC arrest warrant as ‘politically motivated’ - World - DAWN.COM",
  "author": null,
  "content": "Afghanistan’s Taliban government said on Friday an arrest warrant sought by the International Criminal Court (ICC) for its leaders was “politically motivated”.\n\nIt comes a day after the ICC chief prosecutor said he was seeking warrants against senior Taliban leaders in Afghanistan over the persecution of women — a crime against humanity.\n\n“Like many other decisions of the (ICC), it is devoid of a fair legal basis, is a matter of double standards and is politically motivated,” said a statement from the Afghan Foreign Ministry posted on social media platform X.\n\n“It is regrettable that this institution has turned a blind eye to war crimes and crimes against humanity committed by foreign forces and their domestic allies during the twenty-year occupation of Afghanistan.”\n\nIt said the court should “not attempt to impose a particular interpretation of human rights on the entire world and ignore the religious and national values of people of the rest of the world”.\n\nThe Taliban swept back to power in 2021 after ousting the American-backed government in a rapid but largely bloodless military takeover, imposing a severe interpretation of Islamic law on the population and heavily restricting all aspects of women’s lives.\n\nAfghanistan’s deputy interior minister Mohammad Nabi Omari, a former Guantanamo Bay detainee, said the ICC “can’t scare us”.\n\n“If these were fair and true courts, they should have brought America to the court, because it is America that has caused wars, the issues of the world are caused by America,” he said at an event in eastern Khost city attended by an AFP journalist.\n\nHe said Israeli Prime Minister Benjamin Netanyahu should also be prosecuted over the country’s military offensive in Gaza, which was sparked by Hamas’ attacks in October 2023.\n\n“They should have brought Israel’s prime minister to the court, because (the government) has martyred tens of thousands of innocent Palestinians, they martyred children and women, but he is walking free because the world’s power is standing beside them,” Omari said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/01/241649245e5cb61.png",
  "retrievedAt": "2025-08-26T07:54:41.734Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887398/afghan-taliban-reject-icc-arrest-warrant-as-politically-motivated",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T12:06:26.000Z"
}
