{
  "title": "FO optimistic ties with US will deepen under Trump - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Foreign Office on Thursday expressed optimism that Pakistan’s ties with the United States will grow under the new Trump administration, while emphatically reiterating that non-interference in internal affairs is a non-negotiable foundation of bilateral relations.\n\n“US-Pakistan relations remain very important to us. There’s a decades old, robust legacy on which we can build and we remain ready to engage with the new administration to take these relations forward,” FO spokesman Shafqat Ali Khan said at the weekly briefing.\n\nRecalling the multi-faceted nature of ties, he said, “They cover multiple areas, and we look forward to continuing the positive trajectory of our relations and remain engaged with the new administration.”\n\nThe Trump administration’s approach to South Asia, shaped by its policies towards India and China, looms over Islamabad’s engagement with the US.\n\nReaffirms non-interference in internal affairs as ‘non-negotiable’ tenet of relationship\n\nWhile emphasising Pakistan’s continued commitment to a strong US relationship, Mr Khan called for upholding the principle of non-interference in internal affairs. “This is part of the principles on which interstate relations are shaped,” he asserted.\n\nPakistan’s collaboration with China through projects like the CPEC and its tense relations with India have often drawn scrutiny in Washington.\n\nDomestic concerns also complicate matters. Last year, the US Congress raised questions about democracy and human rights in Pakistan. Bipartisan resolution 901 and a letter signed by over 60 members of Congress called on then-president Joe Biden to advocate for the release of political prisoners, including former PM Imran Khan. Congressional hearings further highlighted these issues.\n\nAdding to Islamabad’s concerns, Richard Grenell, the Trump administration’s special envoy for special missions, has openly criticised the treatment of Imran Khan and urged his release.\n\nMeanwhile, Imran Khan’s PTI has lobbied with members of the US government, raising apprehensions within Islamabad about the new administration’s possible critical stance. Islamabad’s emphasis on non-interference appears aimed at countering these fears and reinforcing its position on sovereignty.\n\nYet, Pakistan views its ties with the US as vital, with hopes of navigating shared interests in a region marked by evolving dynamics and competing priorities.\n\nThe government, therefore, made an early effort to engage with the Trump administration by quietly dispatching Interior Minister Mohsin Naqvi as a special envoy to meet members of the administration’s foreign policy team and Congressional leaders. However, the FO appeared reluctant to publicly own Mr Naqvi’s visit.\n\nWhen asked about Mr Naqvi’s trip and his attendance at Mr Trump’s inauguration, the spokesman clarified: “The government of Pakistan was officially represented (at the inauguration) by our ambassador, as in past oath-taking ceremonies.”\n\nAddressing Mr Naqvi’s presence, he added, “About the Honourable Minister of Interior going to Washington, because this has not been processed through the Ministry of Foreign Affairs, I will refer you to the spokesman at the Ministry of Interior.”\n\nMr Naqvi, closely followed by the PTI activists during his visit, reportedly made a diplomatic misstep by attending an event hosted by the New Federal State of China, the US-based political lobby, composed of Chinese dissidents and Americans, that advocates for the overthrow of China’s ruling Communist Party.\n\nWhen questioned about Mr Naqvi’s participation in that event, the spokesman deflected, saying, “I don’t have facts, but I can try to check.”\n\nHe reaffirmed Pakistan’s unequivocal support for Beijing, stating that the One China policy “remains a core principle of our foreign policy”.\n\n“There’s One China, and this principle enjoys unwavering support of Pakistan. There is no question of any ambiguity about it. It’s a very clear and emphatic position,” he said.\n\nPublished in Dawn, January 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:54:56.856Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887311/fo-optimistic-ties-with-us-will-deepen-under-trump",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T03:42:47.000Z"
}
