{
  "title": "Saudi FM confident of reform under new Lebanon leaders - World - DAWN.COM",
  "author": null,
  "content": "BEIRUT: Saudi Arabia’s top diplomat, on his country’s first high-level visit to Beirut after years of strained ties, said on Thursday he believed crisis-hit Lebanon’s new leaders can spearhead long-sought reforms.\n\nReeling from years of economic collapse and a destructive Israel-Hezbollah war, Lebanese leaders have pinned hopes on wealthy Gulf states for desperately needed reconstruction funds.\n\nThe international community has long demanded Lebanon enact reforms to unlock billions of dollars to boost the economy after financial crisis took hold in 2019 — widely blamed on rampant corruption and mismanagement.\n\n“We are greatly confident in the ability of … the president and the prime minister to initiate reforms necessary to bolster Lebanon’s security, stability and unity,” Saudi Foreign Minister Prince Faisal bin Farhan said after meeting President Joseph Aoun in Beirut.\n\nLebanon’s parliament elected Aoun earlier this month. The candidacy of the former military chief is widely believed to have been backed by Riyadh and Western countries.\n\nSaudi Arabia, the Middle East’s largest economy, was a major investor in Lebanon but ties between the two countries soured for roughly the past decade over the growing influence of the Hezbollah group.\n\n‘Real action’\n\nWith Hezbollah weakened after the war with Israel and the toppling of its ally, Syrian president Bashar al-Assad, Prince Faisal’s visit comes with Lebanon seeking a fresh start.\n\nAoun, whose election ended more than two years without a president, named former International Court of Justice presiding judge Nawaf Salam as prime minister-designate.\n\nHe has been tasked with forming a government capable of boosting Lebanon’s faltering economy and rebuilding areas devastated by war. Aoun has said his first official overseas trip would be to Saudi Arabia, after de facto ruler Crown Prince Mohammed bin Salman invited him to visit the kingdom.\n\nIn his first speech as president, Aoun said the state would have “a monopoly” on bearing weapons, in a country where Hezbollah was the only group to keep its arsenal following the 1975-1990 civil war.\n\nPrior to his visit, Prince Faisal called Aoun’s election “extremely positive”, but said the kingdom was waiting for concrete change before engaging further with Beirut.\n\nPublished in Dawn, January 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6792e599973a3.gif",
  "retrievedAt": "2025-10-12T01:14:13.728Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887289/saudi-fm-confident-of-reform-under-new-lebanon-leaders",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T03:30:00.000Z"
}
