{
  "title": "Vlogger told to do community service - Newspaper - DAWN.COM",
  "author": null,
  "content": "LAHORE: A special judicial magistrate has convicted vlogger Rajab Ali Butt for unlawfully possessing a lion cub and ordered him to do “community service” for one year as an alternative to his sentence.\n\n“He will make/record a video in the form of vlog with dedicated content on the animal’s right for a full five minutes in the first week of every month for a full one year starting from February 2025 to January 2026,” reads the guilty verdict issued by Magistrate Hamidul Rehman Nasir.\n\nThe magistrate noted that the accused pleaded guilty to the charge of having possession of a lion cub without any proper licence/permit.\n\nHe stated that the punishment provided for the offence as per Section 21 of the Punjab Wildlife (Protection, Preservation, Conservation and Management) Act 1974 is imprisonment up to two years or a minimum fine of Rs10,000 and maximum Rs15,000, or both.\n\n“The convict admitted his guilt in a steadfast manner, and he evidently demonstrated remorse over his action as he voluntarily pleaded that he be given a chance to do community service as a corrective measure,” the magistrate says in his order.\n\nHe observed that the nature of the offence, the manner of commission and forthright manner of admission of guilt, coupled with readiness of the convict to educate the public regarding the animals’ rights, makes it an appropriate case to order the convict to undergo community service for one year as a primary and sole condition to his probation.\n\nAs per the magistrate’s order, the convicted vlogger will undergo the sentence of the community service under the supervision of Probation Officer Maheen Solat.\n\nThe court had already ordered handover of the lion cub recovered from the possession of Butt to the Lahore Wildlife Safari Zoo management as an interim arrangement.\n\nPublished in Dawn, January 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:54:43.086Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887346/vlogger-told-to-do-community-service",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T04:28:55.000Z"
}
