{
  "title": "Over 380 Balochistan women complete police training in historic first - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Over 1,600 cadets graduated from the Police Training College, Quetta, on Thursday after completing the training and recruit course.\n\nBalochistan Inspector General of Police Moazzam Jah Ansari was the chief guest at the passing out parade of 1,689 recruits, including 385 women.\n\nProvincial ministers Mir Zahoor Ahmed Baledi, Mir Sadiq Umrani and Meena Majeed Baloch; CTD Additional IG Javed Ali Mehr; Balochistan Constabulary Commandant Agha Muhammad Yousuf; DIGs; and other police officers and relatives of the martyrs were also present on the occasion.\n\nWhile addressing the ceremony, IGP Ansari said for the first time in the province’s history, 385 females cadets completed their training and course and joined Balochistan Police.\n\nIGP hails newly graduated cadets, urges them to serve people\n\nHe said Balochistan Police had demonstrated its capabilities against militants and rendered numerous sacrifices to curb terrorism and prevent kidnapping for ransom.\n\n“The role and performance of the police department hold great significance in society, the IGP said, further stating that the police was one of the most important departments for the nation’s progress and security.\n\nHe urged the recruits to respect human rights and the dignity of citizens during their duties and protect and assist them rather than exert force.\n\nIGP Ansari said the recruits should pledge to safeguard people’s lives, property, honour and dignity and make sacrifices for public service and safety.\n\nHe hoped the new officers would apply their minds to combat terrorists, kidnappers, and killers.\n\n“The police force is the first hope for timely justice, and it is essential that the police perform their duties with discipline and professionalism,” IGP Ansari added.\n\nThe police chief, along with provincial ministers, paid tribute to the martyrs at the Police Martyrs Memorial. They offered prayers for their high ranks and hailed their services.\n\nHe said the sacrifices of these martyrs would always be remembered, and they would be honoured for their contributions to maintaining peace.\n\nThe police force, together with the public, was united in the fight against terrorism, Mr Ansari added.\n\nThe IGP congratulated the officers who secured positions during the training and encouraged them to work hard for further progress in their professional careers.\n\nHe expressed confidence that this training would prove beneficial for the police department and that the recruits would become valuable assets to their institution with renewed enthusiasm.\n\nDuring the ceremony, the IGP also inspected the parade as cadets demonstrated various skills, including martial arts and shooting.\n\nPublished in Dawn, January 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67931c065bf88.jpg",
  "retrievedAt": "2025-08-26T07:55:24.406Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887272/over-380-balochistan-women-complete-police-training-in-historic-first",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T03:05:42.000Z"
}
