{
  "title": "Aerial firing kills 6-year-old during wedding ceremony in Karachi: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A six-year-old boy was killed and two others, including another six-year-old, were injured in an incident of aerial firing during a wedding ceremony in Surjani Town on Friday, police said.\n\nKarachi District West Senior Superintendent of Police (SSP) Tariq Illahi Mastoi said that “some person(s) resorted to firing during the wedding ceremony in Taiser Town, Sector-35-C, resulting in the killing of one child and injuries to another child and a man.”\n\nThe deceased was identified as Banjo, 6, injured as Allan Shahzad, 6, and Robin Baber, 30. The dead and injured were shifted to the Abbasi Shaheed Hospital.\n\nThe police rushed to the spot after receiving information and recovered a 9mm pistol used in the firing, said the SSP, adding that action is being taken for the arrest of the suspects.\n\nSurjani Town Police Station House Officer (SHO) Ghulam Husain Pirzada told Dawn.com that the marriage ceremony took place in Christian Mohalla. He said the suspect, who managed to escape but left his behind his pistol, was a relative of the victims. He said the condition of the injured child was serious.\n\nIn a separate incident, a man and woman were shot dead in Manghopir in an apparent ‘honour’ killing incident on Friday, according to police.\n\nThe police added that Muhammad Akhtar, 29, and Gulsana Hussain, 45, were shot and killed near Wangi Goth.\n\nSSP Mastoi said that “during the initial probe, it transpired that they were killed by unknown suspects over unknown personal enmity.”\n\nManghopir SHO Imran Ahmed Khan told Dawn.com that the man belonged to Sargodha while the woman originally hailed from Naushehroferoz.\n\nHe said they were on their way somewhere by foot when unidentified armed men opened indiscriminate fire on them. He said ostensibly, the double murder appeared to be an outcome of ‘honour’ killing.\n\nInvestigators have collected around 15 spent bullet casings from the crime scene, he said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:54:42.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887413/aerial-firing-kills-6-year-old-during-wedding-ceremony-in-karachi-police",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T15:10:50.000Z"
}
