{
  "title": "Stocks recover 594 points on select buying - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakist­­an Stock Exchange (PSX) snapped the two-session losing streak as bulls drove bears out on Thursday despite a highly volatile session.\n\nThe benchmark KSE-100 index hit an intraday high of 114,319.62 and a low of 113,234.31. Ultima­tely closing with a gain of 594.36 points or 0.52 per cent at 114,037.79 day-on-day.\n\nAhsan Mehanti of Arif Habib Corporation said stocks recovered in the earning season rally amid a drop in treasury bond yields by up to 41bps and expectations of a reduction in industrial power tariff after International Monetary Fund approval.\n\nHe noted that the $1.2bn current account surplus for July-December 2024-25, easing political risk, and speculations ahead of the SBP monetary policy decision next week supported the bullish sentiments at PSX.\n\nTopline Securities Ltd said the market sentiment was buoyed by recent foreign corporate buying, and cement stocks remained in focus. Key contributors to the positive movement included Engro Corpora­tion, PSO, Fauji Cement, The Searle, and Maple Leaf Cement, adding 309 points to the index.\n\nAli Najib, Head of Sales at Insight Securities, said PSX experienced a mixed trading session but ended positively as value hunters stepped in after two continuous adverse closings.\n\nWeekend session performance would be crucial in determining the market’s direction. “If the index closes the week above 116,300 points, it will signal a trend reversal, with bulls likely to take control in the coming week. Conversely, if the index closes below last week’s low of 113,083 points, further downside cannot be ruled out,” Mr Ali observed.\n\nHowever, the trading volume decreased 9.15pc to 675.43 million shares while the traded value fell 13.54pc to Rs30.46bn day-on-day.\n\nStocks contributing significantly to the traded volume included Cnergy­ico PK (143.69m shares), WorldCall Telecom (78.19m shares), Fauji Cement (47.17m shares), Lotte Chemical (35.63m shares) and Citi Pharma Ltd (32.52m shares).\n\nPublished in Dawn, January 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6792e37cb248c.gif",
  "retrievedAt": "2025-10-12T00:59:19.956Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887286/stocks-recover-594-points-on-select-buying",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T03:30:24.000Z"
}
