{
  "title": "PTI to boycott 4th round of talks with govt: Gohar - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI has decided to boycott the fourth round of talks with the government, a day after it announced that party founder Imran Khan issued directions to call off negotiations due to a delay over the formation of judicial commissions.\n\nThe PTI and the government had been engaged in talks to bring down political temperatures. After two rounds of meetings, the third round was held seven days ago (Jan 16) in which the PTI formally presented its demands in writing.\n\nDespite weeks of negotiations, the dialogue process has hardly moved forward on major issues — the formation of judicial commissions and the release of PTI prisoners.\n\nOn Monday, the government assured the PTI of a response to the opposition’s ‘charter of demands’ within seven working days after the party warned it would boycott the next round of talks if judicial commissions were not formed to probe the May 9 and November 26 incidents.\n\nNational Assembly speaker Ayaz Sadiq has called the meeting for the fourth round, scheduled to be held on Jan 28 at 11:45am, according to a notification issued by the NA secretariat, a copy of which is available with Dawn.com. The meeting will be presided over by Sadiq and an invitation has been extended to the PTI.\n\nSpeaking at a press conference outside the Parliament House today, PTI Chairman Barrister Gohar Ali Khan, flanked by PTI leaders Omar Ayub Khan, Shibli Faraz, and Ali Mohammad Khan, said that Imran had approved negotiations despite the long charge sheet against him and the party.\n\n“The [stipulated] days have passed but the government has not announced the formation of judicial commissions even after [the deadline passed] yesterday,” he said, adding that the negotiations ended because the government was “not serious at any stage.”\n\nHe further said, “We presented them with simple demands during the negotiations. What was wrong with announcing the formation of a judicial commission?”\n\nOn Thursday, Gohar had said that the government had promised to form the requested judicial commissions within seven days, but it failed to do so.\n\n“The PTI founder (has) said to call the talks off over the government’s failure to form the judicial commissions,” he said.\n\nHe added that the PTI was hopeful of continuing the talks but they have to be called off “due to non-cooperation from the government.”\n\nRegarding today’s session in the Parliament, Gohar said that eight laws were passed within 11 minutes. “Thirty-seven bills have been passed but none were debated,” he said, adding that they had been rejected by the President.\n\nAccording to the Constitution, laws are passed considering the objection of the President, he added.\n\nEven in India, the session lasts for six hours, he said, adding, “The world will remember how the House was run this year.”\n\nSpeaking during the presser, Senator Shibli Faraz commented on the recent amendments made to The Prevention of Electronic Crimes (Peca) Act, calling it a “black law against freedom of expression”.\n\nThe bill was passed in the National Assembly a day ago, following which journalists staged a walkout from the press gallery in protest of the bill’s passage.\n\nLawmakers from the opposition Jamiat Ulema-i-Islam Fazl also opposed the bill.\n\nHe said that the amendments were meant to push media representatives into the dark, adding that efforts were being made to suppress people’s voices.\n\n“And then they (the government) complain about people not investing in Pakistan,” he remarked. “How can people invest in Pakistan when such laws are being passed?”\n\nHe further said that senators and MNAs were silent on the passage o of the amendment bills.\n\n“They are enjoying their positions based on a fake mandate, that’s why they don’t care about the people.”\n\nMeanwhile, Ayub also chimed in and said that “online businesses will be destroyed under this act.”\n\nOn the other hand, the government, on Thursday, urged the PTI to reconsider its decision of abandoning the dialogue process. Addressing a press conference outside Parliament House, Senator Irfan Siddiqui urged the PTI to not forsake dialogue, for the sake of political stability.\n\n“I cannot understand the reason for the PTI’s threat to abandon talks,” he added. He said the two sides had already agreed to give the government time to furnish its formal written response to the PTI’s demands, adding that the deadline was not yet up.\n\n“I don’t have the words except that they were in a hurry to arrive and are in a hurry to depart. The impatience with which they came is the same with which they are going back. We ask them to stay some days and not go back; let the weather become pleasant.”\n\nSenator Siddiqui said the coalition parties had “almost” formed an opinion on the PTI’s demands. “They should reconsider if it is in their power and if they can form an opinion apart from their founder’s opinion,” he added.\n\nThe senator had pointed out that the government side had exhibited restraint on many points during the talks and ignored many actions by the PTI since it wanted to advance talks in the “spirit of negotiations, democracy and give and take”.\n\nHe had called on the PTI to reconsider its course of action or submit its complaints in written form.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:59:20.141Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887382/pti-to-boycott-4th-round-of-talks-with-govt-gohar",
  "dateList": "2025-01-24",
  "date_published": "2025-01-24T10:03:58.000Z"
}
