{
  "title": "Kashmiris’ freedom fight ignited since their martyrdom by Dogra raj in 1931; Speakers",
  "author": null,
  "content": "ISLAMABAD, Jul 11 (APP): An all-encompassing seminar commemorating Kashmir Martyrs’ Day, held at the Institute of Regional Studies in collaboration with the Youth Forum for Kashmir here Friday, echoed Kashmir’s unbroken resolve.\nThe panelists honored the sacrifice of 22 innocent Kashmiris killed by Dogra forces on July 13, 1931—an event that ignited a century-long struggle for self-determination.\nAmbassador Jauhar Saleem, President of the IRS, highlighted that this solemn day was not merely a historical footnote but a living testament to the unwavering spirit of the Kashmiris.\nFrom the brutality of the Dogra Raj to the militarization and recent demographic engineering under Modi’s regime, the Kashmiri people have never bowed before oppression.\nNotable figures such as Ms. Mushaal Hussein Malik, Ms. Naseem Zehra, Dr. Qamar Cheema, Mr. Zaman Bajwa and Umair Khan emphasized that the struggle has endured through generations, from the Pathar Masjid uprising to the revocation of Articles 370 and 35A.\nEach phase of resistance faced India’s state terrorism, yet has only intensified the Kashmiri resolve.\n“The recent four-day war victory of Pakistan over India has reignited hope among Kashmiris,” said Ms. Mushaal Malik, urging Pakistan to seize the moment and amplify Kashmiri voices on international platforms. She warned against India’s false-flag operations and ecological destruction in the name of development, calling the Vande Bharat initiative a “colonial strategy.”\nMs. Naseem Zehra highlighted India’s growing isolation due to its aggressive policies in the neighbourhood. Conversely, China, Turkey, and Bangladesh support Pakistan. “The time for soft diplomacy is over,” she asserted. “Pakistan must recalibrate its strategy and project its stance globally.” The seminar called for the international community, especially the United Nations and the U.S., to take decisive action. “Kashmir is not just a regional issue; it’s a global flashpoint between two nuclear powers,” warned analyst Dr. Qamar Cheema.\nThe event concluded with a unified call for Kashmiris, whether in AJK or the diaspora, to raise for Kashmiris in IIOJK. “Kashmir’s story must be told by Kashmiris themselves,” urged Umair Khan, while advocating for global media engagement.\nKashmir Martyrs’ Day is not just a remembrance—it is a declaration of Pakistan’s dedication to the right of self-determination of Kashmiris.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:28:10.626Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kashmiris-freedom-fight-ignited-since-their-martyrdom-by-dogra-raj-in-1931-speakers/",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T14:00:00.000Z"
}
