{
  "title": "NEOC warns of landslides in northern regions including Gilgit-Baltistan, AJ&K",
  "author": null,
  "content": "ISLAMABAD, Jul 11 (APP): The National Emergencies Operation Center (NEOC), of the National Disaster Management Authority (NDMA), on Friday released a warning for potential landslides in northern areas, notably Gilgit-Baltistan and Azad Jammu & Kashmir (AJ&K).\nAccording to the alert, isolated heavy rainfall is expected in the valleys of Gilgit, Skardu, Hunza, Astore, Diamir, Ghanche, and Shigar.\nWidespread heavy rain is also likely in Muzaffarabad, Neelum Valley, Rawalakot, Haveli, Bagh, and adjoining areas of AJ&K.\nPotentially affected areas include Upper Kohistan (RD 200–240), Diamir and Astore (RD 340–380), Gilgit (RD 400), and Nagar (RD 460) along the Karakoram Highway (KKH). Multiple locations along the Jaglot–Skardu Road (JSR), particularly in the Rondu region, are also at risk of landslides, mudslides, and rockfalls.\nAuthorities and residents in high-risk zones are advised to remain vigilant for potential slope failures, landslides, and ground subsidence.\nTravel to vulnerable areas should be avoided unless absolutely necessary.\nRelevant departments have been instructed to ensure the availability of emergency personnel and machinery in the identified areas and remain on standby for a rapid response.\nNDMA said it is actively coordinating with the GBDMA and SDMA to implement proactive response measures and safeguard affected communities.\nThe public is strongly urged to stay informed through official alerts disseminated via television, radio, SMS, and the Pak NDMA Disaster Alert mobile application.\nNDMA remains in close coordination with relevant authorities to monitor the evolving situation and ensure the timely dissemination of warnings.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:28:57.466Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/neoc-warns-of-landslides-in-northern-regions-including-gilgit-baltistan-ajk/",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T09:52:00.000Z"
}
