{
  "title": "Economic development impossible without modernizing outdated system: PM",
  "author": null,
  "content": "ISLAMABAD, Jul 11 (APP): Prime Minister Shehbaz Sharif on Friday said that the transformation of the outdated system into a modern, digital, and effective governance model was among the government’s priorities, as economic development and prosperity were impossible without modernizing the system to meet contemporary demands.\nThe prime minister, chairing a meeting, directed to introduce reforms to enhance the performance of ministries and hire the services of experts in every sector.\nDuring a meeting, the Ministry of Energy gave a detailed briefing on a system comprising experts for improving governance and implementing reforms.\nThe prime minister said that the country could not achieve progress with the system that has been in place for seven decades.\nHe highlighted that Pakistan was rich in resources, and its young workforce was its most valuable asset, with many talented Pakistanis bringing fame to the country globally.\nPrime Minister Shehbaz lauded Minister for Energy Sardar Awais Khan Leghari and his team for their tireless efforts and emphasised that assistance from internationally renowned experts and consultants was crucial for systemic change, and introducing new thinking and governance methods through reforms aligning with modern requirements.\nHe said that the energy ministry’s reforms, reduction in losses, and saving billions of rupees for the national treasury served as a role model for other ministries.\nPrime Minister Shehbaz directed the formation of a committee to finalize actionable proposals for the restructuring of other ministries and institutions, considering the reforms in the energy ministry. The committee will also focus on recruiting the best workforce, aligning ministries with modern systems, and improving governance through reforms.\nDuring the briefing, it was told that under the National Electricity Plan, 134 strategic directives had been implemented in the ministry, where the ministry handles policy, monitoring, and future planning, while a technical arm comprising sector experts handles implementation, innovation, and planning.\nThe meeting was also given a detailed briefing on the profiles of the sector experts and the current working of the ministry under the established system.\nFederal Ministers Dr. Musadik Malik, Ahad Khan Cheema, Sardar Awais Khan Leghari, Shaza Fatima Khawaja, Ali Pervaiz Malik, Minister of State Bilal Azhar Kiyani, Chief Coordinator Musharraf Zaidi, and other relevant senior officials attended the meeting.\nIshtiaq Ahmed, APP’s Foreign Editor, leads coverage of the Prime Minister, President and Foreign Office, bringing over 20 years of journalism experience from local and international publications – Reach out at 03335293238/ ishtiaqrao@gmail.com/ X: ishtiaqrao",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:29:01.089Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/economic-development-impossible-without-modernizing-outdated-system-pm/",
  "dateList": "2025-07-11",
  "date_published": "2025-07-11T08:01:00.000Z"
}
