{
  "title": "No Monkeypox case reported in Pakistan so far: NIH",
  "link": "https://www.app.com.pk/national/no-monkeypox-case-reported-in-pakistan-so-far-nih/",
  "date_published": "2022-05-24T14:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):The National Institute of Health (NIH) has clarified that no case of Monkeypox has yet been diagnosed in Pakistan.\nAccording to the spokesperson of NIH, the news circulating on social media about Monkeypox cases was incorrect.\nHe added, the situation was being closely monitored by the health authorities.\nHe said that all the national and provincial health authorities had been advised to remain on high alert for any suspected case of Monkeypox.\nConcerned health authorities and professionals at all levels, stakeholders, especially the Central Health Establishment including monitoring points of entry were also asked to remain vigilant.\nHe added timely detection and notification were important for prompt implementation of preventive measures and all public and private hospitals had been directed to ensure readiness for isolation and treatment.\nHe said that the Centre for Disease Control, NIH was monitoring the situation and would keep the stakeholders updated.\nA recent surge of Monkeypox disease cases were reported by non-endemic countries, including the UK, Spain, and Canada, and a total of 92 confirmed and 28 suspected cases were reported till date, he added.\nMonkeypox is a rare viral zoonotic disease that is caused by infection with the Monkeypox virus. Although the natural reservoir of Monkeypox remains unknown, however, African rodents and non-human primates like monkeys may harbor the virus and infect people.\nThe patient develops a rash within one to three days after the appearance of fever, often beginning on the face and then spreading to other parts of the body. Other symptoms include headache, muscle aches, exhaustion, and lymphadenopathy.\nThe incubation period is usually seven to 14 days but can range from five to 21 days. The illness typically lasts for two to four weeks. The alert said that the transmission occurs via contact with an infected animal, human, or materials contaminated with the virus.\nThe virus enters the body through broken skin, respiratory track, or the mucous membranes like eyes, nose or mouth. Other human-to-human methods of transmission include direct or indirect contact with body fluids, lesion materials or through contaminated clothing or lines.",
  "retrievedAt": "2025-08-11T14:57:33.102Z"
}
