{
  "title": "British Minister visits Defence Ministry; lauds Pakistan’ efforts for peace",
  "link": "https://www.app.com.pk/national/british-minister-visits-defence-ministry-lauds-pakistan-efforts-for-peace/",
  "date_published": "2022-05-24T12:01:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, May 24 (APP):British Minister for the Armed Forces, James Stephen Heappey MP, alongwith delegation called on Secretary Defence, Lieutenant General (R) Mian Muhammad Hilal Hussain and appreciated Pakistan’ efforts for peace and said Pakistan has played a key role in the war against terrorism.\nThe British Minister visited the Ministry of Defence alongwith a delegation here, said a news release.\nSecretary Defence Lieutenant General (R) Hilal Hussain said the UK has a unique position and has a pivotal role to play within the EU region. Therefore, Pakistan highly valued it’s bilateral relationship with the UK, he added.\n“The common and a shared objective for maintaining global peace and security cement their bilateral relationship” he added. Pak-UK relations have a long history of multi-dimensional cooperation ranging from commerce and trade to peace and security.\nPakistan is not only committed to maintaining global peace and security but has also played a phenomenal active role over the last two decades in this regard”.\nSecretary Defence said that economic development was vital for survival of a nation.\nTherefore, Pakistan desired to improve it’s trade linkages with the world, he added.\n“Pakistan’ economic endeavors are very peaceful and projects like CPEC do not have any military connotations. Rather the Project will contribute towards peace, stability and economic connectivity in the region.”\nDuring the meeting both sides not only discussed matters related to bilateral defence collaborations but also agreed to work closely in all domains of mutual interest.\nAdditionally, they agreed to enhance interaction at all levels.",
  "retrievedAt": "2025-08-11T14:57:35.408Z"
}
