{
  "title": "Pakistan committed to elevating Pak-UK ties to new levels: FS Sohail",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-elevating-pak-uk-ties-to-new-levels-fs-sohail/",
  "date_published": "2022-05-24T16:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): Foreign Secretary Sohail Mahmood Tuesday said that Pakistan attached high importance to its relations with the United Kingdom and was committed to elevating it to newer levels.\nThe foreign secretary received Minister for Armed Forces of the UK James Heappey at the Foreign Office.\nThe talks covered bilateral relations as well as regional and international developments.\nStressing the historic and long-standing nature of Pakistan-UK partnership, the foreign secretary reiterated Pakistan’s resolve to further deepen cooperation across myriad dimensions — including trade, investment, security, defence, culture and people-to-people linkages.\nSohail Mahmood especially highlighted the role of Pakistani diaspora in UK and its valuable contribution to the further advancement of bilateral relations.\nThe foreign secretary reaffirmed Pakistan’s strong commitment to playing a positive role in promoting regional peace and security. He emphasized the need for the international community to play its role in addressing the dire humanitarian situation.\nIn the context of South Asia, the foreign secretary stressed the importance of strategic stability and peaceful resolution of the Jammu and Kashmir dispute.\nMinister Heappey reaffirmed the importance of UK-Pakistan partnership and UK’s desire to expand bilateral cooperation.\nHe appreciated Pakistan’s cooperation with the international community, and UK in particular, following the August 2021 developments in Afghanistan. He thanked Pakistan for its facilitation on evacuations from Afghanistan.\nThe two sides agreed to maintain the momentum of high-level exchanges, especially in this 75th anniversary year of Pakistan-UK diplomatic relations.",
  "retrievedAt": "2025-08-11T14:57:28.871Z"
}
