{
  "title": "Cabinet approves special committee for consultations on issue of enforced disappearances",
  "link": "https://www.app.com.pk/national/pm-approves-special-committee-for-consultations-on-issue-of-enforced-disappearances/",
  "date_published": "2022-05-24T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): The federal cabinet on Tuesday approved the formation of a special committee, under the federal law minister, with a mandate to hold consultations with all the relevant institutions and experts on the issue of enforced disappearances.\nDuring the meeting of the federal cabinet held here under his chair, the prime minister was given a briefing on the issue of enforced disappearances. The cabinet committee would consist of cabinet members belonging to all the political parties.\nIt was told that a special committee of the cabinet had been constituted on the subject which served to look into the factors behind the disappearances besides working for the recovery of the missing persons.\nMoreover, a bill to amend the Code of Criminal Procedure 1860  had been tabled in the National Assembly which proposed strict punishment for the people involved in enforced disappearances. The amendment bill is currently under consideration by the Senate Standing Committee concerned.\nCalling it a serious constitutional issue, the cabinet members called for practical steps for its resolution in coordination with all the stakeholders. The prime minister said the enforced disappearances was a serious issue that led to the lawlessness.\nThe federal cabinet also approved the tabling of Elections (Amendment) Bill 2022, saying the participation of overseas Pakistanis in the electoral process was essential for they being a precious asset of the country.\nThe previous government made legislation on the matter without taking the Election Commission into confidence.\nThe cabinet members emphasized the deliberation over reports of the Election Commission on the use of electronic voting machines and the voting right of the expatriates.\nThe meeting viewed that the use of electronic voting machines and voting rights for the overseas Pakistanis should be examined under a pilot project.\nThe Election (Amendment) Bill provides for the launch of the pilot project on the EVM as well as voting for the expatriates for the onward presentation of its report to the parliament that would ascertain its practicability.\nDiscussing other agenda items, the federal cabinet approved the revival of the Railways Estate Development and Marketing Company (REDAMCO), on the recommendation of the railway ministry. The REDAMCO was a subsidiary of the railway ministry which was dissolved by the previous government.\nThe company had been operating to utilize the railways land for profit-making activities which had also led to the surge in the department’s revenue. The revenue was being used to meet the salaries and pension of the railway employees as well as the development projects.\nThe federal cabinet endorsed the decision made by the cabinet committee on the legal reforms committee in its meetings held on May 19 and 25, 2022.\nThe committee had decided on the amendment of Chartered Accountability Bye-Laws 1983; approved the rules for appointment of chairman and members of the National Industrial Relations Commission; and Election (Amendment) Bill 2022.\nThe cabinet nullified the induction of incumbent Chairman of Karachi Port Trust Chairman Nadir Mumtaz on deputation and assigned the additional charge to the Director-General of Ports and Shipping. The new chairman will be appointed through an open competition.\nThe federal cabinet also ratified the prime minister’s advice to the president regarding the appointment of the Punjab governor.\nThe meeting also held a threadbare discussion on the prime minister’s advice to the president on various matters.",
  "retrievedAt": "2025-08-11T14:57:34.026Z"
}
