{
  "title": "Yasin Malik’s case, a stigma on Indian judicial system: Mushaal",
  "link": "https://www.app.com.pk/national/yasin-maliks-case-a-stigma-on-indian-judicial-system-mushaal/",
  "date_published": "2022-05-24T11:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):Mushaal Hussein Mullick, Chairperson Peace and Culture Organization (PCO) on Tuesday invoking attention of the international community towards violation of human rights in Indian-held Kashmir said that Yasin Malik’s case was one of the worst example of judicial victimisation.\nAddressing a joint press conference with MNAs of MQM including Kishwar Zehra, Usama Qadir and Sabir Qaim Khani, wife of jailed Kashmiri Hurriyat Leader Yasin Malik said that India’s fascist regime was suppressing the innocent Kashmiris and their pro-freedom leaders over raising the voice for their right to self-determination.  Modi’s regime, she said was committing worst atrocities against innocent Kashmiris.\nThe cellular services were suspended, people were being disconnected from communication channels, arrests were made to suppress the freedom struggle, she added. One million armed personnel were imposed and the entire valley was converted into the world’s largest jail, Mushaal lamented and said the United Nations must intervene to ensure protection and safety of the unarmed Kashmiris especially Yasin Malik going under trail in a fictitious case.\nMushaal said that the international community, UN bodies and human rights organisations should wake up from their deep slumber as brutal Indian authorities were all-set to convict Kashmiri Hurriyat leader Yasin in fake cases on May 25. Chairperson PCO said that Yasin was constantly physically and mentally tortured and denied even “international basic rights guaranteed to the prisoners”.\nMullick went on to say that the senior Hurriyat leader was kept in solitary confinement as even his family members were not allowed to meet him. The MQM, MNS also expressed solidarity and reiterated that they will support Mushaal in the situation and highlight Yasins Mallik’s case at all international fora. Kishwar Zehra said that Modi’s government suppressed the voice of Kashmiris through these nefarious acts but the reaction of people would be more harmful for Rashtriya Swayamsevak Sangh (RSS) ideology.",
  "retrievedAt": "2025-08-11T14:57:35.370Z"
}
