{
  "title": "Sherry underlines little recognition of persistently growing inequality throughout world",
  "link": "https://www.app.com.pk/national/sherry-underlines-little-recognition-of-persistently-growing-inequality-throughout-world/",
  "date_published": "2022-05-24T11:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Tuesday underscored that there was little recognition of the persistently growing inequality throughout the world as there was a dangerous chasm between the Global South and the West.\nSenator Sherry Rehman spoke in a discussion entitled “The Future of Democracy” held at the annual meeting of global leaders at the World Economic Forum 2022 in Davos, said a media release received here.\nSenator Sherry said, “We are sitting in the antechamber of climate catastrophe.”\nWhile raising the issue of gross inequality between the developed and underdeveloped world, Minister Sherry stressed, “The response of the developed world to the humanitarian crisis in Ukraine, for instance was timely and clear.\nCompare that to the humanitarian crisis in Afghanistan or after the invasion of Iraq or “browner” cultures, and these have been somewhat alienating, given that we worked from assumptions of liberal democracy that say a response to any humanitarian crisis should be the same, equal for everyone.\nUnfortunately, that has never been the case, depending on who the victim is or what is the colour of their skin.”\nOn the importance of democracy for countries like Pakistan, Federal Minister opined, “Authoritarian systems might appear like they are addressing issues but for complex, heterogeneous countries like Pakistan where many different ethnicities and languages compete with each other, the only way the vulnerable get protected is through a more inclusive approach.\nDemocracies ultimately challenge is the system to include the vulnerable, whereas authoritarian governments mobilise populism and sentiment for channelling power, but provide no answers to real problems.\nThe developed world has often found authoritarian governments in fragile countries convenient funnels for diplomatic and other interchanges. These are inconvenient truths. Democracies are like women in the world; two step back and one forward, but they are the only way forward for the disempowered .“\nShe said democracy cannot be reduced to one linear experience or model in history. “Democracies are inherently not linear in their experience, and countries experience democracy quite differently from each other.\nNo one-size-fits-all theory works in this context. Therefore, it is high time that we move away from this notion that there is one set pattern for democracy or that all parliaments work in the same fashion. The idea should be to have tolerance for the models we all navigate or manage as long as they are in the struggle to be representative and inclusive.”\nIn the context of pressing global agendas that need to be addressed with equity and justice, she talked of the global climate change issue as a joint but proportionate responsibility for the big emitters of the previous and current century.\n“We are sitting in the antechamber of climate catastrophe. It is highly unfortunate that our leaders’ vested interests have overshadowed the real changes needed in the world.\nTransitions from fossil fuels are the need of the hour but the developed world is still the highest emitter of greenhouse gases, putting their short term national stakes and corporate interests above the safety and survival of our world. Instead of pressing the countries most at risk, the big emitters should act responsibly and do more.\nPerhaps then all of us will be better motivated to act faster to build a more sustainable and resilient future. At the same time, no democracy, even a climate-vulnerable one like Pakistan can afford to sit back and not act for their own community. The costs of inaction are too high”.\nThe discourse focused on the need for democratic values to safeguard the rights of the most vulnerable. In addition it explained how democracies are equipped for meeting challenges from authoritarian leaders, especially for complex societies.\nOther speakers included President of Latvia, Egils Levits, Senator Christopher A. Coons from Delaware, USA, Editor-in-Chief Foreign Affairs Daniel Kurtz, and Professor of History at the Yale University Timothy Snyder.",
  "retrievedAt": "2025-08-11T14:57:35.448Z"
}
