{
  "title": "Foreign secretary emphasizes common regional approach toward Afghanistan",
  "link": "https://www.app.com.pk/national/foreign-secretary-emphasizes-common-regional-approach-towards-afghanistan/",
  "date_published": "2022-05-24T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): Foreign Secretary Sohail Mahmood Tuesday emphasized the need for a common regional approach toward Afghanistan in order to advance shared objectives.\nThe foreign ministry, in a meeting with Germany’s Special Representative for Afghanistan Dr. Jasper Wieck here, hoped that the international community would assist the Afghan people in averting the humanitarian crisis.\nDuring the meeting, they exchanged views on bilateral relations and the situation in Afghanistan.\nWelcoming Dr. Wieck to Pakistan, the foreign secretary recalled the positive outcomes of their last meeting in March this year.\nHe said Pakistan deeply valued its long-standing relations with Germany, both bilaterally and in the context of the European Union.\nHe added that Pakistan was committed to comprehensively expanding bilateral cooperation across all areas, especially trade, investment, security, and people-to-people exchanges.\nThe foreign secretary also stressed the importance of regular high-level exchanges and highlighted the various events organized to mark the 70th anniversary of diplomatic relations.\nHe highlighted the key elements of Pakistan’s principled position on the conflict in Ukraine and reiterated its support for a peaceful and diplomatic solution as soon as possible.\nThe foreign secretary also briefed the Special Representative on the serious situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). He underscored the importance of peaceful resolution of the Jammu and Kashmir dispute for durable peace and stability in South Asia.\nThe special representative underlined the importance Germany attached to its relations with Pakistan and its desire to enhance bilateral cooperation in diverse fields.\nThanking Pakistan for its facilitation in evacuating Afghans, foreign diplomats, and international aid workers from Afghanistan, Special Representative Wieck reaffirmed Germany’s commitment to work together for promoting peace and stability in Afghanistan.",
  "retrievedAt": "2025-08-11T14:57:28.954Z"
}
