{
  "title": "Calls by nations to boycott Champions Trophy matches can’t put us under pressure: Afghan skipper - World - DAWN.COM",
  "author": null,
  "content": "Afghanistan skipper Hashmatullah Shahidi on Thursday said calls from other nations for a boycott of their Champions Trophy matches, because of the treatment of women by the ruling Taliban, did not affect his team.\n\nAfghanistan open their Group B campaign in the Champions Trophy against South Africa in Karachi on Friday.\n\nLast month, South Africa Sports Minister Gayton McKenzie backed demands from British politicians for a playing boycott of Afghanistan.\n\nThe England and Wales Cricket Board resisted the demand to boycott their Champions Trophy group game but said they would not host Afghanistan in a bilateral series.\n\nAustralia, also in Group B, have cancelled a Twenty20 international series and a Test against Afghanistan in the last two years, but plan to play their trophy game.\n\nShahidi said he was unperturbed.\n\n“We only control things inside the ground, that’s our job,” Shahidi said in a press conference in Karachi. “The other things cannot put us under pressure.”\n\nAfghanistan face England in Lahore on February 26 and Australia at the same venue two days later.\n\n“The whole world knows that we are playing well, especially in the last three years so we are focused on our play and here also we do the control things,” Shahidi said.\n\nHaving learnt most of their cricket in the refugee camps in Pakistan during the Soviet invasion of their country in the 1970s, the Afghanistan team have risen by leaps and bounds.\n\nThey shocked three former champions — England, Pakistan and Sri Lanka — at the 2023 World Cup in India. They were the losing semi-finalists in the Twenty20 World Cup last year, held in the United States and the West Indies.\n\nShahidi said his team was not overawed by South Africa.\n\n“We have recently beaten South Africa in Sharjah so we have that confidence with us and we are not under any pressure,” Shahidi said of his team’s 2-1 win last year.\n\nThe Afghanistan skipper said his team wants to win the Trophy. “We are doing very good so we are here to win the final and not just to participate. We are definitely [a] 100 per cent looking to win this event.”\n\nAfghanistan boast quality spinners with Rashid Khan, ranked second in the world in one-day internationals, leading the attack. They also have hard-hitting batters in Rahmanullah Gurbaz, Ibrahim Zadran and Mohammad Nabi.\n\nShahidi also dispelled assertions from around the world about the quality of cricket facilities in Afghanistan.\n\n“I heard a lot from other countries that ‘they don’t have facilities, they don’t have stadiums, they don’t have academies’,” he said.\n\n“It’s totally wrong. We have good facilities, cricket academies, a high-performance centre in Kabul and Jalalabad and stadiums in every zone of Afghanistan.”\n\nShahidi lamented that despite the presence of adequate facilities, foreign teams could not play in the country due to longstanding security issues. He expressed hope that “as soon as possible, one of the countries will come to Afghanistan and you will see the crowd also”.\n\n“When we play domestic cricket, it’s fully packed,” he added. “Even people wait outside the stadium and try to come and watch the domestic game, like more than 50,000, 40,000 or 30,000 people coming for the finals of an event.”\n\nThe Afghan skipper maintained that if a foreign team were to visit the country, thousands of cricket fans would watch the game in person.\n\nThe Champions Trophy — the first global event hosted by Pakistan in three decades — opened on Wednesday with New Zealand beating the host country by 60 runs in Group A. India and Bangladesh are the other two teams in the Group. The top two teams from each Group will qualify for the semi-finals.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/20192118848f5f1.jpg",
  "retrievedAt": "2025-08-25T19:53:16.864Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893214/calls-by-nations-to-boycott-champions-trophy-matches-cant-put-us-under-pressure-afghan-skipper",
  "dateList": "2025-02-20",
  "date_published": "2025-02-20T15:36:03.000Z"
}
