{
  "title": "Bangladesh can beat anyone, says Najmul ahead of India clash - Sport - DAWN.COM",
  "author": null,
  "content": "DUBAI: Bangladesh’s fast bowlers led by speed sensation Nahid Rana mean the Tigers can beat anyone at the Champions Trophy, skipper Najmul Hossain Shanto declared Wednesday on the eve of their clash with India.\n\nUnfancied Bangladesh face favourites India in Dubai on Thursday in the opening match for the two teams in the eight-nation 50-over tournament. The focus has been on arch-rivals India and Pakistan in a group which also has New Zealand.\n\nBut Najmul said Bangla­desh’s seam attack led by the 22-year-old Nahid, who regularly works up speeds of over 140kph (87mph), is second to none.\n\n“I think we have always struggled with our seam attack but last couple of years we have got some quality fast bowlers,” Najmul told reporters.\n\n“Now we have Nahid Rana, Taskin [Ahmed], the way they are bowling, I think it helps a lot. As a captain we love to see them bowling fast.”\n\nNahid, who is set to play just his fourth 50-over match, made his Test and ODI debut last year and has quickly made a name for himself with his pace and accuracy.\n\n“I think last few months he bowled very well and bowled fast,” said Najmul. “And when we see him in the ground bowling like this, it helps our whole bowling unit, and it has motivated us (in) how we can give opponents lots of challenges.”\n\nNajmul said there were no fav­ou­rites or underdogs at the event.\n\nBangladesh sneaked into the tournament by virtue of a better net-rate than the Netherlands, while former champions Sri Lanka missed out.\n\n“We believe we can beat any team in this tournament and all the teams are capable to win this tournament,” said Najmul.\n\n‘CLASSY’ GILL THE KEY\n\n“But I’m someone not thinking about the opponent too much. If we execute our plan properly, we can beat any team.”\n\nIndia will play their Champions Trophy matches in Dubai after refusing to visit hosts Pakistan over long-standing political tensions.\n\nIndian captain Rohit Sharma on Wednesday said he hopes “classy” batter Shubman Gill carries his blazing form into the Champions Trophy.\n\nIndia begin their campaign fresh from a 3-0 ODI sweep of England at home. Rohit and his men then play arch-rivals Pakistan in a Sunday blockbuster.\n\nVice-captain Gill was the player of the series against England with 259 runs including one century and two half-tons to return to form after a lean Test series in Australia.\n\n“Gill is a very classy player, there was never a doubt about his ability in this squad,” Rohit said of his deputy.\n\n“We tend to mix formats and I don’t think that’s the right way to judge any player. With Gill, we know the numbers are crazy, he has been superb for us in the last three-four years.”\n\nHe added, “Obviously there is a reason that he has been elevated to be the vice-captain of the team as well, hopefully he has a great tournament and it eventually will help us achieve the things that we are looking to achieve.”\n\nFocus will be on Rohit, who opens the batting with Gill, and star batsman Virat Kohli with the future of the two stalwarts being the talking point ahead of the 50-over tournament.\n\nBoth Rohit and Kohli had a poor run with the bat in India’s 3-1 Test defeat in Australia but came good in the England ODIs.\n\nThe 37-year-old Rohit hit 119 in the second match and Kohli (36), who comes to bat at number three, scored 52 in the third to answer critics.\n\nRohit said India’s top-order has enough experience to post big totals.\n\n“The key to have success in this format, your top three-four-five batsmen need to get that big score for you to post a big score eventually,” said Rohit.\n\n“So I think our top four batters are quite experienced and we know that once they are set, once they are in, they like to get those big runs.”\n\nThe return of pace bowler Mohammed Shami has boosted the morale of the team, especially in the absence of ace quick Jasprit Bumrah, who is out with a back injury.\n\nShami, 34, returned to international cricket in the England white-ball series after more than a year due to a heel injury and claimed five wickets in two T20 and two ODI matches. Indian spinner Kuldeep Yadav also made a comeback from his hernia surgery in the recent ODIs and adds to the spin-heavy bowling attack and Rohit said he “looks confident”.\n\nPublished in Dawn, February 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b6481881cb0.jpg",
  "retrievedAt": "2025-10-12T01:32:46.024Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893073/bangladesh-can-beat-anyone-says-najmul-ahead-of-india-clash",
  "dateList": "2025-02-20",
  "date_published": "2025-02-20T02:42:48.000Z"
}
