{
  "title": "Premature alarm - Newspaper - DAWN.COM",
  "author": null,
  "content": "LAST month’s $420m current account deficit reflects the pressure of debt payment and a rising import bill on Pakistan’s balance-of-payments position, amid drying up foreign loans and falling foreign private investment. This gap most likely marks a temporary reversal of the earlier trend of continuous surplus posted for five consecutive months — August to December — on account of a substantial boost in remittances from overseas Pakistanis.\n\nThe remittances have recorded a surge of $5bn between July and January from a year ago. The January gap slashes the accumulated current account surplus from $1.2bn to $628m — still significant progress from the deficit of $1.8bn posted in the same period last year, spawning hopes that the current account surplus/ deficit will remain range-bound between +0.5pc and -0.5pc of GDP during FY25.\n\nThe gap in the current account is not surprising, given the 38pc decline in foreign loan inflows to $4.58bn in the first seven months of the present fiscal year from $6.31bn a year ago. In its monthly report, the Economic Affairs Division said that the external assistance does not include the $1bn received from the IMF under its funding programme. The government is targeting foreign debt inflows of $19.4bn, including $9bn from China and Saudi Arabia, this fiscal year. Though FDI has risen by 27pc to $1.3bn in the first half of the year, the meagre amount underlines the lack of investor confidence amid our painfully slow progress on structural reforms. And even after the passage of two years, the ‘promised’ investment flows from the Gulf remain elusive.\n\nThe weakened financial account indicates that debt payments and a surging trade gap of over $16bn is mostly being financed through the current account. The ‘empty’ financial account is also responsible for a reduction of $1bn in the State Bank’s international reserves in eight weeks from Dec 13 to Feb 7, despite the purchase of $3.8bn from the market in July-October.\n\nThe alarm being raised by some analysts is premature. It is anticipated that debt payment pressures will subside as most maturing loans have already been paid and imports are expected to slow down. If the momentum in remittances continues, we might see a small surplus in the current account.\n\nAside from a ‘natural’, gradual depreciation in the rupee value, there is also no reason for the exchange rate to deteriorate steeply. That said, the fragility of economic recovery demands that the authorities stop relying on remittances to finance the current account deficit and focus on attracting non-debt-creating foreign private investment. Improvement in headline inflation, leading to a fall in interest rates and reserves, besides a stable currency, has given policymakers a chance to fix investment policies and implement structural reforms. The window for changing course is small and time is running out.\n\nPublished in Dawn, February 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:53:26.703Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893117/premature-alarm",
  "dateList": "2025-02-20",
  "date_published": "2025-02-20T02:49:08.000Z"
}
