{
  "title": "Cruel twist of fate led two of a family to board ill-fated Barkhan bus - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Survivors say three dozen gunmen blocked road; picked out, ‘executed’ those hailing from Punjab\n• President, PM promise killers will be brought to justice\n\nQUETTA: “My maternal uncle and his brother-in-law insisted on taking a bus back home to Sheikhupura, though six other members of the family had boarded the Jaffar Express in the morning for the same destination,” Asad Abbas, the nephew of 65-year-old Mohammad Ashiq, told Dawn on Wednesday.\n\nHis relatives were among those slain in the gruesome incident that transpired in the Rakhani area of Barkhan district, where half a dozen men were forced off Punjab-bound buses by gunmen and summarily shot.\n\nAbbas said they had come to offer condolences over the death of his mother and the two had left by bus at 2pm after saying goodbye to other members of the family at the Quetta Railway Station.\n\n“We received information about the killing of my uncles in the wee hours of Wednesday morning,” he said in a voice choked with emotion, adding his family was still in a state of disbelief.\n\nAshiq had four children while his brother-in-law Shaukat Ali had a son, Abbas said, adding that some female relatives accompanied them on the Faisalabad-bound bus.\n\nLevies officials said the gunmen took the seven passengers to a nearby hilly area, lined them up all and opened indiscriminate fire on them.\n\nThe officials while quoting doctors said all the victims had received multiple bullets which caused their instant death.\n\nThey identified the deceased as Mohammad Ashiq, who came from Sheikhupura; Asim Ali, a resident of Lahore; Adnan Mustafa, who belonged to Burewala district Vehari; Mohammad Ajmal, a resident of Lodhran; Shaukat Ali of Faisalabad; Ashiq Hussain, a retired DSP of Balochistan Constabulary; and Sufyan Ansari.\n\nBarkhan Deputy Commissioner Waqas Khursheed Alam, quoting survivors, said around three dozen armed men had blocked the Loralai-Dera Ghazi Khan highway at Rakhani. They were checking all the vehicles and when they signalled the ill-fated coach to stop, the driver tried to speed away, but the armed men opened fire. After stopping the coach, the gunmen barged into the bus and after checking identity cards dragged seven people, who had Punjab addresses on their cards, from the bus and took them away.\n\nCNIC a ‘saviour’?\n\n“I was travelling with my younger brother, Adnan Mustafa, on the same bus. They also asked me for my card. They checked it, but returned it despite it having a Punjab address. My details were written in English, so maybe they didn’t understand it. But they took away Adnan Mustafa, despite him telling them that he did not have his card,” Zeeshan Mustafa, 55, narrated. They shot him dead, he sobbed. “I remained silent out of fear while they were taking my brother,” he further said.\n\nTwo women, who were travelling with Zeeshan and his brother, said, “Armed men did not say anything to women, but checked CNICs of all male passengers.”\n\n“Those speaking Punjabi, the gunmen targeted them,” Shahida Bibi told journalists who reached at the site after the incident.\n\nAfter offloading the seven passengers, the gunmen asked the driver to leave the area. However, the driver stopped after covering some distance.\n\nSufyan Ansari, 20, who was also among the deceased, was going to Faisalabad. He was the brother of eight sisters and was the only breadwinner in his poor family.\n\nOfficials said that security forces, including personnel of Frontier Corps and Levies, had launched search operations in the area and were chasing the attackers.\n\nIn August, 23 people from Punjab were killed in the province in a similar way.\n\nThe bodies of all the seven victims were rece­ived by the deputy commissioner of Dera Ghazi Khan, Mohammad Usman Khalid, and Commandant of Border Military Police Mohammad Asad Chandia at the Punjab-Balochistan border on Wednesday.\n\nPresident Asif Ali Zardari and Prime Minister Shehbaz Sharif strongly condemned the killings and in separate statements prayed for peace for the departed souls and strength for the bereaved families to bear the loss, adds APP.\n\n“Terrorists are the enemies of peace and humanity,” the president said and assured that the perpetrators would be taken to the task.\n\nPM Shehbaz directed the authorities concerned to bring the perpetrators to justice and said that the killers would have to pay a heavy price for their act.\n\nBalochistan Chief Minister Mir Sarfraz Bugti also condemned the brutal killing of bus passengers.\n\nAccording to the provincial government spokesperson, security forces had already reached the scene of the incident. “Security forces are continuing their efforts to track down the terrorists involved in this heinous act,” the spokesperson added.\n\nTariq Birmani in Dera Ghazi Khan also contributed to this report\n\nPublished in Dawn, February 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:33:18.231Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893109/cruel-twist-of-fate-led-two-of-a-family-to-board-ill-fated-barkhan-bus",
  "dateList": "2025-02-20",
  "date_published": "2025-02-20T02:42:02.000Z"
}
