{
  "title": "Fallen white-ball kings England in search of Champions Trophy revival - Sport - DAWN.COM",
  "author": null,
  "content": "England may have been the reigning world champions in both 50-over and T20 cricket as recently as two years ago, but they head into the Champions Trophy facing an uphill struggle to reach the semi-finals.\n\nThey suffered seven defeats in eight white-ball games during their preceding tour of India, culminating in a crushing 142-run loss in the third one-day international in Ahmedabad.\n\nThat result condemned England to a 3-0 series whitewash, after their 4-1 reverse in the T20s.\n\nAccusations of laziness from India great Ravi Shastri and ex-England batsman Kevin Pietersen may be unfair, but the side have now lost more ODIs since their 2019 World Cup triumph than they have won — 32 to 29, with 10 defeats in their last 14.\n\nIn England’s favour is that the pitches in Pakistan, where they face Australia in their Champions Trophy opener in Lahore on Saturday, are set to be more to the liking of both their batsmen and fast bowlers than the spin-friendly surfaces in India.\n\nTo reach the last four of the eight-team Champions Trophy ODI tournament, Jos Buttler’s men must finish in the top two of a group that also contains Afghanistan and South Africa — both of whom beat England during their woeful title defence in the 2023 World Cup in India.\n\nThe recent India campaign was England’s first since Test coach Brendon McCullum also took charge of the white-ball teams.\n\nFormer New Zealand captain McCullum enjoyed initial success as England’s red-ball boss, although the team have since failed to qualify for the World Test Championship final at Lord’s in June.\n\nMany of the criticisms levelled against England’s Test cricket under McCullum have now been applied to the limited-overs teams.\n\nThe all-format charge sheet against England includes a struggle against quality spin and express fast bowling, while their only response when an aggressive ‘Plan A’ fails appears to be simply to ‘go harder’ rather than adapt to the evolving match conditions.\n\nMcCullum however was typically bullish following defeat in Ahmedabad, saying: “You know what I’m like. Always optimistic. If you go the other way, you’ve got no chance, right? I have belief in us.”\n\nBut whether white-ball skipper Buttler remains the right man to oversee an England revamp is an open question.\n\nIt was limited-overs coach Matthew Mott who lost his job following England’s lacklustre defence of their T20 World Cup last year.\n\nNothing that has happened since suggests Buttler is providing the charismatic or tactical leadership to inspire England.\n\nThe dynamic batsman, speaking after the India ODI series, said: “I think the fact we’re not anywhere near our potential yet or playing individually or collectively where we know we can be gives us something to look forward to, believe we can get there and be a dangerous team in the Champions Trophy.”\n\nDashing England opener Ben Duckett has at least been passed fit for the tournament following a groin injury but rising star Jacob Bethell has been ruled out with a hamstring problem.\n\nMeanwhile, England’s attack – which once featured at least one left-arm paceman — is set to be an all-right-arm affair spearheaded by express quicks Jofra Archer and Mark Wood, with much depending on leg-spinner Adil Rashid.\n\nEncouragingly for England, arch-rivals Australia will be without key players in fast bowlers Pat Cummins, Josh Hazlewood and Mitchell Starc.\n\nThey too have just been thrashed, with Sri Lanka inflicting a mammoth 174-run loss upon Australia in the second ODI in Colombo.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:53:21.530Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893188/fallen-white-ball-kings-england-in-search-of-champions-trophy-revival",
  "dateList": "2025-02-20",
  "date_published": "2025-02-20T09:06:40.000Z"
}
