{
  "title": "SC’s Justice Shah observes sexual harassment matter of ‘control and domination’ in ruling - Pakistan - DAWN.COM",
  "author": null,
  "content": "Justice Syed Mansoor Ali Shah has declared sexual harassment at the workplace “less about sexual desire and more about control and domination” in a recent Supreme Court judgement.\n\nThe judgement, dated Feb 12, was issued on a petition filed against a 2023 order by the Lahore High Court (LHC) in a sexual harassment case.\n\nThe verdict was issued on a plea filed by Muhammad Din, who challenged his compulsory retirement over harassment allegations by Sidra Zafar, a doctor.\n\nThe retirement had been ordered by the Punjab Ombudsperson in March 2020 and upheld by the Punjab governor in August 2020 as well as later by the LHC in its March 30, 2023 order as they heard subsequent pleas filed by Din.\n\nJustice Shah dismissed the petition against the LHC’s ruling stating, “[The] contentions raised by the learned counsel for the petitioner have been convincingly answered in the impugned judgment.\n\n“No jurisdictional error, illegality or procedural irregularity in the impugned judgement has been pointed out … the impugned judgement does not warrant any interference.”\n\nHe observed, “When women’s authority is perceived as illegitimate or easily undermined, colleagues, clients, and even subordinates may use harassment as an ‘equalizer’ to reassert traditional power dynamics.\n\n“This reinforces the notion that workplace harassment is less about sexual desire and more about control and domination, serving as a tool to police and punish women who disrupt male-dominated spaces.”\n\nIn his judgement, Justice Shah highlighted that sexual harassment in the workplace remained a critical issue in the country.\n\nHe said, “At the outset, it is imperative to recognise that workplace harassment remains a pressing global issue, affecting millions of workers across various sectors.\n\n“Women are slightly more likely than men to have faced harassment over their careers.”\n\nHis judgement also cited a feminist, legal scholar Catherine MacKinnon, who described harassment as “not as individual misconduct but as systemic sex-based discrimination that reinforces gender hierarchies in the workplace”.\n\nIt further said, “However, gender-based harassment is not solely about hierarchy — it is fundamentally about who is perceived as having the right to wield authority.\n\n“Thus, while sexual harassment is primarily understood as a power-based behaviour, individuals at any level of a hierarchy can perpetrate harassment, particularly when supported by gendered or social reinforcements.”\n\nZafar had filed a complaint against the petitioner Din over alleged harassment and misconduct before the Punjab Ombudsperson in 2019.\n\nThe respondent had detailed how she was subjected to “abuse, verbal assaults, and character assassination” by her driver who engaged in “inappropriate conduct, using indecent language and behaving unethically with female patients and by spreading malicious rumours about her”.\n\nJustice Shah’s verdict noted that Zafar lacked the “authority to remove the petitioner from his position” despite many requests to the department to transfer the petitioner.\n\nPunjab Ombudsperson had ruled that the petitioner’s actions constituted harassment and imposed a penalty of compulsory retirement for Din.\n\nThe petitioner had sought representation before the Punjab governor which was dismissed in the 2020 impugned order. Later, Din invoked the constitutional jurisdiction of the LHC by filing a writ petition against the impugned order, which was also dismissed in 2023.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:53:22.228Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893185/scs-justice-shah-observes-sexual-harassment-matter-of-control-and-domination-in-ruling",
  "dateList": "2025-02-20",
  "date_published": "2025-02-20T09:38:01.000Z"
}
