{
  "title": "Ruling BJP takes control of New Delhi after 27 years as chief minister sworn in - World - DAWN.COM",
  "author": null,
  "content": "A member of India’s ruling Hindu-nationalist party was sworn in on Thursday as chief minister of New Delhi after an election landslide handed it control of the capital for the first time in decades.\n\nRekha Gupta, 50, from Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP) is the fourth woman to serve as chief minister of the sprawling megacity of more than 30 million people.\n\nThe BJP is in government nationally but has not controlled the local legislature in Delhi since 1998, so its sweeping victory in seizing more than two-thirds of seats in the February 5 polls was both symbolic and strategically important.\n\nGupta, who has a law degree and began her career in student politics in the city, was selected for the post by party members late on Wednesday. “I will faithfully and impartially discharge the duties of the office,” Gupta said while taking the oath of office in front of a crowd of cheering supporters.\n\nModi, who was present at the ceremony, said in a post on X that Gupta had “risen from the grassroots” to become the chief minister. “I am confident she will work for Delhi’s development with full vigour,” he added.\n\nThe elections ousted the Aam Aadmi Party (AAP), whose leader Arvind Kejriwal had governed Delhi for much of the past decade and was a prominent critic of Modi.\n\nKejriwal rode to power as an anti-corruption crusader but spent several months behind bars last year over accusations his party took kickbacks in exchange for liquor licences.\n\nHe has denied wrongdoing and characterised the charges as a political witch hunt by Modi’s government.\n\nThe win is a boost for the BJP and 74-year-old Modi, who won a third term in office after elections last year but with a reduced vote that forced him to rely on coalition partners to govern.\n\nGupta faces major challenges, including Delhi’s monumental air pollution crisis, which smothers the city in hazardous fumes for months during the winter.\n\nNew Delhi is regularly ranked the worst capital in the world for choking smog, which often surges as much as 60 times the World Health Organisation’s recommended daily maximum.\n\nYears of piecemeal government initiatives have failed to measurably address the problem, with the smog blamed for thousands of premature deaths annually and particularly affecting the health of children and the elderly.\n\nNone of the key parties made tackling the health crisis a focal point of their campaigns.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/20164135e046f69.jpg",
  "retrievedAt": "2025-08-25T19:53:22.044Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893201/ruling-bjp-takes-control-of-new-delhi-after-27-years-as-chief-minister-sworn-in",
  "dateList": "2025-02-20",
  "date_published": "2025-02-20T12:40:10.000Z"
}
