{
  "title": "PM highlights govt’s business friendly, pro-investment initiatives",
  "link": "https://www.app.com.pk/national/pm-highlights-govts-business-friendly-pro-investment-initiatives/",
  "date_published": "2023-10-18T08:32:00.000Z",
  "source": "APP",
  "content": "BEIJING, Oct 18 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday said that the government was taking business-friendly and pro-investment initiatives to bring about the economic development in the country.\nThe prime minister, in a meeting with a delegation of East Sea Group led by Chairman Fang Yulong, highlighted pro-business policies of the government.\nThe meeting took place on the sidelines of the Belt and Road Forum held here.\nHe said the government was encouraging the private sector and providing a conducive atmosphere to enable it play an effective role for country’s economic development.\nFang Yulong told the prime minister that East Sea Group was making investments in Gwadar Free Zone and refinery sector and that the Chinese firms were taking keen interest in increasing their investment in the country.\nHad a productive meeting with Mr. Fang Yulong, Chairman of East Sea Group along with the delegation. Discussed Pakistan's business-friendly policies, private sector growth, and deepening Pak-China economic ties. China's investment in Gwadar Free Zone is a testament to our… pic.twitter.com/RKRVGUOcyh\n— Anwaar ul Haq Kakar (@anwaar_kakar) October 18, 2023\nPrime Minister Kakar welcomed the East Sea Group’s interest in investment in Pakistan and called Gwadar a key factor for Pakistan’s economic development and China Pakistan Economic Corridor (CPEC).\nHe said that Pakistan and China were time-tested friends as the latter stood by the former in every difficult time.\nLater, the prime minister wrote on X that in the meeting they discussed Pakistan’s business-friendly policies, private sector growth, and deepening Pak-China economic ties.\nChina’s investment in Gwadar Free Zone is a testament to our enduring friendship, he remarked.",
  "retrievedAt": "2025-08-11T10:07:46.766Z"
}
