{
  "title": "Pakistan, China agree to further strengthen high-level engagement, deepen multiple ties",
  "link": "https://www.app.com.pk/national/pakistan-china-agree-to-further-strengthen-high-level-engagement-deepen-multiple-ties/",
  "date_published": "2023-10-18T10:05:00.000Z",
  "source": "APP",
  "content": "BEIJING, Oct 18 (APP): Pakistan and China on Wednesday agreed to further strengthen high-level dialogue and engagement besides deepening the political, economic, education, science & technology, cultural, and people-to-people relations.\nThe bilateral ties were discussed in a bilateral meeting between Caretaker Prime Minister Anwaar-ul-Kakar and Chinese Premier Li Qiang on the sidelines of Third Belt and Road Forum (BRF) here.\nAccompanied by the ministers and senior officials, the two leaders reaffirmed the time-tested and iron-clad friendship between Pakistan and China.\nPrime Minister Kakar extended felicitations to the Chinese leadership on the successful holding of the Third Belt and Road Forum (BRF).\nNoting the depth and breadth of the Belt and Road Initiative (BRI), the prime minister termed it as a project of immense significance for the world in terms of connectivity and shared prosperity.\nThe two leaders discussed bilateral collaboration in the context of CPEC and prospects of further deepening economic linkages.\nPrime Minister Kakar underscored the importance of CPEC for Pakistan’s economy and noted with satisfaction its expansion into new areas of development – including industrial development; livelihood projects; ICT; mining and minerals exploration and agriculture.\nHe expressed the confidence that Chinese investment in Special Economic Zones (SEZs) will contribute in diversification of Pakistan’s export basket and expansion of its industrial base.\nPremier Li Qiang underlined the steady growth of bilateral cooperation and noted the positive momentum of CPEC projects. He hoped that leadership consensus would give further boost to trade and economic relations between the two countries.\nThe two prime ministers also witnessed the signing ceremony in which several MoUs/Agreements were signed in areas of commerce, communication and transport including MLI, connectivity food security & research, media exchanges, space cooperation, urban sustainable development, capacity building, mineral development and industrial cooperation, climate change, vaccine development.",
  "retrievedAt": "2025-08-11T10:07:44.674Z"
}
