{
  "title": "Double-standards of West, coupled with callous policy bleeding Palestinian nation: Alturk",
  "link": "https://www.app.com.pk/national/double-standards-of-west-coupled-with-callous-policy-bleeding-palestinian-nation-alturk/",
  "date_published": "2023-10-18T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): Deputy Head of Mission Embassy of Palestine, Nader Alturk Wednesday said that it is double-standards of the West, coupled with a callous policy that is bleeding a dispossessed nation in search of a homeland for the last many decades.\nAddressing a Distinguished Lecture Series at Islamabad Policy Research Institute (IPRI) titled “Situation in Palestine amidst the recent upheavals in the Middle East”, the Palestinian envoy thanked for the overwhelming support from Pakistan, and hoped that social media and countries across the world should rally for a nation at the verge of obliteration.\n“We are looking for peace, justice and a solution to our territorial dispute with Israel which it has occupied forcefully,” Alturk said and added that the apartheid at work is pushing Palestinians in a death trap.\nHe lamented the British colonial power for handing over 58 percent of the Palestinian lands to the Jews, and regretted that even the remaining 43 percent too has been encroached upon.\nHe displayed the map of Palestine that showed stages of occupation in four stages since 1948.\nHe criticised former US President Donald Trump for initiating a biased diplomacy wherein Israel is being given legitimacy by the Arab states under the Abraham Accord, and no solution is being found for the pestering dispute of Palestinian state.\nHe went on question the right of self defence by the Palestinians, if any? He also asked whether Palestinians were born only to be killed, as the world maintains a criminal silence.\nHe condemned the position taken by the US at UN Security Council, and said that like Ukraine Palestine too has the right to sovereignty and self-defence.\n“We too have rights. Half of Gaza has been bombed and people are being pushed out of the strip into Egypt. Why is the world silent?,”\nNader reminded me that when Russia attacked a hotel in Kyiv, the Western states and the US were up in a storm, but when a hospital in Gaza was bombed killing hundreds, no one is bothered.\nHe said more than 3500 Palestinians have died since the conflict began on Oct 7, and feared that Gazans are at the verge of a second migration.\nThe Palestinian envoy called for an end to occupation, a two-state solution, end to illegal settlements, and respect for international law and human rights. He said this is how the existential crisis in Palestine can be addressed in an amicable and peaceful manner.\nHe feared that the conflict can escalate as forces of inertia are at work, and armed resistance from other countries too is in favour of Palestine.\nPresident IPRI Ambassador (R) Dr Raza Muhammad also spoke on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:08:01.451Z"
}
