{
  "title": "Maulana Azad urges int’l community to unite for Palestinian freedom, peace",
  "link": "https://www.app.com.pk/national/maulana-azad-urges-intl-community-to-unite-for-palestinian-freedom-peace/",
  "date_published": "2023-10-18T16:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): A delegation of esteemed religious scholars and leaders, led by Central Ruet-e-Hilal Committee Chairman Maulana Syed Abdul Kabir Azad on Wednesday met Palestinian Ambassador Ahmed Jawad Rabei to express its unwavering solidarity with the Palestinian people.\nThe delegation included eminent scholars and religious figures representing various schools of thought, Allama Shabir Ahmad Mesmi, Malik Tariq Awan, Allama Zubair Ahmad Zahir, Mufti Zamir Ahmed Sajid, Maulana Abdul Aziz, Maulana Tanvir Ahmed Alvi, Maulana Aamir Shahzad, Maulana Shams ul Haq, Maulana Haroon ur Rashid Balakoti, Maulana Abdul Zahir Farooqi, Maulana Saeed Awan, Peer Umar Farooq Shah, Maulana Abid Israr, Maulana Umar, Maulana Hussain Ahmed, Sheikh Abdul Wahab, Qari Bilal, Mufti Gulzar Ahmed Naemi, Hassan Shoaib, Dr. Allama Sajjad Hussain Naqvi, Allama Mustafa Haider Naqvi, Syed Nasir Abbas Sherazi, Akhunzada Zahid Ali Askar and Maulana Mamooon ur Rashid among others.\nDuring the meeting, Maulana Azad passionately condemned the Israeli aggression and violence against Palestine and Gaza, referring to these actions as reprehensible acts of terrorism and brutality. He urged the international community to take immediate notice of Israel’s atrocities and called upon the global community to unite against Israel’s military actions.\nHe further urged the United Nations, OIC (Organization of Islamic Cooperation), and other influential organizations to establish effective mechanisms to prevent the continuing oppression and brutality faced by the Palestinian people.\nHighlighting the importance of international treaties and legislation, Maulana Azad emphasized the necessity of halting the savage and unjust treatment inflicted on Palestinians. He stated that it was time for the entire world to join forces to confront the Israeli military’s oppressive actions, stressing the OIC, UN, and other relevant bodies must decide in favor of Palestinian freedom to ensure peace in the region.\nHe emphasized Pakistan and its nation’s unwavering support for the oppressed Muslim communities in Palestine and Gaza. He cited the stance of the Pakistan government and Chief of Army Staff General Asim Munir, reaffirming their solidarity against Israeli aggression.\nMaulana Azad underscored that Israel’s recent assault presented a global challenge, as the country continued to violate international laws and conventions. He encouraged worldwide protests against Israel’s unjust practices, asserting that the global community could not remain silent in the face of Israel’s actions. He called for the Pakistani people to extend their complete diplomatic and moral support to the Palestinian people.\nIn his closing remarks, he offered prayers for the freedom of Palestine, unity within the Islamic world, the preservation of the Haramain Sharifain, Pakistan’s development and prosperity, and the liberation of Indian Illegally Occupied Jammu and Kashmir.",
  "retrievedAt": "2025-08-11T10:07:35.487Z"
}
