{
  "title": "SC adjourns Bahria Town Karachi case till Nov 8",
  "link": "https://www.app.com.pk/national/sc-adjourns-bahria-town-karachi-case-till-nov-8/",
  "date_published": "2023-10-18T16:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): The Supreme Court (SC) on Wednesday adjourned the hearing of a case pertaining to the implementation of judgment about Bahria Town Karachi, till November 8.\nThe three-member SC bench headed by Chief Justice of Pakistan Qazi Faez Isa sought details from the Malir Development Authority (MDA) and the Sindh Building Control Authority (SBCA) regarding all approvals granted to the said town.\nDuring the course of proceedings, it was observed that the court’s decision regarding the estimation of land price was final, and the Bahria Town had no option other than its implementation.\nThe chief justice inquired that whether a bench could be constituted for the execution of the judgment, and why not the same bench could ensure its implementation.\nAdditional Attorney General Aamer Rehman replied that benches had been formed in the past for implementation of the decisions.\nThe chief justice questioned that why the case was not fixed for hearing for two and a half years. Whether the Bahria Town had lost interest in the case and whether it had filed any application for early hearing.\nHe observed that it was a very serious matter and the court would look into it.\nBahria Town’s lawyer Salman Butt adopted the stance that his client should have been allotted 16,896 acres of land but it was given only 11,000 acres as the MDA had refused to give 5,000 acres.\nHe said that the court’s decision regarding fixing of the land price was not legal.\nThe chief justice said that the bench was not hearing the review petition. The Bahria Town administration was not obeying its orders.\nJustice Athar Minallah remarked that the judgment had stated the Bahria Town would be considered a defaulter at the time of third installment if it did not pay first two.\nLater, the court adjourned the case.\nThe Supreme Court in 2019 had accepted the Bahria Town’s offer of payment of Rs 460 billion as fine to settle a case pertaining to its Malir or Karachi Super Highway project. It was bound to pay the amount in monthly installments of Rs 2.25 billion for the next three years, and supposed to pay the entire amount over seven years.",
  "retrievedAt": "2025-08-11T10:07:35.483Z"
}
