{
  "title": "WB recognizes Ehsaas Emergency Cash among top 4 social protection interventions globally",
  "link": "https://www.app.com.pk/national/wb-recognizes-ehsaas-emergency-cash-among-top-4-social-protection-interventions-globally/",
  "date_published": "2021-05-15T10:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP):The World Bank in a report released on Saturday recognized Ehsaas Emergency Cash among top four social protection interventions globally in terms of number of people covered.\nThe World Bank has just released a report on “global social protection responses to Covid-19”.\nThis report is called the “living paper” and it is a partnership effort involving 18 coauthors and a large number of contributors; the paper presents a 650-page volume and accompanying database documenting how countries and territories are planning, implementing or completing social protection measures in the context of the pandemic.\nThe report states that there has been “an exponential growth in social protection measures between March 20, 2020 and May 14, 2021 and that a total of 3,333 social protection measures have been planned or implemented in 222 countries or territories”.\nPakistan ranks 4th globally in terms of the number of people covered and 3rd globally in terms of percentage of population covered amongst those that covered over 100 million people; the World Bank has stated that only “select countries have attained impressive six-digit levels” in this regard. Pakistan’s Ehsaas Emergency Cash is one of them.\nThe lead author of the paper is Ugo Gentilini, lead of Social Protection at the World Bank. The report is accompanied by an excel sheet as well to make available the larger volume of data.\nAccording to the report, Pakistan’s Ehsaas also ranked high amongst the programs that did well in terms of Planned versus actual coverage rates.\nAccording to the report, most of social protection measures are provided as social assistance.\nThese represent 55% of global programs and are the predominant form of support in most regions.\nAmong social assistance measures, cash transfers remain the premier instrument. A total of 734 cash-based measures have been planned or implemented in 186 countries. Highest level of spending in lower middle-income countries category is observed in Mongolia Zimbabwe, Bolivia, and Pakistan.\nOne of the special features of the report is on delivery matters.\nAccording to the report, globally, there were essentially four ways to find and enroll new beneficiaries, the first of which was to simply add households to the list from an existing social registry.\nPakistan adopted an innovative hybrid targeting approach to enroll new beneficiaries combining emergency assistance for the known vulnerable with demand-based support for the “new poor”.\nRequests were sought through an 8171 SMS short code service and web-portal. Data analytics enabled eligibility ascertainment, using unique national identification numbers, and drawing on the National Socio-economic Registry and wealth proxies (travel, taxes, billing, assets ownership data and government employment status).\nThe system was end-to-end data-driven, fully automated, rule-based, transparent, and politically neutral. Payments were biometrically verified.\nEhsaas Emergency Cash delivered cash stipends of Rs. 12,000 to 15 million households last year, which meant helping over 100 million people or half the country’s population, representing the largest and most extensive social protection intervention ever in the history of the country.\nDigital capabilities established over the past year as part of Ehsaas, Pakistan’s new poverty alleviation framework, were adapted to deliver Ehsaas Emergency Cash, in particular, a new biometric payment system, a demand side SMS based request seeking platform and a new wealth-profiling big data analytics mechanism.\nThe legacy of this programme is not just short-term relief. Ehsaas Emergency Cash will be an important component of the redesign of social protection, post COVID-19 and will help in the great global reimagination of social welfare envisaged in Ehsaas.\nIn terms of global experience sharing, the case of Pakistan provides useful lessons for other countries that utilize unique personal identification systems.\nIt shows that by combining phones, internet connectivity, national IDs and commercial payment systems, a digital and innovative demand-based social protection system can be created to enable those in distress to seek social support during crises.\nEhsaas Emergency Cash also demonstrated how cash transfer programmes can be deployed to counter socio-economic fallouts due to external shocks such as COVID-19 which present a long-term predicament.\nThe approach can also address rising inequality and advance attainment of SDGs in a post COVID-19 world.",
  "retrievedAt": "2025-08-11T20:43:50.313Z"
}
