{
  "title": "Ethiopia Envoy hosts reception to mark country’s  National Unity Day",
  "link": "https://www.app.com.pk/national/ethiopia-energy-hosts-reception-to-mark-countrys-national-unity-day/",
  "date_published": "2022-09-10T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): High Commissioner of the Federal Democratic Republic of Ethiopia\nto Pakistan Jemal Beker Abdula on Saturday hosted a reception on the eve of the Ethiopian New Year and National Unity Day at the newly opened high commission of his country in Islamabad.\nOn September 10, every year Ethiopians gather to celebrate the New Year as well as the National Unity Day said Jemal Beker Abdula\nThis day, he said his countrymen reaffirm their faith in love forgiveness, unity and harmony which they consider as defining values of their nation.\nThis is also a sign of the country’s diversity which he called the Ehiopian’s wealth and strength.\nThe ambassador said “For his people National Unity Day was not only a beautiful metaphor but also the basis for the existence of our multi-ethnic, religions, idea, gender, peace, cohesion, and harmony among the citizens of Ethiopia and of all nations, nationalities, political and religious views.”\nDue to this unity, he said his country able to perform a miracle and lead Ethiopia to anchor of peace and prosperity,.\nNational Unity Day is celebrated in Ethiopia in honor of the National Defence Forces, which are the epitome of unity, and the preservation of Ethiopia sovereignty and territorial integrity as a unified state.\nHe hoped the bilateral relations between Ethiopia and Pakistan would grow steadily as both the countries shared similar culture, sights and many other things.\nHalf of the mountains in entire Africa are located in Ethiopia he said and invited the Pakistani tourists, traders and people to visit this beautiful country and experience their hospitality.\nEthiopia, he said, was the land of Origin, the Lucy the human fossil that is believed to be the first human, the Land of Coffee where coffee get its name from the place called Keffa, and the source of Nile, the longest river in the world.\nHis country has produced some of the best athletes in the world, the ambassador said.\nMoreover, he said Ethiopia is a land of wonder, archeological, nature and contrast of nature.\nThe ambassador said since he arrived in Pakistan he was highly moved by the hospitality, generosity and sincerity of the people of Pakistan. This is something that gives us a feeling that we are living in our second home. The people of Ethiopia too are equally warm, welcoming and friendly, he said.\nOn behalf of his government and the people, the Ethiopian ambassador conveyed his heart-felt condolences to the people and the government of Pakistan on the catastrophic floods that played havoc with lives and properties, roads and infrastructure. Pakistan though contributed little to the climate crisis but is suffering much, he said and added the people of Ethiopia as well as the government always stood by their brotherly country.",
  "retrievedAt": "2025-08-11T15:33:10.437Z"
}
