{
  "title": "PM, UN sec. general arrive Usta Muhammad to review flood damages",
  "link": "https://www.app.com.pk/national/pm-un-sec-general-arrive-osta-muhammad-to-review-flood-damages/",
  "date_published": "2022-09-10T08:06:00.000Z",
  "source": "APP",
  "content": "JAFFARABAD, Sep 10 (APP): Prime Minister Muhammad Shehbaz Sharif along with United Nations Secretary-General Antonio Guterres on Saturday arrived here to visit the flood-affected Usta Muhammad Tehsil.\nThe chief secretary of Balochistan briefed the dignitaries about the devastation caused by the monsoon floods, and rescue, relief and rehabilitation efforts in the province.\nOn the occasion, the prime minister while speaking to the UN secretary-general said that the relevant authorities faced huge difficulties to reach to the affected people in the remote areas of the province.\nHe informed that floods had badly affected the road and rail infrastructure besides, damaging bridges.\nThe prime minister said that the rehabilitation of the flood affectees was a major challenge, the federal government was assisting the provinces and urged the international community’s support to overcome these challenges.\nHe said that the province had its natural resources, and his government was focusing on the development of the province.\nBalochistan Chief Minister Abdul Quddus Bizenjo informed the UN secretary-general that they had utilized all the limited resources in the rescue, relief and rehabilitation efforts. He appealed to the global community to extend financial help to support the flood affectees of the country.\nEarlier, upon arrival, Acting Governor Balochistan and Chief Minister Abdul Quddus Bizenjo received the prime minister and the UN secretary-general.\nPrime Minister Muhammad Shehbaz Sharif and UN Secretary-General Antonio Guterres also interacted with flood affectees during their visit to the tent city Usta Muhammad. The federal ministers also accompanied them.",
  "retrievedAt": "2025-08-11T15:33:16.080Z"
}
