{
  "title": "“It’s time to serve flood-affected people, not doing politics:” Atta",
  "link": "https://www.app.com.pk/national/its-time-to-serve-flood-affected-people-not-doing-politics-atta/",
  "date_published": "2022-09-10T11:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 10 (APP): Special Assistant to the Prime Minister (SAPM) Attaullah Tarar on Saturday said the incumbent coalition government believed in serving the flood-affected people on priority, not doing politics of personal gains.\n“It is unfortunate that a party [PTI) is busy doing politics in these testing times instead of making concerted efforts to reduce sufferings of the flood-affected people in the country,” he said while addressing a news conference.\nHe was of the view that the Pakistan Tehreek-e-Insaf (PTI) was holding public meetings in Punjab and Khyber Pakhtunkhwa, spending around Rs 250-300 million on each gathering that should have been utilized to help the flood-affected people.\nAttaullah Tarar said in the testing times when the people of Punjab were badly hit by the flood, the provincial government moved a summary of Rs 400 million to purchase new vehicles for ministers and advisors.\nHe said it was unfortunate that the PTI leadership in Punjab, Khyber Pakhtunkhwa, Gilgit Baltistan and Azad Jammu Kashmir miserably failed to heal the wounds of the people hit by the flood.\nHe said Prime Minister Shehbaz Sharif had visited the flood-hit areas of the country and met with the affected families in KPK, Punjab Balochistan and Sindh provinces.\nThe SAPM said Punjab Chief Minister Chaudhry Pervaiz Elahi and his son were acting as a facilitator for Imran Khan to arrange political gatherings in the province. “Pervaiz Elahi has not visited the flood-hit areas,” he alleged.\nHe viewed that Punjab flood-hit areas were facing a shortage of medicines, food and other necessary items.\nAttaullah Tarar said the PTI leaders were using Punjab province as a platform to promote their anti-state narrative.\nHe alleged that Farah Gogi had been given an ‘NRO’ by the Punjab government in all the corruption cases.\nHe questioned why two Director Generals of Anti-corruption had been changed in a short time. “ The two DGs of Anti-Corruption had been changed just to give NRO to Farah Gogi,” he said.\nHe said that Farah Gogi did all the corruption in line with the direction of Imran Khan’s family.\nHe alleged that Farah Gogi was facilitated by the PTI leadership to fly outside the country.\nHe said that Pervaiz Elahi has distributed about 832 jobs among his favourite.\nTo a question, he said there is no plan to impose governor rule in the Province.\nHowever, the SAPM said that other constitutional options were under consideration for an in-house change in the Punjab province.",
  "retrievedAt": "2025-08-11T15:33:11.938Z"
}
