{
  "article_id": "2025-05-30_89345a39024742407063c83fe2b1e2c3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/iomed-creation-significant-step-in-reinforcing-multilateralism-promoting-diplomacy-over-confrontation-dar/",
    "retrieved_at": "2025-08-27T16:04:43.285Z"
  },
  "metadata": {
    "title": "IOMed creation significant step in reinforcing multilateralism, promoting diplomacy over confrontation: Dar",
    "author": null,
    "date_published": "2025-05-30T08:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 361,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "HONG KONG, May 30 (APP):Deputy Prime Minister and Foreign Minister (DPM/FM), Senator Mohammad Ishaq Dar on Friday termed the creation of International Organization for Mediation (IOMed) a significant step in reinforcing multilateralism and promoting diplomacy over confrontation in the new era of mediation. The signing ceremony of the Convention establishing IOMed took place in Hong Kong, with Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar representing Pakistan at the historic event. Speaking at the high-profile gathering, Senator Dar lauded the visionary leadership of the People's Republic of China for spearheading the creation of IOMed. He hailed China for once again leading a transformative initiative-comparable in impact to the Asian Infrastructure Investment Bank (AIIB). The DPM underlined that Pakistan reaffirmed its commitment to peaceful conflict resolution by becoming a founding member of the newly established International Organization for Mediation (IOMed). Senator Dar described the establishment of IOMed as \"the birth of an important global institution dedicated to mediation and peaceful dispute resolution,\" and commended the selection of Hong Kong as the organization's headquarters. Calling the city a \"super connector,\" he noted its symbolic value in bridging East and West. Reiterating Pakistan's dedication to the principles of the UN Charter and international law, Dar highlighted the country's recent efforts, including the establishment of the International Mediation and Arbitration Center (IMAC) in Pakistan, aimed at advancing commercial dispute resolution. The Foreign Minister also used the platform to draw attention to pressing global conflicts, citing unresolved issues such as Jammu and Kashmir and the occupied Palestinian territories, and warned against the rise of unilateralism and populism. He condemned India's recent military aggression and disregard for international treaties like the Indus Waters Treaty, describing such actions as a threat to regional and global peace. Emphasizing the significance of President Xi Jinping's Global Security Initiative (GSI), Senator Dar said the vision aligns with Pakistan's commitment to a UN-centric global peace architecture based on dialogue, justice, and win-win cooperation. \"Through our presence in IOMed, Pakistan brings not only its rich diplomatic experience but also an unwavering commitment to peace, equity, and justice,\" Dar concluded, urging member states to empower the organization to reach its full potential.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}