{
  "article_id": "2025-05-30_5a144918a0c4c2c5760041185f0da04f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/31-students-present-research-proposals-at-aious-academic-board-meeting/",
    "retrieved_at": "2025-08-27T16:03:53.101Z"
  },
  "metadata": {
    "title": "31 students present research proposals at AIOU’s academic board meeting",
    "author": null,
    "date_published": "2025-05-30T12:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 245,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 30 (APP):A total of 31 PhD scholars showcased their research proposals at the 73rd meeting of the Board of Advanced Studies and Research (BASR) at Allama Iqbal Open University (AIOU), underscoring the university's steadfast commitment to academic excellence and cutting-edge research. The meeting concluded on a successful note, marking a significant step forward in fostering a vibrant research culture. The event was held in two sessions. The first session featured 15 PhD candidates from the Faculty of Sciences, who presented their innovative research synopses. Their presentations were met with high praise for demonstrating scholarly depth, originality, and scientific rigor. The second session included 16 scholars from the Faculty of Social Sciences and Humanities, the Faculty of Arabic and Islamic Studies, and the Faculty of Education. This session was chaired by Professor Dr. Irshad Ahmed Arshad, Director of BASR, who commended the students' dedication and academic insight. The meeting was attended by the university's deans, senior faculty members, and subject experts, all of whom appreciated the students' research enthusiasm and intellectual competence. While the majority of proposals received approval, some were returned with constructive recommendations for refinement and enhancement. Speaking on the occasion, Vice Chancellor Professor Dr. Nasir Mahmood emphasized AIOU's role as a leading institution in promoting research and quality education. He stated, \"Our researchers and graduates continue to contribute meaningfully to the intellectual and developmental progress of the nation. AIOU remains committed to nurturing future scholars who will shape tomorrow's knowledge economy.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}