{
  "article_id": "2025-05-30_cf986fcdf75126827dbafd3822c23a4e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pmyp-chinese-institutions-sign-loi-to-empower-youth-skills-training/",
    "retrieved_at": "2025-08-27T16:05:15.158Z"
  },
  "metadata": {
    "title": "PMYP, Chinese Institutions sign LoI to empower youth skills training",
    "author": null,
    "date_published": "2025-05-30T16:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 376,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 30 (APP): In a landmark move to empower Pakistan's youth and enhance digital economy readiness, the Prime Minister's Youth Programme (PMYP) signed a Letter of Intent (LoI) with ITMC China, UNI International, and leading Chinese vocational colleges. A meeting was held on Friday at the Prime Minister's Office, chaired by Chairman of the PMYP, Rana Mashhood Ahmad Khan. The strategic partnership aims to build a digitally skilled workforce through short-term, employment-oriented training courses in collaboration with NAVTTC, TEVTAs, and Chinese TVET institutions. Under the initiative, 40 to 50 specialized digital trades have been identified, covering high-demand sectors including, E-Commerce & Cross-border E-Commerce, Digital Marketing & Media Technology, Artificial Intelligence & AIGC, Fintech & Financial Accounting,Tourism & Hospitality and Creative Entrepreneurship, Animation. Over the next two years, 1,000 local master trainers will be trained using Chinese occupational and curriculum standards. Further more PMYP will select top 100 education institutions (including universities and vocational training centers), from which 10 master trainers per institute will be nominated including,2025 Goal: 200 master trainer,2026 Goal: 800 master trainers. Notably,training will be conducted using a hybrid model (online & offline), supported by high-quality hands-on software, training platforms, and certification by ITMC and Chinese TVET Colleges. Over the next five years, the initiative will train up to 100,000 youth, with each participating institute training 100 trainees annually. In line with China's international cooperation policy, 30 to 50 Centers of Excellence (CoEs) will be established across Pakistan, providing physical training infrastructure in collaboration with NAVTTC, TEVTAs, and Chinese TVET institutions. Additionally, 100,000 free freelancer accounts will be provided to support Pakistan's growing freelance economy. Trainees will receive internationally recognized e-certificates upon course and software completion. Specialized Training Programs will include,Amazon Store Operations,Cross-border E-commerce Live Streaming,Short Video Production,Business Data Analysis,AI Intelligent Agent Development,Digital Marketing Applications,Online Store Operations,Data-driven Product Selection and AIGC Technology Applications. A Joint Working Group will be formed between PMYP, ITMC, and UNI International. The first batch of 200 master trainers will be selected and onboarded. A ToT (Training of Trainers) Opening Ceremony will mark the formal start of the initiative. This collaboration is a significant step toward bridging the digital skills gap and enhancing youth employability across Pakistan, aligning with the government's vision of economic empowerment through technology and innovation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}