{
  "article_id": "2025-05-30_fce7bd480fcdddfb93630a16f87e74af",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/experts-call-out-tobacco-industrys-tax-evasion-tactics-on-world-no-tobacco-day/",
    "retrieved_at": "2025-08-27T16:05:35.226Z"
  },
  "metadata": {
    "title": "Experts call out tobacco industry’s tax evasion tactics on World No Tobacco Day",
    "author": null,
    "date_published": "2025-05-30T15:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 996,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, May 30 (APP):Experts from leading policy think tanks and health advocates joined forces on Friday to spotlight the manipulation and interference of the tobacco industry in Pakistan's tax policy-just ahead of the federal and provincial budget announcements. The seminar titled \"Unmasking the Appeal: Exposing Tobacco Industry Interference in Tobacco Taxation,\" organized by the Sustainable Development Policy Institute (SDPI) in collaboration with the Social Policy and Development Centre (SPDC), Karachi was held in connection with the World No Tobacco Day 2025,said a press release. The seminar served as a crucial pre-budget discussion on the dire need for effective and progressive tobacco taxation reforms, amid concerns over rising illicit trade, under-regulated nicotine products, and health policy sabotage by the tobacco lobby. In his opening remarks, Syed Ali Wasif Naqvi, Senior Research Fellow at SDPI, stressed the urgency of tackling tobacco as a holistic public health threat. Dr Abid Qaiyum Suleri, Executive Director of SDPI, in his welcome note, emphasized the importance of revisiting tobacco taxation as a vital revenue and public health issue. He called for aligning tax mechanisms with income levels and health vulnerabilities, urging the Federal Board of Revenue (FBR) to reprioritize tax targets. \"We're seeing tax evasion through illegal cigarette trade and unchecked nicotine vape sales, particularly in the capital,\" he said. Muhammad Asif Iqbal, Managing Director of SPDC, delivered a technical presentation that dismantled industry narratives. According to SPDC's nationwide survey of over 9,000 households and 6,600 smokers whereas 35% of the cigarette market is illicit, contradicting industry claims of 54%. Despite inflation (CPI rising by 9.5%), cigarette prices rose by only 2.7% since 2023, he said. The track and trace system has improved, he said 57% of cigarette packs now have tax stamps, up from 48% in 2023. Illicit cigarette sales remain stagnant, debunking fears that higher taxes lead to black market growth, he added. Iqbal recommended an increase of at least Rs 40 per pack in the Federal Excise Duty (FED) and full implementation of the Finance Act 2024, including sealing retailers selling untaxed or counterfeit products. Waseem Iftikhar Janjua, Advisor at SDPI, highlighted that Pakistan has one of the lowest tobacco tax rates in South Asia, trailing even conflict-ridden regions like Palestine and Sudan. He advocated for a single-tier excise tax system, introduction of a health levy on all tobacco products and stronger enforcement through the Track and Trace System. He also called out the policy ambiguity around e-cigarettes and nicotine pouches, urging a clear stance. Dr Waseem Saleem, technical advisor on tobacco taxation at WHO, stated that Federal Excise Duty (FED) on cigarettes has remained unchanged since February 2023, even as inflation surged by 26%. \"This failure to adjust FED rates in line with inflation has significantly eroded the real value of tobacco taxes,\" Dr Saleem said. He added that the tobacco industry has exploited this stagnation by shifting production toward lower-taxed economy brands. Official data shows that while overall cigarette production rose by 22% in the first nine months of FY 2024-25, production of premium brands - which are taxed at PKR 330 per pack - fell by over 53%. Meanwhile, production of economy brands, taxed at just PKR 101 per pack, jumped by 30%. Despite the rise in cigarette production, FED revenues from the sector increased by just 7.4% - well below the rate of inflation. The average effective tax per stick dropped from PKR 6.50 to PKR 5.64 over the same period. Dr Saleem estimates that this tax erosion has resulted in a potential revenue loss of PKR 82 billion over the past two fiscal years. Dr Saleem urged the government to reassess its tobacco tax policy, emphasizing the need for regular FED rate increases and stronger controls on production practices. \"To protect both public health and national revenue, Pakistan must close these loopholes and prevent the industry from gaming the system,\" he concluded. Sania Ali Khan, a tobacco control advocate, exposed the industry's backdoor tactics: from media manipulation and CSR stunts to interference in policy-making through front groups. She drew attention to the environmental cost-3.7 liters of water per cigarette, along with contributions to deforestation and pollution. Dr Minhaj us Siraj, Executive Director of Syndicate Health, noted that while tobacco control efforts are already in motion, this year's theme-focusing on taxation-presents both an opportunity and a challenge. \"Taxation remains a complex but vital tool in tobacco control,\" he said. Recalling past attempts by the government to seek funding for public awareness campaigns against illegal cigarette sales, Dr Siraj credited sustained advocacy and stakeholder engagement for recent improvements. He proposed a unified front: \"Federal and provincial revenue departments, along with all relevant stakeholders, must come together to establish a dedicated Tobacco Control Authority to streamline efforts and ensure effective policy implementation.\" Dr Shabana Saleem, Director General at the Ministry of National Health Services, Regulations and Coordination (MoNHSR&C), echoed the need for a consolidated and holistic approach. Speaking as Guest of Honour, she emphasized the value of technical collaboration with think tanks such as SDPI and SPDC, who are part of the Ministry's technical working group on tobacco taxation. \"The Ministry has conveyed strong recommendations to the FBR and Ministry of Finance for significant hikes in tobacco taxes,\" she stated. \"We are pursuing the matter relentlessly with the relevant institutions to secure the outcomes needed for public health.\" Dr Shabana Saleem further revealed that the Ministry's top authorities are convinced of the need to revive the Tobacco Control Cell, which had been inactive in recent years. She confirmed that a comprehensive proposal has already been submitted to the Ministry of Finance and FBR, urging immediate action. \"The Ministry is working closely with development partners and NGOs to deliver on its mandate,\" she added. \"Tobacco control demands a holistic, multi-sectoral effort-and we are ready to lead it.\" In his closing remarks, Dr Sajid Amin Javed, Deputy Executive Director of SDPI, emphasized that effective tobacco taxation boosts revenue without economic trade-offs, but political will and inter-ministerial cooperation are vital.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}