{
  "article_id": "2025-05-30_1d5786f642b2879344e6c9374c4dd9ce",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/teachers-applaud-senate-move-to-reinstate-tax-rebate/",
    "retrieved_at": "2025-08-27T16:03:53.100Z"
  },
  "metadata": {
    "title": "Teachers applaud Senate move to reinstate tax rebate",
    "author": null,
    "date_published": "2025-05-30T12:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 302,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 30 (APP):The teaching community of Islamabad welcomed the Senate Standing Committee on Finance and Revenue's approval of the Income Tax (Second Amendment) Bill 2025, which aims to reinstate critical tax relief for salaried individuals, especially teachers and researchers. The Senate panel, chaired by Senator Saleem Mandviwalla, endorsed the bill, focusing particularly on reversing recent tax burdens that had led to significant salary deductions for teachers. This development follows the Federal Cabinet's earlier decision, dated March 26, 2025, to reinstate the 25% tax rebate for full-time teachers and researchers. The rebate had been abruptly discontinued four months prior, drawing widespread criticism from the education sector. Reacting to the committee's approval, Mr. Fazal-e-Maula, Chairman of the Joint Education Action Committee Teachers, praised the move as a \"positive step,\" but noted that more comprehensive measures were needed. \"While the restoration of the 25% tax rebate is appreciated, it is only a small relief. The government must go a step further and introduce an education allowance,\" he said. He also advocated for aligning teachers' salaries with those of other government employees in equivalent grades. Prof Danish Yaseen, Joint Secretary of the Federal Government College Teachers Association (FGCTA), echoed similar sentiments. \"After restoration of the 25% rebate, teachers now stand where they previously were. But the government should consider further incentives, as is done in other countries. Teachers should not be burdened with financial worries, only then they can foster a peaceful and focused classroom environment.\" Prof Akram Khan Khosa, President of the FGCTA said, \"Despite playing a pivotal role in shaping the nation's future, teachers continue to suffer due to low salaries, an outdated service structure, and lack of incentives,\" he said. Khosa urged the government to go beyond tax relief and introduce an Education Allowance to alleviate the financial struggles faced by teachers.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}