{
  "article_id": "2025-05-30_a82e929dd9484323a72371a8322af20c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-wfp-partner-to-combat-climate-linked-malnutrition/",
    "retrieved_at": "2025-08-27T16:04:47.183Z"
  },
  "metadata": {
    "title": "Pakistan, WFP partner to combat climate-linked malnutrition",
    "author": null,
    "date_published": "2025-05-30T06:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 197,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 30 (APP):Federal government and the United Nations World Food Programme (WFP) have agreed to strengthen collaboration on climate-resilient initiatives to tackle malnutrition and food insecurity in vulnerable regions. The decision came during a meeting between Federal Minister for Climate Change and Environmental Coordination, Dr. Musadik Malik, and WFP Country Director Coco Ushiyama on Friday. The discussions centered on Pakistan's five-year cooperation framework with WFP, with a focus on addressing stunting-a critical health issue exacerbated by climate change, conflict, economic downturns from COVID-19, and governance challenges (collectively termed the \"4Cs\"). Dr. Malik stressed the importance of proactive, results-oriented programs that integrate climate adaptation and resilience-building into nutrition strategies. \"Our partnership must translate climate policies into tangible benefits for communities, especially in food-insecure areas,\" he said. Both sides reaffirmed their commitment to embedding climate resilience into Pakistan's national development agenda, ensuring long-term food security and improved health outcomes. The collaboration aims to leverage WFP's expertise in humanitarian aid and Pakistan's climate action plans to mitigate the impacts of environmental crises on vulnerable populations. The meeting marks a step forward in aligning Pakistan's climate and nutrition policies, with further details on joint initiatives expected in the coming months.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}