{
  "article_id": "2025-05-30_573efd77d8c9d1fc5d58a02e0fc1c302",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/intellectual-literary-session-held-on-renowned-poet-kishwar-naheed/",
    "retrieved_at": "2025-08-27T16:05:38.438Z"
  },
  "metadata": {
    "title": "Intellectual & literary session held on renowned poet Kishwar Naheed",
    "author": null,
    "date_published": "2025-05-30T14:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 241,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 30 (APP): A one-day intellectual and literary session was held here yesterday under the auspices of the Ahmad Saleem Study Circle, featuring renowned poet, writer, and progressive intellectual Kishwar Naheed as the guest of honor. The event was moderated by Dr. Muhammad Amjad Kallu. The session centered on a thought-provoking dialogue exploring Kishwar Naheed's personal and literary journey, feminist thought, and contemporary social consciousness. With remarkable candor and intellectual depth, Naheed spoke on critical issues such as women's rights, freedom of expression, and female representation in Urdu literature. A notable highlight of the event was the enthusiastic and active participation of university students. The young audience engaged deeply with Naheed's creative and intellectual legacy, raising a diverse range of questions and contributing to a vibrant discussion on the thematic and emotional layers of her poetry. Several students recited selected poems by the poet, which were met with appreciation and encouragement from Naheed herself. Addressing the students, especially young women, Kishwar Naheed emphasized the importance of inquiry, research, and independent thinking, stating:\"To question, to think, and to seek new paths - that is the essence of true knowledge.\" The session concluded with a moving recital of selected poems in Naheed's own voice, leaving a lasting emotional and intellectual impression on the audience. Participants described the gathering as insightful, inspiring, and memorable. Events of this nature play a vital role in nurturing intellectual development, literary awareness, and social consciousness among students.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}