{
  "title": "Ehsaas Emergency Cash Programme to benefit 10 m corona affectees: Dr Sania",
  "link": "https://www.app.com.pk/national/ehsaas-emergency-cash-programme-to-benefit-10-m-corona-affectees-dr-sania/",
  "date_published": "2020-03-24T03:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):Special Assistant to Prime Minister on Social Protection and Poverty Alleviation Dr Sania Nishtar Tuesday said the “Ehsaas Emergency Cash Programme” had been approved for giving cash assistance to 10 million people affected due to the spread of novel coronavirus.\nDr Sania, in a series of tweets, said the programme would benefit 67 million people (given household size) as Rs 12,000 would be given to each family as per decision.\nShe said the daily wage earners were their top priority whose livelihood had been badly affected by the corona-induced economic downturn.\nThe Ehsaas Emergency Cash Programme, she said, would benefit 10 million affectees in three categories.\nListing the first category, she said 4.5 million existing Ehsaas Kafaalat beneficiaries (all women) already getting Rs 2,000, would get extra Rs 1,000 emergency relief (total Rs 3,000) for the next four months.\nIn the second category, she said, three million affectees would be identified through the national socioeconomic database. The eligibility threshold would be relaxed upwards. Those with previous income of upto 20,000, who had now suffered economic shock and were without livelihood, would be helped through Ehsaas.\nDr Sania said in the third category, an SMS campaign, to be launched in two weeks would allow others, not currently enrolled in the database to seek assistance. The district administrations would conduct assessments speedily after SMS was received. Around 2.5 million would be identified through the Ehsaas SMS route, she added.\nShe said data analytics would be used to ensure that the system was not abused. CNICs of those declared eligible would be passed to Ehsaas partner banks, including Habib Bank Limited and Alfalah Bank, and simultaneously an SMS message would be sent to them directing them to collect money through nearest bank.\n“We will ensure coronavirus protection measures during Ehsaas payments through use of hand-washing / disinfectants at cash disbursement sites, increase in number of Point of Sales to reduce crowding, special sites, distancing in queues and use of new currency notes”, she said.\nDr Sania said she would do a press conference during the current week to explain how the “Ehsaas Emergency Cash and SMS Programme” would be implemented.",
  "retrievedAt": "2025-08-11T18:59:30.288Z"
}
