{
  "title": "Qureshi, French FM for enhanced cooperation to control COVID 19",
  "link": "https://www.app.com.pk/national/qureshi-french-fm-for-enhanced-cooperation-to-control-covid-19/",
  "date_published": "2020-03-24T03:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi during a telephone conversation with French Foreign Minister Jean-Yves Le Drian discussed in details the COVID-19 (Coronavirus) pandemic as well as ways to enhance cooperation to combat the spread of the disease.\nExpressing deep concern over the loss of precious lives, Foreign Minister Qureshi lauded the steps being taken by the French authorities to contain the virus, and thanked the his counterpart for looking after 13 Pakistanis affected in France.\nHe also briefed foreign minister Le Drian about the measures underway in Pakistan to contain the outbreak, the foreign office spokesperson in a press release on Tuesday said.\nForeign Minister Qureshi informed that the number of affected people in Pakistan due to COVID-19 was increasing.\nThe COVID-19 had spread to almost all countries of the world, and the situation demanded a coordinated approach by the international community to combat its spread, he added.\nIn view of the situation in Iran, Foreign Minister Qureshi underscored the need for immediate lifting of sanctions and extending humanitarian assistance to enable Iranian authorities to save precious human lives.\nHe also expressed deep concern over the continuing communication and movement lockdown in Indian Occupied Jammu and Kashmir which was depriving eight million Kashmiris of critical information and essential medical supplies needed to effectively contain the COVID-19 pandemic.\nForeign Minister Qureshi also expressed concern over the fragile state of financial systems of the developing world.\nTo allow developing countries to cope with the crisis, and mitigate the economic fallout, he underlined the Prime Minister’s call for debt restructuring, and sought France’s support and understanding, as an important member of the EU, the G-7, and the UN Security Council, on these issues.\nThe French foreign minister agreed with Qureshi’s assessment of the situation in Iran and the need to provide debt relief to developing countries, and expressed his intention to raise the lifting of sanctions on Iran with the IMF, as well as providing debt relief to developing countries at the G-20.\nForeign Minister Qureshi suggested that in view of the situation arising out of the COVID-19, the two sides may hold the next round of Bilateral Political Consultations, which was scheduled on 26 March 2020, via video conference.\nForeign Minister Le Drian thanked the foreign minister for his expression of solidarity and concurred with the need for enhanced cooperation to tide over the crisis. The two ministers also agreed to stay in contact.",
  "retrievedAt": "2025-08-11T18:59:24.385Z"
}
