{
  "title": "PM announces around Rs 1000 b hefty relief package to tackle economic slowdown from COVID-19",
  "link": "https://www.app.com.pk/national/pm-announces-hefty-relief-package-to-tackle-economic-slowdown-from-covid-19/",
  "date_published": "2020-03-24T08:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):Prime Minister Imran Khan Tuesday announced around Rs 1,000 billion huge relief package aimed at providing financial support to the different sectors of economy affected by the economic slowdown unleashed by the coronavirus (COVID-19) all over the globe.\nDuring an interaction with media persons, the prime minister said the government had decided to allocate Rs 200 billion for the labour class, which had been hit hard in the difficult times.\nTo help the industrial sector and especially the export sector, it was decided to release tax refunds amounting to Rs100 billion, besides deferring of the interest payment to bolster the sector, he added.\nFor the small and medium industry, and agriculture sector, another amount of Rs 100 billion was set aside with deferred interest payment, the prime minister said, adding concessional loans would also being extended to the sectors. The government wanted to bring down the input costs for the farmers.\nOther packages, he said, included additional amount of Rs 50 billion for the Utility Stores, Rs 280 billion for the wheat procurement, and slashing of petrol and diesel prices by Rs15 per liter for which the government would have to bear the burden of Rs75 billion. An amount of Rs100 billion was allocated separately for the emergency situation, he added.\nThe prime minister said power consumers using 300 units and gas users with Rs 2,000 monthly bills would be facilitated to deposit their bills through three monthly installments. A sum of Rs 50 billion was also allocated for the medical staff. The National Disaster Management Authority would get Rs 25 billion for purchase and procuring of kits, he announced.\nImran Khan said for the vulnerable families who were bearing the brunt of the difficult time, it was decided to allocate an amount of Rs 150 billion for a period of four months.\nHe said they were also expanding the network of Panagah (shelter homes) where the precautionary measures had been strictly practiced.\nBesides, he said, it was decided to either completely cut taxes or reduce them on different edible items. For the construction industry, the government would announce a separate package within days, which, he promised, had never been witnessed in the country’s history.\nReiterating that the country could not afford a complete lockdown with the imposition of curfew, the prime minister said the situation in the country so far did not warrant for resorting to that last step.\nHowever, he added, the government would review the situation after a couple of weeks. The provincial governments after the 18th Constitutional Amendment could take their decisions while the role of the Federal Government was only that of an advisory, he replied to a query.\nThe Federal Government, he said, could only give guidelines but could not direct the provinces against their decisions. The provincial governments could react to a situation, but should also give consideration to the evolving situation. “God forbids, nobody knows the evolving situation, which might also compel us for the imposition of curfew after two weeks,” he added.\nAdvisor to the PM on Finance Abdul Hafeez Shaikh, Minister for Food Security Khusru Bakhtiar, Advisor to the PM on Health Dr Zafar Mirza, Special Assistant to the PM on Information and Broadcasting Dr Firdous Ashiq Awan, and NDMA Chairman Lieutenant General Muhammad Afzal were also present on the occasion.\nComparing the situation in Spain, Italy, France and other European countries, the prime minister said with about 900 cases in Pakistan, the government team had been taking cognizance of the evolving situation regularly.\nEnforcing a curfew would lead to complete halting of transport, which could badly affect the food and medical supplies. Such steps could have strong damaging affects upon the society and economy, especially on the downtrodden or the poor class, who had been living in clusters in the Katchi Abadis.\nThe prime minister while differentiating between the lockdown and curfew, also shared his concerns that the evolving situation of the COVID-19 outbreak could stretch over to six months.\n“Whatever decisions the government take, I am fully responsible for them. All the economic decisions are being taken with consensus of my economic team,” he added.\nTo another question, he regretted that the economic situation had been improving in the country as the macroeconomic indicators witnessed rising, but the COVID-19 outbreak cast unintended consequences upon the economy. The year 2019 had been the most difficult time of his life, he added.\nThe prime minister, to a question, replied that in case of emergency, the country would require a volunteer force comprising the youth, besides creation of funds. The youth and overseas Pakistanis would be tapped in such like scenario.\nDilating upon the issue of complete lockdown, he further regretted that a confusion and impression had been created in the country. Taking wrong decisions at the current critical stage were more dangerous than the spread of coronavirus, he warned.\nThe prime minister said the government was extra cautious in taking certain steps, which should benefit the country and the nation. During the first National Security Committee meeting, when the country had reported just 21 cases, the gradual lockdown started with the closure of the schools, besides stoppage of public gatherings.\nIn the past, decisions were taken for the interests of selected elite class and there were different systems for different classes, he said and regretted that the same response was being also witnessed in the country over the coronavirus.\nThe prime minister said it was a collective fight of the humanity and a single government could not fight it alone. The public response to the government’s measures like those witnessed in China was vital for achieving the objectives, he stressed and urged the nation to fully cooperate with the government’s calls to control the spread of pathogen.\nTo a question about holding of religious congregations in the country despite a ban, Imran Khan said the government had mobilized the Ulema, who were guiding the people to avoid mass gatherings and follow the government and health ministry’s precautionary measures. A volunteers force would also be formed to assist and guide the people in that regard.\nAbout short-term lockdown of the country, the prime minister again rejected the idea, saying a debate had been started even in the United States about the lockdown of cities as some of the people were of the view that it would hurt the national economy.\nHe, however, reiterated: “We as a nation will counter the pandemic with unity, rest assure the government is fully concentrating on the economy and food security, and trying its level best to face the endemic.” It was the government’s job to create easiness for its people, he added.\nHe said when the pandemic spread there were only 1,500 ventilators in the public sector but now their number had increased to 2,200.\nTo another question, the prime minister said he fully believed in freedom of the press, but accuracy and objectivity should be the hallmarks of journalists. The role of the media was to counter panic in the society as it was more dangerous than the coronavirus.\nHe assured the anchorpersons that the nation had the resilience to counter such kind of crisis, citing the examples of 2005 earthquake and 2010 flood. The government would provide all details to the media about the situation and take them into confidence.\nThe prime minister said efforts were being made to stock the hospitals with basic medical equipment. He urged the people to become disciplined and avoid social gatherings so that there would be no need for them to go to hospitals.\nAdvisor to the Prime Minister on Finance Dr Abdul Hafeez Sheikh said despite facing a number of challenges on the economic front due to an inherited fragile economy, Prime Minister Imran Khan had announced Rs 1,000 billion package to counter the spread of coronavirus and to support the most vulnerable sections of the society, who had been the worst hit by the pandemic.\nNDMA Chairman Lt Gen Muhammad Afzal said the Chinese government was fully helping Pakistan in supply of various medical equipment and gadgets. There was a plan to acquire 10,000 additional ventilators over the next few months in order to cope with any health crisis, such as the Covid-19 pandemic.\nHe revealed that there were around 2,200 ventilators across Pakistan at the moment and around half of them would be available if needed for the COVID-19 patients, he added.\nHe said the import of medical equipment, 100,000 masks and 50,000 N- 95 for doctors and other things would be started form tomorrow. Some 50,000 test kits would also arrive from China on Wednesday.\nHe said a direct flight was being operated for Wuhan to collect medical equipment, including a small number of ventilators. Some 12 tonnes material would be brought from Urumqui by Saturday. The border with China would be opened for one day for the supply of medical goods.\nLt Gen Afzal urged the businessmen to place their orders for import of medical equipment from China, which the government would fully accommodate.\nSome 25,000 masks were being prepared daily in the Wah Cantonment while all the masks manufacturing companies had been asked to prepare the masks and the government would fully compensate them in their business.\nHe said the NDMA already had $80 million funds while it would soon another $800 million.\nFederal Minister for National Food Security Khusro Bkhtiar said Pakistan had 90 percent of local food. Besides the last year’s strategic wheat stock of 4 million tonnes, the stock capacity for the present year had been increased to 8.2 million tonnes.\nHe said Pakistan produced seven million tonnes rice while its total consumption was just 3.5 million tonnes. The country was self-sufficient in poultry, whose supply chain would be ensured at all costs.\nThe country had 80,000 tonnes of cooking oil and ghee in stock while their price in the international market was on the decline, he added.\nKhusro Bakhtiar said Pakistan had two months stock of pulses, while there was slowdown in their prices in the international market. The government would ensure supply chain of food commodities throughout the country, he added.",
  "retrievedAt": "2025-08-11T18:59:40.246Z"
}
