{
  "title": "ICT’s offices, markets, social places to be closed tomorrow: Moeed Yusuf",
  "link": "https://www.app.com.pk/national/icts-offices-markets-social-places-to-be-closed-tomorrow-moeed-yusuf/",
  "date_published": "2020-03-24T03:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):Special Assistant to the Prime Minister on National Security Division (SAPM) on Tuesday announced that in the wake of coronavirus pandemic all the offices, markets, shopping malls and restaurants in Islamabad Capital Territory (ICT) would remain closed from March 25 to April 7, 2020.\nAddressing a press conference, he said no intercity public transport would be allowed to operate within the federal capital whereas Metro Bus service in ICT would remain open from 8:30am to 10:30am and 3:30pm to 5:30 pm.\nHe informed that no public gathering at social places including cinemas, parks and religious congregation were banned in the ICT.\nHowever, essential services including welfare trusts, hospitals, pharmaceutical companies, medical equipment manufacturers, medicine stores, groceries were exempted from the ban, he added.\n“Hospitals and clinics will remain open whereas outdoor patients department (OPD) will remain close at all ICT healthcare centres,” Moeed Yusuf said.\nHe noted that bakeries, meat and milk shops, flour mills (Atta Chaki), groceries would remain open.\n“Oil depots and petrol pumps will also remain open whereas the ICT administration will work out some standard operating procedures (SOPs) within a week for future course of action.”\nMoeed Yusuf mentioned that only authorized media departments that were registered with the Information department would be allowed to continue their business including newspaper distributors.\n“Media personnel and government officials are requested to keep their computerized national identity cards and office batches while travelling in ICT from tomorrow so that they could be identified.”\nHe went on to mention that the mega departmental stores were permitted to only keep their grocery and medical stores open during the shutdown. However, these stores were responsible to decontaminate their outlets and public dealing zones to prevent the pandemic attack.\nLater, Deputy Commissioner ICT Muhammad Hamza Shafqat issued the notification late night which mentioned that public offices would function from Monday to Thursday from 10:00am to 04:00pm and on Fridays 10:00 am to 01:00.\nHowever, people who would be exempted from the lockdown were officials of government departments on duty notified by respective departments and ministries. It also included staff related to health Services including hospitals, clinics, laboratories, pharmaceutical factories and medical stores, and law enforcement agencies.\nPeople who needed medical care were allowed two attendants with him despite the ban in the ICT. “Religious rites like Namaz-e-Janaza and burial were also being allowed.”\nHe said the ICT administration had also given permission to the utility companies; relevant directorates or wings of CDA, IESCO, PTCL, and SNGPL alongwith essential services of Metropolitan Corporation Islamabad to remain functional. Public and private telecommunication companies, their franchise and customer support centers with no public dealing were allowed with minimum attendance at their premises. Call centres with 50 percent staff were also allowed to work with no public dealing, he added.\nHe said, “Banks would also be opened with essential staff and specific timings, to be notified by the State Bank of Pakistan. Defense related manufacturing and packing facility along with dry port operations and customs services to continue.”\nHe said as per the notification preferably one person may travel in a private vehicle. In case of medical emergency two attendants may accompany the patient.\nThe SAPM said, “Two persons per family may go out to buy essential items. Handicapped person may be assisted by two persons alongwith a driver.\nPersons on vehicles transporting essential food items, medicines, medical equipment from godowns, farms, mills or factories may be assisted by two helpers or cleaners during the transportation. All personnel of the exempted departments must travel and work keeping in view the policy of social distancing.”",
  "retrievedAt": "2025-08-11T18:59:33.015Z"
}
