{
  "title": "Qureshi, Spanish FM discuss COVID 19 outbreak",
  "link": "https://www.app.com.pk/national/qureshi-spanish-fm-discuss-covid-19-outbreak/",
  "date_published": "2020-03-24T03:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi held a telephone conversation with his Spanish counterpart Arancha Gonzales Laya and discussed matters related to the Covid-19 outbreak.\nForeign Minister Qureshi conveyed deep condolences over the loss of precious lives in Spain\nand commended the steps being taken by the Spanish authorities, and in particular, lauded the heroic sacrifices of the Spanish healthcare workers.\nHe also dilated upon the positive role of the 100,000 strong Pakistani community in Spain standing in solidarity with their Spanish compatriots during the unprecedented crisis, Foreign office spokesperson said in a press release on Tuesday .\nForeign minister Qureshi expressed deep concern over the continuing communication blackout in Indian Occupied Jammu and Kashmir which was depriving eight million Kashmiris of critical information and essential medical supplies, needed to effectively contain the Covid-19 pandemic.\nHe also underscored the need for immediate lifting of sanctions against Iran and extending humanitarian assistance to enable Iranian authorities to save precious human lives.\nQureshi further highlighted the Prime Minister’s call for debt relief for the developing countries to enable them to devote resources to combat the pandemic, and mitigate its serious economic fallout.\nThanking Qureshi for the call, Foreign Minister Laya apprised him of the steps being taken by Spain to look after its citizens, including those of Pakistani origin.\nShe appreciated the role being played by the Pakistani community in Spain.\nShe informed that the situation in Iran was discussed at the EU foreign ministers meeting held on 23 March and also mentioned that the issue of debt relief to developing countries, could be taken up at appropriate fora.\nThe two ministers agreed that the best way to overcome the Covid-19 pandemic was to cooperate closely.",
  "retrievedAt": "2025-08-11T18:59:24.383Z"
}
