{
  "title": "President urges people not to worry from social distancing, give time to family, children",
  "link": "https://www.app.com.pk/national/president-urges-people-not-to-worry-from-social-distancing-give-time-to-family-children/",
  "date_published": "2020-03-24T13:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):President Dr Arif Alvi on Tuesday urged the people not to worry from social distancing due to the coronavirus as it was the best opportunity for them to give time to the family and concentrate on the education of children.\nThe president, in a recorded message on the corona preventive measures and mental health, said exercise was must to strengthen immune system to fight the COVID-19.\nHe said worshipping and being grateful to Allah Almighty reduced stress, and bring peace and calm.\nThe president thanked the media for creating awareness among the people about the fight against the virus and sensitizing them to adopt preventive measures. He also thanked the political parties by taking various steps to counter the spread of virus instead of resorting to revelry.\nDr Alvi once again called for national unity and urged the people to become disciplined and adopt preventive measures against the coronavirus so that there would be no need for them to go to hospitals.\nThe number of hospitals in the country, he said, were not sufficient to handle the huge rush. Except breathing problem, the people suffering from minor diseases like fever etc should not got to the hospitals in the present situation.\nThe president said Pakistan had sent some medicines, including chloroquine hybrid, to China for the treatment of the virus and after its testing they were found good for the breathing problem. Sufficient stock of the medicine was present in the country to meet its own requirement and that of Afghanistan.\nHowever, some people had started panic buying of the medicine, which was not for prevention of the disease and was just for its treatment. It was rather harmful for heart and diabetics patients, he added.",
  "retrievedAt": "2025-08-11T18:59:39.423Z"
}
