{
  "title": "Govt’s strict measures to halt further COVID-19 spread: Dr Mirza",
  "link": "https://www.app.com.pk/national/govts-strict-measures-to-halt-further-covid-19-spread-dr-mirza/",
  "date_published": "2020-03-24T03:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):Special Assistant to Prime Minister on National Health Services Dr Zafar Mirza Tuesday expressed the hope that the government’s strict measures will help controlling the further spread of coronavirus (COVID-19) in the country.\nAddressing a routine media briefing on COVID-19, Dr Mirza said that the objective behind stern steps of provinces and involvement of Pakistan Army under article 245 was to curtail the virus at existing stage.\n“All provinces were making sincere efforts at their level to successfully combat the disease and making foolproof protection for citizens against COVID-19. Plans were made in accordance with the changing situation, which will hopefully improve with the passage of time”, he said.\nHe said that National Disaster Management Authority (NDMA) was a lead organization to procure and ensure availability of necessary medical items while the Ministry of National Health Services was responsible for making need assessment of required items.\nHe thanked Pakistanis living inside and outside the country for their generous support offer who were willing to donate the government to meet the requirements of medical equipment etc.\nDr Mirza said the government has made arrangements by making a focal point in this regard. He added NDMA would receive all such things and share it where required.\nHe said that as Prime Minister said that this was not a lockdown, but the permission was only for required staff at offices and those running the business of medicines, food, grocery and other essential items however other citizens were being stopped to move freely.\nHe said that the government had planned to start training of healthcare staff and workers who were busy in treatment of coronavirus patients or to be appointed for the purpose.\nDr Mirza said that 5,000 health professionals will be trained while he also assured protection of health staff during treatment of coronavirus patients at hospitals. He added that at national level the government was also working to start national level volunteer programme.\nHe said that Prime Minister Imran Khan was likely to announce economic support and protection for people in wake of prevailing coronavirus situation. He added all available resources were being allocated and joint efforts were made to control the disease.\nHe appealed people to avoid unnecessary movement outside home and follow the directions of respective governments and administrations. He said provinces had made plans to restrict citizens at home with objective to protect them from coronavirus.\nHe said that the total number of coronavirus (COVID-19) related cases reached 892 in the country with addition of 89 new positive cases. He added suspected cases were 7,736 out of which 1,262 were reported during last 24 hours.\nHe said that 78% cases had travel history of Iran while 63% of the confirmed cases were men and 37% were women. He said that 635 patients were admitted in hospitals while five were in serious condition.\nHe said six deaths had been reported from the disease so far while 399 cases were reported from Sindh, 249 from Punjab, 38 from Khyber Pakhtunkhwa, 110 from Balochistan, 15 from Islamabad Capital Territory, 80 in Gilgit Baltistan and one in Azad Jammu and Kashmir. He said that six patients had been discharged after complete recovery.\nHe said that 4,788 people were at different quarantine centres at provinces, who were shifted from main quarantine at Taftan while the ratio of disease positive trend in them was 24%.\nHe said that globally, 382,000 cases were reported from 195 countries and over 100,000 patients had been recovered.",
  "retrievedAt": "2025-08-11T18:59:28.609Z"
}
