{
  "title": "India starts work on hydro projects after suspending treaty with Pakistan, say sources - Pakistan - DAWN.COM",
  "author": null,
  "content": "India has begun work to boost reservoir holding capacity at two hydroelectric projects in the India-occupied Kashmir, sources with knowledge of the matter told Reuters, after fresh escalation with Pakistan led it to suspend the Indus Waters Treaty.\n\nTensions between the two countries have spiked following the April 22 attack in occupied Kashmir’s Pahalgam that killed 26 people, mostly tourists, marking one of the deadliest assaults in the region since 2000. India has implied cross-border links without evidence, while Pakistan vehemently rejected the allegation and called for a neutral probe.\n\nA “reservoir flushing” process to remove sediment began on Thursday, carried out by India’s biggest hydropower company, the state-run NHPC and authorities in the India-occupied Kashmir, the three sources said, according to Reuters.\n\nThey spoke on condition of anonymity as they were not authorised to talk to the media.\n\nThe work may not immediately threaten supply to Pakistan, which depends on rivers flowing through India for much of its irrigation and hydropower, but it could eventually be affected if other projects launch similar efforts.\n\nThere are more than half a dozen such projects in the region.\n\nIndia did not inform Pakistan about the work at the Salal and Baglihar projects, which is being done for the first time since they were built in 1987 and 2008-2009, respectively, as the treaty had blocked such work, the sources added.\n\nIndia’s NHPC and the neighbouring governments did not reply to emails from Reuters to seek comment.\n\nThe flushing operation ran for three days from May 1, the sources said.\n\n“This is the first time such an exercise has taken place and will help in more efficient power generation and prevent damage to turbines,” one of the sources told Reuters.\n\n“We were also asked to open the adjustable gates for cleaning, which we did from May 1,” the source said, adding that the effort aimed to free the dam operation from any restrictions.\n\nPeople living on the banks of the Chenab river in the India-occupied Kashmir said they noticed water had been released from both Salal and Baglihar dams from Thursday to Saturday.\n\nSeparately, Press Trust of India posted a video on its X account reporting that India has restricted the flow of water through the Balighar dam on the Chenab River.\n\nThe flushing of hydropower projects requires nearly emptying a reservoir to force out sediments whose build-up is a major cause of decline in output.\n\nFor example, two of the sources said that power delivered by the 690-megawatt Salal project was far below its capacity, because Pakistan had prevented such flushing, while silting also hit output at the 900-MW Baglihar project.\n\n“Flushing is not a common thing because it leads to a lot of water wastage,” said one of the sources. “Downstream countries are expected to be informed in case it leads to any inundation.”\n\nBuilding both projects had required extensive back and forth with Pakistan, which worries about losing out on its share of water.\n\nUnder the 1960 treaty, which split the Indus and its tributaries between the neighbours, India had also shared data such as hydrological flows at various spots on the rivers flowing through India and issued flood warnings.\n\nIndia’s water minister has vowed to “ensure no drop of the Indus river’s water reaches Pakistan”.\n\nGovernment officials and experts on both sides say India cannot stop water flows immediately. The treaty has allowed it only to build hydropower plants without significant storage dams on the three rivers allocated to Pakistan.\n\nThe suspension means India “can now pursue our projects at free will”, said Kushvinder Vohra, a recently retired head of India’s Central Water Commission who worked on Indus disputes with Pakistan.\n\nIndian Prime Minister Narendra Modi’s government has sought to renegotiate the treaty in recent years, and the two countries have tried to settle some of their differences at the Permanent Court of Arbitration in the Hague.\n\nThese concerns relate to the size of the water storage area at the region’s Kishenganga and Ratle hydroelectric plants.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:15:25.434Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908603/india-starts-work-on-hydro-projects-after-suspending-treaty-with-pakistan-say-sources",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T10:32:25.000Z"
}
