{
  "title": "SBP cuts interest rate by 100bps to 11pc - Business - DAWN.COM",
  "author": null,
  "content": "The State Bank of Pakistan (SBP) cut the policy rate on Monday to 11 per cent, amid trade and industry sectors advocating for a significant cut.\n\nThe central bank’s policy rate, after being slashed by 1,000bps from 22pc since June 2024 in six intervals, previously stood at 12pc.\n\nApril inflation stood at a low of 0.3pc, largely due to a high base a year ago. The reduction is also primarily attributed to lower prices of key food staples such as wheat and its derivatives, onions, potatoes and certain pulses, as well as a cut in electricity and fuel charges. These items carry significant weight in the inflation basket — the Consumer Price Index (CPI) — meaning minor price changes can heavily influence the overall rate.\n\nAccording to a notification issued by the SBP today, the Monetary Policy Committee (MPC) decided to cut the interest rate, noting that inflation in April turned out to be lower than expected, mainly due to a drop in prices of perishable food items and electricity and fuel charges.\n\nAccording to the statement, core inflation declined in April, primarily reflecting favourable base-effect amid moderate demand conditions.\n\n“Overall, the MPC assessed that the inflation outlook has improved further relative to the previous assessment,” the statement said.\n\nThe committee viewed that the heightened global uncertainty surrounding trade tariffs and geopolitical developments could pose challenges for the economy.\n\n“In this backdrop, the MPC emphasised the importance of maintaining a measured monetary policy stance,” it said.\n\nThe committee also noted key developments since the last meeting.\n\nIt said that the provisional real GDP growth for Q2-FY25 was reported at 1.7 per cent year-on-year whereas Q1 growth was revised up to 1.3pc from 0.9pc.\n\n“Second, the current account recorded a sizable surplus of $1.2 billion in March, mainly due to record-high workers’ remittances,” it said.\n\nIt said that the surplus and SBP’s foreign exchange purchases partially cushioned the impact of large ongoing debt repayments on the SBP’s foreign exchange reserves.\n\nIt also said that recent surveys suggested further improvement in both consumer and business sentiments, adding that shortfall in tax collection has continued to widen.\n\n“Global uncertainty, particularly around tariffs, has led the IMF to sharply downgrade its 2025 and 2026 growth projections for both advanced and emerging economies,” the statement said, adding that the tariff uncertainty also triggered heightened financial market volatility and a sharp decline in global oil prices.\n\n“Considering the evolving developments and risks, the MPC viewed that the real policy rate remains adequately positive to stabilise inflation in the target range of 5pc to 7pc, while ensuring that the economy grows on a sustainable basis,” it said.\n\nSeparately, the statement said that headline inflation, continuing its downtrend, fell to 0.3pc y/y in April, driven primarily by food and energy prices.\n\n“A sharp decline in wheat and allied product prices, moderation in global commodity prices and downward adjustment in electricity tariffs were the major drivers of this ease in food and energy prices,” the statement said.\n\n“These factors also contributed to the moderation in inflation expectations of consumers,” it said.\n\nMoreover, core inflation, after remaining sticky at around 9pc over the past few months, declined to 8.0pc y/y in April, it added.\n\nThe statement said that going forward, the committee anticipated inflation to gradually inch up in the coming months and stabilise within the target range of 5pc to 7pc.\n\n“This outlook is, however, subject to both upside and downside risks emanating from volatility in wheat and other food prices, timing and magnitude of energy price adjustments, potential global supply-chain disruptions and uncertain commodity price outlook.”\n\nEarlier, it noted that despite a long-term decline in inflation and real interest rates above 11pc, opinions on the central bank’s likely decision on the policy rate were divided, with trade and industry sectors advocating for a significant cut.\n\nResearchers had conducted polls to gauge market sentiment, but the 0.3pc inflation in April has caused division among those who were confident there would be no change in the interest rate.\n\nHowever, many experts believed the SBP would cut the rate by 50bps. Some had also found reasons for a likely status quo as they feel the war-like situation between India and Pakistan has created uncertainty that may escalate prices.\n\nThis situation may force the central bank to adopt a cautious approach in the face of sudden shocks of higher inflation.\n\nThe SBP’s MPC met today to set the key interest rate for the next two months. In March, the central bank delivered a surprise by leaving its policy rate unchanged in the last review, disappointing the business community.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:15:23.683Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908601/sbp-cuts-interest-rate-by-100bps-to-11pc",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T11:11:50.000Z"
}
