{
  "title": "Escalating tensions with India to impact Pakistan’s economic growth: Moody’s - World - DAWN.COM",
  "author": null,
  "content": "Global rating agency Moody’s on Monday said that escalating tensions between India and Pakistan would weigh on Pakistan’s economic growth.\n\nAn attack on April 22 in occupied Kashmir’s Pahalgam killed 26 people, mostly tourists, in one of the deadliest assaults since 2000. India has implied cross-border links without evidence, while Pakistan has rejected the claim and called for a neutral probe.\n\nTensions have since spiked, with Pakistan reinforcing its forces as it expected an incursion and India’s premier granting “operational freedom” to his military. As temperatures remain high, with the military warning of a “swift” response to any misadventure by New Delhi, diplomatic channels have remained engaged to prevent conflict.\n\nIn a note, the rating agency stated: “Sustained escalation in tensions with India would likely weigh on Pakistan’s growth and hamper the government’s ongoing fiscal consolidation, setting back Pakistan’s progress in achieving macroeconomic stability.”\n\nOn Pakistan’s economic trajectory, it said that its macroeconomic indicators had been improving, with growth gradually rising, inflationary pressure easing and foreign exchange reserves increasing amid “continued progress” in the International Monetary Fund (IMF) programme.\n\nHowever, the agency noted that “a persistent increase in tensions could also impair Pakistan’s access to external financing and pressure its foreign exchange reserves, which remain well below what is required to meet its external debt payment needs for the next few years”.\n\n“India and Pakistan’s diplomatic relations have deteriorated,” the agency said, recalling Information Minister Attaullah Tarar’s statement that Pakistan expected a military action by India.\n\nNotably, the agency warned that India’s suspension of the 1960 Indus Waters Treaty could “severely reduce Pakistan’s water supply”.\n\nIn comparison, Moody’s said that the macroeconomic conditions in India would remain stable, propelled by “moderating but still high levels of growth amid strong public investment and healthy private consumption”.\n\n“In a scenario of sustained escalation in localised tensions, we do not expect major disruptions to India’s economic activity because it has minimal economic relations with Pakistan,” it said, adding that the country accounted for less than 0.5 per cent of India’s total exports in 2024.\n\nHowever, it did stress that higher defence spending could impact on India’s “fiscal strength and slow its fiscal consolidation”.\n\n“Our geopolitical risk assessment for Pakistan and India accounts for persistent tensions, which have, at times, led to limited military responses,” it said.\n\nIt predicted that flare-ups “will occur periodically” as they have throughout the neighbouring countries’ post-independence history. However, they will not lead to an “outright, broad-based military conflict”, it added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:15:25.233Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908608/escalating-tensions-with-india-to-impact-pakistans-economic-growth-moodys",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T10:14:29.000Z"
}
