{
  "title": "1.1m out-of-school children enrolled across Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Chief Minister Maryam Nawaz chaired a meeting at the School Education Department for a detailed briefing on the existing and proposed projects of school education.\n\nOfficials concerned told her the “outsourcing of more than 11,000 schools has been completed in Punjab, and the enrollment of children has increased manifold.”\n\nShe congratulated the minister of education on the enrollment of 1.1 million out-of-school children under the Punjab Education Foundation, says a handout.\n\nThe CM directed School Management Councils to provide necessary facilities in schools worth Rs 10 billion within 90 days. She also directed them to build required classrooms in all schools within a year, and said, “Repair 580 most dilapidated and 2,770 precarious school buildings.” She added the construction and repair of schools is among our top priorities.\n\nOver 11,000 schools outsourced, CM told\n\nShe set a target of spoken English training of 500,000 children of government schools from English trainers. She directed the relevant authorities to expand the scope of school meal programme to other districts and tehsils keeping in view the number of children suffering from malnutrition there. She also directed them to build Nawaz Sharif School of Eminence for girls and boys in every district, and set a target of upgrade of 1,750 schools in five years.\n\nShe was told the upgrade of 250 schools will be done in the next financial year, and 300 Tech-Ed schools will be built in 10 tehsils of Punjab.\n\nMINISTER: Punjab Information Minister Azma Bokhari strongly condemned Pakistan Tehreek-i-Insaf’s decision to boycott the national security briefing, calling it a clear demonstration of their anti-state mentality.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:54:07.814Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908485/11m-out-of-school-children-enrolled-across-punjab",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:52.000Z"
}
