{
  "title": "Free rides being offered in Quetta to cut polio vaccination refusals - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: “Come for the rides, stay for the drops!” The streets of Quetta echoed with the joyful chants of children as Immunity Express “Sehat-ki-Sawari” rolled into action, turning moments of fun into milestones of protection.\n\nIn the ongoing fight against polio, reaching every last child remains an urgent priority. Despite repeated campaigns, a number of children are consistently missed whether due to refusals, absence during team visits, or because they belong to mobile and transient populations. To address this gap, Quetta launched “Immunity Express” in four union councils namely Samungli, Sheikhan, Kotwal-2 and Kharotabad-2 during the polio campaign.\n\nUnder this innovative, low-cost initiative, local swing vendors and camel ride owners were engaged to offer free rides to children. The colorful swings and camel rides attracted not only children but also their younger siblings, gathering them at accessible points within their communities. As the children rushed towards the rides, polio workers checked their fingers for vaccination marks, a missing mark meant immediate action: administering the polio vaccine to under five kids on the spot.\n\nThis joyful environment helped vaccinate many children who were previously missed due to any reason.\n\n“Through this activity, we were able to cover those children who were not available at home during our visits. Even refusals melted away when kids came for the rides,” shared a polio worker, smiling proudly.\n\nChildren showed their purple fingers with smiles that lit up not only their faces but their eyes too. Their excitement was truly heartwarming to witness.\n\n“We love the free rides! And we got our polio drops too!” they chanted, swinging high and riding camels, proudly showing their vaccinated fingers.\n\nThe success of Immunity Express comes at a crucial time. Although Balochistan has not reported a polio case this year, the risk remains extremely high. Positive environmental samples evidence of the poliovirus circulating silently in sewage have been detected in many areas across the province\n\nMoreover, polio cases continue to emerge in neighboring Afghanistan and other provinces of Pakistan, posing a constant threat of cross-border and interprovincial transmission.\n\nIn such a volatile envir­on­ment, maintaining high levels of vaccination coverage is the only shield against the virus. Every missed child is a risk not just to themselves but to entire communities. Initiatives like Immunity Express are vital in closing immunity gaps, reaching the unrea­ched, and ensuring that every child is protected.\n\nImmunity Express beautifully demonstrated how simple ideas, rooted in community engagement and joy, can turn the tide in public health efforts. By bringing smiles and safeguarding lives, it took another meaningful initiative towards a polio-free future for all.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:54:07.333Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908525/free-rides-being-offered-in-quetta-to-cut-polio-vaccination-refusals",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:15.000Z"
}
