{
  "title": "BSF’s era of intruding into Bangladesh draws to a close - World - DAWN.COM",
  "author": null,
  "content": "ONCE upon a time, not so long ago, the border between Bangladesh and India was not just a line drawn on maps — it was a bloodied seam, stitched together with the pain of innocents. For decades, the Indian Border Security Force (BSF) enjoyed an unchecked licence to kill, literally. And Bangladesh, under the suffocating collar of Sheikh Hasina’s regime, remained submissive. But those days are gone. The butcher is out. The tides have turned. Let’s rewind.\n\nFew names stir the soul like that of Felani Khatun. A 15-year-old girl who dared to dream of a better life, Felani was gunned down by the BSF in 2011 while crossing back into Bangladesh. Her body hung from the barbed wire for hours, an unwilling martyr to Indian border brutality. The photograph that captured her lifeless form became an iconic indictment of the “world’s largest democracy” and its staggering hypocrisy.\n\nOne might imagine that the international shame alone would provoke some introspection in New Delhi. But introspection, much like justice, is a rare currency when power intoxicates. Not only did the BSF deny justice, they doubled down. From 2000 to 2020, over 1,200 Bangladeshis were killed by BSF bullets. Their crimes? Cattle trade, alleged trespassing, or simply being too close to the line that divides brown from browner.\n\nThe Indian media, ever faithful to its nationalist gospel, described these killings as “anti-infiltration” operations. In reality, they were often nothing short of extrajudicial executions. And with Hasina’s government too busy importing onions and exporting sovereignty, there was little protest from Dhaka.\n\nIndia is learning, perhaps for the first time in decades, that Bangladesh is not a backyard — it’s a sovereign nation\n\nIndia has long mastered the art of regional muscle-flexing under the guise of democratic diplomacy. While it sermonised peace and prosperity, it wielded the BSF aggressively on its eastern front. Bangladesh was expected to comply, stay silent, and accept collateral damage in the name of “strategic relations.”\n\nUnder Sheikh Hasina, compliance was institutionalised. Her government’s policy was essentially: “BSF kills, we stay still.” In exchange, she received glowing endorsements from India and dubious praise for “stability.” That stability, of course, came at the cost of blood-soaked borders and silenced dissent. But like all bad arrangements, this, too, had an expiry date.\n\nHasina’s fall in August last year was not just a political transition; it was a psychological liberation. Her departure signalled the end of Bangladesh’s self-imposed vassalage. The people had spoken, and this time, they roared.\n\nWith the new leadership came a new tone. Border killings, once met with timid press notes, are now responded to with thunderous protest and sharp diplomacy. Reports now emerge of villagers also refusing to be passive victims. Communities along the border are organising, resisting, and yes, retaliating. The once-muted backbone of Bangladesh has returned, now reinforced with public support and political will.\n\nIn Meherpur, locals chased off BSF troops attempting to enter Bangladeshi territory, pelting stones and shouting slogans. In Chapainawabganj, community patrols have sprung up, coordinated with local law enforcement to monitor cross-border activities. When Swarna Das, a schoolgirl, was abducted and brutalised by BSF personnel, it no longer took months of diplomatic crawling for the news to break. Social media exploded. Protests erupted. Demands were made, and not politely.\n\nIndia is learning, perhaps for the first time in decades, that Bangladesh is not a backyard — it’s a nation. And its people, once subdued, are reclaiming their voice.\n\nOf course, the Indian establishment, caught off guard, is responding with its usual playbook. Accusations of “radicalism” fly fast. Op-eds in Delhi whisper of “anti-India sentiment” being stirred up by “vested interests.” But this is not about sentiment; this is about sovereignty. This is not about radicals; it’s about citizens refusing to be killed like cattle and ignored like pests.\n\nBorders often reflect the character of nations. For years, the Indo-Bangl­adesh border reflected a colonial hangover dressed up as partnership. But no more. Today, that border reflects resistance, pride, and a new calculus.\n\nThis doesn’t mean war or conflict. It means accountability. It means Bangla­desh no longer accepts the asymmetry of power as fate. It means Dhaka speaks with confidence, not permission.\n\nThere’s poetic irony in the way things have shifted. India, which once used BSF as a symbol of dominance, now finds itself pleading for “calm and cooperation” as border tensions spike — not because Bangladesh seeks revenge, but because it demands dignity.\n\nAnd why not? If Israel can bomb its way to “security” and India can shoot unarmed teenagers to defend “territorial integrity,” surely Bangladeshis have the right to demand that their citizens not be murdered at fences.\n\nThe recent uptick in border-level resistance is not lawlessness. It’s what happens when people are pushed too far, when lives are deemed expendable, and when a state forgets its first duty: to protect.\n\nThis is not just about BSF’s bullets or India’s muscle. It is about the reckoning of decades of diplomatic dishonesty and violent arrogance. It is about the breaking of a silence that should never have existed.\n\nFelani Khatun’s ghost still hovers over that barbed wire fence. But today, she is no longer alone. Her story, once told in whispers, is now shouted from rooftops. The border may still be fenced, but fear is not.\n\nIndia, a nation proud of its lunar missions, can’t seem to stop its BSF jawans from stumbling into sovereign Bangladesh — and begging their way out. Recently, two armed BSF soldiers crossed the international border and tried to herd Bangladeshi farmers like colonial-era overlords. But this isn’t the Bangladesh of 2012. This is the Bangladesh after Hasina, where people don’t cower — they retaliate. The once-muted BGB sprang to life. Villagers and BGB troops not only confronted the intruders but caught them, weapons and all. In a scene fit for satire, a BSF jawan was caught on video grabbing a BGB soldier’s leg in apology.\n\nIn another drama, two Bangladeshi farmers were seized by the BSF for stepping over an invisible line to thresh paddy. In a poetic twist, locals captured two Indian nationals on their land and handed them to BGB. No bullets, no bluster — just symmetry.\n\nThe ensuing flag meeting saw a quiet but firm exchange of citizens. This time, Bangladesh didn’t blink. What’s changing is more than tactics; it’s the tone. The nation that once endured quietly now demands loudly. And enforces it, with video proof and viral pride. Bangladesh is no longer the timid sibling. It stands firm. And for any BSF soldier tempted to trespass again, one question remains: Is the leg you’ll have to grab worth the ego you’ll leave behind?\n\nHistory has shown that fences, be they of barbed wire or ideology, eventually fall. The question is not if, but when. The BSF’s era of impunity is drawing to a close, not because of international outrage (which remains lukewarm), but because Bangladeshis have had enough. And when a nation finds its backbone, even the mightiest neighbour must reconsider its posture.\n\nFrom Felani to Swarna, from silence to defiance, the story of Bangladesh’s border is no longer written in Indian ink. It is being authored anew, by its people.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6817fbf9e56f1.gif",
  "retrievedAt": "2025-10-12T02:54:32.626Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908515/bsfs-era-of-intruding-into-bangladesh-draws-to-a-close",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:35.000Z"
}
