{
  "title": "Gunmen kidnap labourers in Noshki; no clue to abducted policemen - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Unknown armed men attacked a construction site in the Albat area of Noshki district on Sunday and kidnapped four labourers working on the Noshki-Kharan road project, officials said.\n\nAccording to Levies officials, a private construction company was building the Noshki-Kharan road and had established a camp in the Albat area. A group of armed men arrived at the site, opened fire on construction machinery and damaged it, they said.\n\nThe attackers took four labourers hostage at gunpoint and fled the area. Security forces rushed to the site after receiving information, cordoned off the area and launched a search operation to recover the kidnapped workers.\n\nIn a separate incident, the whereabouts of five police personnel remained unkn­own 48 hours after they were kidnapped by armed militants in the Mongochar area of Kalat district while escorting a vehicle transporting 10 under-trial and convicted prisoners.\n\nThe prisoners were being transferred from Gadani jail in Hub district to Quetta and Mach jails. Armed militants intercepted the vehicle in Mongochar, where they had blocked the Quetta-Karachi national highway and were checking passing vehicles, officials said.\n\nThe attackers seized control of the vehicle, freed the 10 prisoners and abducted five police officers at gunpoint, taking them and their official weapons into nearby mountainous areas.\n\nHowever, they released the driver and the vehicle.\n\nSecurity forces have launched a search operation in the area to recover the abducted police personnel.\n\nThe Baloch Liberation Army, a banned separatist outfit, claimed responsibility for kidnapping the police officials, including a senior officer. The group also released photographs of the abducted officers.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:15:57.143Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908523/gunmen-kidnap-labourers-in-noshki-no-clue-to-abducted-policemen",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:15.000Z"
}
