{
  "title": "Over 80 players participate in Swat chess championship - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWAT: Top chess players from across Pakistan battled it out in close contests in the first-ever Swat Open Chess Championship 2025.\n\nThe scenic valley of Swat witnessed an extraordinary display of intelligence and strategic brilliance as the chess championship concluded here on Sunday.\n\nThe championship was organised by Khyber Pakhtunkhwa Chess Association (KPCA) with support of Chess Federation of Pakistan (CFP). More than 80 players from Sindh, Balochistan, Punjab and Khyber Pakhtunkhwa participated in the chess tournament.\n\nThe tournament followed rapid chess format, hosting matches in open, women’s and under-14 categories, with a total of seven intense rounds. The event was meticulously managed, offering players an ideal environment, with refreshments and meals available, making it one of the region’s most fiercely contested recent chess events.\n\nIn the open category, top players from across Pakistan battled it out in close contests. Salman Ali Khan from Islamabad emerged as champion, displaying exceptional strategic skills. Aimal Safi from KP was runner-up while Asadullah Rampuri from Sindh claimed third position.\n\nOther standout players included Asif Abbasi (Sindh, 4th), Imtiazul Haq (Sindh, 5th), Masawar Kakar (Balochistan, 6th) and Raja Gohar Iqbal (Punjab, 7th).\n\nIn the women’s category, Sawera Ali secured first position. Mohammad Ashj Tariq topped under-14 division, followed by Furqan Mughal.\n\n“Swat, once known for its challenges, is now leading the way in promoting peace, development and intellectual sports. This event proves that we can nurture talent and build a constructive society through mind sports like chess,” said Kashif Saleem, secretary of KP Chess Association.\n\nThe tournament received full logistical and institutional support of district youth office, who played a vital role in ensuring its success. “We were proud to support such a positive initiative. Providing space, security and resources for youth engagement is central to our mission,” said a spokesperson for the office.\n\nRaja Gohar Iqbal, finance secretary of Chess Federation of Pakistan, commended Salman Khan, the vice president of KP Chess Association, for his leadership and efforts in delivering a well-executed tournament. He also praised Umar Khan, the president of KPCA, and Kashif Saleem for their commitment to promoting chess in the province.\n\nKashif Saleem extended heartfelt thanks to all players, officials and guests, who travelled from various parts of the country to participate in the tournament. “We are grateful to everyone, who joined us. Your presence turned this into a truly national event,” he said.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6817e3ef98670.jpg",
  "retrievedAt": "2025-08-23T08:15:31.217Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908439/over-80-players-participate-in-swat-chess-championship",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:27:05.000Z"
}
