{
  "title": "May 9 riots: SC reserves verdict on military trials case, will announce decision this week - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Supreme Court’s (SC) Constitutional Bench on Monday reserved its verdict on the appeals against the decision to declare the trial of civilians in military courts null and void, saying it would announce the verdict later this week.\n\nThe development came as the CB resumed hearing a case pertaining to the military trials and the subsequent sentencing of civilians for their role in attacks on army installations during the riots that followed ex-premier Imran Khan’s arrest on May 9, 2023.\n\nThe CB resumed hearing a set of 38 intra-court appeals (ICAs) moved by the federal and provincial gover­nments as well as Shuhada Forum Balochistan, among others, against the widely-praised October 2023 ruling by a five-judge bench that unanimously declared that trying the accused civilians in military courts violated the Constitution.\n\nThe bench — led by Justice Aminuddin Khan and including Justices Jamal Khan Mandokhail, Naeem Akhtar Afghan, Muhammad Ali Mazhar, Hassan Azhar Rizvi, Musarrat Hilali, and Shahid Bilal Hassan — is reviewing whether the trial of civilians in military courts is constitutional or not.\n\nDuring the hearing, Attorney General of Pakistan (AGP) Mansoor Usman Awan appeared as the state counsel.\n\nTV analyst Hafeezullah Niazi, father of Hassaan Niazi who was among those convicted by military courts over the riots, also attended the hearing.\n\nAs the bench reserved its verdict on the long-standing case, Justice Aminuddin said the court will issue its short order on the decision this week.\n\nAt the outset of today’s hearing, AGP Awan said he would begin his arguments by detailing what happened on May 9, 2023.\n\n“Our country is in a state of war almost all year round,” he said. “Army installations were attacked under a well-thought-out plan; on May 9, 49 places were attacked from 3pm onwards,” he said.\n\nHe noted that a prime minister had been hanged in Pakistan — referring to the hanging of ex-PM Zulfikar Ali Bhutto — but even then, there was no such protest. “No political party had attacked the army in the past.”\n\nThe attorney general further referenced Pakistan’s political history, saying that all parties had been banned during the Movement for the Restoration of Democracy (MRD).\n\n“The entire MRD leadership was in chains — Asghar Khan was under house arrest for three and a half years,” the AGP said. “Even during this time, no one took a step like people did on May 9.”\n\n“Even if this was a reaction to May 9, it cannot be allowed; ours is not an ordinary country,” the AGP said. “Due to geography, we face a lot of threats.”\n\nJustice Mandokhail remarked that the question before the court was not about whether a crime was committed, saying: “You come to the appeal, tell us about the appeal.”\n\nAs he continued his arguments, AGP Awan said that the army took departmental action for negligence in the Jinnah House attack.\n\n“Three senior officers were retired without pension and benefits, including a lieutenant general, a brigadier and a lieutenant colonel,” he said.\n\n“Dissatisfaction was expressed with the performance of 14 officers, dislike and distrust mean that they cannot get any further promotion,” the AGP said.\n\nTo this, Justice Mandokhail asked whether the army had initiated criminal proceedings against any army officer.\n\nThe attorney general said that criminal action would have been taken only when a crime had been committed, noting that departmental action had been taken for not stopping the incidents of May 9.\n\n“The Army Act is clear that departmental action will also be accompanied by criminal punishment,” Justice Mandokhail replied.\n\nAGP Awan then said that he would present arguments on May 9, as well as the July 21 decision and appeal.\n\n“There were 23 incidents in Punjab, eight in KP, seven in Sindh and one in Balochistan. General Headquarters, Lahore, Mianwali Air Base, and ISI offices were attacked.\n\n“All the incidents on May 9 were not accidental — the entire corps was inactive from 5:30pm to 9pm. If there was an external aggression on Lahore on May 9, it could not have been responded to,” the AGP said.\n\nJustice Hassan Azhar Rizvi remarked that at the time of Bhutto’s execution, people were making arrests and people set themselves on fire and self-immolated. “No one set property on fire at that time.”\n\nThe attorney general was in agreement, saying that his father himself had faced cases as a political activist yet it never occurred to anyone to damage the property by burning it.\n\nJustice Hilali asked whether the gate of Jinnah House was broken open or if someone had opened it from inside. “If someone opened it from inside, it would be a crime of collusion,” she added.\n\nThe AGP said he would check about it and then apprise the court.\n\nJustice Mandokhail asked whether what happened on May 9 was done with the intention of committing a crime.\n\n“Was the intention to register a protest or to attack? Maybe the intention was to protest but the matter got out of hand. It should not have gone beyond the limit but it did,” Justice Mandokhail said.\n\n“What happened on May 9 was a crime,” AGP Awan asserted.\n\nHere, Justice Afghan told the attorney general that he had gone down the wrong path.\n\n“We did not allow anyone to talk about the merits of the May 9 incident. Talking about the merits will affect the cases in the trial and appeal. If we go into the details of May 9, many questions will arise.\n\n“Many questions arise that you may not be able to answer, such as whether the general who retired without pension was the Lahore Corps Commander,” Justice Afghan said.\n\nAGP Awan responded in the affirmative that a Lahore Corps Commander was retired without pension benefits. When asked if the Lahore Corps Commander appeared as a witness before the trial court, the attorney general said the court would find out once the appeal is filed.\n\nThe state lawyer then asserted that he was not debating on the “merits of May 9” events but answering the questions raised.\n\nAt this point, Justice Mandokhail and Justice Hilali remarked that they were asking questions important for the country’s future. Upon Justice Hilali asking how many times the Army Act had been amended, AGP Awan replied that changes had been made to it “multiple times”.\n\n“Amending the Constitution is a difficult task but the 26th Amendment was introduced. Why was the Army Act not amended? What is in the Official Secrets Act that even easy amendments are not introduced in it?” Justice Hilali asked.\n\nAGP Awan then informed the court that so far, 86 individuals have filed appeals against their military court convictions. “Others will be given time to file an appeal,” he added.\n\nUpon the attorney general saying that out of 45 minutes he had sought for arguments, he had allotted 20 minutes for Justice Mandokhail’s queries, the judge said: “I have no issue of my own. I am [only] thinking of the country’s future.”\n\nHere, the AGP requested the bench to include an “observation” in its final ruling on the right to appeal of the convicted persons.\n\nHe recalled that there was a previous SC ruling advising the parliament to legislate to allow the extension in an army chief’s tenure. Justice Mazhar then pointed out that in that particular case, the parliament was given clear directions to enact the legislation within six months.\n\n“Once a law is nullified, then the question of appeal does not arise,” Justice Aminuddin observed.\n\nAt this point during the hearing, Niazi came to the rostrum, saying he wanted to speak for five minutes.\n\nHe said: “My son Hassaan Niazi was sentenced to 10 years in prison. It was upsetting to hear praises that [defence ministry’s lawyer] Khawaja Harris did of military courts.\n\n“Whoever violated a law should be punished,” Niazi added, recalling that the Prime Minister House, Parliament House and a radio station’s building were “attacked by mobs” in 2014.\n\n“There was a plan to force the prime minister out of the PM House [but] those cases were heard in civilian courts,” Niazi contended.\n\nHe further argued that the crimes of the May 9 riots “could not be greater than a foreign conspiracy”. “We should have faith in our Supreme Court and civil courts,” the PTI activist’s father said, stating he wanted to see the rule of law in his country during his life.\n\nWhen Niazi mentioned some Indian media reports on Kot Lakhpat jail where his son is imprisoned, Justice Hilali then assured Niazi: “Do not worry. Nothing of the sort will happen.”\n\nJustice Mandokhail asserted, “Our (Pakistan’s) defence is strong.”\n\nOn Dec 13, 2024, the SC’s constitutional bench conditionally allowed military courts to pronounce reserved verdicts of 85 civilians who were in custody for their alleged involvement in the May 9 riots.\n\nSubsequently, on December 21, military courts sentenced 25 civilians to prison terms ranging from two to 10 years for their involvement. Days later, another 60 civilians were handed jail terms of a similar period over the matter.\n\nOn January 2, the mercy petitions of 19 accused were accepted on humanitarian grounds, while 48 other pleas have been processed to Courts of Appeal.\n\nThe sentencing of civilians by military courts was not only condemned by the PTI, but the United States, the United Kingdom and the European Union also raised concerns, saying the move contradicted international laws.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/0520302297ef43f.png",
  "retrievedAt": "2025-08-23T08:15:25.426Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908609/may-9-riots-sc-reserves-verdict-on-military-trials-case-will-announce-decision-this-week",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T14:06:51.000Z"
}
