{
  "title": "CORPORATE WINDOW: Abandoning a legacy treaty - Business - DAWN.COM",
  "author": null,
  "content": "Even though there exists no provision for the unilateral abrogation or suspension of the Indus Water Treaty (IWT), India’s decision to “hold in abeyance” the 64-year-old water-sharing pact in the wake of a militant attack in the tourist destination of Pahalgam in the Occupied Kashmir shows that it is ready to go the extra mile to choke the lifeline water flows to Pakistan.\n\nIn doing so, New Delhi has also chosen to ignore warnings from its own experts that such an arbitrary step risks threatening regional stability by having ripple effects on water cooperation within the wider Indus River basin shared by India, Pakistan, China and Afghanistan, besides causing it reputational loss and damaging its image as a responsible nation.\n\nThis is not the first attempt by India to exit the treaty brokered by the World Bank in 1960 or try to force Pakistan to agree to modify it. Since the 2016 armed attack on an Indian army brigade headquarters in Uri, India has consistently tried to weaken the IWT in an attempt to wiggle out of it.\n\nPractically, the treaty has remained interrupted for the past three years to the extent of the suspension of the meetings of the Permanent Indus Commission, a joint forum comprising experts from India and Pakistan created under the treaty to tackle disputes regarding the sharing of the waters at the bilateral level before invoking other dispute resolution mechanisms. The exchange of flood and other technical information has also been downgraded.\n\nWhatever legal remedies are available to Pakistan under the provisions of the relevant international laws, the battle for its water rights is sure to be a long and tedious one\n\nThe commissioners from the two sides are required by the treaty to meet at least once every year, alternately in India and Pakistan. Following up on the suspension of the mandatory Commission meetings, India has twice served notices — first in January 2023 and the second in September 2024 — to Pakistan to “renegotiate” the terms of the treaty, citing fundamental and unforeseen changes in circumstances like demographic shifts, climate change, implementation challenges, etc.\n\nUnder international law, particularly the Vienna Convention on the Law of Treaties 1969, changes of circumstances are not recognised as grounds for terminating or suspending treaties. If India unilaterally revokes the treaty, it would jeopardise other major transboundary water agreements. Once a precedent is set, according to one commentator, it becomes easier for other players to follow it without much difficulty.\n\nEven though India has allegedly harboured a desire to abrogate the IWT for quite some time, the Permanent Indus Commission’s meetings were suspended and notices served to Islamabad for the reassessment of the pact in the wake of Pakistan’s opposition to the Ratle project and the ongoing dispute over Kishanganga’s design.\n\nThe treaty allows the upper riparian to build “run-of-the-river” hydroelectric projects on the Western rivers — Indus, Jhelum, and Chenab — accounting for 80 per cent of the Indus Basin’s total flows, provided they do not impound or divert the river waters through the construction of significant storage infrastructure. But disputes have emerged between the two countries over the size of the reservoirs, as well as project designs that Islamabad fears are tweaked to create water storage in violation of the agreement.\n\nExperts believe the suspension of the treaty will allow India to modify existing infrastructure or build new ones to hold back or divert more water without informing Pakistan. Unlike in the past, India will now not be required to share its project documents with Pakistan. Besides, it may alter the seasonal release of water from its reservoirs.\n\n“New Delhi will now flush and refill reservoirs not during the monsoon but in the dry season — from October to February — disrupting Pakistan’s sowing season,” said a note by Islamabad-based think tank Jinnah Institute. And in the long term, India plans to construct and upgrade a cascade of dams along the Indus system, raising fears of both ecological degradation and regional instability.\n\nThe note, however, argues that India cannot cut off water to Pakistan without enormous engineering and environmental adjustments on its side and potentially enormous financial and political costs. Diversion is also unrealistic, as it requires the construction of channels or tunnels over unstable terrain, which risks flooding upstream Indian territories and destroying local ecosystems.\n\nHowever, it says India can very well manipulate seasonal releases or withhold flood data, which will disrupt Pakistan’s crop cycles, increase costs and disturb crop yields downstream, especially during months when water flows are limited. Thus, the most immediate risk is the introduction of uncertainty. “Pakistan’s agricultural and energy systems have been built around predictability that has held for decades. The erosion of treaty protections could undermine those assumptions.”\n\nIt maintains that there is also the risk of inviting retaliatory precedents from other upper riparians. “Weaponising water tarnishes diplomatic capital with neighbours like Nepal, Bhutan and Bangladesh closely watching India’s conduct on shared water systems. If India disregards Pakistan’s rights, it reinforces perceptions that New Delhi is willing to use water as a political tool. This could undermine ongoing and future negotiations over the transboundary Koshi, Teesta and Ganga River systems.\n\n“Becoming the first state in this century to openly weaponise water will carry a major global stigma. Such a move would undercut its claim to regional leadership, open the door to international criticism and invite comparisons India will find difficult to defend.”\n\nPakistan says any attempt to stop or divert the flow of its waters as per the IWT and the usurpation of its rights as a lower riparian is an act of war, with Prime Minister Shehbaz Sharif pledging to respond with full force. A Reuters report quotes Barrister Aqeel Malik, the minister of state for law and justice, as saying that the government was working on plans for at least three different legal options, including raising the issue at the World Bank, which is the treaty’s facilitator, against India over its move to suspend the treaty.\n\nIt is also considering taking action at the Permanent Court of Arbitration or at the International Court of Justice in The Hague, where it could argue that India has violated the 1969 Vienna Convention on the Law of Treaties, he said. “Legal strategy consultations are almost complete,” Barrister Malik said, adding that a decision on which cases to pursue would be made “soon” and would likely include pursuing more than one avenue.\n\nHe added that Islamabad was considering a fourth diplomatic option to raise the issue at the United Nations Security Council. Whatever legal remedies are available to Pakistan under the treaty’s provisions and the relevant international laws, the battle for the preservation of the IWT and its water rights will be a very long and tedious one for the country. And it will mostly be fought in diplomatic circles.\n\nPublished in Dawn, The Business and Finance Weekly, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/68180a5998ef6.gif",
  "retrievedAt": "2025-10-12T02:54:09.657Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908564/corporate-window-abandoning-a-legacy-treaty",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:49:36.000Z"
}
