{
  "title": "Govt, KWSC earn opposition ire over Karachi water crisis - Pakistan - DAWN.COM",
  "author": null,
  "content": "• KWSC claims repair work on 84-inch main completed, water supply to be restored today\n• JI, MQM-P demand accountability as city experiences its sixth pipeline rupture in five months\n\nKARACHI: As Karachi Water and Sewerage Corporation (KWSC) on Sunday claimed to have repaired the damaged 84-inch pipeline that kept one-third of the city deprived of water, opposition parties held the Sindh government responsible for “criminal negligence” for failing to maintain the basic infrastructure.\n\nThe leaders of the Jamaat-i-Islami and Muttahida Qaumi Movement-Pakistan also questioned the mechanism of accountability in the KWSC, which had not yet come up with any authentic report explaining reasons for the damage occurred last Tuesday.\n\nThey said it was the sixth incident of pipe burst over past five months in the metropolis.\n\nAdvocate Saifuddin, the leader of the opposition in the City Council, visited Karachi University to inspect the area affected by the leakage of the 84-inch pipeline.\n\nThe JI leader was accompanied by several elected representatives of the local government.\n\nOn the occasion, Bulk Supply Executive Engineer Zafar Palejo briefed the JI leaders about the water supply line, it’s leakage and repair work.\n\nMr Saifuddin was told that the 50-year-old water supply line had become rusted and that the Sindh government had already been updated about the situation.\n\nSpeaking to journalists, the opposition leader said that the Pakistan Peoples Party government was continuously ignoring Karachi and its long-standing problems.\n\n“The PPP has been ruling over the province for the past 50 years, and consecutively for the past 17 years, but it never took any drastic step to bring any positive change to the mega city,” he said.\n\n“The self-imposed mayor and his accomplices have ruined the entire local government department. It is the criminal negligence on the part of the authorities that despite repeated warnings from experts and reports of different consultants to replace the old lines with new ones, they did not pay any heed and today Karachiites are paying the price.”\n\nHe also visited several departments of the university and interacted with faculty members.\n\nHe was told that the leaked water had caused losses to the university worth tens of millions of rupees.\n\nCrisis in KU, Gulshan Town\n\nMeanwhile, chairman of Gulshan Town Dr Fuad Ahmed told Dawn that the pipeline damage had not only deprived more than half of his town of water, but also ruined Karachi University.\n\n“I have tried to bring a team of Provincial Disaster Management Authority to handle the situation at the university but in vain,” he said. “On one hand we are unable to answer the people about the time and again damages to this line and on the other academic activities of thousands of students are at risk. We have learnt that some four years ago consultants and experts in their reports have told the authorities to replace this line but the authorities’ criminal silence and negligence invited this crisis.”\n\nMQM-P slams KWSC performance\n\nIn a statement, the MQM-P expressed deep concern over the severe water shortage in Karachi, stating that the Sindh government had taken over the city institutions and destroyed each one of them.\n\n“The performance of the organisation responsible for supplying water to a city of over 30 million residents is utterly dismal,” the party’s Central Committee said in the statement.\n\n“The failure of the KWSC is affecting the entire city, where any maintenance issue results in days-long water outages. In many areas, citizens are deprived of drinking water and are suffering from mental distress. The MQM-P demanded immediate repair and restoration of water supply across Karachi.\n\n“The qualified and competent professionals must be employed to ensure water supply in Pakistan’s highest tax-paying city.”\n\nAccording to the party’s Central Committee, the Karachi Water and Sewerage Corporation has “become a hub of corruption from top to bottom” and there is an urgent need to recruit skilled and professional individuals in the organisation.\n\nWater supply resumption\n\nMeanwhile, the KWSC officials said that the repair work on the 84-inch pipeline passing through the university of Karachi had been completed.\n\n“The water supply through the pipeline will be resumed at 10pm [Sunday] and by Monday evening, water supply in the city is expected to begin returning to normal,” said an official.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:15:43.779Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908472/govt-kwsc-earn-opposition-ire-over-karachi-water-crisis",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:41.000Z"
}
