{
  "title": "Survey, alignment of new road finalised to link Margalla Avenue with motorway - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The survey and alignment of a new road has been finalised to link Margalla Avenue with the Islamabad-Peshawar Motorway (M-1), sources revealed on Sunday.\n\nAround 181 kanals of land will be acquired for the project, they said.\n\nOut of the total 3.4 km stretch of the road, 1.8 km falls in Rawalpindi and 1.6 km in Islamabad, which will be constructed by the Capital Development Authority (CDA).\n\nSources said that the process of alignment of the road was completed in the past too, but the new alignment was conducted to avoid damaging houses.\n\nThey also said that the ICT Revenue Department, in collaboration with CDA’s land directorate, completed the pre-award acquisition process and soon the relevant authority will announce the compensation rate.\n\nOnce started, construction work on the project will be completed in eight months\n\nConsequently, CDA’s engineering wing will be given the go-ahead to start this project.\n\nOut of 181 kanal, 51 kanal falls in the revenue estate of Sangjani, which fully falls in Islamabad and 130 kanal falls in the revenue estate of Badana Kurd, which mostly falls in Rawalpindi.\n\nCDA’s Member Engineering Syed Nafasat Raza said the new road would be constructed to get a maximum benefit from Margalla Avenue. “Currently, work related to land acquisition is in progress. As soon as it completes, we will take steps to start construction work,” he told Dawn.\n\nIt is relevant to note here, CDA had approved the said project worth Rs5.45 billion (construction and land acquisition) in August 2023.\n\nAccording to a working paper of the CDA, the maximum benefit from Margalla Avenue cannot be achieved until the road is linked to M-1.\n\nThe project comprises a six-lane road facility and aims at providing an alternative route for commuters travelling to Islamabad from GT Road (N-5) and vice versa.\n\nOnce started, work on the project would be completed in eight months.\n\nIn 2021, the then prime minister Imran Khan had directed the CDA to develop the road that fell within the limits of Islamabad, whereas the Rawalpindi Development Authority (RDA) was asked to carry out work on the portion that fell in their jurisdiction.\n\nHowever, the following PDM government tasked the NHA to construct the road falling in Rawalpindi.\n\nThe Margalla Avenue, which starts at E-11 and extends to GT Road in Sangjani, will be linked with the new portion of the five-km-long road. Originally, as per the master plan of Islamabad, the Margalla Avenue starts from Murree Road near Bhara Kahu to end at GT Road while passing through the foothills of Margalla.\n\nHowever, currently, it starts at E-11 and another road, which is originally a service road (Khayban-i-Iqbal) passes through sectors F-5, F-6, F-7, F-8, F-9 and F-10 up to E-11.\n\nIn fact, the original Margalla Avenue, which is supposed to be constructed at the foothills of Margalla is not constructed yet from F-5 to E-11.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:53:38.387Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908450/survey-alignment-of-new-road-finalised-to-link-margalla-avenue-with-motorway",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:57.000Z"
}
