{
  "title": "After USAID - Newspaper - DAWN.COM",
  "author": null,
  "content": "WHEN I started writing my book, The Shady Economics of International Aid, in 2023, I never anticipated that some of the issues I explored would surface so powerfully even before its release in 2025.\n\nOn his first day in office in January 2025, President Donald Trump signed an executive order freezing all USAID and State Depart­ment programmes for 90 days. Subsequently, several statements came directly from President Trump and senior officials citing numerous USAID-funded projects across countries that were labelled as ‘waste’, ‘abuse’, and ‘fraud’. In reference to Pakistan, Congressman Scott Perry alleged that USAID spent $840 million on education-related programmes in the last 20 years, including $136m to build 120 schools. He stated that there is zero evidence any single school was actually built. These revelations are startling and need to be substantiated.\n\nPrima facie, the Trump administration’s allegations and its frustration with USAID seem plausible. The ‘insane’ priorities in some countries, including the multimillion-dollar funding for LGBT advocacy, sex changes, and media organisations, do not align with the professed objectives of international aid; ie, poverty alleviation or bro­ad­­er economic development. The decision, however, impacted activities worldwide totalling about $42 billion in 157 countries for over 6,100 activities covering all sectors. Those directly affected, particularly more than 10,000 USAID staff working all over the world, strongly criticised the decision. Six weeks into its suspension, Secretary of State Marco Rubio declared they were cancelling 83 per cent of USAID programmes. The surviving approximately 1,000 programmes will now be administered under the Department of State.\n\nWe don’t know how events will ultimately unfold in the US as legal battles are still ongoing. However, as things stand, the USAID has been dismantled and US aid to developing countries will be reduced substantially. The US isn’t the first country to shut down its international aid agency. In June 2020, Boris Johnson, the UK’s then prime minister, used budget-tightening as a ground to effectively close the DFID — Britain’s equivalent of USAID — and merged it with the Foreign and Commonwealth Office.\n\nFollowing the USAID fiasco, UK Prime Minister Keir Starmer has announced the UK would increase spending on defence by cutting its aid budget from 0.5pc of gross national income to 0.3pc, much lower than the UN’s 0.7pc aid target. The UK aid budget is now at its lowest in decades. The UK is not alone — France and Germany have also cut aid budgets in recent years.\n\nThe demise of USAID could present developing nations with an opportunity to reduce aid dependency.\n\nFor recipient countries, these disruptions are unlikely to have any major sociopolitical or economic consequences. For instance, Pakistan will not experience a significant financial squeeze. In 2023, USAID committed only $132.6m across various sectors. This funding was reduced to $116m in 2024, primarily due to a decline in humanitarian assistance. These funding levels are negligible relative to the size of Pakistan’s $375bn economy. The same holds true for most African countries, where USAID’s spending is minimal. Nevertheless, the aid that actually reaches intended beneficiaries is only a small fraction of overall disbursement figures.\n\nSo, will these aid cuts have any significant impact on the developing countries’ overall economic growth? Research studies provide little convincing evidence of a positive relationship between economic growth and the volume of aid received. However, the situation could potentially change if the US also withdraws from the IMF, World Bank, and other multilateral development banks. Such decisions seem unlikely; however, if taken, they would be bad for the US. By abandoning the IMF and the World Bank, the US would surrender a key source of global influence and economic leverage.\n\nThe US has long maintained tight control over these institutions, shaping their policies and leadership to align with its own national interests. It has consistently appointed the World Bank’s president, approved Europe’s choice to lead the IMF, and selected the Fund’s first deputy managing director. Moreover, it remains the only country with the power to unilaterally block major decisions, as both institutions require an 85pc majority for approval.\n\nThe US also uses IMF as a ‘first responder’ to safeguard its economy and uses the World Bank to strengthen security and economic alliances and support postwar reconstruction in countries like Iraq and Afghanistan. Even so, the actual cost of US participation in these institutions is far lower than often assumed. Each year, the US Treasury assesses the financial impact of its contributions to the IMF; in 2023, it reported an unrealised gain of $407m.\n\nEven if the US pulls out from the multilateral organisations, other countries will save the multilateral system. They may be alarmed, but they are not powerless. In doing so, however, the US would forfeit vital tools for supporting its allies and withholding financing from its adversaries.\n\nAlso, Western countries’ retreat from aid will leave an obvious opening for other powers to inc­rease influence in developing nations. China continues to signal investment commitments in Afri­­ca. At the 2024 Forum on China-Africa Coope­ra­tion, it pledged $51bn over three years in loans and traditional aid. The Gulf states are also incr­easing aid, largely in strategically important regions.\n\nIn principle, the demise of 63-year-old USAID, while difficult for many people, could present developing nations with an opportunity to reduce aid dependency and achieve sustainable economic growth. Sometimes good things can come from adversity. Over time, as the system stabilises, donor agencies may become more accountable to the taxpayers who fund them.\n\nClearly, international aid is a broken system desperately in need of fundamental reforms, both within donor agencies and recipient nations. The mismanagement of aid is pervasive and extends be­­­yond USAID. Donor agencies — funded by taxpayer dollars — are fraught with issues ranging from resource misallocation and misutilisation to a glaring lack of accountability for failed prog­r­a­m­mes. The USAID review has also exposed the high-handed culture prevalent within donor agencies, and should prompt other countries to scrutinise the operations of their own aid organisations.\n\nThe writer is a former senior adviser of the IMF and has a PhD in economics from the University of Cambridge.\n\ndr.saeedahmed1@hotmail.com\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681802a51a89b.png",
  "retrievedAt": "2025-08-23T08:15:27.507Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908547",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:27:26.000Z"
}
