{
  "title": "Building density, street networks affect intensity of Karachi flooding - Pakistan - DAWN.COM",
  "author": null,
  "content": "• To control urban flooding, city administration should set up urban forests, green roofs, permeable pavements\n\nUN Secretary-General António Guterres has described the fight against the climate crisis as the top priority for the 21st Century. The state of the planet is broken. It’s time to make peace with nature, he said. He has rightly said so, because 2024 was the first full year to surpass 1.5 degrees Celsius above pre-industrial levels (pre-industrial era is 1720 to 1800; some says it is 1850-1900; other says it is 1880-1899). The world has warmed approximately 1°C since 1970; and 1.2°C to 1.4°C since the mid-1800s.\n\nA host of environmental problems have been created by the climate change. These include water scarcity, air pollution, making malaria a climate-sensitive and difficult to control disease, psychological harm, wildfires and smoke, poverty, and increased insect population.\n\nA major problem, associated with climate change is flooding in cities. Floods are a natural occurrence. Climate change is making severe flooding events more common and destructive.\n\nKarachi gets flooded even by moderate rainfall. The city administration concentrates on storm water drains, as a means for flood management. Since the drains are open, they are filled with solid waste. When it rains, the water has nowhere to go, causing flooding. In many situations around Karachi, the waste bins are located close to the drains, contributing garbage in the drains.\n\nThere are a number of areas in the city, where storm water drains stand in isolation, where rainwater has nowhere to go. As a result, water stands for days. These spots include Gurumandir, Saddar, Shaheen Complex, Karsaz, Nursery, Civic Centre, NIPA, Karimabad, Liaquatabad and Rashid Minhas Road. During 1992 rain, Bath Island and Clifton Block 9 had knee-deep water standing for several days.\n\nThe September 2024 floods in Nepal, which claimed lives of 244 people, have lessons for Karachi. Urbanisation in developing countries doubled from less than 25pc in 1970 to more than 50pc in 2006.\n\nAccording to the World Weather Attribution, rapid urbanisation (386pc increase in built-up areas between 1990-2020) and deforestation (28pc reduction in forest cover from 1989-2019) and climate change were the key drivers of dramatic flood impacts in Nepal. A rapid attribution analysis concluded that such a rainfall event is approximately 70pc likely due to climate change. Urbanisation and climate change created heavy rainfall that battered Nepal for three days.\n\nWhether it is the destruction from the Los Angeles fires, Cyclone Chido in Mayotte, floods in Valencia, or floods in Karachi, it is essential that the adaptation measures need to be put in place.\n\nThe director of Europe’s Copernicus Climate Change Service, Carlo Buontempo, said recently, “Our traditional system to cope with and respond to extreme climate events is being tested to the limits. This is why adaptation is no longer an option — but a necessity.’\n\nKarachi administration should consider nature-based solutions (NbS) for flood control. The UN defines NbS as “actions to protect, conserve, restore, sustainably use and manage natural or modified terrestrial, freshwater, coastal and marine ecosystems”. The European Commission (EC) defines NbS as “solutions that are inspired and supported by nature, which are cost-effective, simultaneously provide environmental, social and economic benefits and help build resilience”.\n\nThere are a number of NbS insights available. These include urban green spaces, planting trees, urban parks, green roofs, retention ponds, permeable pavements, wetlands, mangroves and river conservation.\n\nA number of cities have adopted NbS initiatives. Examples are green roofs in New York; urban forests, and permeable pavements in Portland, Oregon; naturalised riverbanks in Seoul, South Korea; constructed wetlands in Rotterdam, Netherlands; green roofs, and storm water management in Singapore; and rain gardens in Chicago.\n\nIn Bangkok, a 43-year-old Thai landscape architect Kotchakorn Voraakhom has created a public park designed to withstand frequent flooding. Called Chulalongkorn University Centenary Park, the 11-acre park can hold up to one million gallons of rainwater.\n\nChinese sponge cities absorb water and release it slowly into lakes and rivers, helping to prevent flooding. Sponge cities are able to soak up excess water. Karachi Mayor Murtaza Wahab should consider visiting Bangkok, and some Chinese cities, to see these excellent initiatives.\n\nFlooding is strongly influenced by the urban forms (the physical characteristics and layout of a city, including its size, shape, and the arrangement of buildings, streets, and other infrastructure). Karachi administration has completely neglected this aspect. Urban flooding occurs when city landscapes cannot absorb excess water after prolonged spells of intense rainfall.\n\nNew research from the University of California, Irvine, suggests that urban form, specifically the building density and street network of a neighbourhood affect the intensity of flooding. Research to date suggests that the configuration of urban forms has the potential to alter the patterns and severity of flooding substantially. California research has identified two parameters: porosity of city (space available for floodwater to move), and chord length (how far water can move downhill before encountering an obstruction in the city), which has the potential to influence the flooding. The research predicts deeper flooding with denser cities, and shallower flooding with longer chord lengths which enable the acceleration of flow.\n\nIronically, the California research has mentioned Karachi, saying cities with high densities and longer urban chord lengths promote both relatively deep flooding and fast-moving floods. It has included Tokyo, Lagos, Jakarta, Karachi and Sao Paulo, which exhibit a very low porosity and mild slope.\n\nChicago, Miami and Houston emerge as cities susceptible to deep flooding due to building density and mild slopes, and San Francisco emerges as a city vulnerable to shallow but fast flooding due to steep slopes. On the other hand, Seattle emerges as a city with relatively low flood hazard based on its intermediate building density and slopes.\n\nManaging floods go beyond the traditional approaches of flood defences upgradation and drainage systems. It includes nature-based insights and urban forms.\n\nThe writer earned his master’s degree in environmental engineering, from the Asian Institute of Technology, Bangkok, in 1975.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:15:44.528Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908475/building-density-street-networks-affect-intensity-of-karachi-flooding",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:41.000Z"
}
