{
  "title": "Cotton prices witness surge, courtesy international market - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: After a hiatus of nearly two months, cotton prices in the country have witnessed a significant upswing, accompanied by a renewed purchasing interest from textile mills.\n\nThis development has brought relief to cotton ginners are grappling with a prolonged period of low demand and declining prices.\n\nThe recent slump in local cotton prices was primarily due to record imports of sales tax-free cotton, cotton yarn and grey cloth under the Export Facilitation Scheme (EFS). This influx of imported material severely hampered local cotton sales, pushing numerous ginning factories and textile mills towards inactivity due to a severe financial crunch.\n\nHowever, the tide seems to have turned in the past week. Reports of restored trade relations between China and the United States, coupled with a sharp decline in the US Dollar Index, triggered a substantial surge in cotton prices in international markets. Notably, the New York Cotton Exchange saw its July futures contract jump by a record 2.75 cents per pound in a single day, reaching a multi-month high of 68.41 cents per pound.\n\nThe upward trend is expected to continue this week, subsequently impacting domestic prices.\n\nIn Pakistan, this global rally has translated into a price increase of approximately Rs500 per maund (40kg), bringing the current cotton price to around Rs17,500 per maund. The renewed buying interest from textile mills has instilled a sense of optimism among cotton ginners.\n\nMeanwhile, despite a consistent failure to achieve cotton cultivation and production targets in recent years, the Federal Committee on Agriculture (FCA) has, once again, set an ambitious and seemingly unattainable production target of 10.18 million bales for the Cotton Year 2025-26. For the first time, however, the FCA has not yet specified the production targets for individual provinces.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:54:15.154Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908493/cotton-prices-witness-surge-courtesy-international-market",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:52.000Z"
}
