{
  "title": "Navigating timelines in tariff trade talks - Business - DAWN.COM",
  "author": null,
  "content": "The United States, according to media reports, is facing significant challenges in securing so many trade deals within a short span of 90 days during which reciprocal tariffs have to be set.\n\nWhile the markets wait for trade negotiations with 90 countries at the same time, global trading is grinding to a standstill with problems similar to what we saw during Covid-19, writes Chief Economist at investment firm Apollo Global Management, Torsten Slok, online.\n\nMr Slok recalled that, on average, trade deals signed by the United States have taken 18 months to negotiate and 45 months to implement. Towards the end of April, according to the White House press secretary, the Trump administration had received 18 proposals on paper, and the US trade team was meeting with the officials of 34 countries in a single week.\n\nFederal Finance Minister Muhammad Aurangzeb said recently that following President Trump’s ann­ouncement of new tariffs, Pak­istan’s ambassador in Washing­ton contacted the United States Trade Representative the very next day. “Now a delegation will come for formal talks. The date of the visit will be decided after I return to Islamabad,” he added.\n\nFinance minister emphasises that addressing the trade imbalance with the US is more important than the Trump administration’s proposed tariffs\n\nAnalysts expect the US to give priority to negotiations for trade deals with countries such as China, where major amounts of US deficits are involved to draw maximum benefits. Negotiations with China had not started by the time this piece was written.\n\nPakistan is eager to strengthen the business relationship with the United States while also seeking ways to address the existing trade imbalance between the two countries, says the finance minister.\n\nExplaining Islamabad’s priorities, Mr Aurangzeb emphasised that addressing the trade imbalance with the US was more important for Pakistan than the Trump administration’s proposed tariffs. He noted that President Trump was determined to boost US exports to trading partners as part of his broader trade agenda.\n\nOn average, trade deals signed by the US have taken 18 months to negotiate and 45 months to implement\n\nCurrently, Pakistan’s exports of goods to the US are approximately $5.2 billion, while imports stand at around $2bn, creating a surplus of about $3.2bn in Pakistan’s favour. “We are looking at the possibility of addressing this imbalance by importing more goods such as American cotton and soybeans,” he said.\n\nWhile there is near national consensus that Pakistan needs to develop a productive economic relationship with the United States in view of its current external sector vulnerability, there seems to be a lack of clarity on how to go about just that. Pakistan has reduced its public debt-to-GDP ratio from 75 per cent to 67.2pc, says the finance minister, adding that the country planned to bring it below 60pc over the medium term via “prudent fiscal management, enhanced domestic financing, and tax reforms”.\n\nTo quote a Business Recorder editorial, increasing imports of goods like soybeans, cotton, and crude oil from the US could be costly for importers and consumers alike, either due to the US’s lack of price competitiveness or higher freight costs.\n\nEven with these measures, the core issues remain unaddressed. US policy documents explicitly highlight Pakistan’s non-tariff barriers and other irregularities, such as inconsistencies in customs valuation. There are also technical barriers to trade, for example, the implications of SRO 237 on bulk food items. The genetically modified soybean issue during the caretaker government’s tenure was a needless mess. These are difficult times, and it is better to proceed with caution rather than unwarranted optimism.\n\nDambisa Moyo, co-principal of family-owned Versaca Investments, which focuses on growth investing globally, advises investors to prepare for crisis scenarios where conventional risk management strategies do not work. Interestingly, Prime Minister Shehbaz Sharif reaffirmed Pakistan’s commitment to becoming the next major tech destination on April 29 in light of the $700 million pledged in foreign investments at the Digital Foreign Direct Investment Conference in Islamabad for the information technology sector.\n\nMr Aurangzeb said that Pakistan had reached “a pivotal economic recovery” as he outlined the government’s key achievements during a conference at Harvard University in the US, according to a report by the Associated Press of Pakistan. The 2025 conference about Pakistan, titled “Bridging Divides, Building Tomorrow: Pakistan’s Path to Inclusive Growth and Governance”, is an annual Harvard event — the largest student-led conference on Pakistan in the United States — aimed at discussing the political, economic and social trajectory of the country. The forum brings together policymakers, business leaders, academics and students.\n\nPakistan also needs to be prepared for a possible global economic recession. With fears that US tariffs would make products more expensive and possibly tip the US economy into recession, some consumers say they are cutting back on spending across a wide range of items, according to a report in The New York Times. Instead of shopping lists, they are making ‘No Buy Lists’. Similarly, small businesses in the US complain that “everything is stuck and no one knows what to do”.\n\nTrump’s tariffs and attacks on the Federal Reserve will make it difficult for the world to sidestep recession, says American economist Stephen Samuel Roach, a senior fellow at Yale University’s Jackson Institute for Global Affairs. Meanwhile, Jeffrey Frankel, Professor of Capital Formation and Growth at Harvard University’s Kennedy School, puts the odds of a prolonged US downturn as high as 60pc for the coming year.\n\nPublished in Dawn, The Business and Finance Weekly, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:53:38.468Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908562/navigating-timelines-in-tariff-trade-talks",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:49:36.000Z"
}
