{
  "title": "ADB boosts Asia-Pacific food security fund to $40 billion - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Asian Development Bank (ADB) announced on Sunday it plans to expand its support for long-term food and nutrition security in Asia and the Pacific by $26 billion, increasing its total funding commitment for such initiatives to $40bn over the 2022-2030 period.\n\nADB President Masato Kanda announced the new target during the bank’s annual meeting in Milan, Italy. The expansion builds on the ADB’s September 2022 pledge to provide $14bn by 2025 to ease a worsening food crisis in the region and improve long-term food security.\n\nBy the end of 2024, the ADB had committed $11bn — about 80 per cent of the original allocation — with an additional $3.3bn programmed for 2025, the bank said.\n\n“Unprecedented droughts, floods, extreme heat, and degraded natural resources are undermining agricultural production, while at the same time threatening food security and rural livelihoods,” Mr Kanda said.\n\nMove aims to counter growing threats to food production from climate change impacts and resource degradation\n\nThe assistance will fund a programme covering the entire food production process, from farming and processing to distribution and consumption. Through financing and policy support for governments and companies, the programme aims to help the region generate diverse and nutritious food, create jobs, reduce environmental impacts and promote resilient agricultural supply chains.\n\nThe additional $26bn announced on Sunday will include $18.5bn in direct ADB support for governments and $7.5bn in private sector investments. The ADB aims for private sector investments to account for more than 27pc of the total $40bn programme by 2030.\n\nThe programme will work to modernize agricultural value chains to improve access to affordable and healthy food, especially for vulnerable populations. It will also invest in improving soil quality and conserving biodiversity, which the ADB noted are essential for productive agriculture but increasingly threatened by climate change, pollution, and habitat loss. Support for digital technology and analytics aims to improve decision-making for farmers, agribusinesses and policymakers.\n\nMore than half of the world’s undernourished people live in developing Asia, according to the ADB. Food systems account for 70pc of global water use, 50pc of habitable land, and 80pc of biodiversity loss, while employing 40pc of the region’s workforce, the bank said.\n\nTo aid the effort, the ADB is establishing the Natural Capital Fund, a planned $150 million blended finance vehicle. It has anchor support from the Global Environment Facility and expects contributions from other partners, including the Global Agriculture and Food Security Programme. This fund will support projects by farmers and innovators focused on sustainable natural capital management.\n\nFood insecurity threatens to reverse decades of development progress in the region, where the ADB estimates nearly 1.1bn people lacked healthy diets due to poverty and high food prices, which soared in 2022.\n\nGlobal agrifood systems generate hidden environmental, social and health costs estimated at $13 trillion in 2023, or 10pc of global GDP, according to the Food System Economics Commission. These costs stem from emissions, land-use changes, water depletion, poverty among workers and diet-related health issues.\n\nThe commission noted that productivity losses from poor diets rose 14pc globally since 2016, with South Asia seeing a 20pc increase, highlighting the need for reforms beyond traditional production-focused strategies.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:54:12.400Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908452/adb-boosts-asia-pacific-food-security-fund-to-40-billion",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:09.000Z"
}
