{
  "title": "Trump may extend TikTok deadline for deal - World - DAWN.COM",
  "author": null,
  "content": "WEST BEACH: US President Donald Trump said he would extend the June 19 deadline for China-based ByteDance to divest the US assets of TikTok, the short video app used by 170 million Americans, if no deal had been reached by then.\n\n“I would … I’d like to see it done,” Trump told the NBC News programme “Meet the Press with Kristen Welker” in an interview taped on Friday at Trump’s Mar-a-Lago estate in Palm Beach, Florida, that is airing across the US on Sunday.\n\nTrump said he had a “sweet spot” for the app after it helped him win over young voters in the 2024 presidential election, adding, “TikTok is — it’s very interesting, but it will be protected”. Trump has already twice granted a reprieve from enforcement of a congressionally mandated ban on TikTok that was initially due to take effect in January.\n\nA deal had been in the works that would spin off TikTok’s US operations into a new firm based in the United States and majority-owned and operated by US investors but it was put on hold after China indicated it would not approve it following Trump’s announcements of steep tariffs on Chinese goods.\n\nDemocratic senators argue that Trump has no legal authority to extend the deadline, and suggest that the deal that had been under consideration would not meet legal requirements.\n\nOne source close to ByteDance’s US investors said last month that work on the prospective deal continues ahead of the June 19 deadline, but the White House and Beijing would need to resolve the tariff dispute first.\n\nTrump told NBC News that China was keen to reach an agreement, citing the impact that 145 per cent tariffs on Chinese goods were having on its economy.\n\nThe law required TikTok to stop operating by January 19 unless ByteDance had completed a divestiture of the app’s US assets. Trump began his second term as president on Jan 20 and opted not to enforce it. He first extended the deadline to early April, and then again last month to June 19.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:54:29.282Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908453/trump-may-extend-tiktok-deadline-for-deal",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:09.000Z"
}
