{
  "title": "Perilous hour - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE latest crisis in India-Pakistan relations is the fifth in the past 25 years.\n\nEach crisis has been more complex and involved dangerous ramifications, which made it hard even when tensions eased to put ties back on track and return to any ‘normalcy’. Protracted periods of diplomatic disengagement followed these crises. The bilateral impasse only deepened as, when suspended, formal dialogue was difficult to resume. Little wonder that a once promising peace process advanced through what was called the ‘composite dialogue’ was never revived since it was halted over 12 years ago.\n\nThe ongoing crisis has already plunged relations between the nuclear neighbours into a vortex of dangerous confrontation. Tit-for-tat diplomatic measures by both sides, initiated by India, have gone much further than actions taken in past crises. India’s suspension of the Indus Waters Treaty weaponises water and has far-reaching im­­plications even if its immediate impact is limited. Exchange of small-arms fire continues along the Line of Control. The Indian Navy has been cond­u­cting long-range missile drills in the Arabian Sea, obliging Pakistan to intensify its naval activities.\n\nPakistani officials claim to have credible intelligence that India is preparing to launch a military strike. Prime Minister Narendra Modi’s statements about inflicting harsh punishment on the attackers and their backers has reinforced the possibility of kinetic action. He has given the army “operational freedom” to decide “the mode, targets and timing” of India’s response to the Pahalgam terrorist attack. War hysteria has also taken hold in India.\n\nThe danger of an impending military confrontation has evoked growing international concern and prompted calls for restraint. The UN secretary general, China, the US, Saudi Arabia and Iran, among others, have urged de-escalation. Historically, the US has had leverage with both countries — and still does — to play a role in defusing crises. It did so from the 1999 Kargil conflict to the last crisis in 2019. This time, contrary to speculation that Washington is too preoccupied elsewhere with other conflicts, it has engaged swiftly with both Islamabad and New Delhi to urge restraint and ask them to re-establish direct communication channels and work together to maintain peace and security.\n\nCan a full-blown crisis between India and Pakistan be averted?\n\nSecretary of State Marco Rubio conveyed this message in phone calls to Prime Minister Shehbaz Sharif and Indian Foreign Minister S. Jaishankar. The same message was delivered by former national security adviser Mike Waltz to army chief Gen Asim Munir and Indian National Security Adviser Ajit Doval, days before Waltz was removed from that post. Calls were also made to DG ISI Gen Asim Malik by CIA director John Ratcliff and director of national intelligence Tulsi Gabbard. Malik was recently appointed national security adviser, sparking speculation this was in preparation for talks later with Doval.\n\nWhether US intervention will dissuade India from embarking on a military course remains to be seen. Indian media reports suggest the Modi government is examining several options that can inflict pain on Pakistan but stop short of triggering a broader conflict, especially as it cannot be sure of how Islamabad will react. For its part, Pakistan has said any kinetic action by India will be met by a “strong and decisive response”. This would heighten the risk of an uncontrolled escalatory cycle with uncertain consequences and outcome. The room for miscalculation and inadvertent escalation by either side will be high in the absence of any communication between them. Messaging through an intermediary — the US — might be helpful but will not eliminate that risk.\n\nThe past is not a perfect guide, as no two situations are ever the same, but it may be instructive to recall what happened the last time around. The February 2019 crisis erupted after a terrorist attack in occupied Kashmir’s Pulwama district, in which 40 Indian security personnel were killed. Blaming Pakistan for the attack, Indian officials warned of a strong response. Twelve days later, Indian Mirage jets crossed the Line of Control to carry out a bombing raid in Balakot, claiming this destroyed ‘terrorist training camps’ and killed militants. Pakistan was to later show that the site of the bombing was a forested area and there were no casualties or damage. Pakistan retaliated by launching Operation Swift Retort entailing air strikes on a military target in Jammu. That too caused little if any damage.\n\nHowever, in an aerial combat an Indian Mig-21 was shot down by Pakistan and its pilot captured. His release became the key point in defusing the crisis when tensions were escalating to a dangerous level. The climax came when Pakistan determined India was about to attack having deployed and pointed nine missiles at Pakistan. This was conveyed by Pakistan’s foreign secretary to key foreign envoys including the US along with the warning that Pakistan will be compelled to retaliate. “For every Indian missile readied, three Pakistani missiles would be ready in response,” according to a former official. India therefore had to be stopped. The US was engaged at the working level with both sides, but this led to more senior-level involvement. Washington had in any case started pressing for restraint after the Indian strike in Balakot. Former secretary of state Mike Pompeo claims in his memoir Never Give An Inch that nuclear escalation became a real possibility as each side thought the other was about to deploy nuclear weapons.\n\nHectic shuttle diplomacy by the US and Pakistan’s effort to de-escalate the situation led to the government’s decision to release the pilot. His release provided an off-ramp from the crisis and helped to defuse it. In his book Anger Management, Ajay Basaria, former Indian high commissioner to Pakistan, claims India’s coercive diplomacy produced this outcome. In a campaign speech later, Modi suggested a ‘qatal ki raat’ (night of murder) was in the offing if the pilot hadn’t been freed. Refuting Basaria’s version, Islamabad attributed the pilot’s release to Pakistan’s “responsible behaviour” in de-escalating the situation while demonstrating its capacity to respond to any security threat.\n\nA combination of fortuitous factors, active third-party intervention and a concrete ‘peace gesture’ in the midst of escalating tensions helped to end that crisis. Luck also played a part, as many experts have pointed out. The question is whether there are any favourable factors in play today that can halt the ongoing escalation and avert a head-on clash.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681802d5ad62d.jpg",
  "retrievedAt": "2025-08-23T08:15:30.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908548",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:27:26.000Z"
}
