{
  "title": "Missile hits Tel Aviv airport in retaliation for Gaza attacks - World - DAWN.COM",
  "author": null,
  "content": "TEL AVIV: A ballistic missile struck inside the perimeter of Israel’s main airport on Sunday, wounding six people, halting flights and gouging a wide crater, in an attack claimed by Yemen’s Houthi fighters.\n\nThe Houthis, who control swathes of Yemen, have launched missiles and drones targeting Israel and Red Sea shipping throughout the Gaza war in solidarity with Palestinians in Gaza and the West Bank.\n\nThe Israeli military said “several attempts were made to intercept” the missile that was launched from Yemen, a rare Houthi attack that penetrated Israel’s air defences.\n\nAn Israeli official said the country’s security cabinet would convene in the evening.\n\nNetanyahu blames Iran as defence minister threatens seven times stronger response\n\nA police video showed officers standing on the edge of a deep hole in the ground with the control tower visible behind them. No damage was reported to the airport infrastructure.\n\nThe police reported a “missile impact” at Israel’s main international gateway.\n\nAn AFP photographer said the missile hit near the parking lots of Terminal 3, the airport’s largest. The crater was just hundreds of metres (yards) from the tarmac.\n\n“You can see the area just behind us: a crater was formed here, several dozen metres (yards) wide and several dozen metres deep,” central Israel’s police chief, Yair Hezroni, said in the video.\n\nThe Israel Airport’s Authority said: “This is the first time a missile has fallen so close to the terminal and the runways.”\n\n“The missile force of the Yemeni armed forces carried out a military operation targeting Ben Gurion airport” with a “hypersonic ballistic missile”, the Houthis said, referring to their forces.\n\nDefence Minister Israel Katz threatened a forceful response, saying: “Anyone who hits us, we will hit them seven times stronger.”\n\nLater, Israeli Prime Minister Benjamin Netanyahu vowed to respond to Iran at “a time and place of our choosing” over the attack on Israel’s Ben Gurion Airport.\n\n“Attacks by the Houthis emanate from Iran. Israel will respond to the Houthi attack against our main airport AND, at a time and place of our choosing, to their Iranian terror masters,” Netanyahu wrote on X, reposting a March message by US President Donald Trump also attributing attacks by the Yemeni group to their Iranian backers.\n\nPalestinians hail attack\n\nPalestinian groups Hamas and Islamic Jihad later hailed the Houthis’ attack on the airport.\n\nIsrael’s Magen David Adom emergency service said it had treated at least six people with light to moderate injuries.\n\nAn AFP journalist said he heard a “loud bang” at around 9:35 am (0635 GMT), adding the “reverberation was very strong”.\n\n“Security staff immediately asked hundreds of passengers to take shelter, some in bunkers,” the AFP journalist said.\n\n“Many passengers are now waiting for their flights to take off, and others are trying to find alternative flights.” An incoming Air India flight was diverted to Abu Dhabi, an airport official said\n\nIt was one of the airlines to suspend Tel Aviv flights until May 6, along with Germany’s Lufthansa Group, which includes Austrian, Eurowings and SWISS.\n\nA passenger said the attack, which came shortly after air raid sirens sounded across parts of Israel, caused “panic”.\n\nAn airline official said: “Today was a close call”.\n\n“I have worked at the airport for several years but even I was afraid today,” they said.\n\nFlights resumed after being halted briefly, with the aviation authority saying Ben Gurion was now “open and operational”.\n\nGaza war expansion\n\nAn Israel official said Israel’s security cabinet later met on Sunday, after media reported a planned expansion of the Gaza war with call-up orders issued for tens of thousands of reserve troops.\n\nSeveral news outlets said the military had begun sending the orders for reservists to replace conscripts and active-duty soldiers in Israel and the occupied West Bank so they can be redeployed to Gaza.\n\nA military spokesperson neither confirmed nor denied the reports but Israel’s public broadcaster said the security cabinet would meet to discuss the expanded offensive.\n\nIsrael resumed major operations across Gaza on March 18 amid deadlock over how to proceed with a two-month ceasefire that had largely stopped the Gaza war.\n\nSunday’s attack on Israel was the fourth the Houthis have claimed in three days.\n\nIsrael claims to have intercepted most of the Houthis’ missiles fired since the Gaza war started.\n\nIn March, the Houthis threatened to resume attacks on shipping over Israel’s aid blockade on Gaza after a suspension of attacks during the truce.\n\nThe US military has been hammering Houthis with near-daily strikes since March 15.\n\nPublished in Dawn, May 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6817e8a4d411a.jpg",
  "retrievedAt": "2025-10-12T02:53:41.014Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908455/missile-hits-tel-aviv-airport-in-retaliation-for-gaza-attacks",
  "dateList": "2025-05-05",
  "date_published": "2025-05-05T00:26:09.000Z"
}
