{
  "title": "MoU signed to construct 105KM rail track in Thar Coal",
  "link": "https://www.app.com.pk/national/mou-signed-to-construct-105km-rail-track-in-thar-coal/",
  "date_published": "2021-12-21T13:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP):Pakistan Railways has stepped up efforts to construct a new 105kilometres rail track connecting Thar Coal Block II with new Chorr station on the Hyderabad-Mirpurkhas rail link.\nRailway Constructions Pakistan Limited (RAILCOP), M/s Al Furqan Holdings Private Ltd and BIL Pakistan Pvt Ltd signed a Memorandum Understanding (MoU) here to execute the project worth 170 million euro.\nThe project would be executed under 100 percent Foreign Direct Investment (FDI) by Al Furqan Group UAE, CEO RAILCOP, Syed Najam Saeed said while addressing to the MoU signing ceremony.\nNajam Saeed said the project would provide new rail link from Thar Coal Mines to national railway network for ensuring availability of indigenous Thar lignite fuel throughout the country.\nHe said it would give maximum coverage of all Thar Coal Mine Blocks and far-flung population centers in Tharparkar district while avoiding any existing infrastructural relocations.\nNajam Saeed reaffirmed the mission of Minister for Railways Azam Khan Swati in transforming Pakistan Railways into a profit-making entity by initiating such Public Private Partnership (PPP) projects.\nHe also thanked Secretary/Chairman Railways, Habib-ur-Rehman Gilani, for his continuous support for the project.\nFurthermore, Pakistan Railways and on behalf of RAILCOP, Syed Najam Saeed extended special gratitude to Tauseef Zaman, CEO, BIL Pakistan (private) Limited for his role in project.\nThe CEO RAILCOP reiterated the vision of Prime Minister Imran Khan who stressed on attracting FDI with lucrative incentives and policies to the investors in a competitive business environment.\nHe said that Pakistan Railways extended its gratitude to Ministry of Foreign Affairs for its endeavors to attract foreign investment in the country. This particular investment was possible with the efforts of Faisal Abro, an officer of the Foreign Service of Pakistan, posted at the Permanent Mission of Pakistan to OIC, who played an instrumental role in arranging this FDI of €170 million.\nDivulging the project details, Najam Saeed said that with every passing day, the need of rail link to connect Thar Coal mines with the existing railway system was gaining priority and urgency.\nHe said all the relevant authorities and stakeholders were preferring and urging to adopt rail as a primary mode of transportation for Thar coal as compared to highway mode. This new rail link would be helpful in the coal driven energy projects executed under China Pakistan Economic Corridor (CPEC), he added.\nNajam Saeed said the project would also create thousands of jobs which would boost investment in other associated projects, enhance export of coal and to have positive impact of macro-economic indicators.",
  "retrievedAt": "2025-08-11T21:44:33.099Z"
}
