{
  "title": "‘Pygmies of politics’ criticizing PM Imran to increase political stature: Fawad",
  "link": "https://www.app.com.pk/national/pygmies-of-politics-criticizing-pm-to-increase-political-stature/",
  "date_published": "2021-12-21T13:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP):Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain Tuesday lashed out at major opposition political parties for criticizing Prime Minister Imran Khan, just for the sake of increasing their falling popularity.\n“The leadership of Pakistan Muslim League-Nawaz and Pakistan People Party, and Jamiat Ulema-e-Isalm (Fazal) is nothing more than pygmies of politics and their criticism against Prime Minister Imran Khan is just an attempt to increase their stature,” he said in a post-cabinet briefing.\nBriefing media about the decisions taken by federal cabinet headed by Prime Minister Imran Khan, the minister said, return of those, who were against women’s rights and support violence in the name of religion, to the power was not encouraging for any society.\nWhat else could be expected if three to four persons from one party contested elections in the same constituency, he said adding “Ultimately, it would result into defeat in elections.”\n“Due to administrative problems, we suffered some set back in the local body elections in Khyber Pakhtunkhwa,” Chaudhry Fawad maintained, adding the Pakistan Tehreek-e-Insaf was the only national party in the country.\nHe said parties like JUI could not be substitute of the PTI, whereas PML-N and PPP had no place in national politics.\n“Imran Khan is the leader of the federation, it is important for the leadership and workers of PTI to put aside their differences and strengthen Imran Khan’, Chaudhry Fawad remarked.\nWithout Imran Khan, Pakistan’s politics would disintegrate, he added.\nThe minister opined that it would be unfortunate for the country if Maulana Fazlur Rehman’s party came into the power. He said Maryam Nawaz had the habit of committing political blunders and even today she did not disappoint her detractors.\nDisappointment was reflected in Asif Ali Zardari’s speech as well, he said adding only those could speak in that way whose wishes could not be fulfilled.\nThe federal cabinet extended gratitude to all the foreign dignitaries for attending the moot.\nThe minister said that on the occasion of OIC FM conference, Pakistan’s viewpoint on Afghan humanitarian crisis was resonated across the world.\nThe minister said that the cabinet decided that Ministers for Science and Technology and Information Technology would meet the Chief Election Commissioner on Wednesday (tomorrow) to assure all out assistance from the government in holding Islamabad local government elections through EVMs.\nHe said that the ECP should issue tenders for purchase of EVMs so that next general elections could be conducted through the EVMs.\nHe said that the cabinet was given a detailed briefing on state of economy which expressed satisfaction over its stability due to positive economic indicators.\nIn five years, the present government would have to repay the $ 55 billion loans taken by Nawaz Sharif and Zardari regimes. He said that this year Pakistan has retired $ 12.27 billion loans whereas it would have to repay $ 12.5 billion next year.\nThose who were talking about managing the economy had drowned the economy by taking loans during their tenures, he added.\nMoreover, he said that the government had made payments of Rs. 134 billion to IPPs and these payments were made due to agreements signed during the tenure of Shahbaz Sharif and Nawaz Sharif.\nHe said that textile sector has shown 30 per cent growth and information technology exports have risen by 47 per cent so far and hopefully they would be doubled by the end of the fiscal year.\nHe said that 31 per cent increase has been registered in income tax.\nSimilarly he said that farmers earned Rs 1100 billion additional income due to bumper crops and increase in per acre yield.\nHe said the then rulers installed expensive plants on imported fuel, as a result of which electricity tariff was high today.\nThe minister said that the present government has to pay the expenses which were not incurred, even if there was no demand for electricity then according to their capacity we have to pay electricity charges.\nQuoting an example, he said that if an IPP can generate 100 MW of electricity, but need was only 25 MW, the government have to pay for 100 MW of electricity.\nThe minister said that as a result of these agreements, Pakistan was constantly incurring loss which would peak in 2023.\nLong-term loans have to be taken to repay the short-term loans taken in the past, said Chaudhry Fawad.\nDuring the past two years, the number of car manufacturers in Pakistan has increased from 5 to 15, said Chaudhry Fawad adding that currently 240,000 vehicles were being manufactured per year in Pakistan, and the goal was to achieve the production of 500,000 vehicles.\nAll parts of these cars were manufactured in Pakistan, which is a real success, said the minister.\nHe said that new investments are being made in the car manufacturing sector, and banks have increased their capital in the car financing sector from Rs 240 billion to Rs 338 billion by October 2021.\nHe said that 111435 cars were produced in the first five months of fiscal year which meant that car manufacturing has increased by 69 per cent.\nFawad said 85 per cent motorcycles were being manufactured in Pakistan, their parts were also manufactured locally. The sales of motorcycles, tractors, jeeps, cars has shown historic increase.\nHe said the sales of Suzuki Cultus increased by 161%, Suzuki Wagon R by 79%, Suzuki Bolan by 32% and Suzuki Alto by 180%.\nHe said that 6775 units were manufactured by Toyota in July this year only.\nElectricity consumption has increased by 13%, and diesel consumption by 26%, he added.\nThe minister said if the economy had gone down, then how could the demand of vehicles increased.\nThe sectors of construction, agriculture and textiles were experiencing historic improvement, he said adding foreign exchange reserves have increased from $ 20.3 billion to $ 25.2 billion while the export volume has increased by 29% over last year.\nHe said that presently there were 200,000 companies in Pakistan which were registered with the SECP, out of which 150,000 companies have been formed during the last three years, businesses flourished in Pakistan.\nThe federal cabinet has given approval for amendments in section 122 of the Election Act 2017. The amendments have been made in light of directions of the supreme court while the draft law would be presented to the federal cabinet committee on law.\nThe apex court, he said had stated that the Senate vote should be traceable so the Election Commission may address the allegations of horse-trading.\nThe amendments would be tabled in the Parliament for final approval so that it can become the part of law.\nSimilarly, he said on the directions of Islamabad High Court, a summary of establishment division regarding daily-wage, adhoc temporary and contract employees was presented before the cabinet.\nThe cabinet, the minister said, gave approval for 3.98 billion $ ex-post facto loans granted during December-2020 to November 2021.\nThe government was borrowing loans on long-term basis to reduce the external debt burden which was taken during the previous governments on short-term basis on expensive interest rate.\nThe cabinet has accorded approval of official appointments in Institute of Chartered Accountant of Pakistan (ICAP), the minister said .Chairman of the Securities and Exchange Commission of Pakistan (SECP), Deputy Governor of State Bank Syed Najam Ali and Syed Feroz Rizvi would be its members.\nThe cabinet also appointed Jawadullah from Khyber Pakhtunkhwa as member National Commission on the Rights on Child.\nThe Police Act, he said would be sent to the Cabinet Committee for Disposal of Legislative Cases (CCLC) for deliberation on Islamabad Police Act.\nThe Cabinet gave approval for appointment of Dr. Shamshad Akhtar as official member at Port Qasim Authority in place of Vice admiral Zahid Ilyas.\nThe cabinet notified members for National Food Security and Management Committee headed by the Prime Minister. Ministers, planning, food security, finance, industries, chairman federal board of revenue, all the chief ministers and chief secretaries has been made member to the Committee.\nAfter 18th amendment the country has faced food security issues, he said while referring to the price of wheat flour bag in Karachi which was being sold at over Rs 1300 while the same bag was available at Rs 1100 across the country. There has been anomaly that required rationalization.\nThe Cabinet was informed about the production and supply of Urea fertilizer. He made it clear that the country has witnessed a huge production of Urea. The Urea per bag price in international market was Rs 10,000 while on contrary in Pakistan the fertilizer was available between Rs1700-1800 per bag.\nHe said a meeting would be convened tomorrow on special directions of Prime Minister Imran Khan to address the issues related to fertilizer in the country. The agriculture sector will remain on priority for the present government, he said citing farmers’ profits that they made Rs.1, 100 billion from various crops.\nThe Cabinet has okayed the appointment of Muhammad Najam Nawaz Saqib as community welfare attaché in Riyadh Saudi Arabia.\nFawad said the Cabinet has appointed Ikhlaq Ahmed Syed as independent member in board of directors in GENCO Holding Company on the recommendation of Ministry of Energy.\nHe said Muhammad Shafiq-ur-Rehman has been appointed as Chairman while Arshad Ali as independent member on board of Jamshoro Power Company. Chief Engineer MEPCO Allah Yar Khan would continue to perform his duties on temporary basis, he added.\nThe Cabinet, he said has endorsed the decisions of Economic Coordination Committee (ECC) and agenda of CLC Committee.",
  "retrievedAt": "2025-08-11T21:44:31.537Z"
}
