{
  "title": "President for adopting maximum preventive measures in Ramazan to check spread of COVID-19",
  "link": "https://www.app.com.pk/national/president-for-adopting-maximum-preventive-measures-in-ramazan-to-check-spread-of-covid-19/",
  "date_published": "2020-04-24T12:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 24 (APP):President Dr. Arif Alvi has urged the need for adopting preventive measures including social distancing and other healthcare precautions during the holy month of Ramazan to check the spread of deadly coronavirus pandemic.\n“We have to ensure that all religious activities are done in a maximum possible protective environment,” he said in his message to nation on the advent of the holy month of Ramazan.\nThe President said that besides praying to Allah Almighty to rid the country and world of this deadly contagion, the people should also specially take care of the needy, deserving and daily wagers during the holy month.\nHe said that at the moment the whole world was worried due to COVID-19 and was striving and taking measures to curb the pandemic.\nThe President said, “As per the directions of medical experts, so far prevention is the only way to check this contagion.”\n“Insha Allah, we together will succeed in overcoming this challenge,” he added.\nThe President congratulated the whole nation and Muslim Ummah on the advent of the holy month of Ramazan.\n“We have once again been provided by Allah Almighty with the opportunity of benefitting from the blessings of Ramazan ul Mubarik,” he added.\nThe President said that the purpose of fasting – religious duty of Muslims as per the command of Allah Almighty was to create the quality of piety.\n“Piety means prevention. As in our practical life, we try to avoid prickly path, likewise a believer should avoid such things which have been prohibited by Allah Almighty,” he said and added, “Ramazan is the month of training for such prevention”.\n“Furthermore, the objective of this holy month is not only to get people realize about the issues of poor, deserving and downtrodden, through hunger and thirst, but also to promote economic and non-economic justice at all levels so as to block the way of social problems by creating balance in society,” he remarked.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:08:28.805Z"
}
