{
  "title": "PTI leader hails physicians, police, army, media for playing vibrant role against coronavirus pandemic",
  "link": "https://www.app.com.pk/national/pti-leader-hails-physicians-police-army-media-for-playing-vibrant-role-against-coronavirus-pandemic/",
  "date_published": "2020-04-24T02:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 24 (APP):Parliamentary Secretary for Railways, Farrukh Habib has lauded the physicians, police, army and media persons for playing vibrant role against coronavirus pandemic.\nExpressing these views in an interview with a private tv channel programs, he said that tackling the patients of deadly virus in the hospitals, and managing the security issues by law enforcement institutions was an unprecedented work which could not be ignored.\nThis was a momentous event in the history of Pakistan that all the people belonging to different school of thoughts were trying to follow the precautionary measures and standard operating procedures to get rid of the dangerous virus emerged around the world and digested thousands of precious lives.\nLamenting over the attitude of Pakistan Peoples Party leaders who were engaged in fabricating propaganda against the steps taken by Pakistan Tehreek e Insaf (PTI) government, he said Opposition parties should discharge duties for public welfare rather to waste energies on non-issues.\nAbout rising number of coronavirus patients in Sindh, he said the leaders of PPP running the affairs of the province despite tall claims could not ensure better system for their people.\nAppreciating the leadership of present government, Farrukh Habib said that PTI government was well aware of the problems of the masses and for this, several initiatives had already been taken to provide relief to them.\nTo a question, he said a complete lockdown was not a feasible option for the poor nations. However, he said that all out measures were being taken to ensure safety and security of the citizens.\nThe PTI leader further stated that government had started distribution of food items besides financial assistance through Ahsas programe and other resources to help out poor segment of society.\nOpening of the construction sector with small attached departments, he said would also mitigate the suffering of the people in the present circumstances.",
  "retrievedAt": "2025-08-11T19:08:33.784Z"
}
