{
  "title": "PIA reduces UAE bound special flights’ fares by 20-30%: Zulfi Bukhari",
  "link": "https://www.app.com.pk/national/pia-reduces-uae-bound-special-flights-fares-by-20-30-zulfi-bukhari/",
  "date_published": "2020-04-24T02:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 24 (APP):The Pakistan International Airline (PIA) has reduced its special flights’ fares by 20 to 30 per cent, extending maximum relief to the nationals stranded in the United Arab Emirates (UAE) due to the Coronavirus pandemic.\nSpecial Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development Sayed Zulfikar Abbas Bukhari told this to the virtual town hall meeting arranged by his ministry to redress the grievances of\nUAE-based Pakistanis.\n“According to the new prices of PIA, the airfare for the flights operating from UAE to Lahore, Islamabad and Peshawar has been reduced to 1,110 Dirham while the tickets for UAE to Multan and Karachi will be available at 957 Dirham and 810 Dirham, respectively,” Zulfikar Bukhari informed the participants who had highlighted the exorbitant prices of PIA tickets as a major concern for the Pakistanis, intending to return home from the Emirates.\nThe decision to slash airfare for the UAE- bound special flights would come into effect from April, 25, he added.\nIn the current situation, he said: “We ask all the airlines to submit bids and then give opportunity to the PIA to undercut those bids if it wanted to operate the flights. The first priority is given to the PIA if it comes up with the lowest bid.”\nThe preference was being given to those airlines which could offer affordable airfare to the citizens, he added.\nConsul General of Pakistan in Dubai Ahmad Amjad Ali said the prices told by the SAPM did not included tax. “Between 125 dirham to 250 dirham is a tax for different airports so that will be added in the current prices,” he added.\nHighlighting the steps taken by the Pakistani government, its Embassy and Consulate General to facilitate the Pakistani expats, Pakistan’s Ambassador to the UAE Ghulam Dastgir said presently some 27 flights in a week were being operated to airlift Pakistanis from across the globe, out of which 17 were going from the Emirates.\nSo far, around 1,260 nationals had been sent to Pakistan in this week, he added.\n“Pakistanis in the UAE should understand that obviously all these people cannot go in one go. It will take some four to five weeks as we are trying hard along with PIA to accommodate them in an orderly manner,” he maintained.\n“Our top priority is to bring back the laid off workers. We are moving towards regularizing the flights which will ensure the repatriation of all those people who want to come back to Pakistan,” said SAPM Zulfikar Bukhari.\nHe said earlier, the country had a capacity to repatriate 2, 000 people per week which had been increased to 6,000. The number might be enhanced to 8,000 in coming days after getting the desired results, he added.\nIn his concluding remarks, he appreciated the Pakistani Embassy and Pakistani community for distributing ration among their compatriots.\nHe urged the affluent Pakistanis to arrange tickets for those who could not purchase tickets to return home.",
  "retrievedAt": "2025-08-11T19:08:32.696Z"
}
