{
  "title": "Pakistan, Afghanistan should resolve differences amicably: Salahuddin Ayubi",
  "link": "https://www.app.com.pk/national/pakistan-afghanistan-should-resolve-differences-amicably-salahuddin-ayubi/",
  "date_published": "2023-02-03T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 3 (APP): Jamiat Ulema-e-Islam-Fazl, Maulana Salahuddin Ayubi on Friday said Pakistan and Afghanistan should resolve their differences amicably, including the core issue of terrorism, which was imperative for the peace and prosperity of both countries.\nCondemning the Peshawar tragic incident in the strongest terms in the National Assembly, he said both the brotherly countries should develop understanding and resolve the core issues, including terrorism, with dialogues.\nAyubi was of the view that peace could not be maintained if indulged in blame game.\nTaking part in the debate, Pakistan Peoples Party’s Naz Baloch proposed to sit together and find the best solution to terrorism on a permanent basis.\nCriticizing Pakistan Tehreek-e-Insaf (PTI) Chief for promoting chaos, anarchy, polarization and the trend of abusive language, particularly in youth, she said Imran Khan had severely dented Pakistan’s economy during his regime which needed years to come back on track.\nNaz said due to PTI’s bad policies, the large-scale industries were badly damaged and stopped the wheel of economic activities.\nShe condemned the PTI chief for accusing Pakistan Peoples Party Parliamentarians President Asif Ali Zardari for making a plot of Imran Khan’s murder adding that it was high time to take adequate measures to control this Frankenstein monster from further destruction of the country.\nShe also paid tribute to Pakistan Army for rendering uncountable sacrifices for the peace and security of the beloved homeland.\nMeanwhile, PTI’s Asiya Azeem highlighted the security issue of Islamabad District Court (IDC) due to burgeoning incidents of terrorism in the country.\nShe asked the government to shift the IDC to some other place to avoid any untoward incident of terrorism as happened in the past.\nLater, the house was adjourned to meet again on Monday at 1730 hours.",
  "retrievedAt": "2025-08-11T05:54:46.882Z"
}
