{
  "title": "Mushaal Mullick urges Pakistan to approach ICJ over illegal imprisonment of Kashmiri leadership, HB abuses in IIOJK",
  "link": "https://www.app.com.pk/national/mushaal-mullick-urges-pakistan-to-approach-icj-over-illegal-imprisonment-of-kashmiri-leadership-hb-abuses-in-iiojk/",
  "date_published": "2023-02-03T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 03 (APP): Mushaal Hussain Mullick, wife of Kashmiri Hurriyat leader Muhammad Yasin Malik incarcerated in Tihar jail in India on Friday urged the government of Pakistan to approach International Court of Justice for release of Kashmiri leaders imprisoned in various Indian jails and gross human rights abuses being committed by Indian occupation forces in Indian Illegally occupied Jammu and Kashmir.\nShe was speaking at the opening ceremony of a one-day digital photographic and painting exhibition organized by the Directorate of Electronic Media and Publications (DEMP), a subsidiary of the Ministry of Information and Broadcasting, marking Kashmir Solidarity Day at the Information Services Academy.\nShe said that in view of August 5, 2019 unilateral annexation of IIOJK and wilfully changing the demography of the Occupied territory, the UN Security Council should adopt a new resolution and appoint a special envoy on Kashmir.\nExecutive Director General Directorate of Electronic Media and Publications Dr Tariq Mehmood, APHC leader Abdul Hameed Lone, Director Films DEMP Asifur Rehman, Deputy Director Farina Mughal and other officials of the Ministry of Information and Broadcasting attended the ceremony.\nMushaal Mullick said that today’s exhibition had highlighted the freedom movement in the best way as the picture makes the world aware of the reality. She said that India had turned IIOJK into an inferno where genocide of armless Kashmiri people was being committed by the occupational forces.\nShe said the new generation should be apprised that India has been illegally occupying Kashmir and suppressing Kashmiris for 75 years.\n“There is a complete blackout in Occupied Kashmir and no one can stop India’s terrorism in the occupied territory ” , she remarked.\nShe said that UN had taken notice of major conflicts in the world, it was but no action had been taken against India’s state terrorism in IIOJK.\nMushaal Hussain Mullick said that almost all top Hurriyat leadership in IIOJK was behind the bars. She said that great Hurriyat leader Ali Geelani was martyred and his mortal remains were desecrated, Arshaf Serahi was poisoned inside the jail. She said Asia Andrabi and Shabir Shah were facing hardships in jails despite being ill.\nAbout her consort Yasin Malik, she said he has been kept in a death cell for the last four years. She said that Yasin Malik was given boiling water for ablution which burnt his arm. The Kashmiri leader said that the manner in which India has changed the demography of Occupied Kashmir, if attention was not paid, it will become mini-India in one year. She said that the most serious violations of human rights were taking place in IIOJK at the hands of Indian occupation forces.\nMoreover, she said the international community has observed terrorist activities of RSS which had made lives of minorities miserable in India. Mashaal Hussain Malik said that minorities are being victimised in India and a recent BBC report about Gujarat has exposed Modi.\nAbout the media gag in IIOJK, she said that there were restrictions on journalists, cameramen, researchers, human rights activists and media houses but the international community was silent because of economic considerations.\nShe said that the voice of 220 million Pakistanis including all segments of society was with the Kashmiris and “we should not get tired, we should fulfill this duty honestly. “\nAPHC leader Abdul Hameed Lone said that he was grateful to the government of Pakistan and the Ministry of Information, which has been exposing the ugly face of India. He said Pakistanis and Kashmiris were one nation and February 5 Solidarity Day was its manifestation.\nHe said that Kashmir Solidarity Day has been celebrated with the same enthusiasm for several decades. He said that the people of Occupied Kashmir are suffering today, India had been trying to change its demography.\nExecutive Director General DEMP Dr Tariq Mehmood told the participants about the 50 best paintings of a painting competition on Kashmir freedom struggle among students of various local universities were put on display.\nHe said that two documentary films “Kashmir Blackout” and “Story of Kashmir” and a song titled “Kashmir Hamara Hai” produced by DEMP have been released in connection with Kashmir Solidarity Day.",
  "retrievedAt": "2025-08-11T05:54:55.850Z"
}
