{
  "title": "Ministry of Education to observe Kashmir Day",
  "link": "https://www.app.com.pk/national/ministry-of-education-to-observe-kashmir-day/",
  "date_published": "2023-02-03T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 3 (APP): Ministry of Federal Education and Professional Training is making efforts to enthusiastically mark the Kashmir Solidarity Day to express solidarity with the people of Kashmir in their just struggle for freedom from Illegal Indian Occupation Jammu and Kashmir (IIOJK).\nThe education ministry and its attached departments will support the people of Kashmir for their right to self-determination and a just struggle in the face of India’s increasingly oppressive policies and atrocities in IIOJK.\nA consultative meeting, chaired by Federal Minister for Education and Professional Training, Rana Tanveer Hussain, was held at the Ministry of Education on Friday in this regard.\nDuring the meeting it was decided that all departments under the umbrella of the Ministry of Education will show solidarity with the people of IIOJK by observing the day with full enthusiasm and commitment.\nThe minister instructed all the public and private institutions to plan and organize conferences, solidarity walks, seminars, panel discussions, talk shows and competitions to highlight the struggle of Kashmiri people for their right to self-determination as per UN resolutions.\nThe minister said that, “We stand in solidarity with the people of Kashmir and call for an end to the violence, oppression, and human rights violations that have plagued the region for far too long. We also call for a peaceful resolution to the conflict that respects the rights and aspirations of the people of Kashmir”.\nHe further said that “Ministry of Federal Education is committed to raising awareness and providing support to the people of Kashmir, and will continue to work towards ensuring that their voices are heard and their rights are respected”.\nAllama Iqbal Open University, National Skills University Islamabad, Pakistan Institute of Fashion & Design Lahore, NFC Institute of Engineering and Fertilizer Research Faisalabad, Inter Board Committee of Chairmen (IBCC), FBISE, Quaid-i-Azam University Islamabad, Private Educational Institutions Regulatory Authority, National Vocational & Technical Training Commission (NAVTTC), National Book Foundation, National Commission of Human Development, Federal College of Education, National Education Foundation, Federal Directorate of Education, Basic Education Community Schools, and National College of Arts Lahore will hold different activities to mark the day and contribute towards the larger cause.",
  "retrievedAt": "2025-08-11T05:54:46.984Z"
}
