{
  "title": "Opposition leader on knees after derogatory remarks in Senate session",
  "link": "https://www.app.com.pk/national/opposition-leader-on-knees-after-derogatory-remarks-in-senate-session/",
  "date_published": "2023-02-03T10:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 3 (APP): Leader of the Opposition in Senate, Senator Shahzad Waseem on Friday was censured by the members of the treasury benches for passing derogatory remarks for the female members and others calling them to be ashamed for defending the government’s alleged political victimization of opposition parties.\nThe Leader of the Opposition while taking to the Upper House of the Parliament criticised the government for finding faults with the narrative and language of the opposition members under the garb of contempt and disrespect of institutions.\nAddressing the forum, Senator Shehzad Waseem alleged that the coalition government of the Pakistan Democratic Movement (PDM) was dragging the country’s system towards a new decline.\n“Chaudhry Fawad’s two daughters went to meet their father behind the bars instead of going to school that was really despicable for democracy. The daughters of Saifullah Khan Nyazee and Azam Swati should be queried for the humiliation they faced when police teams raided their bedrooms.\nIn the very next moment, he accused that those senators and members of the upper house who defend this conduct of the government should be ashamed to support it as just. Soon afterwards the treasury benches raised ruckus on the opposition leader’s harsh words for the government side.\nHowever, the Chairman Senate expunged the words of the opposition leader as undemocratic and unsuitable.\nAfter facing a strong backlash from treasury benches particularly Senator Bahramand Khan Tangi and Senator Rubina Khalid, the leader of the opposition extended his apologies to the house and said, “I withdraw my statement. I also apologise from the little daughters of the politicians who faced persecution due to the government’s (alleged) victimisation.”\nCommenting on the government’s narrative on terrorism, he said, “They used Taliban to grab dollars and prove themselves liberals before America. Peshawar blast left Khyber Pakhtunkhwa in bloodbath and badly affected the Police Department.”\nHe regretted that the federation sent malicious criticism instead of solidarity at this time when it was necessary to express solidarity.\nSenator Kamil Ali Agha of Pakistan Muslim League-Quaid-e-Azam (PML-Q) said the country was facing crises due to terrorism and inflation, whereas the ruling coalition government was busy settling scores with its political rivals. He urged that the government’s attention should be diverted to the issue that the rise in fuel prices had increased rates of 400 household commodities. “People are dying and the government is busy with political victimisation.\nThe PML-Q Senator while criticising the government’s actions said, “If someone snubs his wife during dinner then the government wants to get an FIR issued against him.”\nSenator Molvi Faiz Muhammad began his remarks referring to a hadith of the Prophet (PBUH) to contain tension in the environment. He said the Prophet’s saying highlighted how important it was to control one’s tongue. The Prophet (PBUH) commanded to protect others’ rights and honour whereas foul language was prohibited in the presence of women.\nSenator Maula Bakhsh Chandio also condemned the remarks of the opposition leader and termed it unacceptable at all.\nMeanwhile, Senator Muhammad Tahir Bizenjo requested an extension for presenting the report on the privilege motion moved by Senator Dr. Zarqa Suharwardy Taimur for a period of 15 days with effect from January 24th. Bizenjo said the days requested for extension had lapsed and urged for another extension till the end of this month. The Chairman Senate read out the order loud and it was subsequently approved by the Upper House.",
  "retrievedAt": "2025-08-11T05:54:54.548Z"
}
