{
  "title": "ECP announces schedule for by-polls on 31 NA seats on March 19",
  "link": "https://www.app.com.pk/national/ecp-announces-schedule-for-by-polls-on-31-na-seats-on-march-19/",
  "date_published": "2023-02-03T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 03 (APP): The Election Commission of Pakistan (ECP) would hold by-polls on another 31 National Assembly constituencies on March 19. The seats had fallen vacant due to resignations of PTI MNAs.\nThe notification says the returning officers (ROs) will issue a public notice in this regard on February 8, while the candidates will be able to file their nomination papers with the ROs from February 10-14, followed by publication of a list of the nominated candidates next day. The scrutiny of documents will be carried out till February 18.\nThe appeals against the acceptance or rejection of nomination papers by the ROs can be filed on Feb 22. Last date for devising of appeals by the appellate tribunals will be Feb 27, followed by publication of the revised list of candidates on February 28. The candidates can withdraw their nominations papers and publication of revised list of candidates is fixed as Mar 01.\nThe candidates will be allotted election symbols on March 02 and the polling will be conducted on March 19.The seats were vacated when the National Assembly Speaker Raja Pervaiz Ashraf accepted the resignations of PTI lawmakers.\nThe by-elections will be held in these constituencies: NA-02 Swat-I; NA-03 Swat-II; NA-05 Upper Dir-I; NA-06 Lower Dir-I; NA-07 Lower Dir-II; NA-08 Malakand Protected Area; NA-09 Buner; NA-16 Abbottabad-II;NA-19, Swabi-II; NA-20, Mardan-01; NA-28, Peshawar-II; NA-30, Peshawar-IV;NA 34, Karak;NA-40, Bajaur-I; NA-42, Mohmand;NA-44, Khyber-II;NA-61,Rawalpindi-V;NA-70, Gujrat-III;NA-87, Hafizabad-I; NA-93,Khushab-I;NA-96, Mianwali-II; NA-107,Faisalabad-VII;NA-109,Faisalabad-IX;NA-135, Lahore-XIII;NA-150, Khanewal-I; NA-152,Khanewal-II;NA-158, Multan-V;NA-164, Vehari-III; NA-165,Vehari-IV;NA-177,Rahim Yar Khan-III and NA-187, Layyah-I.",
  "retrievedAt": "2025-08-11T05:54:35.413Z"
}
