{
  "title": "Railways plan to rehabilitate infrastructure for improving speed of trains",
  "link": "https://www.app.com.pk/national/railways-plan-to-rehabilitate-infrastructure-for-improving-speed-of-trains/",
  "date_published": "2023-02-03T10:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 3 (APP): Pakistan Railways is planning to rehabilitate infrastructure including track and signaling system from Karachi to Peshawar, Main Line-I (ML-I), including doubling of track from Lahore to Peshawar (462.20 Km).\n“The length of the track was 1,726 kilometres and the department has planned to improve speed upto 160 kilometres per hour in the project of up-gradation of ML-I under China-Pak Economic Corridor (CPEC),” an official in the Ministry told APP on Friday.\nIn this regard, the official said that a modified PC-I amounting to Rs. 9.851 billion has got approval from the Executive Committee of the National Economic Council (ECNEC).\nTo improve the speed of the trains and ensure fixed timings, he said the procurement of 230 passenger coaches and 820 High Capacity Wagons under the Public Sector Development Programme (PSDP) project was also under process.\nThe official said that around 46 Completely-Built-Up (CBU) passenger coaches have been procured up till now while the remaining 184 would be manufactured in the country and the couches would be able to travel at the speed of 160km/h.\nHe said the rolling stock being procured under this project would be capable to run at a speed of 160 km/h whereas the department has a dedicated fleet of 55 diesel-electric locomotives of 4000-4500 HP for freight operation to cater maximum haulage at higher speed.\n“The installation of Computer Based Interlocking (CBI) system on 48 stations on ML-I to improve signaling and interlocking for higher speed and safety of train operation,” the official added.\nTo a question, he said Pakistan Railways was a big organization comprising of around 63000 employees and its network was spread throughout the country.\nThe official said the employees were well cared for owing to having several welfare activities, including healthcare facilities through an intensive network of hospitals, dispensaries and child healthcare units.\nHe said that provision of government accommodation according to entitlement and priority list, staff benevolent funds, benefits and incentives provided through Prime Minister’s Family Assistance Package policy for deceased employees’ families were part of these facilities.\nWhile the other facilities included benefits and incentives provided through policy for disabled employees’ families, monthly grants to widows scale-wise, the establishment of primary and high schools, industrial schools to teach handicrafts, sports activities, pick and drop facility for schools/offices, installation of water filters plants, a special provision of five medical seats in Riphah Islamic Universities with the reduction of 50 percent in admission and tuition fees.",
  "retrievedAt": "2025-08-11T05:54:57.239Z"
}
