{
  "title": "AJK PM announces to observe Kashmir Day to express solidarity with IIOJK:",
  "link": "https://www.app.com.pk/national/ajk-pm-announces-to-observe-kashmir-day-to-express-solidarity-with-iiojk/",
  "date_published": "2023-02-02T19:21:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Feb 02 (APP):Prime Minister Azad Jammu and Kashmir Sardar Tanveer Ilyas Khan has announced that February 05 Kashmir Solidarity day would be observed with traditional zest and zeal to express complete solidarity with our brethren in occupied Kashmir.\nThe day, he said would be celebrated all across Pakistan, and Azad Jammu Kashmir with a renewed pledge to continue all-out political, moral and diplomatic support to Kashmiris’ just struggle for the right to self-determination.\n“Prime Minister of Pakistan Shehbaz Sharif will address the joint session of the Azad Jammu and Kashmir Legislative Assembly to show solidarity with our brothers and sisters in occupied Kashmir”, the PM said adding that solidarity rallies would be held at all district and tehsil headquarters, cities and towns and human chains would be created on all bridges connecting Pakistan with Azad Jammu and Kashmir.\nReiterating Kashmiris’ pledge to take the ongoing liberation struggle to it’s logical conclusion, the PM said “the people of Kashmir will not allow the blood of their great martyrs to go in vain”.\nReferring to Modi government’s nefarious designs in the region,  the PM said that India’s RSS-influenced regime was hell-bent on changing the demographic in occupied Kashmir.\n“Kashmir is not a land dispute. It is a matter of right to self-determination of millions of Kashmiris'”, he said adding that India has held Kashmiris hostage by the dint of force. India, he said, has besieged Kashmir militarily.\nHe said that Pakistan’s survival was also linked to the freedom of Kashmir, stressing the need for highlighting the issue with it’s historical perspective, the PM said that the government of Azad Kashmir would continue to play its role to strengthen the freedom struggle.",
  "retrievedAt": "2025-08-11T05:55:07.230Z"
}
