{
  "article_id": "2025-06-20_2ea790d2f0412ccbac986fd7070eeffe",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/preparations-begin-for-next-years-hajj-saudi-guidelines-to-be-strictly-followed-minister/",
    "retrieved_at": "2025-08-27T16:17:51.019Z"
  },
  "metadata": {
    "title": "Preparations begin for next year’s Hajj, Saudi guidelines to be strictly followed: Minister",
    "author": null,
    "date_published": "2025-06-20T12:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 384,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 20 (APP):Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf, Friday said that preparations for next year's Hajj have formally begun, stressing that all Saudi guidelines will be fully observed to guarantee a smooth and safe pilgrimage for Pakistani pilgrims. Participating in the Budget Debate in the National Assembly, the minister said the Saudi government has issued the Hajj policy and timeline, and Pakistan's official quota-set at 179,210 pilgrims-is expected to be confirmed by July 10. Sardar Yousaf, who personally monitored the 2025 Hajj operations, said 115,000 Pakistanis performed the pilgrimage this year, including 88,000 under the government scheme and the rest through private operators. He noted that all pilgrims completed their Hajj with devotion, and the prime minister also commended the efforts. Commenting on Indian aggression, he stated that the people of Pakistan emerged victorious in the Pakistan-India war, attributing this success to the blessings of Allah and the dedicated efforts of the Pakistan Army. Commenting on the federal budget, the minister described it as \"balanced\" and indicative of the government's resolve to fast-track economic recovery. He noted that the increase in salaries and pensions would help ease the financial burden on citizens. Additionally, steps have been taken to boost exports. He emphasized that development projects aimed at benefiting the public are the responsibility of the provinces, which must fulfill their roles accordingly. On regional issues, Sardar Yousaf voiced serious concern over the denial of basic human rights and alleged discrimination against the people of Hazara, particularly in Mansehra district. He said the region's population of over 300,000 lacks access to clean drinking water, gas, and proper infrastructure. He urged the Khyber Pakhtunkhwa government, led by Pakistan Tehreek-e-Insaf (PTI), to stop marginalizing the region and ensure fair treatment. He also called for the reconstruction of education and healthcare infrastructure destroyed in past earthquakes and demanded prompt compensation for those affected by the Suki Kinari Dam project. Stressing administrative reform, he reiterated his demand for the formation of new provinces, including Hazara, to improve governance and service delivery. Meanwhile, Pakistan Peoples Party (PPP) MNA Syed Khursheed Ahmed Shah highlighted the need to revise Pakistan's Hajj quota based on population. He said that under the current 0.1% quota allocation, at least 230,000 Pakistani citizens should be given the opportunity to perform Hajj.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}