{
  "article_id": "2025-06-20_458ad0bce32f02b6a7d778f50d4a027a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/abbasi-expresses-concerns-over-rising-number-of-derailments/",
    "retrieved_at": "2025-08-27T16:18:13.520Z"
  },
  "metadata": {
    "title": "Abbasi expresses concerns over rising number of derailments",
    "author": null,
    "date_published": "2025-06-20T10:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 275,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 20 (APP):Federal Minister for Railways Muhammad Hanif Abbasi Friday expressed concern over the rising number of derailments and called for a detailed analysis and proactive measures to prevent future occurrences. He said this while chairing a high-level meeting at the Ministry of Railways, focusing on train safety, administrative performance and ongoing corruption investigations within Pakistan Railways. Senior officials presented comprehensive briefings on recent train accidents and operational issues, with particular attention to incidents reported in Sukkur, Multan, and Peshawar during June 2025. Hanif Abbasi directed that clear recommendations and an action plan be formulated and submitted to the relevant authorities. He also sought a report on the delay of the Awam Express departing from Karachi and ordered an immediate inquiry into the recent foot overbridge incident in Khanewal. Regarding the closure of the Shahinabad Quarry, the minister instructed officials to identify those responsible and take appropriate action. The meeting also reviewed the Railway Constructions Pakistan Limited investigation, where the Inspector General of Pakistan Railways Police reported that the fact-finding inquiry was nearing completion. The inquiry recommends criminal proceedings against implicated officials and proposes the case be handed over to the Federal Investigation Agency (FIA) for further investigation. Reaffirming the Ministry's zero-tolerance stance on corruption, Minister Abbasi said that financial, administrative and structural reforms remain a top priority. He also said that strict disciplinary action against non-performing staff, while assuring that employees who demonstrate exceptional performance will be recognized through rewards and commendation certificates. Hanif Abbasi called on all officers and personnel to perform their duties with sincerity, transparency and accountability, emphasizing the government's commitment to restoring public confidence in the national rail system.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}