{
  "article_id": "2025-06-20_4a38e67917a1e2371b3e683067d499ec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/court-extends-physical-remand-of-tiktoker-sana-yousaf-murder-suspect/",
    "retrieved_at": "2025-08-27T16:17:01.289Z"
  },
  "metadata": {
    "title": "Court extends physical remand of TikToker Sana Yousaf murder suspect",
    "author": null,
    "date_published": "2025-06-20T17:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 216,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 20 (APP): The District & Sessions Court of Islamabad on Friday extended the physical remand of a man accused of killing TikToker Sana Yousaf, after prosecutors said the suspect is deliberately hiding key evidence. The suspect, Umar Hayat, was produced before Judicial Magistrate Hafeez Ahmed on completion of his four-day physical remand. Police requested an extension, saying the investigation is incomplete and a mobile phone believed to be important to the case is still missing. Prosecutor Raja Naveed, along with Adnan Ali and Mazhar Bashir, appeared on behalf of the state. Naveed told the court that the vehicle used by the suspect had already been recovered, but the mobile phone remained unaccounted for. According to the prosecution, the suspect understands the gravity of the crime and is deliberately avoiding the recovery of the device. The prosecution requested a seven-day extension in remand for further investigation and recovery of the mobile phone. However, the court approved a three-day extension instead. The suspect will now remain in police custody and is scheduled to be presented in court again on June 23. The case was registered at Sumbal Police Station against Umar Hayat, who is accused of murdering Sana Yousaf, a TikTok content creator. Investigators believe the mobile phone may contain crucial evidence related to the incident.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}