{
  "article_id": "2025-06-20_a4d8885ffc45f0bf906aad63ce97874f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-takes-up-key-legislative-business-grants-time-extensions-to-standing-committees/",
    "retrieved_at": "2025-08-27T16:18:14.885Z"
  },
  "metadata": {
    "title": "Senate takes up key legislative business, grants time extensions to standing committees",
    "author": null,
    "date_published": "2025-06-20T09:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 456,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 20 (APP):Presided over by Deputy Chairman Senate Sardar Syedal Khan, the Upper House on Friday continued its discussion on the Finance Bill 2025 and addressed key legislative matters while granting time extensions to various standing committees for the submission of reports on constitutional and legislative bills. Senator Shahadat Awan, on behalf of Senator Farooq Hamid Naek, Chairman of the Standing Committee on Law and Justice, moved motions for sixty-day extensions of time concerning five bills, including The Constitution (Amendment) Bill, 2024 (Amendment of Article 51). These were introduced by Senators Manzoor Ahmed and Danesh Kumar; The Constitution (Amendment) Bill, 2024 (Substitution of Article 140A and amendment of Article 160) introduced by Senator Khalida Ateeb; The Constitution (Amendment) Bill, 2024 (Amendment of Articles 1, 51, 59, 106, 154, 175A, 198 and 218) introduced by Senator Aon Abbas; The Constitution (Amendment) Bill, 2024 (Amendment of Article 62) introduced by Senator Samina Mumtaz Zehri; The Family Courts (Amendment) Bill, 2024 introduced by the same senator. Meanwhile, the Senate also granted a sixty-day extension to Senator Jam Saifullah Khan, Chairman of the Standing Committee on Railways, for presenting a report on a starred question related to the outsourcing of luggage vans by Pakistan Railways. Similarly, Syed Masroor Ahsan, on behalf of Senator Amir Waliuddin Chishti, Chairman of the Standing Committee on National Health Services, Regulations and Coordination, was granted a sixty-day extension to present the report on the Islamabad Healthcare Regulation (Amendment) Bill, 2025, introduced by Senator Mohsin Aziz. Senator Syed Waqar Mahdi, on behalf of Senator Sherry Rehman, secured a 60-day extension for the report on the Pakistan Trade Control of Wild Fauna and Flora (Amendment) Bill, 2024. Moreover, the House approved a sixty-day extension for the Standing Committee on Federal Education and Professional Training, chaired by Senator Bushra Anjum Butt, regarding the University of Business, Sciences and Technology Bill, 2025, introduced by Senator Abdul Shakoor Khan. Besides these motions, several reports were laid before the House. Senator Abdul Shakoor Khan, Chairman of the Functional Committee on Government Assurances, presented two reports - one related to an assurance by the Minister for Communications regarding the condition of the Peshawar-Islamabad Motorway (M-1), and the other concerning the time scale promotion of female teachers assured by the Minister for Federal Education and Professional Training. In addition, Syed Masroor Ahsan, on behalf of Senator Amir Waliuddin Chishti, laid before the House a report on a point of public importance raised by Senator Hidayatullah Khan regarding alleged corruption and mismanagement in the Pakistan Nursing Council. Later, the House resumed discussion on the motion moved by Finance Minister Muhammad Aurangzeb on June 10, 2025, pertaining to the Senate's recommendations on the Finance Bill, 2025, as required under Article 73 of the Constitution.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}