{
  "article_id": "2025-06-20_8a53a1a04e66154479ac71b62ea59a05",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ahsan-iqbal-visits-under-construction-national-police-hospital-in-islamabad/",
    "retrieved_at": "2025-08-27T16:17:01.289Z"
  },
  "metadata": {
    "title": "Ahsan Iqbal visits under-Construction ‘National Police Hospital in Islamabad’",
    "author": null,
    "date_published": "2025-06-20T16:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 299,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 20 (APP): Federal Minister for Planning, Development and Special Initiatives, Ahsan Iqbal, paid a visit to the under-construction National Police Hospital located in Sector H-11, Islamabad. The Minister was accompanied by Minister of State for Interior Talal Chaudhry, Inspector General of Islamabad Police, and Deputy Commissioner Islamabad, said a press release issued here on Friday. During the visit, the Federal Minister reviewed the construction progress and expressed satisfaction over the pace of work. He directed the concerned authorities to ensure the timely completion of the project by June 2026, emphasizing that the hospital is a significant step toward the welfare and healthcare of police personnel. \"This project reflects the state's firm commitment to supporting law enforcement agencies. Our police force forms the frontline of internal security, and it is the state's responsibility to ensure their health and wellbeing,\" stated Ahsan Iqbal. Sharing details of the project, the Minister said the National Police Hospital will be a state-of-the-art facility with a capacity of 250 beds. It will provide services in general medicine, surgery, emergency care, and other specialized areas. Upon completion, it will directly benefit nearly 12,000 police personnel by offering them access to modern medical facilities. He further noted that the project was approved in May 2023 and underscored the importance of its timely completion. \"These projects are funded by taxpayers' money and must be treated as a national trust. Any negligence in their delivery is unacceptable,\" he said. Officials from the relevant ministries, engineers, and project stakeholders briefed the Minister on the current status and progress of construction. Ahsan Iqbal instructed all involved to maintain transparency, quality, and speed in implementation, adding that sustainable and timely completion of development projects is vital for the uplift of vulnerable segments of society and the strengthening of state institutions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}