{
  "article_id": "2025-06-20_daf92d633fab9f3fdc23c6be391b8b04",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/minister-tariq-terms-positive-budget-proposals-as-encouraging-during-senate-debate/",
    "retrieved_at": "2025-08-27T16:18:36.588Z"
  },
  "metadata": {
    "title": "Minister Tariq terms positive budget proposals as encouraging during senate debate",
    "author": null,
    "date_published": "2025-06-20T09:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 195,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 20 (APP):Federal Minister for Parliamentary Affairs Dr Tariq Fazal Chaudhry on Friday termed the positive suggestions from members of both Houses regarding the federal budget as encouraging and constructive, assuring that the government would give them due consideration. Minister Tariq said that both the National Assembly and Senate sessions are currently underway along with finance committee meetings, with government representatives actively participating in all proceedings. He stated that the presence of ministers in both Houses is a reflection of the government's commitment to inclusive decision-making, and encouraged members to present positive proposals, adding: \"All constructive suggestions will be taken seriously and incorporated into the budget wherever feasible.\" Highlighting recent developments, he shared that Deputy Prime Minister and Finance Minister Senator Ishaq Dar recently acknowledged two significant recommendations during the National Assembly session: An increase in government employee salary raise from 6% to 10% following parliamentary input. A reduction in the proposed 18% tax on solar panels to 10%, aimed at balancing support for local manufacturers and affordability for the public. Tariq Chaudhry reiterated that all such recommendations are welcomed as constructive contributions and will be reflected in the final version of the budget.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}