{
  "article_id": "2025-06-20_a054c58194407169f52265355cde18c7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/minister-of-state-for-finance-reaffirms-commitment-to-sustainable-stability-growth-reforms/",
    "retrieved_at": "2025-08-27T16:18:13.517Z"
  },
  "metadata": {
    "title": "Minister of State for Finance reaffirms commitment to sustainable stability, growth, reforms",
    "author": null,
    "date_published": "2025-06-20T10:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 306,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 20 (APP):Mister of State for Finance Bilal Azhar Kayani on Friday stated that the governmentas primary objective is to maintain the economic stability achieved in recent years, provide relief to the public through accelerated growth, and carry forward the ongoing reform agenda. Speaking in the National Assembly, he stated that the governmentas primary objective is to maintain economic stability while finding ways to provide relief to the people despite existing challenges. As part of the five-year plan, customs and regulatory duties on raw materials will be significantly reduced, and machinery will be made more affordable to encourage industrial growth. The budget for the Benazir Income Support Programme (BISP) has been raised from Rs 592 billion to Rs 716 billion, marking a 20% increase in funding. This enhanced allocation is intended to provide greater support to vulnerable families through increased cash assistance and improved service delivery. He expressed gratitude to the standing committees of both the National Assembly and the Senate for their thorough review of the Finance Bill 2025-26, which will ultimately be presented to both Houses in the form of a report. He noted that the finance minister and his team are actively participating in the meetings, and the suggestions of parliamentarians are being duly taken into consideration. He thanked the coalition partners for their support to the government and highlighted that the annual average inflation rate has fallen significantly from 12 percent. He also praised the government for raising government employeesa salaries by up to 10 percent and pensions by 7 percent. He stated that the powers of the Federal Board of Revenue (FBR) has been reviewed and reorganized to promote a more balanced and accountable approach to tax administration. This effort includes defining the extent of its authority, introducing safeguards to prevent misuse, and improving transparency and accountability in its functions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}