{
  "article_id": "2025-06-20_74fd35ab5113d9a1e6b85fae8903d7b1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kheal-das-calls-for-swift-legal-remedy-to-safeguard-minority-rights/",
    "retrieved_at": "2025-08-27T16:17:50.880Z"
  },
  "metadata": {
    "title": "Kheal Das calls for swift legal remedy to safeguard minority rights",
    "author": null,
    "date_published": "2025-06-20T12:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 466,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 20 (APP):Minister of State for Religious Affairs and Interfaith Harmony Kesoo Mal Kheal Das on Friday voiced concern in the Senate over the abduction of Hindu girls in Shahzadpur, Sanghar district, and called for immediate legal reforms to safeguard minority rights in Pakistan. Responding to concerns raised by minority members in the Upper House at the request of the Deputy Chairman of the Senate, the State Minister stated that the incident occurred on June 18, when three daughters and a cousin from the same Hindu family were abducted. He informed the House that swift action had been initiated following his communication with the Inspector General of Police (IG) Sindh, MNA Shazia Atta Marri, and the Chief Minister of Sindh. \"The girls were rescued by Sindh police and were in police custody, and presented in court today. Their statements have been recorded under Section 164,\" he added. The minister urged the Law Minister Azam Nazeer Tarar and the Interior Minister Mohsin Naqvi to take urgent steps to ensure justice. \"This is not only a tragedy for the affected family but a matter of national image. Our enemies are exploiting it in international media to malign Pakistan,\" he added. Kheal Das emphasized that Islam and the Constitution of Pakistan categorically forbid religious coercion, and stressed that such actions contradict both Islamic teachings and state policy. The minister highlighted that in 2020, a Parliamentary Joint Committee formed under the then Prime Minister and headed by Senator Kakar had made significant progress toward minority protection. However, he regretted that external pressures had stalled key legislative initiatives, just as the Pakistan People's Party tried to make a law in Sindh, then pressure is exerted and it had to withdraw the law. \"Our Constitution guarantees full religious freedom, yet these heinous incidents persist. How can a 12 or 14-year-old decide to renounce their religion or leave their parents without coercion?\" he asked. He also acknowledged the efforts of Law Minister Azam Nazeer Tarar, who brought the Minority Commission under Human Rights from religious affairs ministry. The hard work done by law minister provides us protection; Senator Ali Zafar and all the other members also supported it. He also lauded the Senator Ali Zafar, and other lawmakers for facilitating the passage of the Minority Rights Bill, which now awaits presidential assent. He proposed the immediate establishment of a Minority Commission, which he said would serve as a safeguard against such violations. \"My community is protesting. I request the interior minister to immediately contact Sindh government and took quick action over this incident,\" he said. \"I cannot face my people in Sindh if immediate action is not taken.\" He said the Prime Minister Shehbaz Sharif and PML-N leader Nawaz Sharif, have always advocated for interfaith harmony and equal protection for all citizens.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}