{
  "title": "Jatayu, the witness in ‘Ramayana’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "THE din on Indian TV channels toggles between spewing hate and conjuring an enemy that can be cut into four. It’s what religion and nationalism on steroids does to a people.\n\nMarkandey Katju, the pacifist former supreme court judge, has tried every reasoned argument to seek a probe into the Pahalgam tragedy before beating the war drums against a nuclear-armed neighbour. Find the criminals to establish the masterminds, the judge says. But common sense or reason has few takers in a mob that a large part of India has turned into.\n\nTo make the unspeakable crime more grotesque, a security search was carried out for the Pahalgam suspects in a Sri Lankan plane that arrived in Colombo from Chennai. The tip-off from India suggests the culprits may have already dodged the dragnet and fled.\n\nStirring the political pot was a mythological allusion by the RSS chief to the Pahalgam massacre of 25 Indian tourists. Mohan Bhagwat quoted the Ramayana to demand retribution and destruction of the stone-hearted criminals. He reminded his followers of the epic war in which Lord Rama defeated and killed the king of Lanka for deceitfully kidnapping his wife during their exile in the forests of Dandakaranya.\n\nThere are a few problems with Bhagwat’s Rama-Ravana allegory. In the context of modern warfare, not least with nuclear-armed countries like Pakistan, the tempting recourse to religious metaphors could become problematic. As many Pakistanis would remember from enjoying the Ramayana TV serial on Doordarshan, which they were able to see on their TV sets in Lahore, Rama had acquired with his spiritual prowess a powerful weapon known as the Brahmastra. And Rama needed the Brahmastra to lay low Ravana but not without a tip-off from Ravana’s estranged brother Vibhishan.\n\nWhy does it seem a challenge to question the government to show evidence that points the finger at Pakistan?\n\nModi in the current re-enactment of the epic has followers who indulge his claims of divinity. But he knows he lacks Rama’s critical asset in his quiver. Bhagwat isn’t oblivious to the reality that both India and Pakistan for all the wrong reasons have nuclear weapons aimed at each other. I met Prof John Nash at Princeton in 2002, around the time A Beautiful Mind, the movie about him, was released. He was livid that Spiderman was doing better. The nuclear postures of India and Pakistan are rooted in the mathematically structured war games that Prof Nash had fabulously theorised. Any change in the tense equilibrium would result in self-harm. The theory known in military jargon as Mutual Assured Destruction, MAD, was successfully applied on the two Cold War rivals. Such is the power (and legitimate fear) of nuclear weapons that the owner of the world’s most lethal military arsenal must treat with a degree of deference the tiniest owner of the bomb. Remember Donald Trump humouring Kim Jong-un in Singapore.\n\nThe RSS has a tradition of worshipping weapons on Dussehra every year, evidently to valorise warfare as an essential facilitator of its proposed Hindu rashtra. The RSS had called for war also after the Pulwama attack on paramilitary men in 2019.\n\nModi claimed revenge at the time, saying his air force had bombed the alleged hideout of the suspects in Balakot, across the LoC. The Pakistan Air Force conducted a warning raid the next day. They shot down an Indian plane and captured its pilot. Indian forces also shot up one of their own helicopters in the confusion, killing Indian military personnel on board. Modi used the showdown to canvass votes nevertheless, and he won that election handsomely.\n\nBhagwat’s call for war follows an even more frightful precedent. In the wake of the terror attack on Mumbai in November 2008, K. Sudarshan, the former RSS chief, backed a nuclear attack on Pakistan, and asked the country to actually brace for a Third World War. Somehow that interview with a freelance journalist didn’t make people cringe. Fortunately, India had a sagacious leader at the helm at the time. Manmohan Singh fired his home minister for the Mumbai carnage but refused to beat any war drums. He won the 2009 elections without recourse to nationalist madness. In fact, he engaged with Pakistan in peace talks, for example in Sharm el Sheikh.\n\nBefore lynch mobs and TV channels were made the clearinghouse of Indian nationalism, the Congress party could be relied upon to rein in extremist fervour. Today, that composure in the Congress appears to have given way to a shriller nationalism, possibly to not stand out from the chorus and thus risk being accused of lagging in nationalist fervour. The Congress party’s expression of solidarity to the Modi government in whatever steps it considered necessary to respond to the Pahalgam tragedy echoed reckless bipartisanism, the kind that makes it difficult to divine a Democrat from a Republican or differentiate Labour from Tory, for example, in the invasion of Iraq. To give carte blanche on foreign policy, instead of holding the government to account for glaring intelligence failure and security lapses, makes the opposition appear feckless in a crisis.\n\nOpposition parties, notably including Congress spokespersons, have spoken up though against the targeting of Kashmiris and Muslims more widely after Pahalgam. So why does it seem a challenge to question the government to show evidence that points the finger at Pakistan? The foreign press has reported gaps in the Indian narrative. The New York Times, a major newspaper, has spoken of a lack of clear evidence to back India’s claim of Pakistan’s involvement in the massacre.\n\nIn the theme of Ramayana, being quoted to call for war, there was a pivotal character called Jatayu, a bird that could speak in human voice. Jatayu happened to be the sole eyewitness to Sita’s kidnapping. It was his testimony that prompted Ram to wage war on Ravana. Sadly, Jatayu’s clinching evidence is missing in the government’s transcription of the tragedy of Pahalgam from the story of Ramayana.\n\nThe writer is Dawn’s correspondent in Delhi.\n\njawednaqvi@gmail.com\n\nPublished in Dawn, May 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6819658d69ee1.png",
  "retrievedAt": "2025-08-23T08:17:04.530Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908774/jatayu-the-witness-in-ramayana",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T01:33:56.000Z"
}
