{
  "title": "Britain and India clinch landmark trade deal in shadow of Trump’s tariffs - World - DAWN.COM",
  "author": null,
  "content": "India and the United Kingdom concluded on Tuesday a long-coveted free trade pact, in a landmark deal that represents London’s most significant post-Brexit agreement that was finalised in the shadow of US President Donald Trump’s tariff increases.\n\nThe deal, between the world’s fifth and sixth largest economies, has been concluded after three years of stop-start negotiations and aims to increase bilateral trade by a further 25.5 billion pounds ($34bn) by 2040 with liberal market access and eased trade restrictions.\n\n“These landmark agreements will further deepen our comprehensive strategic partnership, and catalyse trade, investment, growth, job creation, and innovation in both our economies,” Indian Prime Minister Narendra Modi said on X.\n\nThe deal lowers tariffs on goods such as whisky, advanced manufacturing parts and food products such as lamb, salmon, chocolates and biscuits. It also agrees to quotas on both sides for auto imports.\n\nBoth countries are also seeking bilateral deals with the United States to remove some of Trump’s tariffs that have upended the global trade system, and the resulting turmoil sharpened focus in both London and New Delhi on the need to clinch a UK-India trade deal.\n\n“We are now in a new era for trade and the economy. That means going further and faster to strengthen the UK’s economy,” British Prime Minister Keir Starmer said.\n\n“Strengthening our alliances and reducing trade barriers with economies around the world is part of our plan for change to deliver a stronger and more secure economy here at home.”\n\nThe pact marks India opening up its long-guarded markets, including automobiles, setting an early example for the South Asian nation’s likely approach to dealing with major Western powers such as the US and the European Union.\n\nTalks over a free trade deal between India and Britain were initially launched in January 2022, and became a symbol of Britain’s hopes for its independent trade policy after leaving the European Union.\n\nBut negotiations were stop-start, with Britain having four different prime ministers since that launch date and elections in both countries last year.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/06182424d6b6212.png",
  "retrievedAt": "2025-08-23T08:16:58.355Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908827/britain-and-india-clinch-landmark-trade-deal-in-shadow-of-trumps-tariffs",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T13:50:57.000Z"
}
