{
  "title": "Pakistan calls on world to pave way for peace - Newspaper - DAWN.COM",
  "author": null,
  "content": "• PM terms Indus treaty ‘red line’\n• Dar sees Pahalgam incident as ‘calculated attempt’ at escalation\n• Any violation of sovereignty to be met with ‘decisive force’, vows army chief\n• Kremlin following situation with ‘great concern’\n\nISLAMABAD: Pakistan on Monday urged the global community to swiftly intervene to bring down tensions in the South Asian region and de-escalate the crisis by addressing its underlying reason: the unresolved Kashmir dispute.\n\nPakistan’s leadership also pledged to fiercely defend national sovereignty against any provocation in the wake of the Pahalgam attack that resulted in the death of 26 people in the held-Kashmir region. The government said that provocative rhetoric from New Delhi and baseless accusations against Pakistan were part of a pattern aimed at diverting attention from the Kashmir dispute.\n\nIn his meetings with foreign dignitaries, including Iran’s foreign minister, Prime Minister Shehbaz Sharif reiterated Pakistan’s offer for an “independent, tra­nsparent, neutral and credible” international inv­e­stigation into the Pahal­gam incident and invited cou­ntries, including the UK, to participate.\n\nPM Shehbaz also raised concerns over what he termed India’s attempts to politicise international fina­ncial institutions to damage Pakistan’s economy and condemned recent actions concerning the Indus Waters Treaty, calling them “unacceptable” and a “red line”.\n\nIran FM visit\n\nDuring their separate meetings with visiting Iranian Foreign Minister Seyed Abbas Araghchi, PM Shehbaz and Foreign Minister Ishaq Dar highlighted their shared commitment to diplomacy.\n\nIran had offered to mediate between India and Pakistan, with President Pezeshkian already having spoken to leaders in both capitals and Mr Araghchi expected to travel to New Delhi on Thursday.\n\n“The prime minister reaffirmed Pakistan’s resolve to work closely with Iran for peace, stability, and development in the region,” the PM Office said in a statement after the meeting. Foreign Minister Araghchi reaffirmed Iran’s commitment to strengthening its relations with Pakistan and playing its part in bringing peace and stability to South Asia, reported state-run APP.\n\nIn his meeting with UK High Commissioner Jane Marriott, the prime minister emphasised that Pakistan would not take any step that endangers regional peace. “Our priority remains economic development,” he said, urging London to use its good offices with both countries to promote peace.\n\n‘Pakistan will defend itself’\n\nDeputy Prime Minister and Foreign Minister Ishaq Dar, at a seminar in Islamabad, said that Pakistan remained committed to regional stability but would not hesitate to defend itself if provoked.\n\n“There appears to be a calculated and premeditated attempt to escalate regional tensions, following a familiar pattern—level accusations without evidence, incite hysteria, and use it as a pretext for aggression,” Mr Dar said.\n\n“If aggression is imposed on us, we will exercise our inherent right to self-defence under Article 51 of the UN Charter.”\n\nHe also voiced concern over India’s move to suspend the Indus Waters Treaty, calling it a dangerous development with far-reaching implications. The foreign minister urged the global community to intervene before the situation spirals further.\n\n“The international community must take serious note of these developments. At a time when the region requires cooperation and restraint, any tolerance for adventurism would only embolden further instability,” he emphasised.\n\n“Being a responsible member of the international community, Pakistan remains committed to regional peace and stability. We will support all efforts towards de-escalation,” he reassured the international partners about Pakistan’s cooperation for de-escalation.\n\nThe Pakistani military reinforced the civilian leadership’s stance, with Gen Asim Munir warning that while the country sought peace, any violation of its sovereignty would be met with decisive force.\n\n“If Pakistan’s sovereignty and territorial integrity are violated, we will respond with full force to preserve national prestige and the well-being of our people,” Gen Munir said during remarks at the Balochistan National Security Workshop.\n\nIslamabad has consistently framed the Kashmir dispute as central to the region’s volatility and reiterated its call for a resolution based on UN Security Council resolutions and the aspirations of the Kashmiri people.\n\nThe Iranian top envoy also called on army chief General Asim Munir at GHQ, Rawalpindi. “The meeting featured constructive discussions on the geo-strategic environment, with particular focus on challenges confronted by both countries in the domain of security. The Pak-Iran border security mechanism was also reviewed as part of efforts to enhance bilateral coordination,” said a statement issued by the army’s media wing after the meeting.\n\nKremlin’s concern\n\nMeanwhile, the Kremlin also called for a de-escalation on Monday, expressing the hope that both sides would work towards reducing tensions.\n\n“We hope that the parties will be able to take measures (…) that will reduce tensions,” Spokesman Dmitry Peskov told reporters, adding that “we are following with great concern the tense atmosphere that has developed on the border.”\n\nRussian President Vladimir Putin told Indian Prime Minister Narendra Modi during a phone call on Monday that the “particularly privileged partnership” between Moscow and Delhi was “not subject to external influence and continues to develop dynamically in all areas”, the Kremlin said in a statement.\n\nMoscow last week said it was ready to mediate after Russian Foreign Minister Sergei Lavrov held calls with both sides last week.\n\n“India is our strategic partner. Pakistan is also our partner. We value our relations with both Delhi and Islamabad,” Peskov said.\n\nPublished in Dawn, May 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:17:03.746Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908702",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T00:31:52.000Z"
}
