{
  "title": "Downpour, strong winds batter Larkana, Qambar and Tharparkar - Pakistan - DAWN.COM",
  "author": null,
  "content": "LARKANA: A 12-year-old boy was killed while a 30-minute rainfall coupled with strong winds played havoc with electricity network, high-grown trees, hoardings and solar panels across Larkana, Qambar-Shadadkot and Tharparkar districts late Sunday evening and Monday.\n\nThe boy, Ali Raza Brohi, 12, was killed when a wall of a structure collapsed and the debris fell on him due to pressure of the downpour and strong winds in Shambozai Mohalla.\n\nThe heavy spell of rain turned the otherwise extremely hot weather pleasant. However, electricity in all the three districts remained suspended for many hours after the rain started falling.\n\nRainwater caused flooding in the low-lying areas and caused trouble to pedestrians and drivers of various vehicles as roads and streets were submerged. In many areas, trees and hoardings were brought down by strong winds.\n\n12-year-old boy killed in rain-related incident\n\nLarkana and its surrounding areas plunged into darkness late Sunday night as many feeders tripped during the rainfall.\n\nThree underpasses connecting Larkana city with the Chandka Medical College Hospital and Eastern part of the city were also submerged causing great inconvenience to people\n\nRainwater accumulated in the Chandka Medical College Hospital (city block) blocking people’s access to it.\n\nThe Met Department recorded 38mm of rain in Larkana and its surrounding areas and has predicted more rainfall until May 9.\n\nIn Tharparkar, most areas including Mithi, Islamkot, Nangarparkar, Chelhar and their surrounding villages received rainfall on Monday. Hailstorm was also reported from some areas.\n\nRoads and streets in Mithi and Islamkot, as well as many other cities and towns, were inundated as the drainage system did not work.\n\nPublished in Dawn, May 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/68194f10cafdf.gif",
  "retrievedAt": "2025-08-23T08:17:06.701Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908709/downpour-strong-winds-batter-larkana-qambar-and-tharparkar",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T00:32:29.000Z"
}
