{
  "title": "Sinner happy to return after doping ban but keeping expectations low for Italian Open - Sport - DAWN.COM",
  "author": null,
  "content": "ROME: World number one Jannik Sinner said on Monday that he was heading into the Italian Open with low expectations as he makes his comeback after serving a three-month doping ban.\n\nSinner agreed a settlement with the World Anti-Doping Agency in February and began an immediate three-month suspension after authorities accepted that the anabolic agent clostebol had entered his system via massages from his physiotherapist.\n\nThe three-times Grand Slam champion, who has not played since winning the Australian Open in January, will now hope to leave the doping saga behind him and build momentum for the French Open, which runs from May 25 to June 8.\n\nThe Italian was cleared to return to training from April 13, with his suspension ending on May 4.\n\n“It’s a very, very low expectation tournament in general for me, it’s talking also results wise,” Sinner told reporters ahead of the Italian Open.\n\n“What’s missing is the complete feedback of where my level is. That’s going to come then slowly with the time of playing, after the first round match I’m going to have a good picture of myself where I am at.”\n\nDespite missing out on three month’s action, the 23-year-old was assured of retaining the top ranking for his home tournament after his closest challenger Alexander Zverev crashed to an early defeat in Monte-Carlo Masters.\n\n“For me personally good news that the Grand Slams were not included … This kind of agreement, I didn’t want to do it in the beginning. It was not easy for me to accept it because I know what really happened, but sometimes we have to choose the best in a very bad moment,” Sinner said.\n\n“It’s all over now, so I’m happy to play tennis again.” Sinner said last year was very difficult for him.\n\n“I was in a tough situation and in the beginning of the Australian Open I struggled a lot. So, it was nice also to take a small break…,” he added.\n\n“But I could feel that I’m not playing for quite a long time. The body still has to adjust the times … the blisters in hands they come again because you’re not used to it anymore.”\n\nSinner’s first opponent on his return in the Italian Open could be compatriot Federico Cina. Sinner has been given a bye into the second round where he awaits the winner of 18-year-old Cina’s match with Argentine Mariano Navone.\n\nHe won’t face his big rival Carlos Alcaraz before the final, with world number seven and Madrid Open winner Casper Ruud a potential opponent in the quarter-finals.\n\nWorld number three Alcaraz withdrew injured from the Madrid tournament and has not yet arrived in Rome.\n\nThe Spaniard could face Britain’s Jack Draper, beaten by Ruud in the Madrid final, in the last eight.\n\nPublished in Dawn, May 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681951dc7db7a.gif",
  "retrievedAt": "2025-10-12T02:55:02.498Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908725/sinner-happy-to-return-after-doping-ban-but-keeping-expectations-low-for-italian-open",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T00:32:16.000Z"
}
