{
  "title": "Industry insists SBP policy rate cut ‘inadequate’ - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Contrary to the cautious welcome by the multinational companies, the entire business community slammed the State Bank of Pakistan (SBP) for slashing its policy rate by 100bps to 11 per cent as against their demand of bringing it to a single digit.\n\nOffering a different view, Pakistan Business Council (PBC) chief executive officer Ehsan Malik said that given rising imports and trade deficit, pressure on the exchange rate, and considerable geopolitical and trade uncertainty, the decision to reduce the policy rate by 100bps instead of 50bps came as a surprise.\n\n“It does, however, signal the bottoming out of the rate cut cycle which will help business plan for the next few months,” he said, adding that the Monetary Policy Committee (MPC) points to the need to maintain a measured monetary stance which the PBC has also been advocating.\n\n“I think it is a very well-thought-out decision of the SBP and better than our expectations of a 50bps cut,” Overseas Investors Chambers of Commerce and Industry (OICCI) Secretary General M. Abdul Aleem said.\n\nThe economy is now on a positive growth trajectory and such decisions should be taken on merit and not on the wish of a few, he remarked, adding that the key stakeholders should not wait and start making investment decisions to mobilise resources and generate economic activities, be it Large-Scale Manufacturing (LSM), exports, trading and housing and real estate.\n\nMr Aleem said the depressed oil pricing is another positive sign. However, the challenges on the borders must be closely monitored in the short term. “All in all, a good decision by the SBP and positive for the business and industry,” he asserted.\n\nFederation of Pakistan Chambers of Commerce and Industry (FPCCI) President Atif Ikram Sheikh said the monetary policy continues to be based on a heavy premium vis-à-vis Consumer Price Index (CPI), and the State Bank reduced the policy rate by merely 100bps as against the industry’s expectation of 500bps reduction. He said the SBP policy rate should have been slashed to 7pc since the CPI stood at 0.30pc in April and is expected to be zero to 3pc in May-June, followed by low oil prices.\n\nKarachi Chamber of Commerce and Industry (KCCI) President Muhammad Jawed Bilwani said, “The cut in interest rate is a positive yet inadequate step toward economic revival.”\n\nPakistan’s interest rate remains the highest in the region despite having the lowest inflation. “India’s policy rate is at 6pc, followed by Bangladesh’s 10pc, Vietnam’s 3pc and Thailand’s 1.75pc. These countries are actively supporting their businesses, while Pakistani industries continue to suffer under unsustainably high borrowing costs,” he added.\n\nPublished in Dawn, May 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:55:05.018Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908737/industry-insists-sbp-policy-rate-cut-inadequate",
  "dateList": "2025-05-06",
  "date_published": "2025-05-06T00:32:10.000Z"
}
