{
  "title": "Overseas Pakistani Faisal Sami wins 2024 UK volunteer of year award",
  "link": "https://www.app.com.pk/national/overseas-pakistani-faisal-sami-wins-2024-uk-volunteer-of-year-award/",
  "date_published": "2024-10-30T10:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 30 (APP): Syed Muhammad Faisal Sami, UK Head of Faizan Global Relief Foundation (FGRF), (Dawat-e-Islami) has won the ‘UK Volunteer of the Year 2024’, in recognition of his dedicated humanitarian efforts both in the UK and internationally.\nHis efforts include food distribution, health services, drug prevention, and disaster relief worldwide.\nAwarded by Charity Today, he was recognized for his exceptional contributions to supporting vulnerable communities in the UK and globally.\nFaizan Global Relief Foundation (FGRF) is well-known for its dedication to humanitarian efforts, addressing relief needs both locally and globally. Its initiatives cover a broad spectrum, including disaster relief, food distribution, educational programs, and health services.\nFGRF aims to empower communities, alleviate poverty, and foster social welfare through its outreach programmes and charitable projects.\nUnder the leadership of Syed Muhammad Faisal Sami, FGRF UK has made significant strides in addressing pressing social issues. Syed has been instrumental in leading projects that provide essential support to those in need.\nIn the UK, Syed has worked above and beyond to support individuals.\nDuring COVID-19, he set up food parcels and supported in delivering thousands of food parcels to those struggling. Syed also led a dedicated team of FGRF volunteers to tackle holiday hunger, ensuring that “no child goes hungry in the holidays.”\nUnder his leadership, the team has successfully provided meals and support to families during school breaks. He has collaborated with West Midlands Police to run drug awareness programmes, establishing prevention workshops that empower local communities to combat drug-related challenges.\nAdditionally, Syed has addressed county lines issues by implementing prevention strategies and raising awareness in the community. To further support public health, Syed has established free health check camps, offering attendees BMI assessments and blood pressure checks. This initiative eases the pressure on NHS services, helping to reduce wait times and queues for vital health checks. This initiative eases the pressure on NHS services, helping to reduce wait times and queues for vital health checks. Moreover, Syed has initiated tree-planting projects in the UK and participated in worldwide plantation programmes, promoting efforts to reduce our carbon footprint, in an effort to try mitigating the global warming crisis. These initiatives not only enhance local environments but also contribute to a more sustainable future.\nSyed Muhammad Faisal Sami is also actively involved in humanitarian efforts worldwide. He played a key role in providing earthquake relief in Turkey, Syria, and Morocco, and in Pakistan, he supported flood victims by delivering ration bags and helping in the construction of homes. In Palestine, he provided humanitarian aid, while in Malawi, Tanzania, Gambia, and South Africa, he worked on improving education and health facilities. Additionally, he contributed to welfare programmes in Libya and Egypt and engaged in social welfare projects in Suriname.\nIn his acceptance speech, Syed expressed his gratitude:\n“I am deeply honoured to receive the ‘UK Volunteer of the Year 2024’ award. This recognition reflects not only my efforts but also the dedication of everyone at Faizan Global Relief Foundation and Dawat-e-Islami. Together, we have worked tirelessly to uplift those in need and make a positive impact in our communities. I hope this award encourages more people to engage in volunteerism and contribute to a better society.”\nLee B. Rayment, Founder and Editor of Charity Today, praised Syed Muhammad Faisal Sami as the UK Volunteer of the Year for 2024, highlighting his impactful work in communities globally. The ‘Charity Today Awards’ celebrate individuals dedicated to volunteer service and community support, with Sami’s achievement emphasizing the importance of volunteers in fostering compassion and social responsibility.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:31:09.054Z"
}
