{
  "title": "Prof Dr M. Iqbal Choudhary appointed as Coordinator General, COMSTECH",
  "link": "https://www.app.com.pk/national/prof-dr-m-iqbal-choudhary-appointed-as-coordinator-general-comstech/",
  "date_published": "2024-10-30T17:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 30 (APP): Prof Dr M. Iqbal Choudhary has been reappointed as the Coordinator General of COMSTECH for the second term of four years by President Asif Ali Zardari.\nProf Choudhary has been serving COMSTECH as Coordinator General since April 2020, said a news release.\nThe appointment of Prof Choudhary for second term has been welcomed by the diplomats of the OIC member states, vice chancellors and concerned circles.\nProf Choudhary started a number of projects supporting the capacity building and socio-economic development of OIC member states during his first term.\nCOMSTECH is the only OIC institution chaired by Pakistan. COMSTECH is the Ministerial Standing Committee on Scientific and Technological Cooperation of the OIC (Organization of Islamic Cooperation) which was established by the Third Islamic Summit of OIC held at Makkah, Saudi Arabia in January 1981. COMSTECH is composed of all the member states of the organization represented by their ministers of science and technology or nominated representatives.\nThe President is the chairman, Prime Minister of Pakistan is the co-chairman and the Coordinator General is the Chief Executive of COMSTECH. Prof Dr M. Iqbal Choudhary is a distinguished national meritorious professor.\nHe is among the most prominent scientists of Pakistan, recognized for his contributions in the fields of natural products and bio-organic chemistry. He has written and edited 76 books, most of which have been published in USA and Europe.\nHe has published 1,175 research papers in the fields of organic and bio-organic chemistry in international journals, 76 books and 40 chapters in books published by major US and European press.\nHe has secured 40 US patents so far. Dr Choudhary’s work has been cited by the researchers from around the world by 41,000 times and his h-index is 82.\nBy now over 100 national and international scholars have completed their PhD degrees under his supervision. Dr Choudhary is D.Sc., Ph.D., and C. Chem. He has been awarded by different governments of Pakistan with Hilal-e-Imtiaz, Sitara-e-Imtiaz, and Tamgha-e-Imtiaz.\nHe has received Mustafa (pbuh) Prize (2021), ECO Award (2005), Khawarzimi Award (2006), COMSTECH Award (2011), TWAS Young Scientist Award (1994), and Prof Abdus Salam Prize (1989).\nHe is a fellow of world renowned science academies: Academy of Sciences for the Developing World, Islamic World academy of Sciences, Pakistan Academy of Sciences, Royal Society of Chemistry, and Chemical Society of Pakistan. He is also the Vice President of TWAS for South and Central Asia.\nRecently, Hunan University of Medicine (HNUM), named a newly constructed research building after Prof Dr M. Iqbal Choudhary. Prof Choudhary’s contributions to various scientific endeavors, particularly his strategic role in establishing Sino-Pak research centers, have been instrumental in fostering collaborative projects between Chinese and Pakistani scientists.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:30:34.214Z"
}
