{
  "title": "Lahore’s air quality poses serious threats to public health, biodiversity",
  "link": "https://www.app.com.pk/national/lahores-air-quality-poses-serious-threats-to-public-health-biodiversity/",
  "date_published": "2024-10-30T09:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 30 (APP): Lahore’s air quality is continuing to worsen, resulting in serious impacts to the health of Lahore’s citizens, while also posing a threat to biodiversity.\nOn Monday this week, Lahore’s Air Quality Index reached an all-time high on the Air Quality Index (AQI). The level of harmful pollutants in the air is increasing and raising serious concerns.\nTo improve the city’s air quality, WWF-Pakistan has published policy recommendations and shared strategic insights gathered from the collection and analysis of the air quality data published from 2013-2024.\nThe data underscores that the city’s air quality is severely degraded and air pollution levels remain high throughout the year.\nThe report found that key contributors to worsening air quality included vehicular emissions, crop residue burning, industrial processes, and coal combustion.\nTo tackle these challenges, WWF-Pakistan has shared key recommendations in its recent report. The report lays out a plan to promote electric vehicles (EV), enhance sustainable development models, segregate industrial zones, expand mass transit networks, and switch to renewable energy sources.\nCommenting on the study, Hammad Naqi Khan, Director General WWF-Pakistan, said that worsening air quality and persistent smog is a serious issue not only for the people but also the biodiversity, especially birds and other animals. “The adoption of electric vehicles can help reduce vehicular emissions that lead to poor air quality. However, financial subsidies and establishing EV charging infrastructure are essential for the transition to electric vehicles” he added.\nThe report also recommends the widespread use of low-cost sensor-based monitoring systems, which can effectively measure pollutants and are relatively economical, thereby filling the gaps in air quality monitoring infrastructure.\nKhan stated that “These low-cost air quality monitoring systems can be used to identify air pollution hotspots and can also be synchronized with traffic management. For example, the provision of alternate routes to avoid traffic congestion or prohibiting heavy transport vehicles in certain areas can reduce localised emissions in the already compromised air quality.”\nThe report indicates that fine particulate matter such as PM2.5, carbon monoxide (CO), ozone (O3), nitrogen dioxide (NO2), and sulphur dioxide (SO2) are among the most harmful pollutants affecting public health. Lahore’s population, exceeding 13 million residents, faces serious health risks due to the deteriorating air quality.\nSohail Ali Naqvi, Director Freshwater Programme, WWF-Pakistan, stated “Lahore consistently ranks among the most polluted cities globally with high concentration of pollutants.\nThe rapid rise in vehicles in Lahore and surrounding cities emit significant quantities of pollutants. Industrial activities including factories and poorly regulated brick kilns also exacerbate air quality”.\nAdditionally, when farmers burn agriculture residues, it causes periodic spikes in the pollution levels in surrounding areas.\nThe report makes medium and long-term recommendations to tackle some of these issues, including the capacity building of farmers on crop residue management, where non-profit organisations like WWF could play a critical role. It also recommends the expansion of a mass transit network, the designation of industrial zones, and the shifting of industries from urban areas to these zones.\nNazifa Butt, Director Climate and Energy at WWF-Pakistan, called for an action plan that aims at promoting renewable energy sources and enforcing compliance in the industrial sector. She was of the view that shifting of leather, textile, and steel industries from conventional coal and diesel-based power generation systems to solar energy can significantly decrease air pollutants. “Industries emitting high levels of pollutants must install relevant pollution control devices”, Butt remarked.\nTo improve the air quality in Lahore, WWF-Pakistan recommended mandatory vehicular emission testing; integrated traffic management; crop residue management through capacity building and alternative uses, and minimising the fugitive dust in the construction sector.",
  "retrievedAt": "2025-08-10T20:31:27.627Z"
}
