{
  "title": "Govt. focusses on economic uplift of masses: DPM Dar",
  "link": "https://www.app.com.pk/national/govt-focusses-on-economic-uplift-of-masses-dpm-dar/",
  "date_published": "2024-10-30T16:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 30 (APP): Deputy Prime Minister/Foreign Minister Mohammad Ishaq Dar on Wednesday highlighted that the incumbent government focused on efforts to uplift the economic conditions of the masses.\nNow, the country was on road to sustainable growth as all the macro-economic indicators were doing well with food inflation nosediving and the GDP on the rise, the deputy prime minister and foreign minister expressed his views during the launching ceremony of BOGO LIV, a financial mobile application, as a chief guest.\nHe further said that Pakistan Stock Market had been the best performing market in the Asia while the credible global institutions were all projecting Pakistan’s economy on road to recovery.\nDar stressed that they needed to introspect on their past and reflect as to how correct the course and stay on the right course.\nHe said that government’s strategy revolved around encouraging productivity through private sector, adding it was not the government’s job to do businesses, rather it acted as facilitator to encourage the private sector.\nThe DPM/Dar further said that the airports were to be outsourced in the country. When the UK could do it why it could not be done here for the purpose of provision of better services, he added.\nHe said that the government was also focusing on downsizing its size and curtailing its spending, adding that immense potential still existed in the country, though they had lost a lot yet the vast opportunities existed.\nDar underscored the need of maintaining the economic stability and called for unity, hard work and moving in the right direction.\nHe said after few months of this government’s tenure, the inflation rate had brought down to around 7 percent while the monitoring policy rate was also reduced.\nAbout the launch of the digital app, the deputy prime minister/ foreign minister said that such like digital payment services and innovative models would contribute towards Pakistan’s digital economy and its financial landscape.\nHe said the government had the vision for digital and prosperous Pakistan and it was taking all steps to stabilize the economy.\nThe innovative ideas in the technological fields would strengthen and uplift lives of the communities, he observed, adding that the country’s population comprised about 67 percent of youth under 30 years of age.\nHe said while on the other hand, Pakistan was blessed with vast mineral wealth which was complemented by its IT and renewable energy sectors.\nThe novel digital financial programmes always contributed to Pakistan’s social and technological progress by benefiting consumers and businesses and by bringing more transparency and accountability, he added.",
  "retrievedAt": "2025-08-10T20:30:30.571Z"
}
