{
  "title": "PIE and DARE-RC collaborate on data-driven studies to tackle key education challenges - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan Institute of Education (PIE) and Data and Research in Education (DARE-RC) on Tuesday decided to collaborate on conducting studies that “effectively utilise data to address key education challenges”.\n\nA second meeting of the Research Advisory Group (RAG) was convened at the PIE Auditorium in Islamabad between PIE and DARE-RC — a project funded by UK International Development — bringing together policymakers, researchers, and development partners to discuss key education research priorities and enhance the role of data-driven policymaking, a press release issued by the organisations said.\n\nPIE Director General Dr Shahid Soroya — while speaking at the event — emphasised the need for a “collective working model to facilitate evidence-based policy”.\n\n“PIE provides a platform where academia, government, and the development sector can work together to shape education policy through research,” the press release quoted him as saying.\n\nHe acknowledged the contributions of key partners and his team, stating, “I appreciate the role of DARE-RC in collaborating with us in organising this meeting. I would also like to acknowledge and appreciate my team at PIE, who are contributing to this important work.”\n\nThe press release said that UK Foreign Commonwealth and Development Office (FCDO) Development and Policy Adviser Salim Salamah highlighted the “importance of a structured research agenda aligned with national priorities”.\n\n“This partnership with PIE is crucial, and we must build consensus on research focus areas,” he noted.\n\nIt said that DARE-RC Programme Director Saima Anwer stressed the “need to prioritise research questions over thematic preferences”.\n\n“We want to collaborate with PIE in conducting studies that effectively utilise data to address key education challenges,” she stated.\n\nAccording to the press release, education researcher and policy expert Irfan Muzaffar underscored the “importance of a data-driven approach”.\n\n“We should look at the data and develop research questions accordingly. With a strong foundation already in place at PIE, RAG is well-positioned to drive impactful research,” he said.\n\nEducation expert Dr Faisal Bari — according to the press release — highlighted PIE’s institutional strengths stating “PIE’s strengths lie in data standardisation and policy formulation.\n\n“It not only benefits from the support and mandate provided by the government but also receives valuable backing from key development partners such as DARE-RC, ensuring that meaningful research translates into policy,” Bari said.\n\nFederal Ministry of Education Joint Education Advisor appreciated PIE’s role in “producing data and evidence-based policy research”, reiterating “the importance of data-driven decision-making and PIE’s contribution towards shaping national education policies through robust research”.\n\n“The meeting reviewed progress on the early warning system for reducing school dropouts, discussed the role of data standardisation in policy formulation, and proposed the institutionalisation of provincial research networks to bridge the evidence-policy divide,” the press release said.\n\nIt concluded after an agreement was reached on the next steps, including strengthening RAG’s role as a national research body, deepening collaboration with provincial education departments, and enhancing the visibility of PIE’s research contributions, the press release added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/041913299e407c8.jpg",
  "retrievedAt": "2025-08-25T19:20:46.828Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889717/pie-and-dare-rc-collaborate-on-data-driven-studies-to-tackle-key-education-challenges",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T14:29:11.000Z"
}
