{
  "title": "Home secretary, Sindh IGP issued notices over plea against promotion rule for ASIs - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh High Court on Monday issued notices to the home secretary, inspector general of police (IGP) and others on a petition filed by six assistant sub-inspectors (ASIs) challenging their promotion method.\n\nThe petitioners submitted that that the promotion method for the ASIs serving in Karachi was made different from those serving in other zones of the Sindh police in violation of Articles 25 and 27 of the Constitution.\n\nThey asked the court to set aside an order issued by the IGP regarding the promotion method.\n\nA two-judge constitutional bench of the SHC comprising Justice Mohammad Karim Khan Agha and Justice Adnan-Ul-Karim Memon issued the notices for a date to be fixed by the court office after four weeks.\n\nPetitioners say 2,873 SIs serving in Karachi and 454 posts are still vacant\n\nThe petitioners submitted that they had passed the requisite exams for ASI (BPS-9) along with other candidates who were appointed in their respective police zones across Sindh, but not the successful candidates of the Karachi zone. They were appointed were appointed as ASI in 2016 after they moved the high court, they added.\n\nThey contended that many of their batchmates had been promoted to the post of sub-inspector and a few of them have become SHOs, but despite having spotless service record, they had not been promoted.\n\nThey also stated that currently, 2,873 SIs had been serving in Karachi zone against a total strength of 3,327, as 454 posts were still vacant.\n\nThe petitioners said that they were hoping to be considered for promotion as per law, but surprisingly, the IGP had passed an order on Jan 3, in which “upper school course for promotion of ASI to SI has been declared mandatory”.\n\nThey argued that the order was against the definition of Chapter 19 and Sub-chapter 25 of the Police Rules 1934, which can only be amended/change by the provincial assembly.\n\nThe petitioners contended that the impugned order was passed for the officials of the Karachi zone only as nine ASIs had been promoted in the Hyderabad zone without complying with the IGP’s order.\n\nThey asked the SHC to overturn the impugned order and also sought directions for respondents to consider them for promotion.\n\nPublished in Dawn, February 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:21:23.177Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889585/home-secretary-sindh-igp-issued-notices-over-plea-against-promotion-rule-for-asis",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T03:00:59.000Z"
}
