{
  "title": "LHC seeks reply from DC over PTI’s plea for Feb 8 gathering - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Lahore High Court (LHC) on Tuesday sought a reply from the city’s deputy commissioner on a PTI plea seeking permission to hold a public rally at Minar-i-Pakistan on February 8.\n\nThe opposition PTI has decided to observe a “black day” on February 8 (Saturday) to protest against its “stolen mandate” in last year’s general elections, which were dominated by independent candidates that the party fielded.\n\nMalik, the PTI’s newly appointed Punjab chief organiser, had submitted an application to Lahore DC Syed Musa Raza on January 29, seeking permission for the gathering. However, upon receiving no response, she then approached the LHC yesterday for the rally’s approval.\n\nPresiding over the hearing today, Justice Farooq Haider directed DC Raza to appear in person on February 6 (Thursday) and submit a response on the petition filed by Malik, also a former PTI MNA.\n\nThe judge also sought responses from other respondents named in the plea — namely the Punjab government; the Lahore commissioner, DC and additional DC; and the state.\n\nSpeaking to the media in Lahore today, Malik said February 8 was “not the PTI’s day but Pakistan’s”.\n\nAsserting that her party’s leaders and workers had been facing “oppression” for the past two years, Malik urged people to attend Saturday’s protest rally.\n\n“No segment [of the society] was spared from dacoity on Feb 8, 2024,” she said, referring to the elections in which the PTI says its mandate was “stolen”.\n\nStressing that ex-premier Imran Khan and his wife were in jail, Malik said the PTI founders’ sisters were appearing before courts in various cases.\n\n“Peaceful protest is our right,” the PTI leader said, asserting that the government “would not be able to stop” the protest on February 8.\n\nSpeaking to the media yesterday, Malik had said that in case of denial of permission for the Minar-i-Pakistan protest, the party would disclose its “plan B”.\n\nThe PTI has also announced a protest rally on February 8 in the Swabi district of Khyber Pakhtunkhwa, where the PTI is in power.\n\nTo mark the occasion, the party would distribute Rs50 million in development funds among the village councils, as well as Rs200,000 each to PTI workers convicted by military courts recently over the May 9, 2023 riots.\n\nIn her petition, Malik had also asked the court to direct the authorities to grant permission for the rally and restrain law enforcement agencies from harassing and abducting PTI workers, as well as from carrying out raids to arrest them.\n\nShe had termed it “strange” that whenever the PTI requested permission for a public gathering, security concerns were raised as what she said was a pretext to deny approval. The PTI leader also alleged that she was being harassed and threatened to withdraw the request.\n\nThe application detailed that the PTI leaders managing the power show would be Malik, Punjab Assembly Opposition Leader Malik Ahmad Bachhar, MPA Sheikh Imtiaz Mehmood, and Ali Ijaz Buttar.\n\n“We have not only called our poets as traitors i.e. Faiz Ahmad Faiz, we have levelled allegations of terrorism against political activists, we have hanged our elected popular prime minister and after approximately 50 years of his hanging seen a judgment calling for that he did not have a fair trial,” the petition read.\n\nRecalling that prime ministers and lawmakers had been in the past “put to trial in false and frivolous cases”, the plea said: “With a change of time we have seen change of hearts [and] the same judgment being reversed by way of their acquittal.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/04142206445fca1.jpg",
  "retrievedAt": "2025-08-25T19:20:51.938Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889690/lhc-seeks-reply-from-dc-over-ptis-plea-for-feb-8-gathering",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T08:36:57.000Z"
}
