{
  "title": "Australian cricketer Khawaja backs journalist fired over Gaza stance - World - DAWN.COM",
  "author": null,
  "content": "Australia batsman Usman Khawaja has condemned a radio station’s decision to drop cricket journalist Peter Lalor from its coverage of the Sri Lanka test series over social media posts related to the Israeli-Palestinian conflict.\n\nAustralian radio station SEN confirmed on Tuesday it had parted ways with Lalor, the former chief cricket writer of The Australian newspaper, after dialogue with him about some of the commentary on his social media.\n\nLalor’s feed on X includes re-posts of news stories about Israeli attacks in Gaza and accusations of genocide levelled at the Israeli government.\n\nPakistan-born Khawaja, who has been vocal in his support for Palestinians, wrote on Instagram that Lalor “deserved better”.\n\n“Standing up for the people of Gaza is not anti-Semitic nor does it have anything to do with my Jewish brothers and sisters in Australia, but everything to do with the Israeli government and their deplorable actions,” Khawaja said.\n\n“It has everything to do with justice and human rights. Unfortunately hatred towards the Jewish and Muslim community will always exist.”\n\nAustralia has been grappling with a series of anti-Semitic and Islamophobic attacks on places of worship, buildings and cars since the beginning of the Israel invasion of Gaza in late-2023.\n\nThe country’s race discrimination commissioner, Giridharan Sivaraman, has said Australia is in a “febrile time”.\n\n“Anti-Semitism and Islamophobia are both real, are both increasing, and are both significant concerns,” he has said.\n\nLalor, who was working as a freelance commentator for SEN, said he was told by the station’s management that there were accusations he was antisemitic, which he objected to.\n\n“I was told my retweeting was not balanced, and insensitive to one side and that many people had complained,” he said in a statement to subscribers on his Cricket et Al substack.\n\nSEN station boss Craig Hutchison said he and Lalor had a different view of the impact of the commentary on his social media.\n\n“We respect Pete as a journalist and long-time contributor to the game but also acknowledge the fear that many families in our community feel right now, and we also need to respect that,” Hutchison told the Sydney Morning Herald.\n\nAustralia lead the two-match test series 1-0 after beating Sri Lanka by an innings and 242 runs in the opener in Galle. The second test starts in Galle on Thursday.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/04151150ddfaf39.jpg",
  "retrievedAt": "2025-08-25T19:20:46.824Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889699/australian-cricketer-khawaja-backs-journalist-fired-over-gaza-stance",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T10:45:30.000Z"
}
