{
  "title": "Housing scheme on CDA radar for ‘grave’ violations of layout plan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Capital Development Authority (CDA) has pointed out that the Jinnah Garden Housing Scheme has not handed over amenities land to the civic agency in accordance with one of the primary conditions mentioned in the layout approval.\n\nThe housing society is a cooperative housing scheme in Zone IV of the federal capital, facing litigation in the Islamabad High Court.\n\nThe CDA recently submitted a detailed report to the court, pointing out several violations of the layout plan, which will be taken up at the next hearing.\n\nReferring to the Phase I extension of the housing project, the report said an area measuring 1,826 kanals was approved by the CDA in 2021 with certain terms and conditions, but to date, the operators had not submitted reports regarding the transfer of land reserved for parks, open spaces, playgrounds, graveyards, and the right of way.\n\nCDA says Jinnah Housing scheme has not handed over amenities land to civic body\n\nThe CDA stated that operators of the scheme were supposed to complete this task within 45 days after the approval of the layout plan.\n\nThe operators were also supposed to mortgage 20 per cent of the saleable areas in the layout plan with the CDA as a guarantee for completing development works in the specified areas.\n\nThe report pointed out several other deficiencies, including a sewage treatment plant, and the solid waste system.\n\nIt said in 2013, the operators of the scheme had transferred 44 kanal land in the form of residential and commercial plots and 20pc saleable area was mortgaged with the CDA and 179 kanals for roads/streets was also transferred to the CDA.\n\nHowever, the operators of the scheme were told that the land belonging to the CDA must be earmarked on the approved layout plan and submitted to the CDA, but to no avail.\n\nThe layout plan of Phase II, an area measuring 1,066 kanals, situated in Mouza Jabbi Gakhran, Chak Kamdar, Nara Syedan, and Kahuta Road, was approved in October last year by the CDA subject to certain terms and conditions.\n\nHowever, the land reserved for public parks and playgrounds was not transferred to the CDA whereas the process of mortgaging 20pc of the saleable area with the authority in the layout plan was also incomplete.\n\nThe CDA claimed that besides other deficiencies, the environment report and the waste management plan were also not submitted.\n\nCombined layout plan\n\nAccording to the report, CDA received a request for the approval of a ‘Revised & Extended Combined Layout Plan of Jinnah Garden (Phase-I & Extension)’ over an area measuring 6,757 kanals, in December last year, but the housing scheme did not provide the supporting documents.\n\nAccording to the report, the CDA visited the housing scheme on Jan 16. It said that without restoration of the layout plan for the Jinnah Garden (Phase-I), and without obtaining an NOC for development works on the site, the work was being carried out in E and G blocks. Moreover, a marquee was also constructed in Block F in violation of rules and regulations.\n\nThe CDA said in another complaint it was claimed the land reserved for amenities (parks, playground, hospital etc.) measuring 204 kanal had been exchanged with the Naval Anchorage Housing Scheme.\n\nTherefore, they [operators of the scheme] have been ordered to stop the development works and dismantle/remove all the development works carried out in violation of the layout plan. They were further advised to submit a detailed report regarding the deletion of 204 kanals reserved for amenities.\n\nPublished in Dawn, February 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:21:13.982Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889581/housing-scheme-on-cda-radar-for-grave-violations-of-layout-plan",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T03:01:23.000Z"
}
