{
  "title": "Arsenal thrash Manchester City to boost title challenge - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Arsenal’s 5-1 demolition of Manchester City on Sunday kept the Gunners still within reach of Liverpool in the Premier League title race.\n\nIn the battle between the top two for the past two seasons, the Gunners prevailed to move within six points of leaders Liverpool, who have a game in hand.\n\n“It is a great day for us, especially with the necessity that we had to win the game,” said Arsenal boss Mikel Arteta.\n\nA day to savour for Arsenal against the side that has denied them the title in each of the past two seasons was lit up by goals from academy graduates Myles Lewis-Skelly and Ethan Nwaneri.\n\nThe teenagers became the youngest players to score in the Premier League against the reigning champions since Wayne Rooney announced his arrival for Everton against Arsenal in 2003.\n\nLewis-Skelly would have been banned had his controversial red card against Wolves last weekend not been rescinded.\n\nThe left-back made the most of that reprieve with a barnstorming performance that was capped by his first goal for the club.\n\nHe rounded it off with a cocksure celebration as he mimicked City striker Erling Haaland’s trademark meditation pose.\n\nNwaneri completed the rout with his seventh goal of the season and is thriving in the extra minutes offered by Bukayo Saka’s injury layoff.\n\nThe vibrancy of Arsenal’s youth contrasted sharply with an ageing City side, whose best days are clearly behind them and need a refresh if Pep Guardiola is to make them contenders again next season.\n\n“It’s happened all season, we are giving away too many things,” said City manager Guardiola. “You cannot lose the control, it’s 95 minutes. You cannot finish in the way we played.”\n\nArsenal were gifted the perfect start inside two minutes as Manuel Akanji lost possession and Kai Havertz squared for Martin Odegaard to open the scoring.\n\nHaaland headed in his 250th career club goal early in the second half to bring City level but the defending champions are a pale shadow of their former selves this season and conceded within 105 seconds of the restart when Thomas Partey’s shot deflected in off John Stones.\n\nEighteen-year-old Lewis-Skelly curled in Arsenal’s third before Havertz fired low and hard into the far corner with City cut open at will by the Arsenal counter-attack on 76 minutes.\n\nNwaneri rounded off the rout when he curled home in stoppage time.\n\nDefeat leaves City still in fourth but now 15 points off the top and realistically dethroned after four consecutive seasons as champions.\n\n“How we played in the last 30 minutes was not acceptable. Personally and collectively, it’s not us,” Stones said. “It is not nice to be involved in that when you know it’s not your team in those situations. Credit to Arsenal, this is not an easy place to come to.\n\n“For 65 minutes, we played some great football at times. We were in the game and it was a swinging point. It swung the wrong way for us. I am angry, upset personally and collectively about how the game finished.”\n\nLiverpool’s lead may prove too much for Arsenal to usurp by May but midfielder Declan Rice says there is a determination to hunt them down.\n\n“Liverpool are still quite far in front especially with the game in hand and with them winning yesterday you know going into the game that you have to win,” Rice, who provided two assists, told Sky Sports.\n\n“It’s more disappointing the games like Aston Villa when we were 2-0 up and dropped points because we could be up there closer to Liverpool.\n\n“But we will be there and we will keep pushing. We do need others to help us but we know what the goal is and that’s to hunt them down and win the Premier League. We need to stay positive and I’m sure we will be fine.”\n\nPublished in Dawn, February 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a15b030d170.gif",
  "retrievedAt": "2025-08-25T19:21:24.949Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889604/arsenal-thrash-manchester-city-to-boost-title-challenge",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T03:00:48.000Z"
}
