{
  "title": "USAID website goes dark after Musk rebuke - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The official website of the US Agency for International Development (USAID) remained offline on Monday, two days after it first went dark, amid reports that the agency is being merged with the US State Department.\n\nThis development follows comments made by Elon Musk, the world’s richest man, who is overseeing major government reforms.\n\nDuring an online conversation on X, Musk confirmed that President Trump had authorised the dismantling of the agency, which was established under the Foreign Assistance Act of 1961 to coordinate US foreign aid.\n\n“We went over it with (the president) in detail, and he agreed that we should shut it down,” Musk said.\n\n“We spent the weekend feeding USAID into the wood chipper… USAID is a criminal organisation. Time for it to die,” he wrote on X.\n\nThe agency is among the world’s biggest providers of humanitarian aid to foreign nations. In 2023, it received $43 billion in funding and had a workforce of over 10,000 before the layoffs. The agency supports projects addressing hunger, poverty, and disease.\n\nThe disruption to its work became apparent on Monday, when USAID’s headquarters were closed for the day. Employees were instructed to work remotely or remain at home, except for those responsible for essential maintenance duties.\n\nA weekend email from USAID leadership instructed staff accordingly, while plaques bearing the USAID seal were removed from offices, signaling a shift in the agency’s structure.\n\nThe agency’s social media accounts were also taken offline, replaced by a streamlined version on the State Department’s website. Attempts to access the original website resulted in an error message indicating that the “IP address could not be found”.\n\nThis move is part of the Trump administration’s broader strategy to overhaul US foreign aid distribution.\n\nLast week, the administration issued an executive order freezing funding for foreign aid while a review is conducted to ensure it aligns with the “America First” foreign policy.\n\nReports suggest the administration plans to bring USAID under the direct control of the State Department, a proposal discussed on Friday when early signs of the agency’s closure emerged.\n\nUSAID employees are now left uncertain about their future, as lawmakers and aid workers express concern over the potential loss of the agency’s independence.\n\nPublished in Dawn, February 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a1851c31d2e.jpg",
  "retrievedAt": "2025-10-12T01:07:44.223Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889629/usaid-website-goes-dark-after-musk-rebuke",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T03:08:39.000Z"
}
