{
  "title": "Fly Jinnah secures Bangladesh nod to operate Karachi-Dhaka route soon: reports - World - DAWN.COM",
  "author": null,
  "content": "Fly Jinnah, a low-cost air carrier for domestic routes, has secured the nod from Bangladesh to operate flights from Karachi to Dhaka, it emerged on Tuesday.\n\nThe development comes after Bangladesh High Commissioner to Pakistan Mohammad Iqbal Hussain announced last week that direct flights between the two countries were expected to begin within the next few months. He had also revealed that cargo flights between Dhaka, Karachi and Lahore would also commence soon, further facilitating trade and business exchanges.\n\nBangladeshi media outlet The Daily Star reported a day ago that Civil Aviation Authority of Bangladesh (CAAB) Chairman Air Vice Marshal Monjur Kabir Bhuiyan told it: “They (Fly Jinnah) applied to us, and we have approved it.”\n\nHe further said: “Now they (Fly Jinnah) will appoint a GSA (General Sales Agent). Once they request slots and frequencies, we will provide them. Our part is currently complete.”\n\nIndian media outlet ANI also reported that a direct air link between the two countries would be set up soon after the launch of a direct shipping line between Chittagong and Karachi.\n\n“CAAB has approved a proposal of Fly Jinnah to operate direct flights between Bangladesh and Pakistan. We will sign a deal to resume Dhaka-Karachi direct flights,” the outlet quoted the said Abdul Naser Khan, additional secretary to Bangladesh’s Ministry of Civil Aviation and Tourism, as saying.\n\nThe two countries were once one nation but split following a bloody civil war, which saw the territory previously referred to as ‘East Pakistan’ seceding to form the independent nation of Bangladesh.\n\nIn the years since the split, Dhaka’s leaders — especially the recently ousted regime of Sheikh Hasina — stayed firmly in the Indian camp, preferring to maintain close ties with New Delhi and keeping Islamabad at arm’s length. However, ever since a popular uprising that saw Hasina’s government toppled in August, there has been a thaw in ties between the two capitals, with trade and bilateral relations seeing a marked improvement.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:20:45.579Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889721/fly-jinnah-secures-bangladesh-nod-to-operate-karachi-dhaka-route-soon-reports",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T14:44:28.000Z"
}
