{
  "title": "Four more bunkers destroyed in Kurram - Pakistan - DAWN.COM",
  "author": null,
  "content": "KURRAM: Four more bunkers were demolished on Monday as part of the ongoing efforts to enforce a peace agreement in restive Kurram district.\n\nThe district administration officials said that a total of 26 bunkers had so far been destroyed in accordance with the peace agreement signed by the warring groups of Kurram district.\n\nMeanwhile, in Lower Kurram, the traders staged a demonstration after a convoy of over 40 trucks carrying food items arrived from Thall area of Hangu, vowing not to allow them to proceed to Parachinar, the district headquarters.\n\nHaji Rauf, a traders’ leader, said traders’ trucks had been stuck on the Thall-Kohat Road for several months, but they were not allowed to proceed to Kurram.\n\nHe said that till the trucks of traders were not allowed to move to Kurram they would not let the convoy of trucks to move forward. He also announced a shutter-down strike in Parachinar from Tuesday (today) against this ‘unfair’ treatment.\n\nHe said the food items being delivered in 40 to 50 vehicles per week were not sufficient for the affected regions. He also demanded reopening of all the roads.\n\nHaji Rauf alleged that influential individuals got their tucks included in the convoy, and such vehicles often went missing after reaching Kurram, which created further difficulties for the residents.\n\nSyed Makhdum Shah, a social worker, alleged that influential individuals were given priority in the helicopter service to shift patients and overseas citizens, neglecting those in need. He demanded a transparent process for preparing a list of those in need for availing the helicopter service.\n\nPublished in Dawn, February 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:21:11.444Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889542/four-more-bunkers-destroyed-in-kurram",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T03:01:33.000Z"
}
