{
  "title": "HRCP for impartial probe into PTI’s Nov 26 protest - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Human Rights Commission of Pakistan (HRCP) has urged the government to immediately announce an independent, impartial inquiry into the PTI-led protest in Islamabad on Nov 26, 2024, involving the families of the alleged victims, the PTI and other political stakeholders.\n\nHRCP on Monday released a fact-finding report about PTI-led protest in Islamabad on Nov 26. The report concluded that contrary to the federal government’s claims, the PTI-led protest in Islamabad on Nov 26, 2024 led to loss of life allegedly among the protesters as well as reported deaths among the security personnel.\n\nA high-level fact-finding mission has documented oral testimonies from state representatives, the PTI leadership, reporters on the ground and the families of seven people who were allegedly killed during the protest.\n\nThe mission is deeply concerned by allegations that the hospital administrations and police withheld the bodies of victims until their families agreed not to pursue any legal action. While the hospital administrations refused to speak with the fact-finding team, accounts from journalists and the families of alleged victims suggest that these hospitals may be concealing information.\n\nWhile the right to peaceful assembly is constitutionally guaranteed, it must remain within the bounds of the law.\n\nReports indicate that some protesters carried slingshots, tear gas shells and firearms spotted on occasion. At the same time, the administration demonstrated a clear lack of proficiency in managing the protest and used force excessively and disproportionately. Although the mission attempted to contact the interior minister to inquire about the use of live ammunition against protesters, he was unavailable to meet the team.\n\nThe mission has expressed alarm over the mainstream media’s blackout of the entire event, which may have resulted from state coercion or self-censorship. The media should have been allowed to assess the situation on the ground without hindrance and report the facts.\n\nThe report urges the government to immediately announce an independent, impartial inquiry into these events, involving the families of the alleged victims, the PTI and other political stakeholders.\n\nPublished in Dawn, February 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/04124000b3e1d53.jpg",
  "retrievedAt": "2025-10-12T01:07:39.593Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889561/hrcp-for-impartial-probe-into-ptis-nov-26-protest",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T03:01:51.000Z"
}
