{
  "title": "India’s Modi invited to meet with Trump next week: White House official - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump has invited Indian Prime Minister Narendra Modi to visit the White House next week, a White House official said, hours after a US military plane departed to return deported migrants to the country.\n\nTrump spoke with Modi on Jan 27, when he discussed immigration and stressed the importance of India buying more American-made security equipment and fair bilateral trading ties.\n\nIndia, a strategic partner of the United States in its efforts to counter China, is keen to enhance trade relations with the US and make it easier for its citizens to get skilled worker visas.\n\nIt is also keen to avoid tariffs that Trump has threatened in the past, citing India’s high tariffs on US products.\n\nThe United States is India’s largest trading partner and two-way trade between the two countries surpassed $118 billion in 2023/24, with India posting a trade surplus of $32 billion\n\nA US military plane is deporting migrants to India, a US official said on Monday, the farthest destination of the Trump administration’s military transport flights for migrants.\n\nPresident Donald Trump has increasingly turned to the military to help carry out his immigration agenda, including sending additional troops to the US-Mexico border, using military aircraft to deport migrants and opening military bases to house them.\n\nThe official, speaking on the condition of anonymity, said the C-17 aircraft had departed for India with migrants aboard but would not arrive for at least 24 hours.\n\nThe Pentagon has also started providing flights to deport more than 5,000 immigrants held by US authorities in El Paso, Texas, and San Diego, California. So far, military aircraft have flown migrants to Guatemala, Peru and Honduras.\n\nThe military flights are a costly way to transport migrants. Reuters reported that a military deportation flight to Guatemala last week likely cost at least $4,675 per migrant.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:20:53.410Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889680/indias-modi-invited-to-meet-with-trump-next-week-white-house-official",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T07:01:32.000Z"
}
