{
  "title": "Ex-British soldier jailed for spying for Iran - World - DAWN.COM",
  "author": null,
  "content": "LONDON: A former British soldier who sparked a manhunt after escaping from prison before his trial was sentenced by a UK court on Monday to 14 years for spying for Iran.\n\nDaniel Khalife, 23, was found guilty in November of espionage and terrorism charges as well as for escaping prison.\n\nA judge at Woolwich Crown Court in southeast London sentenced him to 14 years and three months jail for embarking on a “dangerous and fantastical plan” that involved passing sensitive information to Iranian intelligence for cash.\n\nKhalife, whose mother is Iranian, gathered information, including the names of elite special forces personnel, over a two-and-a-half-year period while posted in the UK and United States before being arrested and charged in 2023.\n\n“The mere fact that you started on this dangerous and fantastical plan demonstrates your immaturity and lack of wisdom,” said Justice Bobbie Cheema-Grubb.\n\nProsecutors accused Khalife of playing a “cynical game”, making contact with a man linked to Iranian intelligence after joining the British army. He subsequently told British intelligence he wanted to be a double agent, in what his defence lawyer termed a “hapless” ploy.\n\nIn September 2023, Khalife escaped a London prison strapped to the underside of a food delivery truck, sparking a three-day nationwide manhunt and raising concerns about prison security.\n\n“This sentence reflects the gravity of the offences committed by Khalife,” said Dominic Murphy, head of the Metropolitan Police’s Counter Terrorism Command.\n\nPublished in Dawn, February 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/04100803a9d6404.jpg",
  "retrievedAt": "2025-08-25T19:21:21.974Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889615/ex-british-soldier-jailed-for-spying-for-iran",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T03:01:08.000Z"
}
