{
  "title": "COAS rubbishes Indian military’s ‘hollow statements’, vows full throttle response to any ‘misadventure’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff (COAS) General Asim Munir on Tuesday rubbished recent “hollow statements” from the Indian military and vowed a befitting to any “misadventure” against Pakistan.\n\nIndian Army Chief General Upendra Dwivedi claimed last month that “60 per cent of the terrorists eliminated” in Indian-occupied Kashmir (IoK) in 2024 were allegedly of Pakistani origin. General Dwivedi further alleged that “80pc of the remaining fighters in IoK were of Pakistani origin”. The remarks had elicited a strong response from the Pakistan Army.\n\nA press release from the Inter Services Public Relations (ISPR) today said COAS Munir presided over the 267th Corps Commanders’ Conference at the General Headquarters where the comments from the Indian side came under discussion.\n\nThe ISPR said the high-level moot took “serious note of the recent reckless and provocative statements” from the Indian military leadership and termed them as being “irresponsible and detrimental” to regional stability.\n\nThe ISPR quoted the COAS as saying on the matter while addressing the military brass meeting: “Pakistan Army remains fully prepared to defend the country’s sovereignty and territorial integrity. These hollow statements from Indian military are indicative of their growing frustration and serve only to divert the attention of their masses and international community from their multiple internal fissures and blatant violations of human rights. Any misadventure against Pakistan will be responded with full and resolute force of the state.”\n\nThe meeting’s participants also discussed the prevailing situation along the Line of Control (LoC) and the Working Boundary near Sialkot.\n\nThe ISPR said that expressing solidarity with the “resilient people” of IoK on the eve of Kashmir Solidarity Day, the forum’s members strongly condemned the “continued blatant human rights violations” in IoK, recognising them as a “grave threat to regional peace and stability”.\n\nThe army brass reiterated Pakistan’s unwavering support for the “legitimate struggle of the Kashmiri people for their right to self-determination, as enshrined in relevant UN Security Council resolutions” and emphasised the significance of international engagement in addressing the persistent violations in the territory.\n\nThe forum undertook a comprehensive review of the regional and internal security landscape, assessing the “full spectrum of threats” to the country.\n\nOn other matters, the high-level moot expressed “grave concern over the continued use of Afghan soil” by the proscribed Tehreek-i-Taliban Pakistan (TTP) group for terrorist activities against Pakistan.\n\n“The forum stressed the imperative of concrete and tangible actions by interim Afghan government against Fitna Al Khawarij (the term used by the state to refer to the TTP) instead of denials as well as continuing with the strategy of undertaking all necessary measures in defence of Pakistan and its people.”\n\nThe ISPR said the moot’s participants also stressed the need to accelerate “people-centric socio-economic development initiatives in Balochistan, recognising the urgency of countering externally driven narratives of exclusion”.\n\nThe forum’s participants vowed that no one would be allowed to disrupt peace in Balochistan and “nefarious designs of foreign-sponsored proxies attempting to mislead and radicalise the youth of Balochistan will be decisively thwarted with the unwavering support of the people of Balochistan.”\n\nThe army chief also commended the operational preparedness of all formations and emphasised the importance of sustained mission-oriented training, enhanced military cooperation and the conduct of joint exercises in both conventional and counter-terrorism domains.\n\nConcluding the conference, the ISPR said COAS Munir reaffirmed that the military leadership remained “fully cognizant of the multifaceted challenges confronting the nation and is resolute in fulfilling its constitutional responsibilities with the steadfast support of the proud people of Pakistan”.\n\nThe ISPR added that the participants also paid “profound tribute to the sacrifices” made by the martyrs of the armed forces, law enforcement agencies, and citizens who laid down their lives in pursuit of peace and stability.\n\nSeparately, Federal Minister for Kashmir and Gilgit Baltistan Affairs Amir Muqam said that the Kashmir cause remained the foremost priority of the government, underscoring the nation’s unwavering commitment to the pressing issue.\n\nAddressing a press conference in Islamabad today, Muqam stressed that the nation stood united and firmly behind Kashmiris in IoK, reiterating Pakistan’s unshakeable resolve to support their rightful struggle.\n\nThe minister asserted that Indian Prime Minister Narendra Modi’s attempts to oppress the Kashmiris were unsuccessful. Muqam cited the recent elections, won by a Muslim majority party, as evidence of the Kashmiris’ resilience and resistance to oppression.\n\n“This development underscores the ongoing tensions and complexities surrounding the Kashmir region, a longstanding point of contention between India and Pakistan,” he said.\n\nFlanked by the convener of All Parties Hurriyat Conference AJK chapter, Ghulam Muhammad Safi, Muqam said they had planned a massive rally in Islamabad for tomorrow to mark the day in solidarity with Kashmiris.\n\nHe said that events would be held across the country, particularly in the provincial capitals where people would express their solidarity with Kashmiris.\n\nThe minister said the Indian army continued to violate human rights in IoK and exhibited aggression against locals which had made life difficult for the Muslim-majority region.\n\nHe said rallies and events would also be held in the embassies of Pakistan in foreign countries as a solidarity day being observed by Pakistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/04180159a37ae91.jpg",
  "retrievedAt": "2025-08-25T19:20:46.827Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889716/coas-rubbishes-indian-militarys-hollow-statements-vows-full-throttle-response-to-any-misadventure",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T13:37:47.000Z"
}
