{
  "title": "Opposition has no guts to overthrow Govt.: Fawad",
  "link": "https://www.app.com.pk/national/opposition-has-no-guts-to-overthrow-govt/",
  "date_published": "2021-12-28T13:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 28 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Tuesday said that the opposition parties did not have the guts and prowess to overthrow the present democratically-elected government with their so-called protest movement.\nReplying to questions during the media briefing on the decisions of the Federal Cabinet meeting chaired by Prime Minister Imran Khan, he said for agitation in politics, there was a need of leadership which the opposition lacked. “The opposition leadership can give their party workers only false hope.”\nSpecial Adviser to the Prime Minister on National Security Dr Moeed Yusuf accompanied the minister in media briefing.\nFawad said an opposition leader like Imran Khan was needed who really upset the then government by his bold and courageous leadership adding most of the political leaders in opposition were ‘daily-wagers’ who only wanted to pass time.\nThe minister said JUI-F chief Maulana Fazal was giving timelines to topple the government for the past three years.\nHe recalled that when the PTI came to power, Maulana Fazal in the very first year reached Islamabad along with his supporters with the false hope to topple the government. “Since then, he has been giving the dates.”\nAbout Rana Shamim affidavit in the Islamabad High court, Fawad said it was proved beyond any iota of doubt that how big Sicilian mafia Nawaz Sharif and family were.\nHe said Nawaz Sharif would never return home voluntarily, rather the government would bring him back after the finalization of the agreement with the UK government.\nThe minister said when former Speaker National Assembly Ayaz Sadiq issued the statement of bringing Nawaz Sharif back, the Sharif family somehow got worried.\nTo another question, he said that no mini-budget was in the offing as only adjustments would be carried out.\nHe said that the government was forced to go to the International Monetary Fund (IMF) due to the loot and plunder of former regimes of Asif Zardari and Nawaz Sharif.\nHe said the opposition instead of mere point-scoring, should come up with an alternative solution if they had any.\nHe said the bill would be presented in the ongoing session of the Parliament as an initial discussion on the draft was held in the Cabinet meeting.\nSharing details of the decisions taken by the Federal Cabinet, he disclosed that it approved the country’s first-ever national security policy.\nFor the first time in the national security policy, the minister said the economic strategy had been linked with geostrategic policy, adding if the economy of a country was not strong, then its security could not be guaranteed. “Until the common man is satisfied with the economic, social and legal situation, the security of the country will remain in danger”, he said.\nFawad said national security policy focused on the common man.\nHe said work on the policy was initiated in 2014 that got approval in 2021, which meant it took almost 9 years in its preparation and approval after input from 18 different ministries.\nIn the past, Fawad said consensus could not be evolved on national security policy and it was for the first time that a government in power, incorporated points of view of all stakeholders.\n“For the first time under the leadership of Prime Minister Imran Khan, we have surpassed an important milestone”, Chaudhry Fawad remarked.\nThe policies of other ministries including internal policy and food security policy were also linked with the national security policy, he said.\nThe minister informed the media that the Cabinet was given a briefing on urea production as the agriculture sector was the top priority of the government.\nDuring the past two years, he said there had been tremendous successes in agricultural produce as cotton, sugarcane, rice, wheat and maize crops remained bumper. “There have been historic production of wheat, rice and sugarcane.”\nHe said additional Rs 1100 billion had been added to the agriculture sector and procurement of tractors, motorcycles, agro-medicines witnessed a substantial increase in rural areas.\nHe said the price of DAP fertilizer in the international market had gone up to about Rs 12,000, and Pakistan had to import more than 70 per cent of the commodity.\nThe minister said despite the gas crisis, the government provided gas to urea plants to ensure its availability in the country and this year a record production of urea was achieved.\nThe minister said price of urea in the world market was around Rs 10,500 per bag, whereas its price in Pakistan was between Rs 1700 to 1900.\nHe said urea shortage was noticed in some parts of the country due to rising prices in the world market.\nFawad assured that Pakistan had enough stock of urea, its price was stable, production was good but in some places, there were complaints of hoarding and smuggling. The Cabinet had asked the Punjab government for an effective crackdown on urea hoarders and smugglers. “If a smuggling of a truck of urea is stopped , about Rs. 8 million can be saved.”\nHe said an artificial shortage of urea would be overcome, and hopefully, the situation would improve in 48 hours.\nIn another landmark decision, the minister said, the Cabinet had ordered publication of MPs 2019 tax directory, adding no other sector had as much accountability as of politicians.\nPrime Minister Imran Khan, Fawad said had laid the foundation of a government based on transparency, and the assets of politicians and their families were in view of the public.\nThe minister said that on the recommendation of the Finance Ministry, he said that the cabinet gave approval to the names of the members of new Board of Directors of House Building Finance Corporation (HBFC).\nHe  said that the cabinet gave approval to the bill for increasing coordination among various educational boards. Fawad said that the cabinet also gave approval to the proposal for the appointment of Muhammad Asim for the post of Executive Member of the PEMRA.\nThe cabinet also gave approval to the constitution of a joint investigation team for investigation into the killing of journalist Nazim Jokhio who was killed in Karachi.\nHe said  that criminal investigation into his murder case had been compromised to save the killers of the journalist.\nHe said that the cabinet approved the proposal to convert Citizen Club in F-9 Park to Gandhara Heritage and Cultural Centre and the PM would head its management committee.\nHe said that the cabinet approved the proposal to send to Cuba made-in-Pakistan Covid-related medical equipment worth Rs 23 million.  The consignment included face masks, sanitizers and personal protective equipment.\nHe said that now the ministries had been given the powers to make temporary appointments for 6 months on the vacant posts.",
  "retrievedAt": "2025-08-11T21:46:25.557Z"
}
