{
  "title": "Pak-China TVTI at Gwadar to be functional from January",
  "link": "https://www.app.com.pk/national/pak-china-tvti-at-gwadar-to-be-functional-from-january/",
  "date_published": "2021-12-28T11:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 28 (APP):The Pak-China Technical and Vocational Training Institute at Gwadar will likely to be functional from January next as the development work on the project has been completed.\nThe first-ever state-of-the-art vocational and technical training institute in the port city of Gwadar would accommodate 360 trainees at one time and provide training opportunities for at least 1,000 people every year, said an official on Tuesday.\nThe institute would create job opportunities for 249 people whereas half of them would be local people of Gwadar, he added.Under the China Pakistan Economic Corridor (CPEC), the project was initiated in the port city to provide standard vocational education to the people of Balochistan in modern technological field, he added.\nThe official said, the students belonging to Gwadar district would be enrolled free of cost to get modern vocational skills in the institution. The students after completing their course work would be sent to china for filed visits of various industries to get hands on exposure of modern technologies and industrial advancements.\nThe province was going to embrace huge economic and employment opportunities after CPEC’s operational phase and it was imperative to ensure quality education of the local masses to benefit from the game changer project, he added.\nAccording to official sources, the project was being built under CPEC at the total cost of $ 10 million.“The project will enhance skills of local population of Gwadar to participate in the growth of the Port City and bring investment, business and tourism in the area,” he added.\nThe Institute would help fulfilling maritime skilled manpower requirements of the Gwadar Port after the development of industrial projects including the Gwadar Port Free Zone, Export Processing Zone and other industrial and port-related projects.\nThe Institute comprises a main building, having two blocks, an administration block, four workshops, cafeteria, hostels, parking areas, an examination block and a teachers lodging facility, he said.",
  "retrievedAt": "2025-08-11T21:46:23.157Z"
}
