{
  "title": "Over 18,600 seminaries registered as gov’t integrates religious education into national framework: Dr. Qamar",
  "link": "https://www.app.com.pk/national/over-18600-seminaries-registered-as-govt-integrates-religious-education-into-national-framework-dr-qamar/",
  "date_published": "2024-12-09T12:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP):Project Director of Directorate General of Religious Education (DGRE), Major General (Retired) Dr. Ghulam Qamar on Monday said that substantial steps had been taken to integrate religious seminaries into the national education system.\nAddressing a conference on ‘Positive Impact of Madaris Registration under DGRE’ here at a local hotel, he emphasized that the process has been carried out independently, without any external influence.\nDr. Qamar, highlighting the pivotal role of seminaries in Pakistan’s history and society, acknowledged the challenges seminaries have faced over time, emphasizing the government’s commitment to addressing these issues.\nIn 2019, he informed that a formal agreement was reached between the government and prominent religious scholars, mandating that all seminaries affiliate with the Ministry of Education. This initiative, endorsed by the federal cabinet, ensures the registration of seminaries under the DGRE, established under the ministry’s supervision, he added.\nDr. Qamar detailed the registration process, which involves submitting a form without incurring any fees as the directorate operates 16 regional offices to facilitate its operations. He said the registration is completed within two weeks. He said over 18,600 seminaries are now registered nationwide, with plans to register all seminaries within five years as per the agreement.\nHe further revealed that 1,609 students from 53 countries are currently studying in Pakistani seminaries, with many institutions providing free books and training in disciplines like calligraphy and technical education. Approximately 2,500 students are receiving technical education, while 115 seminaries offer calligraphy training, he said adding that teachers at registered seminaries are paid by the Ministry of Education.\nDr. Qamar underscored the importance of inter-sectarian harmony, calling for unity and mutual respect in the country. He reiterated the commitment to work with seminaries without political affiliation, focusing solely on the welfare of students and the betterment of society.\n“Seminaries play a crucial role in serving the nation, and their students contribute to various fields, including the military and civil services. This effort to integrate seminaries into the mainstream reflects the collective voice of the nation,” he maintained.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:10:29.289Z"
}
