{
  "title": "IESCO field offices put on high alert to ensure smooth power supply in snow season",
  "link": "https://www.app.com.pk/national/iesco-filed-offices-put-on-high-alert-to-ensure-smooth-power-supply-in-snow-season/",
  "date_published": "2024-12-09T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP):Islamabad Electric Supply Company (IESCO) has put filed offices on high alert to ensure uninterrupted and smooth power supply besides rectification of faults due to snow season.\nChief Executive IESCO Muhammad Naeem Jan and General Manager Operations Muhammad Aslam Khan visited the 132 KV IESCO Guldana Grid Station Murree and reviewed the arrangements made by the relevant field offices to ensure uninterrupted power supply and timely addressal of any faults during snow, said a statement issued here Monday.\nThe CEO cancelled leaves of field officers and staff and they were put on high alert till the end of the snowfall season.\nThey were also asked keep in touch with the district administration so that electricity-related complaints or any emergency situation could be controlled in a timely manner.\nThe IESCO Chief also ordered to provide additional transformers, meters, cables and poles to the Murree, Jhikka Gali, Patriata offices.\nSpeaking on the occasion General Manager Operations Muhammad Aslam Khan said “our priority is to ensure continuous supply of electricity to the consumers in all situations.” All necessary arrangements have already been completed in this regard, he added.\nAslam Khan said that IESCO Helpline No. 118, Complaint and Monitoring Cell numbers 0519252933, 0519252934 will remain active 24 hours for immediate registration and redressal of complaints.\nSE Islamabad Circle Altaf Khokhar, XEN Bhara Kahu, XEN Construction Sardar Liaqat Ashraf, Assistant Manager (CM&O) Imran Iqbal and other officers were also present on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:08:27.656Z"
}
