{
  "title": "EJF, IPDS join hands to enhance journalists’ capacity for climate change reporting",
  "link": "https://www.app.com.pk/national/ejf-ipds-join-hands-to-enhance-journalists-capacity-for-climate-change-reporting/",
  "date_published": "2024-12-09T15:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP):The Environmental Journalists Forum (EJF) and the Institute of Peace and Diplomatic Studies (IPDS) have joined hands to strengthen climate change awareness and enhance journalistic capacity in Pakistan.\nThe partnership was formalized through a Memorandum of Understanding (MoU) signed on Monday at a ceremony held at the TDI office in Islamabad.\nThe event was attended by IPDS Director Asif Noor, IPDS President Dr. Farhat Asif, EJF President Ali Jabar, General Secretary Asghar Hayat, Senior Vice President Rozina Ali, Secretary Information Muhammad Mukhtar, Ayesha Naz, Amna Janjua, Sonia Malik, Basit Ali and others.\nA key highlight of this collaboration is the launch of “Climate Baithak,” a platform for journalists and students to engage directly with climate experts.\nThese interactive sessions, lasting 70 minutes each, will include detailed briefings and Q&A segments, aiming to deepen participants’ understanding of climate science and reporting techniques.\nPlanned to occur fortnightly, these sessions primarily target environmental journalists and students in relevant fields, empowering them with the knowledge to address pressing environmental issues effectively.\nBoth organizations plan to roll out capacity-building programs, including workshops, field visits, and mentorship initiatives.\nJournalists will be trained in areas such as climate science, investigative reporting, and data-driven journalism.\nCertification opportunities for advanced skills and mentorship from experienced climate reporters will be offered, cultivating a robust network of professionals dedicated to environmental journalism.\nThe partnership extends beyond training, encompassing research and content development initiatives. These include the creation of a Climate Reporting Handbook, an Environmental News Portal, and joint investigative stories on critical issues such as air pollution and water scarcity.\nPublic awareness campaigns, youth-focused media challenges, and dedicated radio and TV programs are also part of the collaboration, aiming to foster community engagement and broaden the impact of climate discourse.\nIPDS Director Asif Noor emphasized the media’s pivotal role in educating the public about climate challenges. He noted the lack of substantial climate journalism in Pakistan and stressed the importance of equipping journalists with the tools and opportunities needed to address this gap.\nIPDS President Dr. Farhat Asif highlighted the potential of global fellowships and knowledge-sharing platforms, announcing plans for lectures by international climate journalists to bring global insights to Pakistani reporters.\nEJF President Ali Jabar underlined the challenges faced by Pakistani journalists, including limited resources and opportunities, and described the MoU as a significant step toward addressing these issues.\nGeneral Secretary Asghar Hayat emphasized the need for journalists to be well-informed to guide the public effectively. He announced that EJF would continue forging partnerships with climate experts, academia, and NGOs to bolster environmental reporting capacity.\nThe collaboration, set to last two years, promises transformative outcomes for climate journalism and public awareness in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:07:23.723Z"
}
