{
  "title": "21st Conference on Frontiers of Information Technology launched on Monday",
  "link": "https://www.app.com.pk/national/21st-conference-on-frontiers-of-information-technology-launched-on-monday/",
  "date_published": "2024-12-09T11:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 9 (APP):Speakers at the opening of the 21st Conference on Frontiers of Information Technology (FIT) on Monday underscored the importance of harnessing emerging technologies to tackle pressing global challenges.\nThe two-day conference is being arranged by COMSATS University Islamabad (CUI) with participation of renowned experts from leading universities and institutes worldwide, including the United States, United kingdom, Australia, China, Qatar and Japan.\nSpeaking on the occasion, General Chair of FIT and In-charge of the Islamabad Campus, Professor Dr Sohail Asghar captivated the audience with his vision, emphasizing the transformative role of emerging ICT technologies in addressing global challenges.\nHis thought-provoking insights inspired attendees to explore interdisciplinary collaborations and leverage technology to create a smarter, more connected world.\nThe Program Chair of the conference, Dr Majid Iqbal Khan, extended a warm welcome to the attendees and provided an overview of the event.\nFIT served as a platform for various research and intellectual activities. This year, the conference attracted 410 technical paper submissions, a significant increase from 260 submissions last year.\nFollowing a rigorous blind review process, 85 submissions were accepted, resulting in an acceptance rate of 21percent.\nThe conference featured 20 dynamic technical sessions, showcasing the latest trends and innovations in Information Technology.\nThese sessions brought together leading experts, researchers and industry professionals to share insights, best practices, and groundbreaking advancements.\nThe conference included two keynote addresses and 12 invited talks delivered by globally recognized scholars, accomplished entrepreneurs, government representatives, and senior managers from international IT companies.\nSpeakers hailed from diverse regions, including Germany, Australia, the United States (Florida), the United Kingdom (Essex and Glasgow), Qatar (Doha), Malaysia, and Pakistan (Taxila).\nA dedicated session titled “Environmental Data Science” was conducted as part of the technical program.\nChancellor of Sir Syed CASE Institute of Technology, Islamabad, Prof Dr Shoab Ahmed Khan delivered a keynote address titled “Generative AI, LLMs, and RAG: Transforming Academia, Industry, and Government for Pakistan’s Future.”\nFounder and CEO of Nayatel, Wahaj Us Siraj, as the guest of the honour, emphasized the importance of entrepreneurship and the growing role of AI and IT in Pakistan.\nHe enlightened the gathering how technological advancement, innovations, and human foundations grow business and customer satisfaction.\nExecutive Director of the Higher Education Commission (HEC), Prof Dr Zia-Ul-Qayyum, as a chief guest, emphasized the importance of research, innovation, and IT development in Pakistan and appreciated the efforts of CUI officials in organizing FIT-2024.\nFirst Secretary of Science and Technology, Embassy of the People’s Republic of China, Mr. Ying Shengxin, CEO of Heroboss (a Chinese company operating in Pakistan) Ms Wang Chung Ping, Public Affairs Manager of Huawei Pakistan Mr Wang Yiming, Member of the Pakistan Science Foundation, Prof Dr Muhammad Akram Shaikh were among the special guests.\nThese distinguished guests commended the initiative for its contribution to advancing IT in Pakistan and appreciated its impact on fostering international collaboration in the field.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:11:33.048Z"
}
