{
  "title": "PHC grants transit bail to Omar Ayub, others",
  "link": "https://www.app.com.pk/national/phc-grants-transit-bail-to-omar-ayub-others/",
  "date_published": "2024-12-09T10:09:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 09 (APP):Peshawar High Court on Monday granted transit bail to several Pakistan Tehreek-e-Insaf (PTI) leaders, including opposition Ieader in the National Assembly Omar Ayub.\nJustice Sahibzada Asadullah heard the bail plea of Omar Ayub, whose counsel argued that multiple cases had been filed against Ayub in Islamabad and Punjab, making his court appearances challenging due to fear of arrest.\nThe court granted him transit bail until January 8 and directed him to appear before the relevant courts.\nSimilarly, Justice Asadullah also approved a 20-day transit bail for PTI leader Umair Niazi, instructing him to appear before the concerned courts.\nChief Justice Peshawar High Court Ishtiaq Ibrahim presided over hearings for transit bail applications from other PTI leaders, including Shandana Gulzar, Arbab Amir Ayub, Asif Khan, and Arbab Sher Ali.\nDuring the proceedings, Omar Ayub submitted an additional plea, claiming he had been arrested in Rawalpindi during a previous court appearance despite holding protective bail.\nThe court granted him transit bail until January 9 in a Faisalabad case while extending the earlier transit bail in other cases until January 8.\nAdvocate Moazzam Butt informed the court that his clients faced cases in Islamabad and Faisalabad, which were lodged following the D-Chowk protest.\nHe also mentioned that Arbab Sher Ali was out of the country when the charges were filed against him.\nAfter confirming that all the applicants were elected members of the National Assembly, the Chief Justice granted Shandana Gulzar, Arbab Sher Ali, Arbab Amir Ayub, and Asif Khan a three-week transit bail to enable them to appear in relevant courts.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:13:08.614Z"
}
