{
  "title": "NAB recovers Rs 3.8 trillion in one year: Chairman",
  "link": "https://www.app.com.pk/national/nab-recovers-rs-3-8-trillion-in-one-year-chairman/",
  "date_published": "2024-12-09T11:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP):Chairman National Accountability Bureau (NAB) Lt Gen Nazir Ahmed said on Monday that the Bureau has set a historic record by recovering Rs 3.8 trillion, or $13.57 billion, in just one year.\nSpeaking at a special event in connection with Anti-Corruption Day, the NAB Chairman said that the Bureau had directly or indirectly recovered Rs 6.1 trillion since its establishment.\nHe commended the outstanding performance of NAB Karachi, NAB Sukkur, and NAB KPK. NAB Karachi and Sukkur regions have collectively saved Rs 2.4 trillion and Rs 1.1 trillion, respectively, by recovering forest land across an area of 1.8 million hectares. Similarly, NAB Khyber Pakhtunkhwa has achieved indirect and consequential savings of Rs 194.937 billion, he said.\nIn addition, the NAB has processed 22,000 applications. Due to reforms, the filing of false complaints has been discouraged, leading to a reduction in such complaints from 4,000 per month to just 400 per month, the Chairman expressed.\nThe Chairman NAB emphasized that corruption, in any form, is the greatest barrier to sustainable development and economic prosperity. He reiterated NAB’s commitment to fighting corruption, safeguarding national assets, recovering embezzled funds, and returning them to the public.\nThe event was attended by NAB Deputy Chairman Sohail Nasir, the UNODC Representative in Pakistan, and a large number of senior NAB officers.\nThe NAB Chairman stated that 65 percent of the country’s population is under the age of 30, and the youth represent the future.\nHe highlighted that a comprehensive plan has been developed to engage them in the anti-corruption movement. To achieve this, a public awareness program will be launched with the support of educational and research institutions, along with various stakeholders.\nHe mentioned that NAB is not only dedicated to combating corruption but has also shown exceptional performance in safeguarding national assets, recovering stolen funds, and returning them to the public.\nThe Chairman also noted that NAB has implemented a visitor feedback system, which not only aids in controlling corruption but also enhances the institution’s performance. Additionally, work is being carried out in the power sector with the cooperation of National Electric Power Regulatory Authority (NEPRA), and its positive impact will be felt soon.\nHe urged NAB officers to work with utmost dedication and enthusiasm to swiftly provide relief to victims in the real estate sector. The NAB Chairman also mentioned that NAB has signed MoUs with 10 countries to expedite the resolution of corruption cases.\nOn the occasion, UNODC representative Troels Vester emphasized that youth are the future leaders of the anti-corruption movement. He stated that there are currently around 1.2 billion youth worldwide, and their active participation will play a crucial role in combating corruption. He also emphasized that corruption impacts every aspect of life, and all possible support will be extended to the efforts being made to address it in Pakistan.\nAwards were presented to the top-performing NAB officers during the seminar. The awardees included Rashid Badar and Mirza Aleem Baig from NAB Karachi, Rafi Jan from NAB KP, Khattab Gul from NAB Sukkur, Rashid Badar from NAB Lahore, and Mohsin Haroon, Mian Umar Nadeem, and Umair Ahmed from NAB Rawalpindi.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:12:06.774Z"
}
