{
  "title": "PM calls for collective efforts to build inclusive, equitable society",
  "link": "https://www.app.com.pk/national/pm-calls-for-collective-efforts-to-build-inclusive-equitable-society/",
  "date_published": "2024-12-09T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP):Prime Minister Shehbaz Sharif has called upon all Pakistani citizens, including federal and provincial governments, media, United Nations (UN) agencies, non-governmental organizations (NGOs), and civil society, to unite and contribute to building a more inclusive and equitable society.\nIn his message on International Human Rights Day, the prime minister said that since the adoption of the Universal Declaration of Human Rights by the United Nations in 1948, the commemoration of International Human Rights Day on 10th December every year, reminded all nations of the world to adhere to protecting inviolable human rights and preserve human values.\nHe mentioned that much before the adoption of the Human Rights Declaration by the UN; the sacred religion Islam had exhorted human beings to follow tenets of human values.\nThe prime minister highlighted that this year’s theme “our rights, our future, right now” was a call to acknowledge the importance and relevance of human rights in our everyday lives.\nPakistan is fully cognizant of its regional and international commitments in thus respect, he said adding that it was a matter of great satisfaction for us that the legislative, policy and programmatic measures taken by Pakistan for promotion of human rights had been appreciated by the international community.\nThe Government of Pakistan, he said had undertaken a number of legislative measures to protect Human Rights, particularly the vulnerable population including women, children, senior citizens, transgender persons, minorities and persons with disabilities in line with the fundamental rights as enshrined in the Articles 8-28 of the Constitution of Pakistan.\nLikewise, he pointed out that an autonomous National Commission for Human Rights, National Commission on the Status of Women, and National Commission on the Rights of Child had been established to address human rights issues.\n“It is a matter of pride for us that in 2024, the National Commission for Human Rights has been accredited as an A-Status NHRI by the Global Alliance of National Human Rights Institutions, indicating its compliance with the Paris Principles which is reflective of the strengths of the Commission in upholding human rights in Pakistan.” Similarly, he said the statutory National Commission for Minorities has further strengthened our endeavours for protection of minority rights.\nThe prime minister also mentioned the plight of the people of Palestine who are facing Israel’s brutal aggression in Gaza and the West Bank, urging that the world should not turn a blind eye to the gravest human tragedies of our time and play its role to ask Israel to immediately cease the ongoing genocide of the people of Palestine.\nLikewise, he said the gross human rights violations in Indian Illegally Occupied Kashmir also needed immediate attention from the global community including the UN. “Pakistan shall continue to extend moral, political and diplomatic support to the people of IIOJK and the people of Palestine until they achieve their universal right to self-determination.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:02:09.958Z"
}
