{
  "title": "Ashrafi urges preservation of existing DGRE system for Madaris",
  "link": "https://www.app.com.pk/national/ashrafi-urges-preservation-of-existing-dgre-system-for-madaris/",
  "date_published": "2024-12-09T16:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP):Chairman of the Pakistan Ulema Council, Allama Hafiz Muhammad Tahir Mahmood Ashrafi, on Monday presented a unanimous resolution emphasizing the importance of preserving the current system of religious seminaries in Pakistan.\nAddressing a gathering of prominent religious leaders and seminary board representatives, Ashrafi stressed that the Directorate General of Religious Education (DGRE) system must not be abolished or altered under any circumstances. He highlighted that millions of students rely on this system for their future and urged the government to resist any external pressure to change or dismantle it.\nAshrafi emphasized that the current madaris system, affiliated with the Ministry of Education, is crucial for the academic and spiritual development of over three million seminary students across Pakistan.\nBefore 2019, there were only five seminary boards. The government changed its policy in response to our demand, deciding to grant the right to manage a board to those with the necessary capability. Our demand was for the government to officially recognize the education provided by seminaries. As a result, ten new boards were established, all of which are now functioning effectively.\n“We are the guardians of this system,” Ashrafi declared. “We cannot compromise on matters concerning the future of seminaries.” He noted that the 2019 agreement, endorsed by scholars like Mufti Taqi Usmani, was a testament to their collective vision.\nAshrafi highlighted that over 18,600 seminaries have trusted this system and registered with the Ministry of Education.\nThe meeting was attended by representatives from all schools of thought, including key figures such as Mufti Abdul Rahim, Khurram Nawaz Gandapur, and Allama Jawad Hussain Naqvi. The event also included remarks from federal ministers Khalid Maqbool Siddiqui and Chaudhry Salik Hussain, DGRE Project Director Major General (Retired) Dr. Ghulam Qamar, and other religious luminaries.\nAshrafi called for all seminary board leaders to be consulted before any laws are made on this matter. He concluded with an appeal to the government to strengthen the existing system, ensuring the welfare of millions of seminary students who are integral to Pakistan’s future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:05:26.704Z"
}
