{
  "title": "NDMA for adopting precautions to avoid life, property loss due to likely heavy rains",
  "link": "https://www.app.com.pk/national/ndma-for-adopting-precautions-to-avoid-life-property-loss-due-to-likely-heavy-rains/",
  "date_published": "2020-05-27T01:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP):The National Disaster Management Authority (NDMA) has cautioned the provincial authorities to take preventive measures to avoid loss of life and damage to property due to likely heavy rains from Thursday night to Tuesday.\nNDMA in its weather alert said Pakistan Meteorological Department (PMD) forecast rains and thunderstorms in scattered places of Punjab, Khyber Pakhtunkhwa, Azad Jammu and Kashmir, few places of Sindh and north east Balochistan.\nThe advisory released here asked National Highways Authority (NHA), Water and Power Development Authority (WAPDA), Frontier Works Organisation (FWO), Construction and Works (C&W) Departments of respective provinces and regions to remain vigilant for restoring road links.\nThe advisory added that availability of staff of emergency services should be ensured during the period of harsh weather.\nThe advisory pointed out that tourists be apprised about weather forecast. In case of any eventuality, the respective provincial disaster management authorities (PDMAs) and relevant departments should share twice daily updates with NDMA.\nThe advisory asked relevant departments to issue necessary instructions to stakeholders in the light of fresh weather forecast.\nAccording to the PMD weather update an impending weather pattern was going to enter in Pakistan on Thursday night which would grip various parts of the country.\nThe weather forecast has indicated dust thunderstorms with rain in Quetta, Zhob, Harnai, Barkhan, Dera Bugti,Dera Ghazi Khan, Rajanpur, Multan, Khanewal, Rahim Yar Khan, Bahawalnagar, Bahawalpur, Sukkur, Larkana, Jacobabad, Shaheed Benazirabad from Thursday night to Monday/Tuesday.\nWhereas rain thunderstorm (with intervals) is expected in Khyber Pakhtunkhwa, Islamabad, the Rawalpindi, Jhelum, Chakwal, Attock, Mianwali, Sargodha, Bhakkar, Layyah, Khushab, Mandi Bahauddin, Hafizabad, Gujranwala,Gujarat, Sialkot,Narowal, Sheikhupura, Lahore,Kasur, Faisalabad, Jhang,Toba Tek Singh,Sahiwal , Okara, Kashmir and Gilgit-Baltistan during Thursday night to Monday/Tuesday.\nDust-thunderstorm with rain is also expected in Mirpurkhas, Badin and Hyderabad on Monday.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:15:50.547Z"
}
