{
  "title": "Indian aggressive policy towards neighbors threatening regional peace, security: Qureshi",
  "link": "https://www.app.com.pk/national/indian-aggressive-policy-towards-neighbors-threatening-regional-peace-security-qureshi/",
  "date_published": "2020-05-27T11:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 27 (APP):Minister for Foreign Affairs, Shah Mahmood Qureshi, Wednesday while rubbishing Indian propaganda said Pakistan had nothing to do with China-India standoff but the Indian aggressive policy towards its neighbours was threatening the regional peace and security.\nTalking to different television channels, the foreign minister said China had never reacted aggressively rather offered India to hold dialogue to settle the Ladakh issue, but by increasing tension, India wanted to distract world’s attention from its state terrorism in occupied Kashmir.\nTensions between both China and India reached high when Beijing captured a group of Indian army personnel that violated the Line of Control in Sikkim and Ladakh. China says India is constructing illegal defense-related structures near the Galwan Valley and reportedly, the Chinese army captured a group of Indian army personnel but later\nreleased them.\nThe foreign minister said India was rising tensions in the region by carrying out construction activities in territory that was considered disputed between India and China.\n“A war was fought between India and China in 1962 and again, India is resorting to aggressive posturing in the same territory,” he added.\nQureshi urged the Indian government to exhibit responsible behaviour by making use of the mechanisms of dialogue and consultations to resolve the disputes.\n“India’s intentions do not look good. India has already heated up the occupied Kashmir front and you know very well its attitude towards Nepal [on border issue],” Qureshi said. New Delhi is also sabotaging peace in Afghanistan, he added.\nThe foreign minister said India was carrying out worst terrorism against innocent\nKashmiris and urged the international community to take notice of the Indian actions.\n“Pakistan has said this again and again. I have said this to the UN Secretary-General and written letters to the UN Security Council that India is threatening peace [in the region] through its aggressive behaviour,” Shah Mahmood Qureshi said.\nHe said India was also fanning Islamophobia by amending its citizenship laws to deprive the millions of Muslims of their citizenship. Hindutva is being promoted and secularism being buried in India, he remarked.\nEven millions of people within India were against the Modi’s policies and many voices were rising from within the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:15:45.005Z"
}
