{
  "title": "AJK government presents Rs.163. 7 billion Budget",
  "link": "https://www.app.com.pk/national/ajk-govt-presents-rs-163-7-billion-budget/",
  "date_published": "2022-06-25T14:07:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Jun 25 (APP):Azad Jammu and Kashmir (AJK) government on Saturday presented its Budget for fiscal Year 2022/23 with a total volume of Rs. 163.7 billion out of which Rs. 28.5 billion have been allocated for annual development program (ADP).\nMinister for finance Abdul Majid Khan presented the budget for coming fiscal year and revised estimates for current fiscal year in the legislative Assembly in the absence of opposition members who boycotted the session and protested in front of building against government’s policies.\nThe estimates for recurring expenditures for next fiscal year have been shown Rs. 135.2 billion compared to Rs. 112. 9 billion revised estimates of current fiscal year while Rs. 28.5 billion has been allocated for development expenditures compared to revised estimates of Rs. 22.8 billion for current fiscal year.\nTotal income from revenue for the next fiscal year has been estimated Rs. 36.5 billion including Rs. 25.89 billion from income tax and Rs. 10.61 billion in the head of other taxes.\nThe government will receive Rs. 74.32 billion in the head of variable grants, Rs. 25.13 billion in the head of state revenue, Rs. 700 million in the head of water use charges and Rs. 700 million as capital receipts (loan and advances).\nThe minister while elaborating the salient features of the next fiscal year budget said that 62 percent funds in ADP had been allocated for 389 running development schemes while 38 percent was allocated for 263 new projects in the next fiscal year budget and 107 running projects would be completed during the coming fiscal year.He told the house that 19 percent fund in ADP in the coming fiscal budget had been allocated for social sector, 12 percent for production sector and 69 percent for infrastructure development.\nThe minister announced 15 percent disparity allowance and 15 percent adhoc allowance on new pay scales of 2022 for government employees and 15 percent rise in pensions of retired government employees.\nIn ADP for next fiscal year, preference had been given to communication department with highest allocation of Rs. 12 billion while Rs. 3.3 billion has been allocated for housing and physical planning.\nThe minister said Rs. 2.17 billion had been allocated in ADP for next fiscal year for education department and Rs. 1.8 billion for health department.",
  "retrievedAt": "2025-08-11T15:09:03.890Z"
}
