{
  "title": "Pakistan believes in peaceful co-existence: PM",
  "link": "https://www.app.com.pk/national/pakistan-believes-in-peaceful-co-existence-pm/",
  "date_published": "2022-06-25T10:40:00.000Z",
  "source": "APP",
  "content": "KARACHI June 25 (APP): Prime Minister Muhammad Shehbaz Sharif Saturday said that Pakistan believed in peaceful co-existence and wanted to promote friendly relations as it did not harbour any designs against anyone.\nAddressing a passing out parade of 117th Midshipman and 25th Short Service Commission course at Pakistan Naval Academy, the prime minister said Pakistan’s desire for peace must not be taken as weakness.\nHe said the entire nation was proud of its armed forces for their continuous vigil to foil enemies’ designs and rendering huge sacrifices in the fight against terrorism.\nHe observed that Pakistan navy had been effectively playing its part to the overall deterrence and national security with the available resources.\nLauding the contribution of Pakistan Navy, the prime minister said that it had a legacy of valour and professionalism and expressed the confidence that the newly commissioned cadets would further strengthen that legacy.\nHe underscored that the maritime domain was continuously shifting, mainly due to technological advancement and power re-shuffle globally.Only those navies would prevail and prove effective that would align with ever evolving geo-strategic spectrum and modern trends of warfare, he added.\nHe said that the three Services had proved their mettle against all threats at the borders. The whole nation paid tributes to all shuhada and their families, who had secured the country against all threats with their ultimate sacrifices, he said, adding the nation saluted them all.\nChief of the Naval Staff, Admiral Muhammad Amjad Khan Niazi And Chief Minister Sindh Syed Murad Ali Shah also attended the passing out parade.\nThe prime minister said Pakistan was blessed with large coastline which held vast potentials which could be utilized by further strengthening of the defence capabilities and boosting of the maritime economy.\n“Pakistan’s economic future hinges upon success of CPEC,” he said, adding the Gwadar port was its major project.\nHe underscored that Pakistan Navy had even more important role to play in the present age of ever growing blue economy, marine security and strategic defence.\nThe prime minister said Pakistan Navy with its available resources continued to fulfill and perform well to meet the international obligations, besides countering multiple challenges.\nHe said equipping Pakistan Navy with the latest technology for safeguarding maritime borders of the country was a priority of the government.\nCongratulating the newly commissioned cadets and midshipmen, he said that it was an auspicious occasion in the lives of these young men to start their wonderful naval career with a sense of great achievement and pride.\nExtending felicitations, the prime minister advised the young officers to lead by their conduct, character, knowledge and foresight.\nThe prime minister said that it was matter of great satisfaction for him that females cadets also formed the part of today’s parade, that signified their innate strength and confidence.\nThey would serve as role model for the Pakistani girls and inspire them to pursue their dreams and acquire success in their chosen fields, he added.\nThe prime minister said Pakistan was also extending quality cadet training to the brotherly countries including Bahrain, Palestine and Qatar.\nThe prime minister also congratulated officers from friendly countries on being commissioned in Forces of their respective countries.\nHe advised the young officers as future leaders to lead by their conduct, character, professional acumen and foresight.\nHe urged the newly commissioned officers to put up their best to live up the glorious tradition of their services and pride of nation.\nThe commissioning contingent comprised of 23 Midshipmen including 4 from Pakistan, 14 from Bahrain Defence Forces, 3 from State of Palestine, 2 from Qatar along with 19 officers from SSC Course.\nThe prime minister congratulated the commissioning term for successful completion of training and highlighted the modern warfare dynamics, while underlining challenges of responsibility for newly commissioned officers.\nThe ceremony was attended by a large number of senior military officers, ambassadors, defence attaches of various countries, civil dignitaries and parents of passing out midshipmen and cadets.\nEarlier, the prime minister reviewed the guard of honour.\nLater, the prime minister gave away awards to the distinction holders. The prestigious Quaid-i-Azam Gold Medal was awarded to Lt Syed Irtaza Haider Naqvi for his Overall Best Performance.\nMidshipman Adnan M Ebrahim Jasim Bader (Bahrain) clinched the Academy’s Dirk. Officer Cadet Naufil Malik was awarded Chairman Joint Chiefs of Staff Committee Gold Medal, while Commandant Gold Medal was awarded to Officer Cadet Sumayya Sajjad from Short Service Commission Course. The Proficiency Banner was awarded to Quarter Deck Squadron.\nEarlier in his welcome address, Commandant Pakistan Naval Academy Commodore Sohail Ahmad Azmie highlighted the quality education afforded to Pakistani as well as friendly countries’ cadets at the Naval Academy.\nThe commandant urged the cadets to hold fast the ideals of loyalty, honour and courage, in order to become Officers with firm character.",
  "retrievedAt": "2025-08-11T15:09:08.269Z"
}
