{
  "title": "Speakers urge building Pak-Turk linkages through educational institutions",
  "link": "https://www.app.com.pk/national/speakers-urge-building-pak-turk-linkages-through-educational-institutions/",
  "date_published": "2022-06-25T09:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP):The speakers at a conference on Saturday emphasized the need to establish linkages between Pakistan and Turkey through educational institutions.\nA number of Pakistani students avail the Turkish universities scholarships but the ratio of Turkish students coming to Pakistani educational institutes is very low which can be addressed by establishing more institutions, they said.\nThey were addressing the NUST and Ankara Centre of Thought and Research (ADAM-ACTR) joint conference on Economic, Social and Political Relations between Turkey and Pakistan here.\nThe main themes of the conference were based on the History of Turkey-Pakistan relations with a focus on the economic, financial, commercial, and international cooperation opportunities.\nThey highlighted the role of Islamic Economics and Finance on Development, and the Social and Cultural Relations between Pakistan and Turkey.\nThe participants provided a road map to stimulate and disseminate new research on economic cooperation between Turkey and Pakistan. They added that in the last few years, the perceptions and interests of Turkey and Pakistan had started to converge on a number of important issues. For over half century, Turkey and Pakistan remained close friends.\nThe Pro Rector (Research, Innovation & Commercialization) NUST Dr Rizwan Riaz expressed how cordial the relations between the two countries were, by saying “Turkey is our brother country”.\nPresident Ankara Centre of Thought & Research Prof. Mehmat Bulut stated that in recent years Turkey had increased its activity, not only in its own geography, but also in those countries that are far from region and not developed economically.\nSouth Asia remained at the forefront of geographical areas where Turkey had increased its activity outside the region.\nHe added that forging of bilateral relations between Pakistan and Turkey could be traced back to the time of British India before Pakistan came into being but the Pakistan Movement was well underway.\nMoreover, Turkish Charge de Affairs in Pakistan Esra Sen highlighted that universities associated with ADAM-ACTR would have an important pool of resources at the academic dimension to produce policies that would trigger regional development and growth.\nTheir multidimensional relationship showed the same spirit of brotherhood as prevailed during centuries old ties between Indian Muslims and the Ottoman Empire, later the Republic of Turkey.\nIdeologically, however, she said they were poles apart – Turkey, when it became a Republic, pursued secularism while Pakistan adhered to the Islamic ideology as the centre piece of its nationhood, but these differences of ideology, with their corresponding reflections on their respective external outlook, never hampered the course of friendly bilateral ties.\nShe expressed hope that in keeping with the global trends, economic interaction will assume centre-stage in relations between Pakistan and Turkey.",
  "retrievedAt": "2025-08-11T15:09:07.562Z"
}
