{
  "title": "Pakistan calls for end to human rights violations in Indian Illegally Occupied Kashmir",
  "link": "https://www.app.com.pk/national/pakistan-calls-for-end-to-human-rights-violations-in-indian-illegally-occupied-kashmir/",
  "date_published": "2022-06-25T17:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 25 (APP): Pakistan Saturday strongly urged the international community to call upon India to end its gross and systematic violations of human rights in Indian Illegally Occupied Jammu and Kashmir (IIOJK), revoke its illegal and unilateral actions of 5 August 2019, and free all political prisoners including the true Kashmiri leaders.\nIn response to media queries, the Foreign Office Spokesperson stated, “We have seen news items appearing in the Indian media indicating that the Government of India might be contemplating to hold some G20-related meeting/event in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). Pakistan completely rejects any such attempt by India.”\n“As is well-known, Jammu and Kashmir is an internationally recognized disputed territory between Pakistan and India. The territory has been under forcible and illegal occupation of India since 1947 and this dispute has remained on the agenda of the United Nations Security Council for over seven decades.”\nHe said India was responsible for widespread atrocities and egregious human rights violations in IIOJK. Since India’s illegal and unilateral actions of 5 August 2019, Indian occupation forces had killed 639 innocent Kashmiris in extra-judicial murders. Numerous reports of the UN, including the two commissioned by the Office of the High Commissioner for Human Rights (OHCHR) in 2018 and 2019, had re-confirmed ongoing Indian atrocities against the Kashmiri people.\n“Most ominously, India has been seeking to change the demographic structure of the occupied territory in flagrant violation of relevant UN Security Council resolutions, international law, and the 4th Geneva Convention.”\nContemplating the holding of any G20 related meeting/event in IIOJK, in utter disregard of the globally acknowledged “disputed” status of the territory, was a travesty that the international community could not accept under any circumstances,” he said adding, “It is expected that in case of any such controversial proposal from India, which would be designed to seek international legitimacy for an illegal and tyrannical occupation continuing for over 7 decades, the G20 members will be fully cognizant of the imperatives of law and justice and would reject it out-right.”\nThe Spokesperson said the only way to lasting peace in South Asia was by granting the people of the Indian Illegally Occupied Jammu and Kashmir their inalienable right to self-determination as pledged to them in the relevant UN Security Council resolutions.",
  "retrievedAt": "2025-08-11T15:08:58.737Z"
}
