{
  "title": "Mishal Malik calls UN for urgent action against ‘inhuman steps in IIOJK’",
  "link": "https://www.app.com.pk/national/mishal-malik-calls-un-for-urgent-action-against-inhuman-steps-in-iiojk/",
  "date_published": "2022-06-25T09:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP):Mishal Malik, social activist and wife of jailed Kashmiri leader Yasin Malik on Saturday called upon the international community particularly the United Nations to take urgent actions against ‘inhuman steps’ of Modi-led government in Indian Occupied Jammu and Kashmir (IIOJK).\nTalking to a private news channel, she said that extremist Hindutva ideology being propagated by the Indian government posing a grave threat to regional peace, adding, the Indian troops are targeting juveniles and using rap as a weapon to suppress Kashmir freedom movement.\nThere is a humanitarian crisis in Kashmir valley and United Nation must come forward and pressurize India to stop atrocities in Occupied Kashmir, she demanded.\nThe world’s criminal silence over the Kashmir issue is posing serious threat to regional peace, she feared.\nShe asked world human right bodies to send a fact finding mission to IIOJK ascertain facts about deteriorating human rights situation and plight of Kashmiri political prisoners in jails of India.\nShe said international community should play a role in early release of all illegally detained Kashmiri political prisoners, adding, India cannot suppress the Kashmiris’ genuine freedom movement through the use of brute force.\n“The current situation in IIOJK is the worst in recent history where people have been deprived of their fundamental rights, including right to life, food, health, freedom of expression and assembly,” she added.\nShe said Kashmiris will fight their self-determination of rights till last breath, adding, India has been denying the right of self-determination to Kashmiri people for the last more than seven decades, in violation of multiple Security Council resolutions.",
  "retrievedAt": "2025-08-11T15:09:10.717Z"
}
