{
  "title": "Governor Punjab for timely completion of development projects",
  "link": "https://www.app.com.pk/national/governor-punjab-for-timely-completion-of-development-projects/",
  "date_published": "2022-06-25T12:08:00.000Z",
  "source": "APP",
  "content": "BAHAWALPUR, Jun 25 (APP):Governor Punjab Engineer Muhammad Baligh-ur-Rehman reviewed the ongoing and new development projects under Bahawalpur Annual Development Program, Mega Projects and District Development Package Program at the Circuit House.\nGovernor Punjab directed that the development projects should be completed on time so that the fruits of development could reach the masses.\nThe meeting was attended by Additional Chief Secretary South Punjab Capt (retd) Saqib Zafar, Commissioner Bahawalpur Division Raja Jahangir Anwar, Deputy Commissioner Bahawalpur Irfan Ali Kathia,\nformer Provincial Minister Malik Muhammad Iqbal Channar, MPA Afzal Gill, MPA Hasina Begum, former MPA NA Begum Parveen Masood Bhatti, former MPA Fauzia Ayub Qureshi, former mayor Aqeel Najam Hashmi, ticket holder Dr Rana Muhammad Tariq and officers of relevant departments were present.\nGovernor Punjab Muhammad Baligh-ur-Rehman said that pending welfare projects of previous era of PML-N, Home Economics College, Industrial Estate Bahawalpur, upgradation of Thalassemia and Bone Marrow Center, Additional Ring Road Bahawalpur, construction and repair of Civil Hospital Bahawalpur Road, and construction of Jhangra East Road should be completed on time.\nHe said a special grant would be taken from the government to provide funds for pending projects.\nThe meeting was informed that under the annual development program of Bahawalpur city, 339 new and ongoing development projects were underway with an estimated cost of Rs. 50711.76 million of which Rs 10312.48 million have been released this year.\nAdditional Chief Secretary South Punjab Captain (Retd) Saqib Zafar, Commissioner Bahawalpur Division Raja Jahangir Anwar, Deputy Commissioner Irfan Ali Kathia gave a briefing on the projects.\nA group of Women Chamber of Commerce Bahawalpur met with Governor Punjab Engineer Muhammad Baligh-ur-Rehman at Circuit House.",
  "retrievedAt": "2025-08-11T15:09:05.276Z"
}
