{
  "title": "Imamia Council organizes Paigham-e-Karbala Conference",
  "link": "https://www.app.com.pk/national/imamia-council-organizes-paigham-e-karbala-conference/",
  "date_published": "2023-07-16T11:33:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jul 16 (APP):Imamia Council for the Unity of the Muslims (Rejection of Sectarianism) Khyber Pakhtunkhwa in collaboration with Qoumi Aman Jirga organized ‘Paigham e Karbala Conference’ here the other day, said a press release issued here on Sunday.\nDirector General (DG), Iranian Cultural Centre, Peshawar Asghar Khusro Abadi attended the conference as the chief guest.\nAddressing the participants of the conference, Asghar Khusro Abadi said that the message of Karbala was offering timely and early prayers, which could not be forgotten due to engagements relating to customs, traditions and other routine matters.\nChairman, Qoumi Aman Jirga, Iqbal Haidri highlighted the significant events organized in Muharram ul Harram and other holy Islamic months underlining their importance in Islamic history and stressed for highlighting these golden chapters. He further stressed for creation of awareness amongst the youth about Islamic calendar.\nAllama Syed Zafar Naqvi highlighted the responsibility of masajid and emphasized presentation of the importance of Muharram-ul-Haram in true sense.\nAllama Abid Hussain Shakri, the Principal of Madrasa Arif Hussain Al-Hussaini Shaheed, shed light on the unwavering commitment of Imam Aali-e-Maqam, emphasizing the visible and hidden aspects of martyrdom.\nCustodians of numerous Imam Bargahs, Taiziadars, founders of Majalis, Salars of Matami Sangats and their representatives from Peshawar turned over to the conference.\nThe unique event successfully brought together Shia and Sunni Muslims under one roof, promoting unity, understanding, and brotherhood.\nThe speakers at the conference highlighted commonalities, values, tolerance and brotherhood, with a particular focus on strengthening the bonds of Islamic brotherhood through a deeper understanding of Karbala. By emphasizing shared aspects rather than differences, the aim was to thwart the ambitions of those who perpetuate sectarian tensions and conspiracies against Islam.\nAPP/aqk\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T08:55:52.604Z"
}
