{
  "title": "National Day of France celebrated in Islamabad",
  "link": "https://www.app.com.pk/national/national-day-of-france-celebrated-in-islamabad-2/",
  "date_published": "2023-07-15T20:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 15 (APP): The French Embassy in Pakistan celebrated the National Day with a grand event that witnessed the participation of government officials, diplomats from various countries, members of the media, and individuals from diverse segments of society.\nAddressing the event, the Ambassador of France to Pakistan, Nicolas Galey acknowledged the positive trajectory of bilateral relations between France and Pakistan and expressed gratitude to various sectors within Pakistan, including government departments, businesses, cultural institutions, and the media, for their active and positive contributions in strengthening these ties.\nThe ambassador particularly highlighted the notable increase in the number of Pakistani students studying in France through university cooperation programs.\nFurthermore, he said, “France’s development agency has been actively engaged in major infrastructure projects in Pakistan, with a recent focus on the crucial agriculture sector, as prioritized by Prime Minister Shehbaz Sharif.”\nThe mutual cooperation and progress achieved in these areas exemplify the ongoing positive engagement between France and Pakistan, signifying a successful resolution to a challenging period, the envoy added.\nHe recalled that in the multilateral institutions process, France supported the efforts that have led to a favourable outcome for Pakistan by the Financial Action Task Force (FATF).\n“The multilateral institution’s process received backing from France, which contributed to this positive outcome” he added.\nHe said, “We’re also very happy for the negotiation between Pakistan and the IMF, contributed positively.”\n“This opens obviously and encouraging prospects for the Pakistani economy and therefore, for increasing international investments in Pakistan,” he added.\nAbout the GSP plus free trade program, he said, “We naturally support the fruitful negotiation between the EU and Pakistan over concentration of this essential program for the Pakistani economy.”\nThe ambassador emphasized the importance of the relationship between Pakistan and the EU, in particular through the GSP plus free trade program, of which Pakistan is the largest beneficiary in the world.",
  "retrievedAt": "2025-08-11T08:55:49.802Z"
}
