{
  "title": "PSX falls on debt worries, profit-taking - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) witnessed range-bound trading on Monday as concerns over debt repayments and macroeconomic uncertainty weighed on investor sentiment during the rollover week. The benchmark KSE-100 index came under selling pressure, shedding nearly 380 points.\n\nThe index closed at 138,217.58, down 379.78 points or 0.27pc. It fluctuated between an intraday high of 139,201.16 and a low of 138,149.57, with profit-taking emerging ahead of the July contract expiry.\n\nAhsan Mehanti of Arif Habib Corporation said stocks remained under pressure amid geopolitical uncertainty, rising inflation fears, and speculation over the State Bank’s monetary policy decision next week. The rupee’s instability and concerns surrounding external debt repayments due in FY26 further contributed to the bearish sentiment.\n\nAccording to Topline Securities, the downward pressure on the index was primarily due to declines in Fauji Fertiliser, United Bank, Oil and Gas Development Company, Systems Ltd, and Hub Power, which cumulatively eroded 438 points. However, gains in Habib Bank, Engro Fertiliser, and Pakistan Aluminium Beverage Cans Ltd partially offset losses, contributing a total of 152 points.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, noted that the market began the rollover week on a cautious note. The session opened positively, with the benchmark index hitting a high of 139,201 points — up 604 points or 0.44pc. However, profit-taking at that level dragged the index into negative territory by the close of trading.\n\nTechnically, the 135,000 level serves as the first support zone for the index, buoyed by strong corporate earnings and sustained foreign inflows. A breach of this level could see the index slide towards the 132,000 mark, where attractive valuations and prospects of monetary easing may help restore investor confidence.\n\nMarket participation remained subdued, with total volumes dipping 0.2pc to 608.18 million shares, while the traded value dropped 25.61pc to Rs23.52bn. First Prudential Modaraba led the volume chart, with 58.73 million shares changing hands.\n\nPublished in Dawn, July 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687eb2be47eb1.jpg",
  "retrievedAt": "2025-08-17T21:03:54.156Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925705/psx-falls-on-debt-worries-profit-taking",
  "dateList": "2025-07-22",
  "date_published": "2025-07-21T23:41:08.000Z"
}
