{
  "title": "PHC urged to strike down oath-taking order - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR/ISLAMABAD: Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur and the speaker of provincial assembly, Babar Saleem Swati, on Monday challenged in Peshawar High Court the order of its chief justice of nominating KP governor to administer oath to 25 newly-notified MPAs on reserved seats and subsequent oath taking by them in Governor’s House.\n\nA bench consisting of Justice Ijaz Anwar and Justice Mohammad Faheem Wali issued notices to federal government, Election Commission of Pakistan (ECP) and other respondents seeking their replies until Aug 5 to separate petitions filed by the chief minister and the speaker, who sought multiple reliefs from the court.\n\nThe petitioners have requested the court to declare as unconstitutional and illegal the July 20 notification issued by the PHC registrar wherein the PHC chief justice nominated Governor Faisal Karim Kundi under Article 255(2) of the Constitution for administering oath to the MPAs.\n\nThey also requested for declaring as unconstitutional the notification of the governor about holding the oath taking ceremony in Governor’s House and a letter sent to PHC by ECP on July 16, requesting the chief justice to act under Article 255 (2) of the Constitution and nominate a person for administering oath to the said MPAs.\n\nKP Assembly speaker seeks CJP’s intervention over ‘unauthorised exercise of jurisdiction’\n\nThe petitioners requested the court to declare as void the oath administered to the said MPAs. The petitioners contended that the governor and rest of the respondents’ actions amounted to an unconstitutional attempt to subvert the authority of the speaker and violated the principle of lawful governance.\n\nThey said that the notification issued by the high court registrar on administrative instructions allegedly from the chief justice was without any judicial order, thereby lacking legal validity.\n\nThey contended that the registrar’s notification relied on vague administrative correspondence from ECP, which failed to fulfil the requirement of Article 255 (2) regarding ‘impracticability.’\n\nThe petitioners are of the opinion that ECP couldn’t direct high court or interfere in the affairs of provincial assembly. They added that the high court under, Article 175 of the Constitution, was not subordinate to ECP.\n\nAdvocates Bashir Khan Wazir and Waqar Khan appeared for the chief minister and the speaker, respectively, whereas KP advocate general also appeared supporting the petitions. The additional attorney general, Sanaullah Khan, appeared for federal government.\n\nDuring courser of hearing, Justice Ijaz remarked that had the newly-elected members not taken the oath, they would not have been able to cast their votes in the Senate elections on Monday. The bench observed that the PHC chief justice was constitutionally empowered to act in such situations under Article 255 (2).\n\nThe AG stated that Article 255 (2) could only be invoked when it was impracticable for the oath to be made before a person mentioned in the Constitution.\n\nHe stated that under Article 255(2), the situation had not reached the point of impracticability, yet the chief justice appointed the governor to administer the oath.\n\nJustice Ijaz observed that since the assembly session had been convened but the oath was not administered, it indicated that taking the oath had become impossible. The bench remarked that the assembly session was adjourned until July 24, and since the Supreme Court had issued its decision (reserved seats case), it must be respected — even if someone disagreed with it.\n\nThe AG said that ECP sent to CM a letter on July 14 that was received on July 16. The CM, he stated, then sent a summary to the governor and convened an assembly session for July 20, but due to lack of quorum, the session was adjourned. He clarified that neither the CM nor the speaker refused to administer the oath.\n\nThe petitioners’ lawyers argued that under Article 65 of the Constitution, members of the assembly must take the oath inside assembly house, and that the speaker had not refused to administer the oath. They said that the session had been adjourned due to lack of quorum.\n\nThey stated that although the assembly session was ongoing and adjourned until July 24, the PHC chief justice used his powers under Article 255(2) to authorise the governor to administer the oath to MPAs, which was an unconstitutional act.\n\nMeanwhile, the bench also adjourned to Aug 5 hearing of another petition of Mr Gandapur seeking court’s order to declare Pakistan Tehreek-i-Insaf as a political party and the MPAs backed by it as its members and to grant the party its rightful share on reserved seats.\n\nSeparately, the KP Assembly speaker in a letter to the chief justice of Pakistan, accused the PHC chief justice of exercising judicial overreach by issuing directives to the governor for administering oath to the MPAs-elect. The speaker also requested CJP Yahya Afridi to take prompt cognisance of ‘constitutional violation and unauthorised exercise of jurisdiction’.\n\nIn a four-page letter to the CJP, the speaker pleaded before the top judge that his intervention was critical to reaffirm that no judicial authority, under the guise of administrative orders or otherwise, usurped powers constitutionally vested in the legislature.\n\nPublished in Dawn, July 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/201920259f800d7.png?r=192040",
  "retrievedAt": "2025-08-17T21:02:52.108Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925693/phc-urged-to-strike-down-oath-taking-order",
  "dateList": "2025-07-22",
  "date_published": "2025-07-21T23:41:44.000Z"
}
