{
  "title": "Australia eyes comeback in mining sector - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After more than a decade, Australia is considering returning to Pakistan’s mining and mineral sector through direct investments, joint ventures, and institutional collaboration for the research and development of natural resources.\n\nAustralia has been operating in Pakistan’s mineral and natural resources sector, primarily in all resource-rich regions, including Balochistan, Gilgit-Baltistan, and Azad Kashmir, with a focus on research and exploration. This effort has identified critical reserves of copper, gold, coal, zinc, and other precious resources, including oil and gas.\n\nAustralian BHP Billiton’s joint venture with the Geological Survey of Pakistan led to the discovery of the multi-billion-dollar Reko Diq copper-gold deposits, now being developed for commercial production by Barrick Gold Corporation of Canada.\n\nAustralian High Commissioner to Pakistan Neil Hawkins called on Petroleum Minister Ali Pervaiz Malik on Monday and discussed matters relating to the expansion of bilateral cooperation in energy and mining, with a focus on investment, technology transfer, and skills development, according to an official statement.\n\nAfter decade-long gap, Canberra looks to JVs in mineral-rich regions, including Reko Diq project\n\nMr Hawkins expressed strong interest from Australian mining companies in Pakistan’s mineral-rich regions and proposed collaboration between Australian universities, mining firms, and Pakistani institutions to provide specialised training programmes in modern mining techniques and services. This initiative, he believed, would enhance local expertise and support the development of Pakistan’s mining sector.\n\nMr Malik appreciated the proposal and assured the High Commissioner that Pakistan valued Australia’s advanced mining capabilities and technical knowledge, and would welcome partnerships that build local capacity and attract investment in the mineral and energy sectors. The minister also assured full support for facilitating such collaborations.\n\nBoth sides agreed to strengthen institutional linkages and explore joint ventures in energy and mining for mutual economic growth and hoped to exchange delegations soon for in-depth discussions. Australia is also assisting Pakistan in water resources through a knowledge base and technology, and has helped the Indus River System Authority (Irsa) to establish water availability assessment tools and a telemetry network for monitoring water flows in rivers and at major reservoirs and headworks.\n\nThe Geological Survey of Pakistan identified the presence of mineral deposits in the Reko Diq area in early 1990s in collaboration with BHP Billiton of Australia. Later in 2000, Tethyan Corporation (TCC) of Australia took over the project from BHP and invested $30 million by raising funds through an international listing, drilling over 75,000 meters to prove the reserves. BHP had also left Pakistan under its global restructuring.\n\nThe TCC has subsequently been acquired by two of the world’s largest copper and gold mining firms — Antofagasta of Chile and Barrick Gold Corporation of Canada — for $130 million at the time. The agreement between Pakistan and the two mining firms, signed during the Musharraf era, ran into trouble, leading to international arbitration and an out-of-court settlement for penalties and project revival. In the process, the Reko Diq project, originally due for production in 2010, was delayed by at least 15 years.\n\nAt the time of discovery by GSP and BHP, it was announced that the Reko Diq mining area had proven estimated reserves of 2 billion tonnes of copper and 20 million ounces of gold, valued at $65 billion.\n\nThe recent feasibility studies completed by Barrick have also established that the project would have a 45 million tonnes of throughput per annum (Mpta) for the first five years and then 90Mpta for the following 32 years of the second phase.\n\nPublished in Dawn, July 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:04:03.958Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925710/australia-eyes-comeback-in-mining-sector",
  "dateList": "2025-07-22",
  "date_published": "2025-07-21T23:41:08.000Z"
}
