{
  "title": "Houses, crops damaged as new rain spell hits KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "CHITRAL/BAJAUR: A new spell of monsoon rains on Monday hit several parts of the Khyber Pakhtunkhwa province, damaging houses and crops and suspending traffic.\n\nThe high flood in Chitral River triggered by the fast melting of Chiantar and other glaciers of Broghil valley washed six houses and a large chunk of the farmlands of Junali Koch village near Upper Chitral’s district headquarters Booni.\n\nResidents of the affected village told Dawn over the phone that two houses slipped into the river, while five houses were damaged, partially rendering the families homeless.\n\nThey said that almost all families of the village were affected by the floods as they lost their sources of sustenance to the flood, including crops of rice, wheat, vegetables and fruit orchards of grapes, apricot, apple and peach which brought them additional income.\n\nMeanwhile, rains in the Yarkhon Valley of Upper Chitral on the night between Sunday and Monday wreaked havoc in the village of Arakhan in Mirgram No 2 and severely damaged dozens of houses while no casualties have been reported yet as the villagers had shifted to safety in view of the danger.\n\nAccording to residents of the affected villages, a large number of livestock were perished and washed away by the flash floods because the villagers had no time to shift the livestock to safer places.\n\nSimilarly, the Chitral River was flooded, leaving houses and infrastructure in Ayunand and other low-lying areas of Lower Chitral at risk of damage.\n\nIn the Bajaur tribal district, authorities closed the Jar bypass Road, which connects the district to the rest of the country via the main Bajaur-Munda Road, to traffic after heavy rains triggered flooding.\n\nThe Jar Bypass Road, an alternative route to the damaged Jar bridge, was closed to vehicular and pedestrian movement for being hit by downpour-induced floods, according to district administrations and Rescue 1122.\n\nThey urged the people to use Khar-Qazfi Bypass Road to avoid any potential incidents. Rescue 1122 stated that scores of rescuers have been deployed along the Jar Bypass Road to deal with any emergency eventuality.\n\nPublished in Dawn, July 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/21213017c6ed6dc.jpg?r=213125",
  "retrievedAt": "2025-08-17T21:02:50.253Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925692/houses-crops-damaged-as-new-rain-spell-hits-kp",
  "dateList": "2025-07-22",
  "date_published": "2025-07-21T23:41:44.000Z"
}
