{
  "title": "Court acquits 12 in 2006 Mumbai train blasts case - World - DAWN.COM",
  "author": null,
  "content": "MUMBAI: An Indian court acquitted on Monday 12 men previously convicted for a series of bomb blasts that ripped through packed commuter trains in Mumbai in 2006 that killed 187 people.\n\nThe men were convicted in 2015 of murder, conspiracy, and waging war against the country over the attacks during the evening rush hour of July 11, 2006 that also injured more than 800 people. Five were sentenced to death, while the other seven were given life imprisonment.\n\nBut, 10 years later, the Bombay High Court set aside a lower court’s verdict and acquitted the 12 men.\n\nJustices Anil Kilor and Shyam Chandak said in their judgement, the prosecution had “utterly failed to establish the offence beyond the reasonable doubt against the accused on each count”.\n\nThe men were ordered to be released from jail “if they are not required to be detained in any other case”. The prosecution can appeal against the order in the Supreme Court.\n\nA total of seven blasts ripped through the trains after the bombs, packed into pressure cookers, were placed in bags and hidden under newspapers and umbrellas.\n\nProsecutors said the devices were assembled in Mumbai and deliberately placed in first-class coaches to target the city’s wealthy Gujarati community.\n\nThey said the bombings were intended as revenge for the riots in the western state of Gujarat in 2002, which left some 2,000 people dead, most of them Muslims.\n\nProsecutors accused Lashkar-e-Taiba of being behind the attacks, although a little-known outfit called the Lashkar-e-Qahhar later claimed responsibility.\n\nPublished in Dawn, July 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/22094206a3a522c.jpg",
  "retrievedAt": "2025-08-17T21:03:20.244Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925763/court-acquits-12-in-2006-mumbai-train-blasts-case",
  "dateList": "2025-07-22",
  "date_published": "2025-07-21T23:41:20.000Z"
}
