{
  "title": "Trump pulls US out of UN cultural agency Unesco for second time - World - DAWN.COM",
  "author": null,
  "content": "President Donald Trump pulled the United States out of the UN culture and education agency Unesco on Tuesday, repeating a move he had already ordered during his first term, which had been reversed under Joe Biden.\n\nThe withdrawal from the Paris-based agency, which was founded after World War Two to promote peace through international cooperation in education, science, and culture, will take effect on December 31, 2026.\n\n“President Trump has decided to withdraw the United States from Unesco — which supports woke, divisive cultural and social causes that are totally out-of-step with the commonsense policies that Americans voted for in November,” White House spokeswoman Anna Kelly said.\n\nThe State Department said remaining in Unesco was not in the national interest, accusing it of having “a globalist, ideological agenda for international development at odds with our America First foreign policy”.\n\nUnesco chief Audrey Azoulay said she deeply regretted Trump’s decision, but that it was “expected, and Unesco has prepared for it”.\n\nThe agency had diversified its sources of funding, receiving only about eight per cent of its budget from Washington, she said.\n\nUnesco was one of several international bodies Trump withdrew from during his first term, along with the World Health Organisation, the Paris Agreement global climate change accord and the UN Human Rights Council. During his second term, he has largely reinstated those steps.\n\nUnesco officials said the US withdrawal would have some limited impact on programmes the United States was financing.\n\nIsrael welcomed the US decision to quit Unesco.\n\nThe US State Department said one of the reasons for the withdrawal was Unesco’s decision to admit Palestine as a member state, which was “contrary to US policy and contributed to the proliferation of anti-Israel rhetoric within the organisation”.\n\nUnesco officials said all relevant agency statements had been agreed with both Israel and the Palestinians over the past eight years.\n\n“The reasons put forward by the United States to withdraw from the organisation are the same as seven years ago, even though the situation has changed profoundly, political tensions have receded, and Unesco today constitutes a rare forum for consensus on concrete and action-oriented multilateralism,” Azoulay said.\n\n“These claims also contradict the reality of Unesco’s efforts, particularly in the field of Holocaust education and the fight against antisemitism.”\n\nDiplomats said it was felt at Unesco that the withdrawal was inevitable for political reasons, given that Biden had brought the US back and had promised to repay arrears from the first time Trump pulled out.\n\nUnesco, whose full name is the United Nations Educational, Scientific and Cultural Organisation, is best known for designating World Heritage Sites, including the Grand Canyon in the US and the ancient city of Palmyra in Syria.\n\nThe US initially joined Unesco at its founding in 1945 but withdrew for the first time in 1984 in protest against alleged financial mismanagement and perceived anti-US bias, returning in 2003 under then-president George W Bush, who said the agency had undertaken needed reforms.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/22190719dcf0842.jpg",
  "retrievedAt": "2025-08-17T21:01:27.012Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925875/trump-pulls-us-out-of-un-cultural-agency-unesco-for-second-time",
  "dateList": "2025-07-22",
  "date_published": "2025-07-22T14:42:18.000Z"
}
