{
  "title": "Young student allegedly beaten to death by seminary teachers in Swat: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A young student was allegedly beaten to death by his madressah teachers on Monday evening in Swat’s Chaliyar village, according to the police.\n\nSwat District Police Spokesperson Moin Fayaz said in a statement that the victim, Farhan, had missed classes for a few days before the incident occurred.\n\nPolice and eyewitnesses said that three teachers reportedly beat Farhan in front of fellow students.\n\n“He had just returned to school after being absent for some days,” said one of Farhan’s classmates, who chose not to be named.\n\n“Our teachers started hitting him hard. Later, they dragged him into a side room and kept beating him. I was called in to bring water. He drank a little, then put his head in my lap — and just went silent.”\n\nFarhan was rushed to the nearest hospital by students and teachers, but doctors declared him dead upon arrival, according to Fayaz.\n\nA first information report (FIR), a copy of which is available with Dawn.com, has been registered against all three suspects under Sections 302 (premeditated murder) and Section 34 (common intention) of the Pakistan Penal Code, as well as Section 37 (punishment for violence) of the Child Protection Act (CPA).\n\n“One of the suspects has been taken into custody, while efforts are underway to arrest the other two.\n\n“This is a deeply disturbing case. A thorough investigation is ongoing, and we are committed to ensuring justice for the child and his family,” Fayaz said.\n\nFarhan’s uncle, Saddar Ayaz, told Dawn.com that when his nephew was at home, he was afraid to go back to the madressah and did not want to return.\n\n“I took him to the seminary myself, handed him over to the teachers, and went back,” Ayaz said. “Later that evening, one of the teachers called me and told me that my nephew had fallen in the toilet and died.”\n\nHuman rights groups and local residents have demanded action — not just to punish those responsible, but to prevent future tragedies.\n\n“Farhan could have been any of our children,” said Haider Ali, a local elder. “He went to study. He never came back.”\n\nUnder the Khyber Pakhtunkhwa Child Protection and Welfare Act 2010 and its 2018 regulations, corporal punishment is a punishable offence, violation of which can result in up to six months of imprisonment or a Rs50,000 fine, or both.\n\nIn May this year, the Khyber Pakhtunkhwa Private Schools Regulatory Authority, through a notification, strictly prohibited corporal punishment in all private schools across the province after receiving complaints.\n\nViolations, however, continue to prevail. According to a recent report by the KP Child Protection and Welfare Commission (KPCPWC), children across the province were subjected to 33 different forms of abuses, including 14 incidents of corporal punishment.\n\nIn April, a seminary teacher in Kasur was arrested for allegedly beating a student with a hot iron for not memorising his lesson at Bangla Kambovan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/01101324e7d8d4a.jpg?r=101332",
  "retrievedAt": "2025-08-17T21:01:53.789Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925841/young-student-allegedly-beaten-to-death-by-seminary-teachers-in-swat-police",
  "dateList": "2025-07-22",
  "date_published": "2025-07-22T09:43:41.000Z"
}
