{
  "title": "Sindh Mental Health Authority provides over 3,500 patients free psychiatric services - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh Mental Health Authority (SMHA) held medical camps in several cities recently, providing free-of-cost psychiatric services to over 3,500 patients.\n\nThe camps were held in Mithi, Diplo, Nangarparkar, Islamkot, Chachro, Kaloi, Dali, Umerkot, Sanghar, Khairpur and Sukkur\n\n“Patients were treated for various mental health conditions. The latest camp was held on July 20 at the basic health unit of Sikandarabad, Taluka Nara, district Khairpur,” Secretary SMHA Dr Syed Zafar Mehdi said, adding that over 500 patients were provided free consultations and medicines at the health facility.\n\nAccording to him, this was the first-ever psychiatric camp in the Nara Desert organised in collaboration with the District Health Office and PPHI (Peoples’ Primary Healthcare Initiative).\n\nThe authority plans to analyse camp data to develop a comprehensive mental health strategy for Sindh’s desert regions for policy planning and future interventions,” he said.\n\nOfficials stated that senior psychiatrists from Karachi, Hyderabad, Sukkur, Sehwan, and other cities volunteered for the camps. The patients included people of all age groups who were provided with thorough mental health assessments, personalised care, and two weeks of free psychiatric medicines.”\n\nA mental health camp was also held at the Gambat Institute of Medical Sciences where sessions held to discuss emerging mental health challenges in the province and to provide quality care to patients.\n\nThese initiatives, they said, would help expand mental healthcare access, reduce stigma, and build local capacity across underserved areas.\n\nPublished in Dawn, July 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/682d12fc618c1.jpg",
  "retrievedAt": "2025-08-17T21:03:04.137Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925730/sindh-mental-health-authority-provides-over-3500-patients-free-psychiatric-services",
  "dateList": "2025-07-22",
  "date_published": "2025-07-21T23:41:27.000Z"
}
