{
  "title": "Repatriation of profit remains flat in FY25 - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The outflow of profits and dividends on foreign investment remained tightly controlled in FY25, totalling $2.219 billion — only slightly higher than the $2.15bn recorded in FY24, despite notable improvements in Pakistan’s external account and broader economic indicators.\n\nAccording to data released by the State Bank on Monday, the restrained profit repatriation came as a surprise to many in the financial sector, especially considering the more stable macroeconomic environment in FY25, which saw record remittances of $38.3bn, a current account surplus, a stable exchange rate, and support from the International Monetary Fund.\n\nIn contrast, FY23 saw a sharp decline in profit outflows amid a severe economic crisis, dwindling reserves, and tight restrictions on foreign exchange payments. Profit repatriation on foreign direct investment (FDI) in FY23 fell to $1.349bn — a drop of $331m from FY22 — as foreign firms faced challenges in repatriating earnings and managing operations.\n\nWhile economic indicators improved in FY25, Pakistan still failed to meet its export targets or attract substantial foreign investment. FDI rose just 4.7pc year-on-year to $2.457bn, highlighting lingering investor concerns and a tepid investment climate.\n\nOutflows stood at $2.219bn in FY25 despite improved external conditions and record remittances\n\nThe stagnant profit outflow reflects continued foreign investor caution, underscoring Pakistan’s struggle to rebuild investor confidence despite signs of economic recovery.\n\nSector-wise data showed the power sector posted the highest profit outflows, rising to $399m in FY25 from $246m a year earlier. The sector has faced criticism over its capacity payment model, and the government has recently held negotiations to address structural inefficiencies.\n\nProfit repatriation in the financial sector totalled $383m — nearly half of the $638.6m recorded in FY24, when banks earned record profits by investing in high-yielding government securities offering returns of up to 22pc.The food sector also saw a notable increase, with profit outflows doubling to $306m in FY25 from $154m in FY24. In the oil and gas exploration sector, profit repatriation surged to $146.4m from just $13m in the preceding year, marking the most significant turnaround.\n\nPublished in Dawn, July 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/20092627de8a29c.jpg?r=092720",
  "retrievedAt": "2025-08-17T21:04:03.091Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925711/repatriation-of-profit-remains-flat-in-fy25",
  "dateList": "2025-07-22",
  "date_published": "2025-07-21T23:41:08.000Z"
}
