{
  "title": "Why China’s neighbours are worried about its new mega-dam project - World - DAWN.COM",
  "author": null,
  "content": "China has broken ground on what it says will be the world’s largest hydropower project, a $170 billion feat capable of generating enough electricity each year to power Britain.\n\nThe scheme dwarfs the mighty Three Gorges Dam, currently the world’s largest, and Chinese construction and engineering stocks surged after Premier Li Qiang unveiled it on the weekend.\n\nFor Beijing, the project promises clean power, jobs and a jolt of stimulus for a slowing economy. For neighbours downstream, it stirs old anxieties about water security: the Yarlung Zangbo becomes the Brahmaputra in India and Bangladesh, a lifeline for millions.\n\nThe plan involves five dams along a 50-kilometre stretch where the river plunges 2,000 metres off the Tibetan Plateau.\n\nFirst power is expected to be generated in the early-to-mid 2030s, but beyond that and the price tag, China has published little information about how it intends to build the project.\n\nThat lack of information is compounding fears about water security in India and Bangladesh, which rely on the Brahmaputra for irrigation, hydropower and drinking water.\n\nThe chief minister of Arunachal Pradesh, which borders China, said earlier this year that the dam could dry out 80 per cent of the river passing through the Indian state while potentially inundating downstream areas such as neighbouring Assam state.\n\nIn addition to water, the dam will also mean less sediment flowing downstream, according to Michael Steckler, a professor at Columbia University. That sediment carries nutrients essential for agriculture on floodplains downstream.\n\nIndia and China fought a border war in this region in the 1960s, and the lack of transparency from Beijing has helped fuel speculation it might use the dam to cut off water in another conflict, according to Sayanangshu Modak, an expert on the India-China water relationship at the University of Arizona.\n\n“The construction of the Yarlung Zangbo hydropower project is a matter within the scope of Chinas sovereign affairs,” Beijing’s foreign ministry said on Tuesday, adding the dam would provide clean energy and prevent flooding.\n\n“China has also conducted necessary communication with downstream countries regarding hydrological information, flood control, and disaster mitigation cooperation related to the Yarlung Zangbo project,” the ministry said.\n\nIndia’s foreign and water ministries did not respond to requests for comment.\n\nBut the impact of the dam on downstream flows has been overstated, in part because the bulk of the water that enters the Brahmaputra is from monsoon rainfall south of the Himalayas, and not from China, said Modak.\n\nHe added that China’s plans are for a “run of the river” hydropower project, which means the water will flow normally along the usual course of the Brahmaputra.\n\nIndia itself has proposed two dams on the Siang river, its name for the Yarlung Zangbo. One, an 11.5-gigawatt project in Arunachal Pradesh, will be India’s largest if it goes ahead. Those have been proposed, in part, to assert India’s claims on the river and bolster its case should China ever seek to divert the water, Modak added.\n\n“If India can show that it has been using the waters, then China cannot unilaterally divert,” he said.\n\nQuarrels over dams and water security are not new. Pakistan has accused India of weaponising shared water supplies in the disputed Kashmir region after New Delhi suspended its participation in the Indus Waters Treaty, which regulates water sharing between the neighbours.\n\nIn Egypt, a senior politician was once caught on camera proposing to bomb a controversial Nile river dam planned by Ethiopia during a long-running dispute over the project.\n\nThe dam will be built in an earthquake zone also prone to landslides, glacial-lake floods and storms. A spree of dam building in the area sparked concerns from experts about safety following a devastating earthquake in Tibet earlier this year.\n\nA much smaller hydropower project on a nearby tributary has been limited to four-month construction windows because of engineering challenges in high altitudes and vicious winters.\n\nHeader image: The Baihetan hydropower plant is seen in operation on the border between Qiaojia county of Yunnan province and Ningnan county of Sichuan province, China on June 28, 2021. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/22153432de8dc37.png",
  "retrievedAt": "2025-08-17T21:01:46.985Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925856/why-chinas-neighbours-are-worried-about-its-new-mega-dam-project",
  "dateList": "2025-07-22",
  "date_published": "2025-07-22T10:41:09.000Z"
}
