{
  "title": "Bangladesh take second T20I for first series win over Pakistan - Sport - DAWN.COM",
  "author": null,
  "content": "Bangladesh survived a late onslaught by Faheem Ashraf and Ahmed Daniyal to pull off a narrow eight-run victory in the second T20I match on Tuesday, winning a first-ever series in the format against Pakistan.\n\nAshraf hit an aggressive 32-ball 51 while debutant Daniyal smashed an 11-ball 17 but holed out off the second ball of the final over as Pakistan were all out for 125 in their chase of 134 to win in Dhaka.\n\nEarlier, Jaker Ali struck a 48-ball 55 as Bangladesh — sent in to bat — were bowled out for 133 in 20 overs, with Salman Mirza taking 2-17 and Daniyal close behind on 2-23.\n\nLeft-arm Bangladesh pacer Shoriful Islam picked up his best T20I figures of 3-17 on a slow-paced Mirpur pitch as Pakistan lost their first five wickets for just 15 runs by the fifth over.\n\nAshraf cracked four sixes and as many boundaries to raise hopes of a comeback win, but spinner Rishad Hossain bowled him in the penultimate over.\n\nAshraf and Abbas Afridi, who scored a 13-ball 19, had revived the innings from 47-7 with a 41-run stand, but Bangladesh had the last laugh.\n\nBangladesh won the first match at the same venue by seven wickets and took an unassailable 2-0 lead with the final match on Thursday, also in Dhaka.\n\nThis was Bangladesh’s first T20I series win over Pakistan in four tries.\n\nPakistan lost opener Saim Ayub to a run out for one in the first over before Islam dismissed Fakhar Zaman (8) and Mohammad Haris (0) to hit Pakistan hard at the top.\n\nBangladesh skipper Litton Das praised a team effort.\n\n“It’s wonderful to win back-to-back series,” said Litton, who also led the team to a 2-1 T20I series in Sri Lanka last week. “This shows good improvement in our standards.”\n\nPakistan captain Salman Agha rued his side’s batting lapses.\n\n“We thought 134 would be gettable but we lost too many wickets early on and that’s something we must address quickly,” said Agha.\n\nEarlier, Jaker smashed five sixes and a boundary for his third T20I half century.\n\nBangladesh had lost four wickets for 28 by the sixth over before Jaker and Mahedi Hasan revived the innings with a 53-run stand for the fifth wicket.\n\nMahedi scored a 25-ball 33 with two sixes and as many boundaries.\n\nThe final match is on Thursday, also in Dhaka.\n\nLast month, Pakistan had whitewashed Bangladesh in a three-match home T20I series at the Gaddafi Stadium. Das-led Bangladesh came into the series on the back of an away 2-1 T20I series triumph over Sri Lanka.\n\nPakistan are visiting Bangladesh for the first time since December 2021 as they arrived in the country on Wednesday, after taking part in an extensive training camp in Karachi, the PCB said.\n\nPakistan: Salman Agha (captain), Saim Ayub, Fakhar Zaman, Mohammad Haris, Hasan Nawaz, Mohammad Nawaz, Khushdil Shah, Faheem Ashraf, Abbas Afridi, Salman Mirza, Ahmed Daniyal\n\nBangladesh: Litton Das (captain), Parvez Hossain, Naim Sheikh, Towhid Hridoy, Shamim Hossain, Jaker Ali, Mahedi Hasan, Rishad Hossain, Tanzim Hasan, Mustafizur Rahman, and Shoriful Islam.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/22214601115a296.jpg",
  "retrievedAt": "2025-08-17T21:01:33.181Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925864/bangladesh-take-second-t20i-for-first-series-win-over-pakistan",
  "dateList": "2025-07-22",
  "date_published": "2025-07-22T12:27:53.000Z"
}
