{
  "title": "Iran hosts talks with Russia, China on nuclear issue today - World - DAWN.COM",
  "author": null,
  "content": "TEHRAN: Iran said it will host China and Russia on Tuesday for talks on its nuclear programme, amid European threats to reimpose sanctions.\n\n“A trilateral consultation” with Russia and China would be held in the Iranian capital to discuss nuclear issues and the potential reimposition of sanctions, foreign ministry spokesman Esmail Baqaei told a news conference on Monday.\n\nHe accused the West of failing to respect the 2015 Iran nuclear deal. “The European parties have been at fault and negligent in implementing” the nuclear agreement, Mr Baqaei said.\n\nThe three European countries have warned that sanctions could be reimposed on Iran if it does return to the negotiating table over its nuclear programme.\n\nBlames Western powers for not respecting 2015 deal\n\nIran confirmed fresh talks with European powers will be held on Friday in Istanbul.\n\nIranian diplomats will meet counterparts from Britain, France and Germany, known as the E3.\n\n“In response to the request of European countries, Iran has agreed to hold a new round of talks,” said the foreign ministry spokesperson.\n\nA German diplomatic source said on Sunday the E3 were in contact with Tehran.\n\n“Iran must never be allowed to acquire a nuclear weapon. That is why Germany, France and the United Kingdom are continuing to work intensively in the E3 format to find a sustainable and verifiable diplomatic solution to the Iranian nuclear programme,” the source said.\n\nKremlin meeting\n\nOn Sunday, Russian President Vladimir Putin held a surprise meeting in the Kremlin with Ali Larijani, top adviser to Iran’s supreme leader on nuclear issues.\n\nLarijani “conveyed assessments of the escalating situation in the Middle East and around the Iranian nuclear programme”, Kremlin spokesman Dmitry Peskov said of the meeting.\n\nPutin had expressed Russia’s “well-known positions on how to stabilise the situation in the region and on the political settlement of the Iranian nuclear programme”, he added.\n\nPublished in Dawn, July 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/2108075552c7a69.jpg?r=080813",
  "retrievedAt": "2025-08-17T21:04:21.950Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925712/iran-hosts-talks-with-russia-china-on-nuclear-issue-today",
  "dateList": "2025-07-22",
  "date_published": "2025-07-21T23:40:56.000Z"
}
