{
  "title": "Sania constitutes a joint working group to combat cyber frauds in name of Ehsaas",
  "link": "https://www.app.com.pk/national/sania-constitutes-a-joint-working-group-to-combat-cyber-frauds-in-name-of-ehsaas/",
  "date_published": "2021-11-12T12:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Senator Dr. Sania Nishtar Friday convened a meeting on cyber security and measures to combat fraud and disinformation through cell phone SMS’, websites and apps.\nThe meeting brought together senior officials and representatives from the Law Division, security agencies, Federal Investigation Agency (FIA), Pakistan Telecommunication Authority (PTA) and cellular mobile operators on the table.Chairman PTA, Maj Gen (Rtd) Amir Azeem Bajwa along with senior officials of Ehsaas including Secretary Ismat Tahira and DG Technology Mir Anwar were also present in the meeting.\nBringing rich perspectives to the table, the participants discussed the issues of fake websites, fake SMS, fake Whatsapp messages, fake apps, collecting information and defrauding innocent people using the name of Ehsaas. “To ensure zero tolerance towards digital and cyber frauds, Ehsaas will work together with all stakeholders”, vowed Dr. Sania.\nShe constituted a joint working group with senior officials and representatives from Ehsaas Technology team, PTA and Security Agencies.\n“The working group will meet on the weekly cadence to map the snags in the technological ecosystem and will devise an oversight mechanism and legal amendments in the existing laws with zero tolerance for any fraudulent activity through fake SMS, Whatsapp messages, fake apps and websites”, said Dr. Sania. “I will attend weekly meetings personally”, she added.\nMiscreants create fake websites and mobile applications to defraud poor people and prospective Ehsaas beneficiaries. “Scammers who send fake messages and calls to deceive poor potential /existing beneficiaries will be dealt with strictly”, said Sania.\nTo tackle the menace, PTA, security agencies, Law Division, Telcos and other stakeholders assured full cooperation and support to Ehsaas.",
  "retrievedAt": "2025-08-11T21:35:34.797Z"
}
