{
  "title": "Debt to GDP ratio decreases by 4% despite COVID-19 implications: Senate told",
  "link": "https://www.app.com.pk/national/debt-to-gdp-ratio-decreases-by-4-despite-covid-19-implications-senate-told/",
  "date_published": "2021-11-12T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):The Senate was informed on Friday that the government debt was on a firm downward trajectory, where Debt to GDP (Gross Domestic Product) ratio had decreased by 4 percent during the fiscal year 2020-21 despite economic slowdown caused by the coronavirus (COVID-19) pandemic.\n“The government expects that this ratio will decrease further by 2-3% during the ongoing fiscal year. Over the medium-term, the government’s objective is to ensure gradual reduction in fiscal deficit. which will subsequently reduce country’s reliance on additional debt,” Minister of State for Parliamentary Affairs Ali Muhammad Khan said during the question-hour, on behalf of the Minister for Finance and Revenue.\nAnswering to a question, he said the government paid Rs7,460 billion as interest on its debt, adding that “total public debt increased by Rs14,906 billion during the last three years, out of which 50% (Rs7,460 billion) was due to interest payments.”\nHe said the government was taking necessary steps for ensuring fiscal discipline and consolidation, stabilizing the economy and accelerating growth.\nResponding to another question, Ali Muhammad Khan said the government had set the General Provident (GP) fund rate based on the average yield/interest rate of 10-year floating Pakistan Investment Bonds (PIBs) issued during any fiscal year.\nHe said the applicable average yield/interest rate was 7.9 per cent for the fiscal year 2020-21. “Since, the GP fund rates are linked with floating rate bonds, policy rate in the economy has a major influence in determining this rate for any fiscal year i.e. policy rate was high in FY 2019-20 whereas, it reduced in FY 2020-21.”\nAccordingly, the minister said, the lower mark-up rate had been set on GP fund in FY 2020-21 as compared to last fiscal year. “There is no proposal under consideration to increase the mark-up, and rates for this year will be determined as per given criteria.”",
  "retrievedAt": "2025-08-11T21:35:37.323Z"
}
