{
  "title": "UNHCR & China’s support of neonatal intensive care for Pakistani and refugee mothers newborns",
  "link": "https://www.app.com.pk/national/unhcr-chinas-support-of-neonatal-intensive-care-for-pakistani-and-refugee-mothers-newborns/",
  "date_published": "2021-11-12T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):UNHCR with support of Chinese Government has completed the transfer of a consignment of emergency medical equipment to the neonatal intensive care unit (NICU) of the Polyclinic Hospital in Islamabad on Friday.\nTwenty-three pieces of equipment were transferred to the hospital as part of a list of equipment needed by the hospital, including infant incubators, baby warmers, suction machines, infusion pumps and ultrasound machines, said a press release.\nThe contribution was made possible by the financial support and generosity of the People’s Republic of China. This donation is also part of an ongoing programme of support undertaken by UNHCR across Pakistan in refugee-hosting areas to support health services that ensure treatment for refugees within their general services.\n“We’re very happy that we could facilitate the donation of these pieces of equipment, which help protect and save the lives of newborn children. The Polyclinic Hospital deserves every support we can provide as an invaluable service that helps not only the vulnerable newborn children of Pakistani families but also the new and fragile members of refugee families,” said UNHCR Representative in Pakistan, Noriko Yoshida.\nThe Polyclinic Hospital is one of the largest government hospitals in Pakistan, catering to the health needs of a wide range of patients.\nApproximately 1,000 patients per day, including refugees, will benefit from the new equipment.\nThe Government of China has been supporting UNHCR’s refugee and host community assistance in Pakistan as well as other countries in Asia, Africa and the Middle East.\nUNHCR’s assistance towards host community services is guided by a Solutions Strategy for Afghan Refugees.\nA Support Platform was set up in 2019 to boost the support of the international community towards collective efforts to find solutions for Afghan refugees, including the need for increased assistance towards national services in hosting countries like Pakistan.",
  "retrievedAt": "2025-08-11T21:35:32.636Z"
}
