{
  "title": "Dr Faisal launches nationwide anti-Measles Rubella immunization drive",
  "link": "https://www.app.com.pk/national/dr-faisal-launches-nationwide-anti-measles-rubella-immunization-drive/",
  "date_published": "2021-11-12T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):Special Assistant to the Prime Minister on National Health Services, Regulations and Coordination, Dr. Faisal Sultan on Friday launched a nationwide campaign to immunize more than 90 million children against the deadly Measles and Rubella diseases across the country.\nMore than 386,000 health professionals, including 76,000 vaccinators and over 143,000 social mobilizers were mobilized for the two-week campaign supported by Gavi, the Vaccine Alliance, UNICEF, WHO and partners.\nThe campaign targets children aged between nine months and 15 years and those aged up to five will also receive the oral polio vaccine.\n“Measles and Rubella are contagious diseases and can have severe complications for children even death. An effective vaccine against Measles and Rubella is available to prevent children from the two diseases,” Dr Faisal said addressing the occasion.\nHe said, “I urge both the front line workers to work with dedication and the caregivers to express their support by vaccinating their children against the diseases.\n“Measles and rubella are a couple of devastating diseases that cause severe sickness and can take lives,” said Dr. Muhammad Akram Shah, National Programme Manager, Expanded Programme on Immunization (EPI).\nIn recent years cases have surged dramatically in Pakistan. “Measles cases rose alarmingly affecting thousands of children and claiming many young lives. We need to vaccinate every child”, said Dr. Shah.\nHe said that the campaign will be conducted in public and private health facilities, outreach centres as well as educational facilities, for 12 days from November 15 to November 27. Nearly half of the children who are to be immunized are enrolled in schools.\nThe MR vaccine will be available in the routine immunization schedule for children at nine months and 15 months of age.\n“The Measles and Rubella campaign will move us not only one step closer to maintaining measles elimination and accelerating rubella control, but also one step closer to reducing the overall child mortality across Pakistan. Every child has the right to access life-saving healthcare,” said Dr. Palitha Mahipala, WHO Representative in Pakistan.\nHe said, “WHO is partnering with the Government of Pakistan and supports to ensure that all children get vaccinated against Measles and Rubella. We appreciate the strong political commitment of the Government of Pakistan towards the measles elimination for the benefit of all children in Pakistan.”\n“Today’s world is still grappling with the very contagious measles and rubella viruses, none of which has gone away despite being entirely preventable with a simple vaccine,” said Ms. Aida Girma, UNICEF Representative in Pakistan.\nShe said, “UNICEF is proud to support the government to ensure that safe, effective vaccines are available and delivered nationwide. By working together, we can contribute towards the global eradication of measles and rubella, to the benefit of children in Pakistan and across the world.”\nHe said that Pakistan has demonstrated unwavering commitment toward restoring and strengthening immunization services across the country over the past years, with promising results.\nTargeting every child is a priority to help ensure that the vaccination is equitable for every child, she added.",
  "retrievedAt": "2025-08-11T21:35:34.795Z"
}
