{
  "title": "Dr. Arif Alvi for providing jobs to disable people",
  "link": "https://www.app.com.pk/national/dr-arif-alvi-for-providing-jobs-to-disable-people/",
  "date_published": "2021-11-12T17:57:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 12 (APP): President Dr Arif Alvi Friday said that persons with disabilities should be provided jobs to enable them earn their livelihood.\nHe was addressing the convocation 2021 of the Institute of Cost and Management Accountants of Pakistan (ICMA Pakistan), here at the Sindh Governor’s House as the chief guest.\nHe said that persons with some forms of disabilities constitute around 15 percent of the world population. But visually, physically or hearing impaired people can be provided jobs because they are fit mentally, he added.\nThe president congratulated the passing out students of ICMA Pakistan and observed that after successfully completing the degrees, these professionals will also be part of the corporate world, thus, they will also be responsible for protection of the interest of investors and workers.\nHe also called upon them to work for creation of employment opportunities for the women and disabled persons.\nThe president expressed confidence that the faculty and management of the ICMA Pakistan will also pay attention to this aspect.\nHe termed fake news through social media and disparity of wealth as challenges for the whole world in the present era.\nDr Arif Alvi said that the steps were being taken across the globe to provide secure environment to the women at workplace.\nEarlier, in his welcome address President ICMA Pakistan Ziaul Mustafa said that the ICMA Pakistan was established in 1951 and with its 7000 members, five branches in Pakistan and five overseas chapter, the institute has got membership of many renowned international organizations.\nHe said that the ICMA Pakistan was equipped with latest education, best practices and trends which was helping businesses grow further.\nEarlier, President Dr. Arif Alvi along with President ICMA Pakistan Ziaul Mustafa and others presented degrees to 32 successful CMA qualified candidates.",
  "retrievedAt": "2025-08-11T21:35:29.668Z"
}
