{
  "title": "APS attack a great national tragedy",
  "link": "https://www.app.com.pk/national/aps-attack-a-great-national-tragedy/",
  "date_published": "2021-12-15T13:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP):The Army Public School (APS) attack was a great national tragedy, the losses of the parents and kins of shuhada were irreparable but the nation stood with the affected and Pakistan never lost sight of its national resolve to wipe out foreign sponsored terrorism to prevent and guard against such heinous crime against its citizens.\nArmy Public School (APS) – Peshawar massacre was carried out in a terrorist attack in which seven heavily armed TTP fighters assaulted an Army-run Secondary school in Peshawar on December 16, 2014.\nDuring the attack 134 students within the age bracket of 12 – 18 years were brutally martyred. Martyred also included few teachers, the Principal of the school. It was a Tehreek-e-Taliban Pakistan (TTP) executed attack but planned and financed by Indian Intelligence Agency, RAW and Afghan Intelligence, NDS.\nWorld was experiencing global spread of terrorism and Pakistan had been one of the worst affected countries. Major cities of Pakistan were affected due to terrorism but Peshawar, the capital city of Khyber Pakhtunkhwa and home to a huge majority of Afghan refugees witnessed some of the very brutal attacks.\nPakistani citizens had faced huge losses in terms of lives and material due to foreign assisted/ funded terrorist’s activities executed through political, secessionist, sectarian, ethnic and religious fundamentalists sponsored by hostile states.\nTerrorist attacks staged in Pakistan had killed over 80000 people and inflicted massive damage to the Pakistani economy totaling greater than $67 billion.\nPakistan issued a number of dossiers exposing Indian sponsored terrorism in Pakistan which included very specific information such as bank accounts and Indian nationals involved. It also included information about places of training camps for TTP, Baloch anarchist and others groups.\nIt was also revealed that Indian intelligence (RAW) spent $1 million for the merger of the Tehreek-e-Taliban Pakistan (TTP) with four other militant groups for terrorism in Pakistan.\nIndia had also been funneling money to Baloch anarchists through think tanks in Afghanistan and other means.Indian RAW had also invested heavily to disrupt the progress of CPEC by attacking its projects through different groups.\nThe mastermind of the APS attack was Mullah Fazal Ullah (killed), other collaborators were Gul Zaman Orakzai, Omar Narai (killed) and Muhammad Khurassani (Afghan custody), they were in touch with RAW and NDS handlers in Afghanistan.\nThe attack was considered as Pakistan’s 9/11. After this incident Pak Army decided to launch major operations against terrorists and eliminate them.\nAPS attack was one of its kind highly brutal terrorist activity which targeted innocent children and teachers.\nThe attack was aimed to damage Pakistan’s armed forces sacrifices and successes in war on terror operations. Further the attack was planned and executed by Indian RAW and Afghan NDS to break the Pakistani nation’s resolve against terrorism.\nContrary to this Pakistan Army and nation emerged as more strong and resilient in its commitment to eliminate the menace of terrorism from its soil.\nPakistan Army and government extended all possible assistance to the affected families to contribute in sharing their unbearable loss.\nUnfortunately the great tragedy was being used by anti-Pakistan forces for self-serving purposes, negative propaganda targeting armed forces and other institutions.\nPakistan Army and government had extended all possible assistance for the affected families and all major culprits part of the terrorist attack had already been brought to justice.",
  "retrievedAt": "2025-08-11T21:43:06.185Z"
}
