{
  "title": "Afghanistan is about to collapse. Here’s what the US must do about it.",
  "link": "https://www.app.com.pk/national/afghanistan-is-about-to-collapse-heres-what-the-us-must-do-about-it/",
  "date_published": "2021-12-15T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP):The alarm bells are sounding – as the United Nations, the World Bank, the International Monetary Fund, and the donor community have all been warning of the humanitarian catastrophe emerging with the imminent collapse of the Afghan economy.\nAccording to an article published on the website of Atlantic Council, the withdrawal of US and allied forces from the country, which led to the disintegration of the Islamic Republic of Afghanistan and the Taliban takeover, has been followed by the cutoff of most external assistance and the freezing of most of Afghanistan’s monetary reserves, thereby eliminating 40 percent of the country’s gross domestic product and 75 percent of the government’s budget. The banking system is on the verge of collapse as well, and the currency (the afghani) is losing value rapidly.\nAdd to this a prolonged drought, a raging COVID-19 pandemic, and the disintegration of government services, the write up pointed.\nThe article was penned by former ambassadors and generals of the United States including John F. Campbell, Ryan Crocker, James Cunningham, James Dobbins, Hugo Llorens, P. Michael McKinley, John Nicholson, Ronald E. Neumann, Richard Olson, David Petraeus, and Earl Anthony Wayne\nThe United Nations Development Program has warned that “Afghanistan teeters on the brink of universal poverty,” with as much as 97 percent of the population in danger of falling below the poverty line by mid-2022.\nThe World Food Program estimates that only 5 percent of Afghan households have sufficient food to eat each day and predicts that Afghanistan is poised to become the world’s largest humanitarian crisis. The UN’s humanitarian chief laments that Afghanistan’s economy is unraveling “before our eyes.”\nThe international community is gearing up to provide increased humanitarian assistance to Afghanistan, and the World Bank is releasing some funds to support this effort. But more help is needed to stave off disaster. In addition to food and medicine, Afghanistan needs a stable medium of exchange and a functioning banking system to avoid experiencing widespread economic and governance failure.\nHealth professionals, teachers, and other essential workers need to be paid if the most basic functions of the state are to be maintained. Ordinary Afghans deserve access to their own funds, now frozen in banks wary of US and international sanctions and the potential collapse of the Afghan financial system. Afghans abroad need the financial mechanisms to send remittances to their relatives, some of whom are being left behind by cumbersome US rules on who qualifies for refugee and immigrant status.The Biden administration, like other donors to Afghanistan, is rightly reluctant to do anything that helps the Taliban impose its repressive rule on the country, underscored by recent reports of extrajudicial killings and disappearances.\nNevertheless, discussions are underway in Washington and elsewhere to explore various means of stabilizing the Afghan currency and averting the collapse of the banking system without providing the Taliban with discretionary resources that could be used for nefarious purposes.\nGood ideas for how to do so are available, including proposals by former US ambassadors, USAID directors, and World Bank officials, among others. Because any scheme along these lines will be very controversial, and no system of controls will be perfect, what is needed is the courage to act. The longer decisions are postponed, the more difficult it will become to prevent the looming humanitarian catastrophe in the country and the deaths of many Afghans.\nDuring the past twenty years, all of us have led American diplomatic and military efforts to support the emergence of a more modern, prosperous, and democratic Afghanistan.\nThe group of prominent US ambassadors and generals while writing the article said, “We are much more than dissatisfied with the results, and many of us disagreed with the US decision to withdraw from the country.”\n“We believe the United States and its allies can and should be working in a more concerted manner both behind the scenes and publicly to send clear messages to Taliban leaders relating to core issues like counter terrorism cooperation, broadening non-Taliban representation within the government, and upholding the basic rights of women, people of all ethnic groups, notably minorities, and Afghans closely associated with the United States and other partners. Our personal experience has also left us with indelible respect and affection for the millions of\nAfghans who joined in this enterprise—fighting, teaching, voting, ministering to the sick, sending their children to school, running for office, founding new businesses, and building the freest and most vibrant media environment in Central Asia.\nWe believe the United States has a reputational interest and a moral obligation in vigorously joining efforts to help the Afghan people preserve at least some of the social and economic gains made over the last twenty years.\nWe believe that ways to do so can be found, while erecting barriers to assistance being diverted to purposes other than those for which it is intended. Afghan civil society continues to exist, and it is important that the United States and other international donors continue to work with it.\nWe therefore recommend that the Biden administration expedite its consideration of these issues and, working in close coordination with key allies, come forward with tangible proposals to help stabilize the Afghan economy for discussion with other donors and ultimately presentation to the Taliban. Delay will only fuel more death and suffering.”",
  "retrievedAt": "2025-08-11T21:43:05.611Z"
}
