{
  "title": "Solangi, Power Division Secretary briefs media on electricity tariff",
  "link": "https://www.app.com.pk/national/solangi-power-division-secretary-briefs-media-on-electricity-tariff/",
  "date_published": "2023-08-26T16:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi along with Federal Secretary of the Power Division Rashid Mahmood Langrial held a media briefing on Saturday to explain the current state of electricity tariffs.\nAt the outset of the briefing with anchorpersons and bureau chiefs from various media outlets, the minister acknowledged the difficulties faced by the people due to the escalating electricity prices.\nIn response, Caretaker Prime Minister Anwaar-ul-Haq Kakar had called a high-level meeting on Sunday to address concerns related to electricity pricing, he added.\nHe said all stakeholders within the power sector would participate in the meeting.\nThe Secretary of the Power Division informed the media that the National Electric Power Regulatory Authority (NEPRA) determined electricity tariffs using three distinct methodologies.\nThe three-month tariff adjustment was meant for new power plants, he said, adding electricity prices were subject to fluctuations based on the Consumer Price Index.\nMoreover, he elaborated on the necessity of tariff alterations due to the upsurge in KIBOR rates. However, fuel price adjustments also impacted electricity costs.\nIn the fiscal year 2023, the tariff was initially set at Rs 195 per dollar, but the value of the dollar surged to Rs284.\n“We initially aimed to set the price of RNLG at Rs 3,183 per MMBTU, however, the actual price ranged between Rs 3,000 and Rs 3,800,” he noted.\nSimilarly, the secretary said the price range for imported coal fell between Rs 51,000 and Rs 61,000 per metric ton.\nHe further disclosed that a staggering Rs 2 trillion would be exclusively allocated to capacity payments in the upcoming year.\nThe increase in electricity tariffs predominantly affected consumers utilizing more than 400 units, he said, adding the tariff remained unchanged for 63.5 per cent of domestic consumers.\nFor 31.6 per cent of domestic consumers, he said electricity prices saw an uptick of up to Rs 6.5 per unit.\nNotably, a tariff of Rs 7.5 per unit was only applied to 4.9 per cent of domestic consumers, he added.\nLangrial asserted that the average tariff increase for domestic consumers stood at Rs 3.82.\n“In July 2022, the highest recorded electricity tariff was Rs 31.02 per unit,” he affirmed, also revealing that by August\n2023, the price had increased to only Rs 33.89 per unit.\nHe confirmed that the facility of free electricity units to DISCO officers would be discontinued, emphasizing that the burden was not being transferred to regular bill-paying individuals.",
  "retrievedAt": "2025-08-11T09:19:18.040Z"
}
