{
  "title": "Caretaker govt to focus on revenue generation, human resource development: PM",
  "link": "https://www.app.com.pk/national/caretaker-govt-to-focus-on-revenue-generation-human-resource-development/",
  "date_published": "2023-08-26T07:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Saturday said that the interim government would focus more on rationalizing the expenditures, generations of revenue and development of human resource during its short constitutional period.\nTalking to a delegation of students from Harvard University US, the prime minister said that in Pakistan, about 9 percent population was contributing towards GDP with their taxes.\nHow to bring the undocumented economy,  people in the tax net and how to invest in the human resources would be broadly focused during the short period of the caretaker government, he added.\nThe prime minister said Pakistan was gifted with the natural resources and was a country of talented people.\nHe said the government was focusing to produce the high-tech educated and skilled human resource and cited a couplet of Allama Iqbal in which he had hinted the importance of human resource through individual and collective efforts.\n“Pakistani diaspora in the US is a success story itself,” he said, adding the Americans knew the Pakistanis who were contributing in their society.\nA delegation of Harvard University comprising 38 students from 9 different nationalities, is currently on a visit to Pakistan.\nResponding to a question, he said Pakistan had been the biggest victim of climate disaster which was a global issue. The climate change had become an existential threat, he added.\nHe opined that the world viewed the US as a big power but at the same time, expected it to turn itself into a green power.\nAppreciating the progress achieved by the American society, he said the diversification in the US society was an example for other countries to follow, adding their society was tolerant and what the US had produced in the domains of knowledge and skills was amazing.\nThe caretaker prime minister said the other countries ought to learn from it for their own benefits.\nReplying to a query, the prime minister elaborated the role played by Pakistan during the former USSR and Afghanistan war and the subsequent events in the region.\nHe said Pakistan had contributed hugely towards the global peace and economy.\nThey had faced a lot of challenges in the past as the two powers of the world; the US and Russia, had been in its milieu which had implications, he added.\nPM Kakar, explaining a viewpoint, said that priorities by different governments in Pakistan kept on changing, but they did have visions and tried to visualize those visions. He also deliberated upon the history and creation of Pakistan.\nThe prime minister, to another question, said that democracy gave strength to parliament and mentioned that in Pakistan, in the last fifteen years, three successive democratic governments had completed their tenures.\n“Democracy is a process. We are committed to the performance and participatory process of democracy,” he said.\nThe prime minister also underscored the importance of continuation of the social order and the maintenance of rule of law.\nThe prime minister said that Pakistan had been positively engaged with the US on different issues, adding there were also conversion and diversion between the both countries on various global issues.",
  "retrievedAt": "2025-08-11T09:19:40.090Z"
}
