{
  "title": "All political parties require to hold intra-party elections within five years: ECP",
  "link": "https://www.app.com.pk/national/all-political-parties-require-to-hold-intra-party-elections-within-five-years-ecp/",
  "date_published": "2024-10-02T10:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 2 (APP):The Election Commission of Pakistan (ECP) has said that under Sections 208 and 209 of the Elections Act 2017, all political parties are required to hold intra-party elections within five years in accordance with their party constitution.\nInitially, Pakistan Tehreek-e-Insaf (PTI) was supposed to conduct its intra-party elections by June 13, 2021, but  were not held on time, said a statement issued by ECP here Wednesday.\nThe ECP served repeated reminders  on PTI and before serving a show-cause notice on July 27, 2021, it further said. In response, PTI requested a one-year extension, citing COVID-19 pandemic. The ECP granted  extesnion on the request of PTI, extending the deadline to June 13, 2022.\nHowever, PTI submitted incomplete intra-party election documents under Form 65 in June 2022 to the ECP and despite repeated reminders, the party continued to delay the submission of required documents.\nDespite inordinate delay, the ECP has shown flexibility throughout the process and granted many opportunities to PTI to meet its constitutional requirements. “However, the responsibility for the slow progress rests with the PTI, as the ECP continues to work to legally resolve the matter,” the statement further said.\nPTI held its recent intra-party elections on March 3, 2024, but the process was marred by several shortcomings. The ECP served a notice regarding these issues on April 23, 2024, with the first hearing on April 30, 2024. Between April and October 2024, the case has been heard six times. However, PTI has requested adjournments including hearing on October 2, 2024, seeking more time.\nThe ECP held several hearings in this regard, but the matter remained unresolved due to PTI’s repeated requests for adjournments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:47:56.265Z"
}
