{
  "title": "Minister reviews preparations for upcoming SCO Summit",
  "link": "https://www.app.com.pk/national/minister-reviews-preparations-for-upcoming-sco-summit/",
  "date_published": "2024-10-02T18:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 02 (APP):Chairman of Prime Minister’s Youth Programme, Rana Mashhood Ahmed Khan, on Wednesday visited the Capital Development Authority (CDA) headquarters to review preparations for the upcoming Shanghai Cooperation Organisation (SCO) Summit.\nHe was received and briefed by Chairman CDA, Muhammad Ali Randhawa, along with key officials, including the Inspector General of Islamabad, senior officers from the Ministry of Foreign Affairs, CDA’s Environment and Engineering Wings, DC Islamabad, MCI, DMA, representatives from the Baku team, and Serena Management.\nA detailed briefing was given on various aspects of the SCO summit’s preparations, including Islamabad’s beautification plan, the revamping of the Jinnah Convention Center (JCC), repair and maintenance of VIP routes , and security and lodging arrangements for international delegations and dignitaries.\nRana Mashhood stressed the importance of adding festivity, colour, and vibrancy to the reception for international delegations.\nCDA Chairman Muhammad Ali Randhawa highlighted that preparations for the SCO Summit are in full swing.\nHe outlined a comprehensive beautification plan, including landscaping, and horticulture efforts along the VIP and alternative routes.\nThe various design elements including sculptures, and signage are being placed at key areas.\nThe major interchanges, underpasses, bridges, and other structures are being renovated and painted to enhance their aesthetics.\nThe beautifcation efforts are being carried out in coordination with the Baku team.\nThe main routes are being decorated with flags, digital streamers, and SMDs enhancing the city’s beauty.\nThe main roads are also being repaired, with patchwork, kerb stone replacements, signage and lane marking to ensure smooth and safe travel.\nThe Member Engineering provided an update on the revamping of the Jinnah Convention Center, which is near to its completion.\nThe final touches are being done to ensure the venue is ready to host the summit successfully and CDA has started handing over to MOFA.\nSerena Management officials briefed the delegation on lodging and hospitality arrangements for the principal delegations.\nThey confirmed that main hall and rooms have been refurbished to the highest standards, and all accommodations are nearly complete.\nInspector General of Police Islamabad shared details about the special security arrangements to ensure the safety of international delegation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:46:45.620Z"
}
