{
  "title": "SDPI launches booklet on debunking myths about electric power system, tariff structure",
  "link": "https://www.app.com.pk/national/sdpi-launches-booklet-on-debunking-myths-about-electric-power-system-tariff-structure/",
  "date_published": "2024-10-02T13:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 02 (APP): The experts at a webinar on Tuesday emphasised the need to simplify the existing electric power system and tariff structure for reducing burden on the domestic consumers.\nThe Sustainable Development Policy Institute (SDPI) organised the webinar to launch its latest booklet “Understanding Electric Power System and Tariff Structure in Pakistan: A Basic Guide”, a news release said.\nSDPI’s Research Associate Zainab Babar, while moderating the webinar, said the recent changes in tariff and energy policy mounted unrest not only among consumers but also energy policy makers.\n“However, the SDPI has formed a booklet on power system working and tariff setting to clarify the unrest and queries of the consumers in a comprehensible way,” she added.\nEngineer Ahad Nazir, Associate Research Fellow and Head Center for Private Sector Engagement, in his opening remarks, said Pakistan’s power sector was technical and complex whereas the booklet was an endeavour to make the complex subject understandable from the value chain approach from power generation to transmission, distribution and finally how tariff is determined as even experts qualified in energy subjects are finding it hard to grasp.\n“The most frequently asked questions by the consumers are pertaining to fuel price adjustment and quarterly tariff adjustment whereas the booklet sheds light on these aspects,” he added.\nThe consumer, he said, needed to be aware of the myths and confusions regarding power sector in terms of exchange rate, fuel prices, generation efficiency.\nHe said the tariff was set by NEPRA (National Electronic Power Regulatory Authority) and the Ministry of Energy and other organizations be that GENCOs or DISCOs could not unilaterally decide power tariffs.\nEngineer Ahad Nazir added that all the myths pertaining to the power sector had been debunked in the SDPI’s booklet that needed to be widely publicized to educate the masses on their misconceptions in that regard.\nDr Khalid Waleed, Research Fellow of SDPI and energy expert, said price signals were very important for developing countries in the power sector as it was used to drive demand and supply of power to drive policy decisions.\n“There has been massive uncertainty involved in power tariff setting mechanisms through which policy makers can use those signals for tariff setting. In Pakistan the sector is over complicated ,” he said.\nDr Khalid explained that almost 89% of the total power consumers relied on residential sector that consumed about 48% of total electricity followed by industrial consumers, who make only one per cent of the total consumers, utilized 25%.\n“There are four distinct layers in tariff setting,” he said. The first layer comprised of generation energy price including fuel cost, second of the capacity price, return on equity (debts servicing), third was the fuel price adjustment and then came transmission cost that included operations and maintenance and finally the government taxes of multiple types.\nHe mentioned that there was a need to devise innovative financial solutions, liberalised market, targeted subsidies, simplified slab mechanism, net metering and gas connection, energy efficient and conservation, competitive tariff and quality of service to increase energy consumption in the industrial sector.\nAfia Malik, Senior Research Economist of Pakistan Institute of Development Economics (PIDE), said the consumers due to lack of understanding of tariff formulation were unable to control their electricity bills.\n“There is a weak link between price and demand due to which energy consumption is mostly towards more consumptive sectors instead of the productive sectors. This cycle has to be broken and is possible through revision of our current tariff design with a focus on innovative tariff design,” she added.\nAbubakar Ismail, Head of Energy & Sustainability, Amreli Steels Limited, said the industry was facing a lot of challenges due to tariff uncertainty whereas the tariff needed to be designed in a prospective manner to remove heads and make it comprehensible for the masses.\nAhtasam Ahmad, Energy Finance Associate of Renewables First, said the simplification of entire structure and mechanism of tariff setting was crucial as the fundamental problem was on the end of the government.\n“Inherent mismatch between the tariff and revenue needs to be figure out that would help end the uncertainty on the tariff, and curtailing volatility of the tariff should be the priority of the government to end tariff myths,” he added.\nAsad Mahmood, Energy Efficiency and Renewable Energy Expert said the SDPI took a laudable endeavour and the topic should be repeatedly discussed to make it vogue as the general public lacks basic knowledge on the units they consume.\n“Uncertainty and variables around tariff do exist but communication tools are critical to make people understand their consumption patterns and modes to embrace control of their usage,” he said.\nEngineer Ahad Nazir, in his closing remarks, said there was a need to contextualise every reform agenda with the prevailing needs like economic growth, investments and exports to grasp policy makers’ attention.\n“Every regulator has a constituency and any communication from its side should be lucid, simple and comprehendible,” he said.",
  "retrievedAt": "2025-08-10T19:47:10.567Z"
}
