{
  "title": "PM presents true picture of Afghanistan in UN General Assembly: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/pm-presents-true-picture-of-afghanistan-in-un-general-assembly-sheikh-rashid/",
  "date_published": "2021-09-25T14:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP): Minister for Interior Sheikh Rashid Ahmad on Saturday said that Prime Minister Imran Khan has presented a true picture of Afghanistan covering all aspects logically and confidently in his address to the UN General Assembly.\nCommenting on Prime Minister’s address to the UN General Assembly, he said PM Imran Khan boldly told the world leaders about the role of superpowers in reaching Afghanistan at this stage while the PM also discussed the causes of increasing social and economic instability in the world.\nHe said that the PM has narrated the whole background of the prevailing situation in Afghanistan right from the role of superpowers to the Afghan Taliban. “PM Imran Khan told the world that it was not Pakistan but actually the USA and other countries behind all what happened in Afghanistan,” Sheikh added.\nHe said Imran Khan has clearly apprised the world that Pakistan had to face a hard time on extending its support to the USA and allied forces. “PM Imran Khan told the world how Pakistan faced terrorism independently when the USA left Pakistan at a time when terrorism was on its peak.”\nHe said that Pakistan’s appeal to world leaders on not leaving Afghanistan alone at this stage shows PM’s feeling of love for humanity.\nSheikh Rashid said that the Prime Minister once again exposed the fascist face of Modi’s India, its discriminatory policies with minorities and the Indian army’s insolence with the dead body of senior Kashmiri Hurriyat leader Syed Ali Geelani.\nHe expressed the hope that the world community will make policies taking guidance from the Prime Minister’s address to the UN General Assembly.",
  "retrievedAt": "2025-08-11T21:19:40.159Z"
}
