{
  "title": "Pakistan becomes heaven for new investment: Farrukh Habib",
  "link": "https://www.app.com.pk/national/pakistan-becomes-heaven-for-new-investment-farrukh-habib/",
  "date_published": "2021-09-25T18:33:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Sep 25 (APP):State Minister for Information and Broadcasting Farrukh Habib said that Pakistan has become heaven for new investment due to the policies of the PTI government and various countries are launching joint ventures with their Pakistani counterparts.\nHe said this here on Saturday while inaugurating a gloves factory in Allama Iqbal Special Economic Zone near Sahianwala. It is a joint venture between Germany and Pakistan.\nHe said that the coronavirus pandemic had hit hard the business but the economic growth in Pakistan continued to rise whereas the businesses in India, UK, Germany and other developed countries were squeezing. He said that our core issues were foreign loans and to overcome it we had only two options. One was that expatriate Pakistanis should deposit maximum remittance to Pakistan. They did this job and remittances stood at 30 billion US dollars. Similarly, we should concentrate on enhancing our exports for which government was consulting industrialists and providing them best possible facilities within the given circumstances.\nState Minister for Information and Broadcasting Farrukh Habib said that our agriculture sector was growing at a much faster pace while our growth stood at 4 percent. He said that our focus was to incentivise local and international investors. In this connection, three special economic zones were being developed including Allama Iqbal Special Economic Zone under China Pakistan Economic Corridor (CPEC). Allama Iqbal Special Economic Zone was fully equipped with latest facilities and a dedicated grid station was also approved it besides supplying gas to this zone, he added.\nHe said that due to the special interest of Prime Minister Imran Khan, work on SEZs had been expedited. Policies were being carved out in consultation with the industrialists which yielded positive results.\nFarrukh Habib said, “This gloves factory is also an export-oriented project which will not only enhance our exports but also attract other investors to come to Faisalabad and launch joint ventures on the same pattern.”\nHe said that China had dragged out 700 million people from poverty and for this purpose, the only option for us was to enhance our exports which will also create maximum job opportunities for the unemployed workers.\nMian Aslam Iabal Provincial Minister for Industry, Commerce and Investment said that “I am proud to be a part of the government which has put Pakistan on sustained economic growth”.He said that before PTI government the looms sector was in bad shape. Prime Minister Imran Khan announced historic industrial policy which played a pivotal role in revival of this profitable sector, he added.\nHe said that refund system had been made easy and simplified. Similarly, government successfully launched Kamyab Jawan programme which helped our talented youth to start their own business instead of running after the jobs. He said that government ensured easy availability of cheap loans through State Bank of Pakistan (SBP), so that new industry could be installed in the country.\nHe said that federal government was also introducing reforms in all sectors which will yield positive results on the overall economy.\nMNA Khurram Shehzad said that Faisalabad had emerged as one of the biggest industrial zone of Pakistan adding 80 percent industrial units installed in this city were export-oriented which will materialize the vision of Prime Minister Imran Khan to give a quantum jump to the exports.\nProvincial Minister for Chief Minister’s Inspection Team Muhammad Ajmal and others were also present on the occasion.",
  "retrievedAt": "2025-08-11T21:19:39.541Z"
}
