{
  "title": "Foreign Secretary, EU diplomats discuss bilateral ties, situation in Afghanistan",
  "link": "https://www.app.com.pk/national/foreign-secretary-eu-diplomats-discuss-bilateral-ties-situation-in-afghanistan/",
  "date_published": "2021-09-24T20:24:00.000Z",
  "source": "APP",
  "content": "Foreign Secretary Sohail Mahmood met with the Heads of Mission of the EU member states and EU Delegation here on Friday and discussed matters relating to Pakistan-EU relations and the latest developments in Afghanistan.\nThe Foreign Secretary stressed the importance Pakistan attached to its relations with EU as well as to deepening cooperative ties with EU member states bilaterally. He expressed satisfaction over the current trajectory of Pakistan-EU relations.\nHe also recalled the recent telephone conversation between Prime Minister Imran Khan and President of the EU Council Charles Michel, visits of several European Foreign Ministers to Islamabad and telephonic exchanges with Foreign Ministers in recent weeks, and meeting of the High Representative of the EU and Foreign Minister on the sidelines of the UN General Assembly. The Foreign Secretary said that these high-level interactions had generated positive momentum to further strengthen the relationship.\nOn Afghanistan, the Foreign Secretary noted that the meltdown of the Afghan security forces and collapse of government in Kabul were unanticipated. The Foreign Secretary added that a peaceful and stable Afghanistan was vitally important for Pakistan and the region.\nHe underlined the need for the international community to have a pragmatic approach on engaging Afghanistan through positive messaging and constructive measures. It was imperative to take steps to preclude humanitarian crisis, economic meltdown, and possibility of mass outflow of Afghan refugees.\nThe Foreign Secretary reiterated Pakistan’s disappointment over unwarranted and negative references to Pakistan in the European Parliament’s resolution on the situation in Afghanistan. The Foreign Secretary highlighted Pakistan’s positive role in assisting the evacuation efforts of the international community in general, and EU partners in particular. He stated that the references in the resolution were inconsistent with the spirit of Pakistan-EU relations and the recent constructive interactions at the highest political levels.\nThe Foreign Secretary added that the Pakistan-EU Strategic Engagement Plan was an important mechanism and that Pakistan looked forward to deeper bilateral engagement with EU through next rounds of Political and Strategic Dialogues.\nThe EU Heads of Mission thanked Pakistan for the facilitation provided to the evacuation efforts. They also stressed the importance of the EU-Pakistan relationship and their readiness to strengthen cooperative ties on the bilateral plane.\nIt was agreed to further boost high-level and Parliamentary exchanges.",
  "retrievedAt": "2025-08-11T21:19:43.262Z"
}
