{
  "title": "Pakistan to enhance bartering trade with China",
  "link": "https://www.app.com.pk/national/pakistan-to-enhance-bartering-trade-with-china/",
  "date_published": "2021-09-25T10:25:00.000Z",
  "source": "APP",
  "content": "BEIJING, Sep 25 (APP): In a milestone move to boost barter trade with more countries, Pakistani enterprises joined the Cross-border Barter Trade Alliance at the Inaugural Ceremony of Cross-border Barter Trade Alliance (CBTA) and the Cross-border Barter Trade Platform held at China’s coastal city of Qingdao.\nBarter is typically known as trading one good or service by one party in return for another good or service from another party without the use of money. The General Administration of Customs of China estimates that the total volume of bartering transactions surpassed USD 130 billion in 2020.\nAccording to the International Reciprocal Trade Association (IRTA), a global organisation for barter trade, an estimated 65% to 80% of Fortune 500 enterprises have been reported to engage in some form of bartering, and 65% of corporations listed on the NYSE are involved in bartering.\nIn a similar vein, barter trade also plays a role in Pakistan.According to media reports, Pakistan has exported the surplus wheat and rice to Iran in exchange for sought-after fertiliser and iron ore.\nBarter trade between Pakistan and China also holds great promises. “Pakistan is rich in natural resources such as minerals. The country can trade marbles for other goods with China,” said Ms Shao Liying, who conducted business operations in Pakistan for four years before setting up an O2O barter platform in China, in an exclusive interview with China Economic Net (CEN).\nWang Hui, Secretary-General of CBTA, says that the Cross-border Barter Trade Platform will tackle the ingrained problems of mismatched information, inadequate laws and regulations, and unregulated evaluation of goods and services and further grow barter trade among its current 92 member enterprises from 11 countries and regions including China, Pakistan, Germany, India and Nigeria.\n“The platform will provide a full range of services including information sharing, business matching, legal consultation, quality control management, goods and service evaluation, supply chain services,” said Wang, adding that “this platform will be a global cross-border barter ecosystem, integrating the trade chain, the value chain and the supply chain.”\nThe platform is also set to explore and promote new patterns of barter trade with new technologies. Mr Wang Duo, President of CBTA, noted that digital technology will facilitate barter trade among enterprises in countries along the Belt and Road Initiative (BRI).\n“We have set up a business group for about 200 enterprises on WeChat. They are interested in bartering trade with Pakistan and possible cooperation plans will be made after the pandemic,” Ms Shao added.",
  "retrievedAt": "2025-08-11T21:19:41.313Z"
}
