{
  "title": "Nawaz, Ghani flee away with bags of dollars: Fawad",
  "link": "https://www.app.com.pk/national/nawaz-ghani-flee-away-with-bags-of-dollars-fawad/",
  "date_published": "2021-09-25T15:35:00.000Z",
  "source": "APP",
  "content": "JHELUM, Sep 25 (APP): Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain on Saturday said Nawaz Sharif and Ashraf Ghani were living the life of absconders, one in Dubai and the other in London.\nTalking to the journalists here, the minister said all those political leaders who were not connected to their people and soil, destined to live such a life.\n“Both Nawaz Sharif and Ashraf Ghani have fled abroad with bags of US dollars”, Chaudhry Fawad said.\nHe said that Prime Minister Imran Khan always represented the sentiments of the people of Pakistan on issues such as Afghanistan and Kashmir, the transfer of wealth looted from poor countries to rich countries and the environment. Imran Khan, he said, has representedthe sentiments of every individual of Pakistan at every level.\nHe said, while addressing the United Nations General Assembly, Prime Minister Imran Khan challenged Narendra Modi on the issue of Kashmir before the UN, which has never happened before in Pakistan.\nHe recalled that when Mumbai incidents took place in 2008, the Indian alleged that a Pakistani took part in the Mumbai attacks.\nThat person had no connection with any security agency or Pakistan army but a global propaganda campaign was launched against Pakistan.\nHe said when Kalbhushan Yadav, a serving Indian military officer, was arrested in Balochistan, Nawaz Sharif refused to comment on it. Fawad said that Nawaz Sharif never did any constructive work except looting national wealth and inviting Indian Prime Minister Narendra Modi toweddings.\nPTI was the only political party representing the federation across the country and Imran Khan’s vote bank found everywhere, he said.\nHe remarked that it was good fortune of the nation that it had a leader of Imran’s stature to unite the federation.\nThe minister stated that the PTI would form a government with two-thirds majority in next elections as PML-N and PPP were divided and no one was interested to get the PML-N and PPP ticket in the next general elections.\nBilawal Bhutto, he said, during his recent visit to South Punjab offered Rs 50 million to the people to contest elections on the PPP ticket.\nHe said that PML-N has Shahbaz Sharif and Maryam Nawaz who have a toss every week to decide who will be its leader this week and who will lead the PML-N during next week.\nThe minister predicted that the next election will be the last election of PPP and PML-N, after this they will not be in a position to contest elections.\nHe said global leadership was looking towards Imran Khan and Pakistan for regional affairs, which was a matter of pride for the nation.\nThose who are jealous that all the institutions and government of Pakistan were united, will face frustration for the next five years in the same manner.\nTo a question, he said issues with the Election Commission were on the path of resolution.\nHe said that PTI had no personal problem with the Chief Election Commissioner or its members.\nHe ruled out any consultation with Leader of the Opposition Shahbaz Sharif on the issue of appointment of Chairman National Accountability Bureau as he was an accused of NAB.\nFawad said consultation with Shahbaz Sharif regarding the appointment of NAB chairman would be tantamount to asking a thief who should be his interrogator.\nHe said it was decided that the government will not consult Shahbaz Sharif for the appointment of new chairman NAB.\nHe said in the past, the governments formed their relations only with leaders, whereas Imran Khan speaks to the people at the international level.\n“When we brought out the facts regarding the cancellation of New Zealand’s tour of Pakistan, the English cricket team and the English Cricket Board came under pressure.”\nHe said that the ECB, England players started giving clarifications and the women’s team was criticizing the cancellation of the Pakistan tour.\nThe Prime Minister of the United Kingdom has also expressed his displeasure at the cancelation of the tour which was a success of Pakistan’s public diplomacy.” We have put everything in front of the people,” Chaudhry Fawad said.\nHe said that ground breaking of the Kharian- Rawalpindi Motorway section would likely be done in November. He said that this Motorway would reduce travel time between Rawalpindi and Lahore by one hour.\nHe said that millions of people living in Sohawa, Chakwal, Dina, Jhelum, Gujar Khan, Lala Musa, Wazirabad and adjacent areas would be its beneficiary.",
  "retrievedAt": "2025-08-11T21:19:38.585Z"
}
