{
  "title": "PM seeks youth’s support to steer Pakistan out of crisis, put it on road to success",
  "link": "https://www.app.com.pk/national/pm-seeks-youths-support-to-steer-pakistan-out-of-crisis-put-it-on-road-to-success/",
  "date_published": "2020-01-20T06:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):Prime Minister Imran Khan on Monday urged the youth to support the government in its struggle for steering Pakistan out of the present crisis, and putting it on the road to success and prosperity.\n“The present time is a big test for you but don’t afraid of it; ups and down in life is a fact, I am fighting a war for your future and assure you that the strategic location of the country will beat all the competitors in the region,” he said while interacting with young people belonging to the digital media.\nThe prime minister said under a planning, a huge amount was being spent on the media to propagate against the government on daily basis. The corrupt politicians, who had purchased properties worth billions of rupees abroad by looting the national wealth were now carrying out baseless propaganda that the country was going to be destroyed.\nHe said the present government was countering with an entrenched mafia and the success of young digital experts would be its death. They should counter the fake news and propaganda against the government and increase their feed in that regard. They should support him in his fight against corruption and collectively defeat the mafia involved in looting the national exchequer, he added.\nHe said had the Pakistan Tehreek-e-Insaaf been dependent on traditional media it would have never succeeded. It was due to the social media, the party had succeeded in its struggle.\nTo a question, the prime minister urged the young bloggers to prepare themselves for countering the influx of indecent projection on the social media as it had a direct impact on the family system. The government was taking steps to clamp down on the cyber crime and pornography.\nHe said the Federal Government had curtailed its expenditures by Rs 40 billion, and if any of its ministers was found involved in corruption, he or she would face the music.\n“Our opponents are the most corrupt people and if we succeed against them it is the success of Pakistan and if we lose then these thieves will come back again,” he added.\nImran Khan said the PTI government at its inception faced a difficult economic situation in shape of three times trade deficit, currency devaluation and high import bill of petroleum, gas and edible oil. However, today the country had gained economic stability with the rupee getting stronger, 75 percent decrease in the current account deficit, and exports, investments and remittances increasing.\n2020 would be a year of job opportunities for Pakistanis, he told the young tubers and digital bloggers.\nHe said Pakistan was blessed with fertile land, and gold and copper reserves; however, that potential could not be exploited due to apathy of the past rulers.\nThe present government, he said, was fully focusing on industrialization, construction of five million houses, and promotion of tourism and information technology to create job opportunities and wealth creation.\nHe said the government was also focusing on skill education and had earmarked Rs 50 billion for scholarships for deserving students. Besides under the Ehsaas programme, 60 to 70 shelter houses had been constructed while health cards had been provided to six million families, he added.\nThe prime minister while dilating upon the external challenges the country was facing, said had the US-Iran tension been further escalated it would have far-reaching effects not only for the region but also for Pakistan.\nPakistan, he said, was making all-out efforts for achieving a sustainable peace in Afghanistan, which was vital to advancing his government’s vision for a peaceful neighbourhood, and for economic development and regional stability.\nThe prime minister said the real issue being faced by Pakistan was the extremist ideology being pursued by India where the RSS (Rashtriya Swayamsevak Sangh) fanatics had created hatred against the Muslims and other minorities.\nHe said the Indian leadership would in all probability attempt a false flag operation like Pulwama to divert the world’s attention from its massive human rights violations and unleashing of a reign of terror in the IOJK [Indian Occupied Jammu & Kashmir].\n“The threat of Indian Army chief to attack Pakistan is a genuine threat for us and we are fully prepared for it,” he added.",
  "retrievedAt": "2025-08-11T18:39:18.284Z"
}
