{
  "title": "PEMRA asked to devise mechanism to stop telecast of fake news on electronic media",
  "link": "https://www.app.com.pk/national/pemra-asked-to-devise-mechanism-to-stop-telecast-of-fake-news-on-electronic-media/",
  "date_published": "2020-01-19T22:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):The National Assembly Standing on Information and Broadcasting on Monday asked Pakistan Electronic Media Regulatory Authority (PEMRA) to devise a mechanism to ensure that no defamatory and fake news were telecast on electronic media against any respectable member of the society including legislators for the sake of rating.\nThe committee meeting chaired by Javed Latif, MNA observed that certain news channels daily telecast fake news to get better rating but no action was taken against them.\nThe committee also expressed its displeasure over PEMRA’s notification of imposing ban on ARY News programme “Off the Record” without hearing the host or its management.\nMoreover, the decision was again reverted and ban removed which also gave a bad reflection on PEMRA working.\nThe committee directed PEMRA chairman to attend the meeting of the committee and explain its position on this issue.\nAftab Jehangir, MNA also raised the issue of a feature film “Zindgi Tamasha” and said the committee should discuss the matter.\nSecretary Information Akbar Hussain Durrani informed the committee that Censor Board had approved the film for release twice, but now a third party had filed an application.\nThe chairman of the committee said the Censor Board had twice approved the film for release.\nOn the request of MNA from NA-52 Islamabad, Raja Khurram Shahzad Nawaz, the committee directed the management of Pakistan Broadcasting Corporation (PBC) to settle the issue and road for local population near its land at Alipur.\nThe committee chairman Javed Latif said the public representatives job was to facilitate the people and the management of PBC should get the issue approved form its board of directors within 15 days.\nThe meeting was attended by MNAs,Syed Aminul Haq,Usman Tarakai, Maiza Hameed, Aftab Jehangir, Naz Baloch, Tahir Iqbal and Saima Nadeem.\nBesides information secretary, senior officers from the ministry and attached departments were also present in the meeting.",
  "retrievedAt": "2025-08-11T18:39:31.933Z"
}
