{
  "title": "CM directs for early finalization of uplift projects under KDDP",
  "link": "https://www.app.com.pk/national/cm-directs-for-early-finalization-of-uplift-projects-under-kddp/",
  "date_published": "2020-01-19T23:00:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 20 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan Monday directed for immediate finalization of development schemes, to be undertaken under the Kohat Division Development Project (KDDP), in consultation with public representatives.\nHe was chairing a meeting regarding the Kohat Division Development Project (KDDP) here. A comprehensive detail of priority schemes should be chalked out by February 10 of the ongoing year for final approval.\nThe project is expected to be launched by Mid February this year for which the Chief Minister directed to undertake a comprehensive study of the Annual Development Programme and other developmental projects in pipeline for avoiding duplication of schemes.\nThe project will be funded from the royalty funds of the oil and gas producing districts of Khyber Pakhtunkhwa in Kohat Division. The provincial government will also contribute 20% fund from the Annual Development Programme to ensure equal development of non oil producing Tehsils in the division.\nThe Chief Minister was informed that 147,000 households were expected to directly benefit from the development initiatives aimed to increase the income, employment and livelihood opportunities in the project areas on sustainable basis.\nThe project area covers District Kohat, Hangu and Karak having a total of 673 villages where an estimated amount of Rs15 billion will be spent including Rs 9.7 billion for infrastructure development, Rs 4 billion for poverty reduction and Rs 0.9 billion for development of Agriculture, Livestock and forestry.\nSome of the initiatives to be undertaken include construction of 7 small dams in District Karak, one small dam in District Hangu, rehabilitation of 8 existing irrigation schemes, operationalization of 39 non functional water supply schemes, rehabilitation of 100 Kms rural roads, provision of infrastructure facilities for 135 girls primary schools and 65 BHUs and rehabilitation of 100 tube wells in which the lifespan of installed equipments have expired.\nRegarding the portfolio of Kohat Division, the Chief Minister was informed that 87% cultivated area was rain-fed with less than 50% of the population having access to clean drinking water. With poverty ratio higher than 50%, Kohat division is urgently in need of government attention.\nThe Chief Minister stated that uplift and development of backward areas of the province was the topmost priority of the provincial government for which the government was taking pragmatic measures and the KDDP, a major step towards achieving uniform development in the province.\nThe meeting was also attended by MNA Shahid Khattaq, Advisor to CM on Energy and Power Hamyatullah Khan, Advisor to CM on Merged Districts Ajmal Wazir, Principal Secretary to Chief Minister Shahab Ali Shah, Secretary Energy and Power and others.\nAs part of the development initiative, the Chief Minister was also scheduled to inaugurate the water conservation scheme for rain-fed areas of Khyber Pakhtunkhwa starting from District Karak on January 21 which will bring vast areas of cultivable waste lands under cultivation thereby increasing the agricultural productivity of the province and also providing tremendous livelihood opportunities.",
  "retrievedAt": "2025-08-11T18:39:29.444Z"
}
