{
  "title": "Musadik says ‘Dust to Development’ conference to boost Pakistan’s mining sector",
  "link": "https://www.app.com.pk/national/musadik-says-dust-to-development-conference-to-boost-pakistans-mining-sector/",
  "date_published": "2023-07-31T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP): Minister of State for Petroleum, Musadik Malik, on Monday, termed the forthcoming mineral conference titled “Dust to Development” as a journey of prosperity that eventually extricate Pakistan from the quagmire of economic challenges.\nThe financial value of Pakistan’s minerals amounted to 6.1 trillion dollars, surpassing the total net worth of corporate giants such as Apple, Amazon and Google, the minister said while addressing a press conference here.\nHe said that ‘Dust to Development’ was the commencement of a new era of mining in Pakistan as its scope was not limited to mining, but smelting and export as well.\n“We will extract minerals like copper, lithium and iron and export the by-products of these minerals from its raw soil,” the minister added.\nUnveiling the mining vision of the government, he said that smart industrial clusters would be built in Baluchistan where the raw minerals from the soil would be extracted and converted into export items.\nThe minister emphasized that the export items generated through the utilization of these mineral resources would bring significant benefits to the country, multiplying the advantages manifold.\nThe mining sector had great potential for job creation, the minister said and added that thousands of people would get jobs through the new mining vision of the government.\nUnderlining the mining rules complexities in Pakistan, he said that tangible actions would be taken in order to facilitate foreign direct investment.\nIn this regard, the government had churned out a ‘One Window Operation’ which was being chaired by the prime minister, he added.\nFurthermore, he said that the mining rules and regulations would be harmonized into one general rule in order to make foreign investment smooth and easier.\n“We are replacing the culture of red tape with red carpet, which will be set for the foreign investors,” he added.\nThe government would welcome every foreign investment in the mining sector with a red carpet, Musadik said\nand announced the tax incentives for the investors as well.",
  "retrievedAt": "2025-08-11T09:02:17.592Z"
}
