{
  "title": "Pakistan, China agree on CPEC’s centrality for socioeconomic uplift; resolve to realise shared objectives",
  "link": "https://www.app.com.pk/national/pakistan-china-agree-on-cpecs-centrality-for-socioeconomic-uplift-resolve-to-realise-shared-objectives/",
  "date_published": "2023-07-31T10:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 31 (APP): Pakistan and China on Monday, expressing satisfaction at the steady development of CPEC projects in Pakistan, agreed on its centrality for Pakistan’s socio-economic development.\nThe bilateral ties including the CPEC were discussed in a meeting between Prime Minister Shehbaz Sharif and He Lifeng, Vice Premier of China and Member of the Politburo of the Central Committee of the Communist Party of China.\nAt the invitation of the Government of Pakistan, the Special Envoy of President Xi Jinping He Lifeng is visiting here to attend the 10th-anniversary celebrations of China Pakistan Economic Corridor (CPEC).\nBoth sides expressed their firm commitment to continue working together for realizing the shared objectives of the CPEC.\nIt was also agreed that 10th anniversary of CPEC celebrations constituted a fresh starting point to further expand CPEC as envisaged by the leadership of the two countries.\nThe conversation was marked by traditional warmth and cordiality that has been the hallmark of Pakistan-China All-Weather Strategic Cooperative Partnership.\nDuring the meeting, the two sides exchanged views on several aspects of bilateral relationship including CPEC and bilateral economic and financial cooperation.\nWelcoming Vice-Premier He Lifeng to Pakistan, the prime minister congratulated him on being promoted as the Vice-Premier of China in March this year.\nAppreciating China’s support for Pakistan’s economic development, the prime minister observed that as strategic partners and trusted friends, the two countries have always stood by each other in difficult times, as evidenced by Chinese support to Pakistan in the aftermath of COVID-19 pandemic and devastating floods in Pakistan.\nNoting the unanimity of views between the two countries on regional issues, both leaders reiterated their resolve to support each other on all issues of their core interests.\nIn his remarks, Vice Premier He conveyed President Xi Jinping’s message of China’s firm support to Pakistan’s prosperity and development.\nVice Premier He Lifeng underlined that Pakistan-China friendship was unique and had withstood the vicissitude of time due to deep fraternal ties between the peoples of two nations.\nHe reiterated that as an iron-brother and strategic partner, China would continue its existing economic and financial support to Pakistan.\nWelcoming the prime minister’s vision for deepening trade and investment ties with Pakistan, the Chinese vice premier conveyed China’s willingness to enhance Pakistan’s agro and food exports to China.\nThe Chinese delegation included Guo Wei, Deputy Secretary General of the State Council of China, Sun Weidong, Vice Minister of Foreign Ministry, Cong Liang, Vice Chairman National Development & Reform Commission, Xuan Changneng, Deputy Governor of the People’s Bank of China, Wang Kebing, Deputy Governor of the People’s Bank of China, Wang Liping, Director General of the Department of Asian Affairs of the Ministry of Commerce, Pang Chunxue, Charge d’Affaires, Chinese Embassy Islamabad and other senior Chinese officials.\nThe Pakistan side included Bilawal Bhutto Zardari, Minister for Foreign Affairs, Syed Naveed Qamar, Minister for Commerce, Muhammad Ishaq Dar, Minister for Finance, Rana Sanaullah Khan, Minister for Interior, Marriyum Aurangzeb, Minister for Information, Ahsan Iqbal, Minister for Planning, Khawaja Saad Rafique, Minister for Railways, Hina Rabbani Khar, MOS for Foreign Affairs, Syed Tariq Fatemi, SAPM and senior officials from relevant ministries.\nAfter the meeting, Prime Minister Shehbaz Sharif and Vice Premier He oversaw the ceremony for signing of agreements, MoUs and other documents covering areas including agriculture; industrial cooperation; transport connectivity, etc.\nLater, the prime minister hosted a luncheon in honour of He Lifeng and the accompanying delegation.",
  "retrievedAt": "2025-08-11T09:02:23.378Z"
}
