{
  "title": "Parliamentarians call for uncovering elements behind terrorist attack",
  "link": "https://www.app.com.pk/national/parliamentarians-call-for-uncovering-elements-behind-terrorist-attack/",
  "date_published": "2023-07-31T17:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 31 (APP): The members of the National Assembly on Monday strongly denounced the attack on the Jamiat Ulema-i-Islam Fazl (JUI-F) gathering in Bajaur and emphasized the urgent need to identify and expose the elements responsible for terrorist incidents across the country.\nDuring a point of order, Sheikh Rohsail Asghar, a member of Pakistan Muslim League (PML-N), condemned the attackand requested the suspension of the question hour to discuss this grave and tragic incident. He highlighted that a similar incident occurred on May 9, intended to weaken the institutions responsible for protecting the country.\nMaulana Abdul Akbar Chitrali, while addressing the House, regarded the attack as an assault on Pakistan, all political parties, the Constitution, and democracy itself. He pointed out that such incidents of terrorism had already resulted in the martyrdom of numerous law enforcement personnel, police officers, and civilians. He emphasized the urgency of revealing the hidden hands behind these brutal acts.\nMinister for Communication, Maulana Asad Mehmood, expressed his condolences for the loss of JUI-F workers andstood in solidarity with the bereaved families. He stressed that the attack wasn’t merely targeting a specific party butwas an attack on the entire nation, its economy, democracy, and innocent citizens. He lamented that political workerswho stood firmly for the constitution and democracy were continuously becoming targets of violence.\nMaulana Asad highlighted the alarming number of JUI-F leaders who had lost their lives in the past two years due to similar incidents in various regions, including Khyber Agency, Tarah Valley, Tribal areas, and Balochistan. He strongly stated that they would not compromise on Pakistan, Islam, and democracy, striving to make the country economically and politically robust.\nRana Tanveer Hussain, a senior leader of PML-N and federal minister, expressed sympathies for the tragic incident and the bereaved families. He reminded the House of the sacrifices made during the war against terrorism, which had cost the lives of over 80,000 individuals, including law enforcement personnel. He mentioned attempts to sabotage Pakistan’s development during the Chinese President’s visit in 2014 and was of the view that the recent terrorist incidents were aimed at hindering the country’s progress, particularly during the visit of the Chinese Deputy Premier.\nRana Tanveer Hussain stressed the necessity of unity and the formulation of a concrete strategy to tackle such situations effectively.\nMinister for Water Resources, Syed Khursheed Shah, also strongly condemned the incident, pointing out that his party’s leadership had been a major victim of terrorism. He attributed the root cause of such incidents to a non-democratic mentality.\nPTI lawmaker Sardar Riaz Mehmood Khan Mazari also condemned the tragic incident in Bajaur and criticized the policies of previous governments during the Afghan war, which he believed resulted in chaos and unrest in the country. He called for accountability of those who received dollars during the war, stating that Islam is a religion of peace that promotes brotherhood and discourages violence against others. He expressed solidarity with the families of the victims and the JUI-F leadership.",
  "retrievedAt": "2025-08-11T09:02:06.820Z"
}
