{
  "title": "Rain-wind/thunderstorm likely at isolated places in GB, upper KP, Kashmir: PMD",
  "link": "https://www.app.com.pk/national/rain-wind-thunderstorm-likely-at-isolated-places-in-gb-upper-kp-kashmir-pmd/",
  "date_published": "2024-02-16T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP):Partly cloudy/cloudy weather with rain-wind/thunderstorm/snowfall is likely at isolated places in Gilgit-Baltistan, upper Khyber-Pakhtunkhwa, Kashmir and adjoining hilly areas, as per Pakistan Meteorological Department (PMD) forecast.\nMainly cold and dry weather is expected in most parts of the country.\nIn Islamabad, partly cloudy weather with light rain-wind/thunderstorm is expected in Islamabad and surroundings during\nIn Khyber-Pakhtunkhwa, mainly cold and partly cloudy weather is expected in most districts of the province while cloudy in upper districts with rain-wind/thunderstorm/snowfall is likely at isolated places in Chitral, Dir, Swat, Shangla, Kohistan, Buner, Manshera, Abbottabad, Malakand, Peshawar, Kurrum, Bajaur and Waziristan during evening/night.\nIn Punjab, mainly dry weather is expected in most districts of the province. Cloudy weather with light rain/light snowfall is likely in Murree, Galliyat and surrounding during evening/night. While gusty winds are also likely in the southern districts of the province.\nIn Balochistan, dry weather is expected in most districts of the province, while cold and partly cloudy in northern districts. Gusty winds are likely in coastal areas of the province.\nIn Sindh, dry weather is expected in most districts of the province.\nIn Kashmir/Gilgit-Baltistan, cloudy weather with rain-wind/thunderstorm/snowfall is likely at isolated places in Kashmir and Gilgit-Baltistan.\nDuring the last 24 hours, cold and dry weather prevailed over most parts of the country, while very cold in northern parts.\nThe lowest minimum temperatures recorded were Leh -09C, Skardu -06, Kalam, Astore -05, Gupis -04, Kalat, Bagrote, Gilgit -03, Srinagar and Hunza -02C.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:44:42.570Z"
}
