{
  "title": "State-of-art motorbike ambulance services’ rolling out in Sindh remote areas: Minister",
  "link": "https://www.app.com.pk/national/state-of-art-motorbike-ambulance-services-rolling-out-in-sindh-remote-areas-minister/",
  "date_published": "2024-02-16T07:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP): Caretaker Health Minister Dr Saad Khalid Niaz Friday said that first-ever state of art ‘motorbike ambulance services’ equipped with a first-aid box rolling out in narrow streets of Sindh province to provide immediate medical care before patients can be transported to hospitals.\nThe 1122′ emergency motorbike service equipped with portable oxygen cylinders and various kinds of medicines is emerging as a new hope for emergency healthcare department, he said while talking to a Private news channel.\nThe motorcycle ambulances are equipped with state-of-the-art tools and equipment, adhering to international standards, he mentioned.\nThe bike ambulances were introduced to provide easy availability of health care services to people living in the inaccessible areas of the province, he added.\nHe explained that these ambulance motorbikes could easily pass through small rivers-drains and bumpy roads.\nThe WHO had handed over 25 ambulance motorbikes to 1122 departments to enhance the effectiveness of already existing facilities, he added.\n“Bike ambulances were being deployed in areas that have large populations living in narrow streets”, he mentioned.\nReplying a question, he said that the provincial government was striving hard to provide better healthcare facilities to people at their doors.\nThere is a successful pilot project running in the districts of Thatta and Sujawal with 25 life-saving ambulances, he added.\nTo another question, he said that we will further expand of this service shortly, underscoring Rescue 1122’s commitment to delivering prompt, immediate, and internationally standardized emergency facilities to the residents.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:43:12.220Z"
}
