{
  "title": "HEC, NCHR sign MoU to work on various academic, research activities on human rights",
  "link": "https://www.app.com.pk/national/hec-nchr-sign-mou-to-work-on-various-academic-research-activities-on-human-rights/",
  "date_published": "2024-02-16T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP):The Higher Education Commission (HEC), signed on Friday a Memorandum of Understanding (MoU) with the National Commission for Human Rights (NCHR) to jointly work under a collaborative arrangement on various academic and research activities in the Human Rights area in the country.\nUnder the MoU, HEC and NCHR aim to equip academia, researchers, and students with knowledge of human rights laws and instruments, promote literacy through various media channels, introduce courses focusing on marginalized groups, and establish human rights study centers. Additionally, the partnership seeks to conduct academic research contributing to a culture that values human rights and create and distribute digital content for widespread awareness.\nThe MoU was signed by the Executive Director HEC, Dr. Zia Ul-Qayyum and Secretary NCHR, Malik Kamran Azam Khan Rajar. The ceremony was attended by Dr. Bushra Mirza, (Member-Research and Innovation) HEC, Ms. Noor Amna Malik (Managing Director-NAHE), Engr. Muhammad Raza Chohan (Adviser-Academics), and other officials from HEC and NCHR.\nSpeaking at the occasion, Dr. Zia Ul-Qayyum emphasized HEC’s commitment towards fostering awareness and research at higher education institutions, highlighting the importance of investing in teachers to enhance their capacities in igniting social responsibility among the students.\nRecognizing the crucial role of youth in advocating for human rights, Dr. Zia Ul-Qayyum stressed the need to sensitize the nation to the compliance of human rights policies. He said that HEC has already implemented numerous programmes engaging the youth to address prevailing challenges within the country.\nHe also emphasized the creation of courses focusing on marginalized groups and awareness programmes through youth clubs at HEIs. He affirmed HEC’s commitment to facilitating communication through established synchronous and asynchronous modes, emphasizing the urgency of nurturing a generation well-versed in human rights principles.\nMalik Kamran Azam underscored that it is imperative to elevate the implementation of human rights laws and standards in Pakistan. He said that the collaboration will serve as a vital bridge and will help in developing accelerated modules and methodologies for implementation of the policies. “It will establish a benchmark of engagement programmes, fostering focused discussions and reinforcing statutory institutions’ roles in addressing human rights issues.”\nHe stressed that enhanced audit procedures and cohesive dialogues between government institutions are pivotal and emphasized that the development of a youth-focused group to shape effective human rights content delivery and academic enhancement in Pakistan is need of the time.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:44:00.531Z"
}
