{
  "title": "AJK PM reaffirms resolve to turn Azad Kashmir into welfare state in true sense",
  "link": "https://www.app.com.pk/national/ajk-pm-reaffirms-resolve-to-turn-azad-kashmir-into-welfare-state-in-true-sense/",
  "date_published": "2023-07-03T17:40:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jul 03 (APP) ::Azad Jammu and Kashmir Prime Minister Chaudhry Anwar ul Haq has reiterated his government’s firm resolve to turn the AJK into a welfare state in true sense.\nTalking to different public delegations that called on him at his Bhimber residence to share Eid greetings, Anwaar said serving the people of the state without any discrimination was his ultimate objective.\nThe PM claimed that the budget presented by his government would go down as the best ever budget in the history of Azad Kashmir.\nTo ensure across the board accountability and eliminate corruption from the society, Anwaar said the Anti-Corruption Act would be implemented soon to root out the menace.\nHe said revolutionary measures were taken to bring further improvement in the health and education sectors.\n“A new university is being established soon in Bhimber”, the PM said, adding that the government was keen to make Azad Jammu Kashmir a welfare state where people would have equal opportunities to prosper and flourish.\nHe said in a short span of time, his government had taken such measures which previous governments could not take during a period of 75 years. He said that good governance and transparency in institutions was now visible.\nHe said that all those found guilty of looting and plundering of the state resources or misusing authority would be held accountable.\nFor the welfare of the journalist community, the PM said the government would provide funds to the press foundation.He said that the discretionary powers of the Prime Minister had been abolished.\n“The poor and the oppressed will get justice at their doorstep, the state will provide support for widows, disabled children, divorcees and homeless people in Azad Kashmir”, he said.\nHe said that the departments of cigarettes, forest and food were being closely watched.He said that accountability and transparency in these departments would help save billions of rupees.",
  "retrievedAt": "2025-08-11T08:50:15.035Z"
}
