{
  "title": "Journalism in Pakistan enjoying complete freedom now: Marriyum",
  "link": "https://www.app.com.pk/national/journalism-in-pakistan-enjoying-complete-freedom-now-marriyum/",
  "date_published": "2023-05-03T07:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Wednesday that the present coalition government under the leadership of Prime Minister Shehbaz Sharif fully believed in the freedom of the media and it would continue to take practical measures to protect journalists.\nIn a statement on the occasion of Press Freedom Day being observed today (Wednesday) all over the world including Pakistan, she said now journalism in Pakistan was enjoying complete freedom.\n“The Constitution of Pakistan guarantees freedom of the press and citizens’ right to access accurate information,”  the minister said.\nPaying tribute to those journalists who lost their lives in search of truth, she said that journalism in Pakistan went through a difficult period from 2018 to 2022.\nThe minister said that in four years of PTI rule, there was a “mysterious censorship” in the country that scared journalists.\nIn 2017, Pakistan was ranked 139th in the World Press Freedom Index, due to PTI’s anti-media policies, Pakistan’s ranking decreased by 12 points.\nThe person sitting in the chair of the Prime Minister was given the shameful title of “Press Freedom Predator”, she remarked.\nShe said that Imran Khan not only silenced journalists but got them kidnapped and they were fired at to pressurise them.\nShe said that the PTI’s four-year tenure was a dangerous period for journalists as Imran Khan had imposed restrictions on journalism.\nShe said by imposing such restrictions, one can mislead the people but ultimately the truth has to prevail.\nThe previous government increased the pressure from the state to muzzle the voice of journalists.\nInstead of rectifying his mistakes, Imran vented out the anger of his failures on journalists and media institutions.“Journalists make society strong, it is said that information is power and a journalist gives you that power,” she maintained.",
  "retrievedAt": "2025-08-11T08:25:49.434Z"
}
