{
  "title": "Kuwait, NDMA Pakistan to collaborate for disaster mitigation",
  "link": "https://www.app.com.pk/national/kuwait-ndma-pakistan-to-collaborate-for-disaster-mitigation/",
  "date_published": "2023-05-03T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP):Ambassador of Kuwait to Pakistan Nassar Abdulrahman Al-Mutairi called on Chairman National Disaster Management Authority (NDMA), Lt General Inam Haider Malik and agreed to formulate strategies for participative investment in pre-disaster planning and management, to reduce loss of human lives and infrastructure.\nThe Chairman NDMA expressed his gratitude to the Government of Kuwait and diplomatic team in Pakistan, for generous support during floods 2022, a news release said.\nHe shared the significance of the enhanced utility of modern technology in creating networked, satellite intelligence on climate-based interface and proactive national readiness being developed by Pak NDMA for possible greater usage in the region.\nHe also put light on Pakistan’s capability to project future disasters and accordingly plan mitigation models based on scientific solutions.\n“NEOC will prove to be a model disaster mitigation and management hub for the region, and NDMA will replicate the same on provincial levels at a later stage,” highlighted the Chairman.\nThe Ambassador appreciated the envisioned NEOC of Pakistan NDMA and agreed to formulate strategies for participative investment in pre-disaster planning and management, to reduce loss of human lives and infrastructure.\nThey discussed the necessity of continued support in the fields of disaster mitigation specifically sharing of satellite feeds and software for pre-disaster predictions, and the exchange of academic experts through the platform of the National Institute of Disaster Mitigation (NIDM) of NDMA for developing shared intellectual repository.\n“Kuwait and Pakistan enjoy a long history of friendship and brotherhood, the ties between the two countries are rock solid and unbreakable, “Our people are deeply indebted for the support by Pakistan especially when medical professionals were sent to help combat Covid 19”, the Ambassador endorsed while ensuring possible cooperation.",
  "retrievedAt": "2025-08-11T08:25:43.325Z"
}
