{
  "title": "Razak reiterates for trade, investment relations between Pak-Uzbekistan",
  "link": "https://www.app.com.pk/national/razak-reiterates-for-trade-investment-relations-between-pak-uzbekistan/",
  "date_published": "2020-08-19T04:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Advisor to Prime Minister on Commerce and Investment, Abdul Razak Dawood Wednesday reiterated that the trade and investment relations between Pakistan and Uzbekistan will be strengthened through institutional mechanisms and private sector joint ventures.\nThe Advisor emphasized the importance of developing connectivity for harnessing and deepening the bilateral relationship.\nThe Advisor to the Prime Minister on Commerce and Investment, Abdul Razak Dawood said this in called on the meeting to Charge’ D’affaires of Uzbekistan in Pakistan Sadullah Tashmatov at Ministry of Commerce, said a press release issued by Ministry of commerce here.\nHe added that Pakistan is keen to develop backward and forward linkages in textile, leather, pharmaceutical and agriculture sector with Uzbekistan.\nThe purpose of the meeting was to discuss the upcoming visit of Deputy Prime Minister of Uzbekistan, Sardor Umurzakov, to Pakistan.\nEarlier in May 2020, Razak Dawood invited the Deputy Prime Minister to visit Pakistan along with a delegation to discuss bilateral economic relations.\nDuring the visit both sides will sign Memorandum of Understanding for establishment of ‘Pakistan-Uzbekistan Joint Working Group on Trade and Investment’.\nThe inaugural session of Joint Working Group is also likely to be held during the visit. Both sides agreed to work together for improving connectivity, establishing banking channels and enhancing bilateral trade.\nIn the meeting with the Deputy Prime Minister in May, discussions were held on business to business cooperation as well as utilization of Gwadar and Karachi ports for trade.\nAll these suggestions will also be taken up in the upcoming visit next month. In addition, the Uzbek envoy discussed development of connectivity through road, rail and air linkages between both countries.\nThe envoy also expressed interest in the use of Sialkot International Airport for trade. Both sides agreed to explore opportunities for cooperation and were hopeful that the upcoming visit will help in advancing the bilateral trade and economic ties.",
  "retrievedAt": "2025-08-11T19:41:22.019Z"
}
