{
  "title": "Pakistan urges ending year-long IIOJK siege as world marks Humanitarian Day today",
  "link": "https://www.app.com.pk/national/pakistan-hr-iiojk/",
  "date_published": "2020-08-19T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): As world marked Humanitarian Day on Wednesday, Pakistan stressed steps to ameliorate the worsening humanitarian situation in Indian Illegally Occupied Jammu & Kashmir (IIOJ&K) including lifting of year-long draconian military siege.\nThe Foreign Office in a statement called upon the global humanitarian fraternity to ensure provision of unfettered access and assistance to Kashmiri people in dire need of healthcare.\n“We reiterate the need for evolving a strategic approach to address humanitarian emergencies, guided by the imperative of upholding international humanitarian law, preventing conflicts from eruption, and peacefully resolving long-standing disputes and conflicts,” the statement said.\nThe Foreign Office said Pakistan paid tribute to the sacrifices rendered by humanitarian workers in saving lives and providing support and protection to people affected by conflict, disasters and emergencies.\n“We commend the United Nations, its Office for Coordination of Humanitarian Affairs (OCHA) and other humanitarian organizations for their leadership in mobilizing and delivering assistance to civilians in need, despite challenges of access and restrictions,” it said.\n“We value the active role of and substantial contribution by the humanitarian community, in particular, the United Nations in responding to the unprecedented health and socio-economic impact of COVID-19,” it added.\nThe Foreign Office said, “We encourage the global community to uphold the principles of burden- and responsibility-sharing to support sustainable humanitarian responses in large refugee hosting countries. The protracted refugee situations continue to impact millions of lives and should be supported by the international community in every aspect.”\nIt mentioned that Pakistan and its people had shown exemplary generosity, compassion and hospitality in hosting more than three million Afghans for over four decades.\n“We are thankful to our partners, especially the United Nations High Commissioner for Refugees (UNHCR), for helping us in taking care of Afghan Refugees,” it said.",
  "retrievedAt": "2025-08-11T19:41:18.666Z"
}
