{
  "title": "China to provide $6.8 b for ML-1 project under CPEC: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/china-to-provide-6-8-b-for-ml-1-project-under-cpec-sheikh-rashid/",
  "date_published": "2020-08-19T05:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Minister for Railways Sheikh Rashid Ahmed has said that China will provide 90 percent financing for a $6.8 billion initiative to upgrade the 1,872 kilometers Mainline-1 (ML-1) railway project, the country’s costliest project to date as part of the multi-billion-dollar China-Pakistan Economic Corridor (CPEC) agreement.\n“About 90 percent of financing for the project will be provided by the Chinese government while the remaining amount will be shared by us,” the railways minister said in an interview with Arab News.\n“The process of tendering will start in the first week of September and take about two months to complete. We will most probably start implementing the project by the end of the year,” he said, adding that the project was scheduled to be completed in five years.\nUnder the project, Pakistan’s existing 2,655km railway tracks would be upgraded to allow trains to move up to 165km per hour – twice as fast as they currently do — while the line capacity would increase from 34 to over 150 trains each way per day.\n“When the ML-1 Project is completed, the speed of trains will more than double the current 65-110 kilometers per hour to 165 kilometers per hour,” Sheikh Rashid said. “Our cargo trains will also operate at a speed of 120 kilometers per hour.”\n“We will also eliminate all crossings,” he added. “The new fully automatic [computer-based signaling and control] system will be installed, and underpasses and overhead bridges will be constructed.”\nThe minister said the project would provide job opportunities to more than 150,000 people, of whom 90 percent would be Pakistanis and 10 percent would be Chinese nationals.\n“After the successful completion of ML-1, we will also focus on ML-2 and ML-3,” he said.\nThe ML-1 Project would be executed in three phases to avoid commitment charges, the minister said. The loan amount for each package would also be separately contracted to double the tracks from Karachi to Peshawar via Hyderabad, Nawabshah, Rohri, Rahimyar Khan, Bahawalpur, Khanewal, Sahiwal, Lahore, Gujrawala and Rawalpindi.",
  "retrievedAt": "2025-08-11T19:41:21.868Z"
}
