{
  "title": "170 candidates in run for Senate elections",
  "link": "https://www.app.com.pk/national/170-candidates-filed-senate-election-nomination-papers-ecp/",
  "date_published": "2021-02-15T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): As many as 170 independent and political parties backed candidates are in run from federal capital and four provinces on Senate vacant seats’ election to be held on March 3.\nAccording to an official of Election Commission of Pakistan (ECP), 29 candidates have submitted their nomination papers with Returning Officer (RO) from Punjab, 39 from Sindh, 51 from Khyber Pakhtunkhwa, 41 from Balochistan and 10 from federal capital.\nHe said that 40 nomination papers have been submitted for Women seats while 10 for Non-Muslim and 33 nomination papers have been submitted for Technocrats and Ulema seats besides 87 for General seats.\nAs per details of ECP, six persons have filed their nomination papers with the Returning Officer (RO) from the federal capital included Syed Yousaf Raza Gillani (PPPP), Abdul Hafeez Sheikh (PTI) and Tariq Fazal Chaudhry (PML-N), Muhammad Yousaf (PML-N), Syed Muhammad Ali Bukhari (PTI) and Fareed Rehman (PTI) for one General seat while four candidates filed their nomination papers for one Women seats included Fawzia Arshad (PTI), Farzana (PML-N), Farah Naz Akbar (PML-N) and Muneera Javed Mirza (PTI).\nAs Many as 21 persons who filed their nomination papers with the RO from Punjab province on seven General seats included Kamil Ali Agha (PML-Q), Jamshed Iqbal Cheema (PTI), Muhammad Khan Madni (PTI), Mushahid Ullah Khan (PML-N), Pervaiz Rasheed (PML-N), Muhammad Azeem-ul-Haq Minhas, (PPPP), Malik Saif-ul-Malook Khokhar (PML-N), Saifullah Sarwar Khan Nyazee (PTI), Afnan Ullah Khan (PML-N), Saud Majeed (PML-N), Robina Akhtar (PTI), Malik Zaheer Abbas Khokhar (PTI), Aon Abbas (PTI), Omar Sarfraz Cheema (PTI), Ejaz Hussain Minhas (PTI), Zahid Hamid (PML-N), Ejaz Ahmad Chaudhry (PTI), Sajid Mir (PML-N), Muhammad Baligh-ur-Rehman (PML-N), Irfan-ul-Haq Siddiqui (PML-N) and Ms Neelam Irshad Sheikh (PTI).\nSimilarly, for two Women seats five candidates have submitted their nomination papers from Punjab included Ms. Zarqa Suharwardy (PTI), Ms Saadia Abbasi (PML-N), Ms Saira Tarar (PML-N), Ms Farhat Shahazadi (PTI) and Ms Neelum Irshad Sheikh (PTI). Three candidates have also filed their nomination papers on Technocrats including Ulema included Azam Nazeer Tarar (PML-N), Syed Ali Zafar (PTI) and Atta Ullah Khan (PTI).\nFrom Sindh as many as 19 candidates have filed their nomination papers for seven General seats included Sadiq Ali Memon (PPPP), Saleem Mandviwalla (PPPP), Shaherbano Sherry Rehman (PPPP), Dost Ali Jeesar (PPPP), Jam Mahtab Hussain Dahar (PPPP), Taj Haider (PPPP), Shahadat Awan (PPPP), Zafar Ahmed Khan Kamali (MQM-P), Sohail Mansoor Khawaja (MQM-P), Syed Faisal Ali Sabzwari (MQM-P), Abdul Kadir Khanzada (MQM-P), Muhammad Faisal Vewda (PTI), Pir Sadaruddin Shah (GDA), Mahmood Baqi Moulvi (PTI), Abdul Rahim (GDA), Umaid Ali Junejo (PTI), Muhammad Amir Khan (MQM-P), Mohammad Ashraf Jabber (PTI) and Zenera Malik (PTI).\nNine candidates have their nomination papers for two Women seats in Sindh included Palwasha Mohammad Zai Khan (PPPP), Rukhsana Parveen (PPPP), Khairunisa (PPPP), Khalida Ateeq (MQM-P), Sabheen Ghoury (MQM-P) Serina Adnan (PTI), Fizza Zishan (PTI), Erum Wahab Butt (PTI) and Farzana Hanif (PPPP).\nFor two seats for Technocrats in Sindh including Ulema 11 candidates have filed their nomination papers included Farooq Hamid Naek (PPPP), Shahadat Awan (PPPP), Dr Karim Ahmed Khawaja (PPPP), Muhammad Abdul Rauf Siddiqui (MQM-P), Syed Khizer Askar Zaidi (MQM-P), Dr Shahab Imam (MQM-P), Saifullah Abro (PTI), Hunaid Hassan Lakhani (PTI), Mohammad Hassain Bakshi (PTI), Samar Ali Khan (PTI) and Yasha Ullah Khan Afghan (TLP)\nIn Khyber Pakhtunkhwa, 22 candidates have filed their nomination papers for seven General seats included Malak Najib Gul Khalil (Independent), Nasrullah Khan Wazir (Independent), Farhatullah Babar (PPPP), Hidayatullah Khan (ANP), Atta-ur-Rehman (JUI), Muhammad Tariq Khattak (JUI), Syed Shibli Faraz (PTI), Faisal Saleem Rehman (PTI), Mohsin Aziz (PTI), Aurangzeb Khan (PTI), Abbas Afridi (PML-N), Zeeshan Khanzada (PTI), Dost Muhammad Khan (PTI), Najiullah Khattak (PTI), Muhammad Rizwan Khan (PTI), Hamid-ul-Haq (PTI), Atta-ur-Rehman (JI), Taj Muhammad Afridi (Independent), Shakeel Afridi (Independent), Meena Khan (PTI), Sajjad Hssain (Independent) and Liaqat Khan Tarakai (PTI).\nSimilarly, 13 candidates have filed their nomination papers for two Women seats in KP included Naeema Kishwar Khan (JUI), Sania Nishter (PTI), Tasleem Begum (ANP), Farah Khan (PML-N), Farzana Javed, Shahzia Tehmas Khan (PPPP), Falak Naz (PTI), Zareen Riaz (PTI), Inayat Begum (JUI), Musarat Jabeen (Independent), Saima Khalid (PTI), Hamida Shahid (PTI) and Amat Ara Kaka Khel (PTI).\n11 candidates also submitted their nomination papers for two seats of Technocrats including Ulema included Hamidul Haq (PTI), Nasrullah Khan Wazir (Independent), Farhatullah Babar (PPPP), Zubair Ali (JUI), Rehan Alam Khan (PML-N), Dost Muhammad Khan (PTI), Muhammad Hamayun Mohmand (PTI, Muhammad Iqbal Khalil (JUI), Shaukat Jamal Amirzadah (Independent), Dilroze Khan (PTI) and Muhammad Ali Khan Saif (Independent).\nFive candidates also filed their nomination papers in KP for one Non-Muslim seat included Ranjeet Singh (JUI), Gurdeep Singh (PTI), Araish Kumar (PTI), Asif Bhatti (ANP) and Javed Gill (JUI).\nIn Balochistan, 19 candidates have submitted their nomination papers for seven General seats included Sarfraz Ahmed Bugti (BAP, Sitara Ayaz (BAP), Muhammad Abdul Qadir (PTI), Molana Abdul Ghafoor Haideri (JUIP), Khalil Ahmed Buledi (JUIP), Muhammad Qasim (BNP), Umer Farooq (ANP), Abdul Khaliq Khaq (BAP), Mir Israrullah Khan Zehri (BNP-Awami), Muhammad Sajid Tareen (BNP-Mengal), Manzoor Ahmed (PTI), Auranzeb (BAP), Mir Sardar Khan Rind (Independent), Syed Zahoor Ahmed (PTI), Muhammad Abdul Qadir (Independent), Prince Ahmed Umer Ahmedzai (BAP), Muhammad Jawad (JWP), Usman Khan Kakar (PKMAP) and Hussain Baloch (BNP).\nNine candidates have also filed their nomination papers from Balochistan for two Women seats included Bineesh Sikandar Masih (ANP), Atifa (HDP), Naseema Ehsan (PNP), Samina Mumtaz (BAP), Kashfi Gichki (BAP), Shania Khan (BAP), Shumaila Afsheen (BNP-Mengal), Asia Nasir (JUIP) and Tahira R.K. Jattak (BNP-Mengal).\nSimilarly, eight candidates have filed their papers for two seats for Technocrats including Ulema included Kamran Murtaza (JUIP), Naveed Jan Baloch (BAP), Muhammad Sajid Tareen (BNP-Mengal), Saeed Ahmed Hashmi (BAP), Muhammad Nawaz Nasar (BAP), Muhammad Asif (PNP-Awami), Muhammad Ahmed (BAP) and Muhammad Ibrahim (JWP).\nAs many as five candidates have submitted their papers in Balochistan for one Non-Muslim seat included Heman Dass (JUIP), Danesh Kumar (BAP), Bineesh Sikandar Masih (ANP), Sunil Kumar (BNP) and Khalil (BAP).",
  "retrievedAt": "2025-08-11T20:21:40.493Z"
}
