{
  "title": "Over a thousand Digital Franchise Post Offices established: Murad Saeed",
  "link": "https://www.app.com.pk/national/over-a-thousand-digital-franchise-post-offices-established-murad-saeed/",
  "date_published": "2021-02-15T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): Federal Minister for Communications and Postal Services Murad Saeed on Monday said that Pakistan Post has established over a thousand Digital Franchise Post Offices (DFPOs) spread in more than 130 cities and towns of the country.\nAddressing a ceremony held here at Postal Staff College, he said that DFPOs have been equipped with state of the art technology infrastructure and feature a comprehensive digital platform to streamline book, near real-time tracking and delivery of the articles”, he said.\nHe said that 10,000 more applications have been received for the acquisition of digital franchises.\nThe minister said that this programme would open new opportunities and a much wider access for small scale business, cottage industry and artisans of Pakistan through a massive outreach, maximizing their market potential.\nHe said that under the initiative 3 lac new jobs opportunities would be created for the youth. He further said that Pakistan Post will soon lead in the logistic sector. “We are striving hard to implement all the FATF’s terms and conditions” he added.\nThe minister said that domestic and foreign remittances are on the rise in the country.\nHe said that as PTI came into power, Pakistan Post was facing losses of Rs. 60 billion in previous eras. “But now the revenue of Pakistan Post had significantly increased under the present government” he added.\nHe said that all the state own institutions should stand on their feet and government working to make them profitable through reforms.\nMurad Saeed said that PTI government has taken various measures to overcome losses and first of all emphasized on the austerity measures as par the vision of Prime Minister Imran Khan.\nHe said that under the new initiative Pakistan Post has also introduced a Track and Trace system and mobile application to facilitate its customers.\nThe minister said that Urgent Mail Service was highly praised by the users and now EMS Plus was started aiming to promote e-commerce and online business in line with modern techniques for courier and parcel delivery services.\nHe said that Pakistan Post revenue was on the rise but at same times our expenses also going up, adding that new initiative would overcome the expenses and will Pakistan Post profitable department.\n“The distribution of Sehat Insaf Cards to the 100 percent population of Khyber Pakhunkhwa has been completed while it is under progress in Punjab, Azad Jammu Kashmir and Gilgit-Balistan”, he said.\nHe said that Prime Minister Imran Khan also directed Balochistan government to start the cards distribution process.\nThe minister said that employees of Pakistan Post would be provided free health facility , adding that performance based promotions would be made in Pakistan Post. He said that reforms would be brought in all the institutions.\nMurad Saeed praised the services of Postmen, adding that they are working hard in far flung areas. He said that each official should work hard like postmen.",
  "retrievedAt": "2025-08-11T20:21:44.594Z"
}
