{
  "title": "India’s guided tour of diplomats to IIOJK a ‘smokescreen’ to conceal HR crisis: FO Spox",
  "link": "https://www.app.com.pk/national/indias-guided-tour-of-diplomats-to-iiojk-a-smokescreen-to-conceal-hr-crisis-fo-spox/",
  "date_published": "2021-02-15T18:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): The Foreign Office Spokesperson on Monday said India’s plan to arrange a visit of New Delhi-based diplomats was an attempt to mislead the world and give a false impression of normalcy.\n“Such guided tours are a smokescreen, aimed at diverting international attention from India’s egregious human rights violations in IIOJK, and creating a false impression of ‘normalcy’,” the Spokesperson said in response to media queries.\nThe Spokesperson said the visit would mean nothing if there was no access to all the areas and possibility to freely interact with Kashmiri people and the civil society in an atmosphere free of intimidation.\n“Equally, meeting the senior Hurriyat leadership including those incarcerated on trumped-up charges alone would enable an objective assessment of the ground realities,” he said.\nThe FO Spokesperson said the Indian notion of so-called normalcy in IIOJK had no feet to stand on.\n“The world can clearly see that the illegal and inhuman military siege continues for over 18 months now”, he said and mentioned the extra-judicial killings of Kashmiris in fake ‘encounters’ and staged ‘cordon-and-search’ operations had become rampant.\nThe FO Spokesperson said arbitrary detentions, enforced disappearances and custodial torture have increased; Kashmiri leadership remain incarcerated; journalists, human rights activists and international human rights organizations are being harassed; and the Kashmiris’ fundamental rights, including the right to express themselves continue to be denied.\n“India must also allow the Office of the High Commissioner for Human Rights (OHCHR), the United Nations Observers; the OIC Independent Permanent Human Rights Commission (IPHRC), international human rights and civil society organizations and international media to visit IIOJK and assess the situation on ground,” he said.\nThe FO Spokesperson said the international community including the world leaders, parliamentarian, international human rights organizations as well as the media, who have been unanimous in their condemnation of the ongoing atrocities in IIOJK, must urge India to take genuine steps to resolve the Jammu and Kashmir dispute in a peaceful manner in accordance with the relevant UN Security Council resolutions and the wishes of the Kashmiri people.",
  "retrievedAt": "2025-08-11T20:21:38.473Z"
}
