{
  "title": "Tribunal adjourns petition regarding NA-48 election results",
  "link": "https://www.app.com.pk/national/tribunal-adjourns-petition-regarding-na-48-election-results/",
  "date_published": "2024-07-09T18:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 09 (APP):The Election Tribunal of Islamabad on Tuesday adjourned hearing till July 15, on a petition against the election results in NA-48 Islamabad.\nJustice Tariq Mehmood Jahagiri, hearing the case, remarked that anyone could file application to the registrar office to get a certified copy of the record.\nHe remarked even a common citizen and journalist could file the application if they wanted to see the record.\nThe election tribunal said that it was compulsory for the presiding officer to provide form-45 to the polling agent if he didn’t do it then he has to write reason for it.\nThe tribunal said that it would summon the presiding officer and would inquire if he had accomplished the legal procedure. It, however, said there are a total of 261 presiding officers and they all couldn’t be made respondents.\nThe court ordered member national assembly Raja Khuram Nawaz and returning officer to submit form-45, 46 and 47 to the registrar office.\nJustice Jahangiri questioned the official of Election Commission of Pakistan regarding the EMS system and asked whether the presiding officers sent forms or not. The ECP’s lawyer said that he would inform the court after taking instructions from the commission.\nThe court remarked that if the presiding officer wouldn’t provide forms to polling agents then action would be taken under Election Act. The PO is supposed to make ten packets and took receiving from agents, he said.\nPetitioner Ali Bokhari adopted the stance that no signatures were taken from him or his polling agents. Even he was not allowed to enter, he said.\nECP’s lawyer objected on the stance and said that this matter is not raised in the petition. The election tribunal said that it was not a civil suit instead it is a tribunal, we have to go to the depth of the matter.\nJustice Jahangiri said that who was responsible if anyone has done illegal act. The further hearing of the case was then adjourned.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:48:01.637Z"
}
