{
  "title": "ICT admin launches city-wide dengue surveillance, crackdowns",
  "link": "https://www.app.com.pk/national/ict-admin-launches-city-wide-dengue-surveillance-crackdowns/",
  "date_published": "2024-07-09T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 09 (APP):On the directions of Deputy Commissioner (DC) Islamabad, a city-wide dengue surveillance and control operations were underway to tackle the rising threat of dengue fever.\nThe Assistant Commissioner (AC) Shalimar led an intensive dengue surveillance effort, which resulted in the lodging of FIRs and the arrest of several commercial property owners where positive dengue larvae were discovered. This action targets those failing to comply with health regulations, holding them accountable for endangering public health.\nMeanwhile, AC Saddar took charge of dengue surveillance activities in the G-12 and D-12 sectors, thoroughly inspecting these areas for mosquito breeding sites and ensuring preventive measures are in place.\nSimilarly, ADC (East) Islamabad visited PIMS Hospital to review the facilities and preparedness for handling dengue patients. This visit was aimed at ensuring that the hospital is fully equipped to manage any surge in dengue cases, providing necessary care and treatment to those affected.\nFurthermore, ADC (East) supervised dengue surveillance operations in the G-8 sector and oversaw prevention and control activities in Alipur.\nFollowing the Deputy Commissioner’s directives, Assistant Commissioners have been deployed to various areas of the city to conduct thorough dengue surveillance activities. These measures are crucial in identifying and eliminating potential mosquito breeding sites, thus reducing the risk of dengue transmission.\nThe Islamabad administration’s proactive approach underscores its commitment to safeguarding public health through rigorous monitoring, enforcement, and community engagement.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:48:26.883Z"
}
