{
  "title": "NA committee stresses transparency in PSDP for equitable development",
  "link": "https://www.app.com.pk/national/na-committee-stresses-transparency-in-psdp-for-equitable-development/",
  "date_published": "2024-07-09T15:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 9 (APP):In a bid to enhance equitable national development, National Assembly Standing Committee on Planning, Development and Special Initiatives on Tuesday emphasized the need for transparency in Public Sector Development Projects (PSDP).\nThe committee met under the chairmanship of Member National Assembly (MNA) Syed Abdul Qadir Gillani.\nThe chairman directed that the committee be kept informed of any changes in PSDP and highlighted the importance of transparent provincial distribution of development projects for equitable resource allocation, said a news release.\nHe also reiterated the Committee’s commitment to effectively oversee the Ministry for the public’s benefit.\nMinister for Planning and Development Ahsan Iqbal emphasized the importance of peace, political stability, and policy continuity for Pakistan’s prosperity.\nHe introduced the “5 E” framework as crucial for future growth of the country, focusing on Exports-led growth, E-Pakistan, Environment and Climate Change, Energy, and Equity, Ethics, and Empowerment.\nThe Secretary of the Ministry of Planning and Development provided a comprehensive overview of the Ministry’s functions and its attached departments.\nHe elucidated that while the Ministry was responsible for planning and coordination, project implementation fell under the purview of other ministries. However, the ministry was responsible for monitoring and evaluation of these projects, he added.\nThe committee raised concerns over Karachi’s industrial sector decline due to the energy crisis and identified corruption as a major cause of public sector project delays.\nIt was recommended that priority be given to completing ongoing projects rather than reallocating funds to new projects, to avoid cost escalations and ensure timely completion. Regional disparities in South Punjab’s development were also discussed.\nThe committee was briefed on the status of the Pakistan Public Works Department (PWD), currently undergoing dissolution. It was decided that PWD representatives would be called to provide updates on their existing projects, it added.\nThe meeting was attended by MNAs Ms. Naz Baloch, Maj. (R) Tahir Iqbal, Muhammad Ameer Sultan, Ali Asghar Khan, Yousaf Khan, Dawar Khan Kundi, Ch. Muhammad Shahbaz Babar, and Muhammad Moazzam Ali Khan along with senior officials from the Ministry.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:48:25.599Z"
}
