{
  "title": "AJK, Pakistan’s CII chairmen for enhancing institutional collaboration",
  "link": "https://www.app.com.pk/national/ajk-pakistans-cii-chairmen-for-enhancing-institutional-collaboration/",
  "date_published": "2024-07-09T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 09 (APP):Azad Jammu and Kashmir (AJK)’s Supreme Court Chief Justice and Council of Islamic Ideology (CII) Chairman, Raja Saeed Akram Khan on Tuesday met with Pakistan’s CII Chairman, Dr Muhammad Raghib Hussain Naeemi and discussed matters of mutual interest in the federal capital.\nAccompanying Justice Raja Saeed were AJK’s members of CII, including Mufti Syed Kifayat Hussain Naqvi, Maulana Saeed Yousaf Khan, Secretary Hafiz Rahmatullah Tasawar, and other senior officials.\nDr Naeemi warmly welcomed the delegation. During the meeting, he emphasized the importance of this visit, noting that it would enhance the working relationship and foster research collaboration between the two institutions.\nHe highlighted that cooperation in research would resolve numerous issues and that the council’s role involves responding to questions from Parliament, provincial assemblies, Senate, president, prime minister, chief ministers, governors, and Senate chairman. He said the council provides recommendations to align the Constitution and laws with the Quran and Sunnah.\nDr Naeemi outlined the dual role of the council, acting as a mufti for the state and undertaking ijtihad (independent reasoning). Additionally, he said the council works to improve society, operating under the chairman with a twenty-member team, where a quorum of eight members is required for decisions.\nThe meeting also included the CII secretary, director general of research, and senior officials.\nJustice Raja Saeed expressed that the Quran is a complete code of life and the life of Prophet Muhammad (Peace Be Upon Him) is a guiding light. He stressed the importance of returning to religious principles for survival. He called upon Pakistan’s CII to provide guidance on matters concerning Gaza and occupied Kashmir and urged religious scholars to emphasize unity and harmony in their Friday and Eid sermons.\nJustice Raja Saeed acknowledged the beginning of Muharram-ul-Haram, paying tribute to the sacrifices of the Prophet’s grandson and his family. He explained the structure and function of the AJK’s CII, which formulates recommendations to align laws with the Quran and Sunnah.\nHe expressed gratitude for the warm reception by Dr Naeemi and anticipated that the relationship between the two institutions would be further strengthened in the coming days.\nBoth chairmen exchanged souvenirs and gifts as a token of mutual respect and collaboration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:48:26.766Z"
}
