{
  "title": "Resilience must be redefined across the board: Sherry",
  "link": "https://www.app.com.pk/national/resilience-must-be-redefined-across-the-board-sherry/",
  "date_published": "2024-07-09T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 09 (APP): Chairperson Senate Standing Committee on Climate Change, Senator Sherry Rehman on Tuesday while chairing the committee meeting emphasised the importance of a resilient approach to counter the adverse impacts of climate change in Pakistan.\nSenator Rehman stated, “NDMA and the Pakistan Meteorological Department have predicted above-normal rainfall. The committee was keen to understand the measures for risk reduction and predictability of the monsoon across the country. From the available reports it appears that the eye of the storm will likely be Punjab. Apart from rains, we are facing other environmental crises. Pakistan’s climate challenges are multifaceted, and all relevant environmental institutions must not work in silos. There should be a coordinated and shared strategy to tackle these challenges.”\nDiscussing resilience, Senator Rehman noted, “Pakistan’s exposure to climate stress is so high that resilience must be redefined across the board. It can’t just be about infrastructure; it has to be local and people-centric.”\nShe further highlighted the lack of updated equipment in disaster management departments due to insufficient funding. “Heavy funds were required to update the environmental department’s equipment during my tenure. After the 2022 floods, all funds were re-allocated to flood-affected areas because of the shortage. The capacity of PDMA and other regional institutions must be increased to prevent disasters,” she said.\nThe committee was informed that the Sindh and eastern parts of Balochistan are set to receive a fresh spell of monsoon rain on July 8-9, while upper and central parts of the country, including Rawalpindi and Islamabad, from July 10 to 15. Chairman the National Disaster Management Authority (NDMA) stated that heavy, moderate, and scattered rainfall is expected in various cities of Punjab, Sindh, Balochistan, Khyber Pakhtunkhwa (KP), Azad Jammu and Kashmir (AJK), and Gilgit-Baltistan (GB) between July and August. This rainfall may cause urban flooding, flash flooding, and river tributary overflow. Under the influence of this system, rainfall may also trigger landslides and mudslides in upper Khyber Pakhtunkhwa, Gilgit-Baltistan, Galiyat, Murree, and Azad Jammu and Kashmir.\nThe Chairman NDMA provided comprehensive details on the preparations and risk reduction strategies for the upcoming monsoon season. He informed the committee about the areas that will be more vulnerable this season and emphasized a proactive approach to mitigate any disasters. The monsoon system is expected to enter Pakistan from India. By the end of July and in August, Khyber Pakhtunkhwa and Punjab will likely be more affected by heavy rainfall, with Punjab being the focal point.\nThe Chairman of the Capital Development Authority (CDA) reported on the recent fire incidents at Margalla Hills, noting that 22 fires occurred from May 2 to June 13, 2024. Extinguishing these fires took between 5 to 10 hours. Eleven FIRs were lodged against the culprits, and three individuals have been apprehended. The total area damaged by the forest fires is 250 acres.\nSenator Sherry Rehman remarked, “The incidents of fire in the Margalla forests in Islamabad are alarming. CDA and Islamabad Wildlife Management Board should take joint measures to prevent fire incidents.”\nThe committee members also recommended a proper ecological plan for tree plantation. It was informed that a committee for the ecological plan has already been formulated and that all recommendations from the Senate Standing Committee meeting will be considered.\nThe meeting was attended by Senator Dr. Zarqa Suharwardhy Taimur, Senator Syed Shibli Faraz (Leader of the Opposition), Senator Bushra Anjum Butt, Senator Naseema Ehsan, Senator Manzoor Ahmad Kakar, Senator Palwasha Mohammed Zai Khan, Senator Qurat-ul-Ain Marri, Prime Minister’s Coordinator on Climate Change Romina Khurshid Alam, Secretary of the Ministry of Climate Change and Environmental Coordination, Chairman of the National Disaster Management Authority, Chairman of the Capital Development Authority, Chairman of the Federal Flood Commission, Director General of the Pakistan Meteorological Department, and senior officials from the Ministry of Climate Change and Environmental Coordination.",
  "retrievedAt": "2025-08-11T03:48:28.968Z"
}
