{
  "title": "Govt prepares for massive energy reforms: Ali Pervaiz",
  "link": "https://www.app.com.pk/national/govt-prepares-for-massive-energy-reforms-ali-pervaiz/",
  "date_published": "2024-07-09T12:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 9 (APP): Minister of State for Finance, Revenue and Power Ali Pervaiz Malik on Tuesday said that a massive package of energy sector reforms was imminent to ensure a sustainable and efficient energy sector for the future.\nIn an exclusive interview with a Pakistan Television News, he detailed the multi-faceted approach the government is adopting to overhaul the energy sector.\nHe said that managing capacity charges and decreasing the off-grade utilization was needed to reduce per unit capacity costs. He stressed the importance of shifting towards local fuel sources to decrease dependence on imported fuels, highlighting ongoing efforts in local exploration. A significant portion of the reform strategy involves the privatization of distribution companies (DISCOs) and generation companies (GENCOs).\nAli Pervaiz said that inefficient and obsolete furnace oil plants currently incurring costs despite being non-operational would be scrapped, auctioned, or liquidated. “Efficient plants will be put on a privatization model,” he added.\nHe said that the government was working on establishing a robust regulatory framework to safeguard consumer interest’s post-privatization. The government is working to enhance corporate governance and auditing practices in the DISCOs to prepared these companies for privatization, he added.\nMinister highlighted the government efforts to engage the International Monetary Fund (IMF), showcasing Pakistan’s commitment to economic reforms. Securing the IMF deal will improve Pakistan’s standing with global rating agencies and bolster market confidence, he added.\nAnswering a question of electricity over-billing, he said that any discrimination found in billing would be thoroughly investigated and rectified. He further said that the prime minister has issued strict instructions to protect consumers, particularly those consuming up to 200 units, from unfair billing practices.\nOn the issue of power theft, he called for cooperation from provincial departments and law enforcement agencies to support federation in mitigating the electricity theft. He urged political unity and reconciliation to address these critical issues effectively.",
  "retrievedAt": "2025-08-11T03:48:55.718Z"
}
