{
  "title": "Kamal directs to submit Polyclinic upgradation master plan",
  "author": null,
  "content": "ISLAMABAD, Jul 08 (APP): Federal Minister for National Health Services, Regulations and Coordination, Syed Mustafa Kamal has directed to submit a comprehensive feasibility report and master plan for upgradation of old federal government Polyclinic building.\nHe said this during visit to Polyclinic Hospital accompanied by Federal Secretary of Health, Syed Waqar ul Hassan to review healthcare facilities and service delivery at one of the capital’s key public sector hospitals.\nDuring the visit, the Health Minister conducted a thorough inspection of all hospital departments and evaluated the services being provided to patients.\nHe visited the medical wards, Intensive Care Unit (ICU), and dialysis center, where he received briefings on the current infrastructure and operational status.\nThe Executive Director of Polyclinic provided a detailed presentation on the hospital’s facilities and areas requiring immediate improvement.\nWhile acknowledging the efforts of the staff, Mustafa Kamal directed that 20 additional beds be added to the dermatology and psychiatry departments located at G-7/3-4 to cater to the growing patient load.\nHe also ordered the development of a comprehensive feasibility plan for upgrading the old building of Polyclinic Hospital, incorporating a modern HVAC (Heating, Ventilation and Air Conditioning) system.\nThe minister emphasized that this should be aligned with a holistic service delivery improvement plan to ensure better healthcare outcomes for the public.\nIn a decisive move to enhance diagnostic capacity, Kamal instructed the immediate installation of an MRI machine.\nHe reiterated his commitment to ensuring the provision of quality healthcare services to the public at all costs, stating, “Access to timely and quality medical care is a fundamental right of every citizen.”\nLater, the Federal Health Minister visited the under-construction New Emergency Block at Pakistan Institute of Medical Sciences where he assessed the pace of construction work.\nHe was briefed by the Executive Director of PIMS and officials from Infrastructure Development Authority Punjab (IDAP).\nThe briefing highlighted that the new emergency facility would have a capacity of 200 beds.\nMinister Kamal directed the PIMS administration and IDAP to immediately prepare a comprehensive project presentation, including a clear timeline and details of all challenges.\n“I must be briefed on all obstacles faced by the project, along with deadlines for completion,” he said. He assured that any challenges falling under the Ministry’s jurisdiction would be resolved on an urgent basis, and tasks assigned to other stakeholders must be executed on a fast-track basis.\nHe stressed that the new emergency project is directly linked to saving human lives, and that swift completion and operationalization is a national priority.\nHe also directed that the hospital’s sewage treatment system be upgraded to meet quality standards, and emphasized that the provision of clean drinking water remains a top priority of the Ministry.\nMustafa Kamal proceeded to inspect the under-construction Cancer Hospital in Islamabad.\nThe Project Director provided a briefing on the facility, which will be a 200-bed hospital equipped with advanced healthcare technologies.\nIt was further shared that the hospital will also feature a PET Scan facility, a major advancement in cancer diagnostics and treatment.\nThe minister called for a detailed and time-bound presentation on the project and asked to be informed of all existing challenges.\nTo speed up construction, he instructed an increase in the number of laborers and engineers, and directed that work be carried out in double shifts to meet deadlines.\n“These projects are not just infrastructure they are a promise to the people of Pakistan. We are determined to deliver on this promise with urgency, efficiency, and full transparency,” Kamal concluded.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:21:42.329Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kamal-directs-to-submit-polyclinic-upgradation-master-plan/",
  "dateList": "2025-07-08",
  "date_published": "2025-07-08T17:23:00.000Z"
}
