{
  "title": "Govt to come up with solution for inflated electricity bills: PM",
  "link": "https://www.app.com.pk/national/govt-to-come-up-with-solution-for-inflated-electricity-bills-pm/",
  "date_published": "2023-08-31T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): Prime Minister Anwaar-Haq Kakar Thursday said the government minutely looked into the problem of inflated electricity bills and would come up with a solution within next 48 hours.\nTalking to senior journalists and news anchors here on the current challenging economic conditions, he said the government was considering various options to provide relief to the people.\nThe people had protested against increased electricity bills and the government realized their problems, he added.\nTo a question, he clarified that the Pakistan army, navy and air force were not using a single free unit of electricity and their bills were paid from the allocated financial budget.\nWhile employees of WAPDA were using free electricity units and their usage would be rationalized, especially of the higher grade officers some of them were getting huge quantity of free electricity, he added.\nHe said perception should not be that the government would take any strict measures causing difficulties for the people.\nHe pointed out that the power sector had been a very challenging issue since the 1990s and the governments of that time signed agreements with independent power producers to overcome loadshedding which proved costly for consumers.\nOver the years, he said, the generation and transmission system of electricity was flawed and the government had to deal with serious issues of line losses, power theft, high circular debt, use of expensive imported fuel and capacity payments to electricity companies.\n“These issues cannot be ignored by just closing eyes. We need to diagnose treatment for the disease.”\nHe made it clear that the government would fulfill its agreements with the international financial institutions.\nHe lamented that the country was faced with economic stagnation and there was less investment in sectors like manufacturing, real estate and stock exchange, and the trend was to only take up profit from certain businesses.\nHe said the caretaker government was formed for the continuity of constitutional order, and was dealing with economic and security challenges.\nThe prime minister said Pakistan had security concerns on its western borders.\nThe abrupt withdrawal of the United States from Afghanistan was not responsible as it created problems and now the weapons and equipment left behind there were being used by terrorists and non-state actors in Pakistan, he added.\nHe stressed that no terrorist organization had the capacity to overtake any territory in Pakistan but they could sabotage and create terror.\nPakistan was in capable hands and every sacrifice would be rendered to defend every inch of the country’s territory and steps would be taken for elimination of terrorism, he remarked.\nHe said the government was determined to hold transparent, free and fair elections and transfer power to the next elected government. He was of the view that according to current legal status, the Election Commission had to decide about the date of elections.\nHe said recently formed Special Investment Facilitation Council had huge potential to attract investment in sectors of information technology, defence production, mining and agriculture, and Pakistan had a bright future due to such initiatives.",
  "retrievedAt": "2025-08-11T09:23:39.819Z"
}
