{
  "title": "Dr Umar Saif unveils $10bln IT exports plan",
  "link": "https://www.app.com.pk/national/dr-umar-saif-unveils-10bln-it-exports-plan/",
  "date_published": "2023-08-31T16:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): Caretaker Federal Minister for Information Technology and Telecommunication Dr Umar Saif on Thursday unveiled the roadmap to achieve the annual target of $10 billion IT exports through four major dimensions.\nSpeaking as a chief guest at the 23rd ITCN Asia 2023 “Declaring Pakistan The Regional ICT Hub,” he said the annual IT export could be increased to $3.5 billion from the present level of $2.6 billion by providing confidence to the IT companies to retain their exports income in special accounts of local banks.\nSpecial forex accounts and online banking platforms were necessary for the IT companies to invest in the core infrastructure for purchasing essential software services and hardware equipment, he added.\nThe minister said the ministry, through a partnership with the private sector, would train 100,000 software developers to enhance the exports by $2 billion per annum, which would translate the export values to $5.5 billion.\nIn that regard, he said, various training programmes and boot camps would be organized to build the capacity of university graduates in accordance with in-demand skills of the IT industry.\nThe training initiative would even provide jobs to thousands of graduates in the country who would support themselves and their families, he added.\n“Presently, our higher educational institutes produce 35,000 to 40,000 graduates every year in different disciplines, and merely 10 percent are employable.”\nDr Umar Saif further said that Pakistanis were the second largest online workforce community in the world, however, revenues earned by them were reflected in remittances of overseas Pakistanis because of the unavailability of the international payment gateway, Paypal.\nThe facilitation of freelancers through a global payment gateway and easy account facility would also enhance exports by another $2 billion, he added.\nThe freelancers, he said, were being empowered with training in different skills, but an ecosystem and workstations were equally vital for them to enhance their contribution to exports of IT and IT-enabled services.\nHe said the government, in collaboration with the private sector, would create space on 5,000 points in different cities for freelancers.\n“Besides, the tax rate on the income of freelancers is extremely high, which should be equalized to the tax rate of the IT industry at 0.25%. Hence, the rising trend of the Gig economy can also be facilitated in Pakistan.”\nRegarding the telecom sector, the minister vowed the launch of 5G technology which would be made possible through the auction of 300 MHz in consultation with all stakeholders. Also, the capacity of the spectrum would also be increased to double from the present level to meet the demand of the customers, he added.\nDr Umar Saif said a special financing facility should be proposed for mobile phone manufacturers to enhance the production of mobile phone handsets with enhanced qualities.",
  "retrievedAt": "2025-08-11T09:23:38.174Z"
}
