{
  "title": "Ethiopian Envoy receives National Peace Award",
  "link": "https://www.app.com.pk/national/ethiopian-envoy-receives-national-peace-award/",
  "date_published": "2023-08-31T12:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): The National Peace and Justice Council (NPJC) has honoured the Ambassador of the Federal Democratic Republic of Ethiopia to Pakistan, Jemal Beker Abdula, with the National Peace Award for his dedicated efforts in laying the foundation and fostering closer ties between the two brotherly nations.\nThe award ceremony took place during the National Peace Seminar which was held at the Islamabad Club, said a news release on Thursday.\nNPJC Chairman Mian Abdul Waheed presented the award to Ambassador Jemal Beker, lauding his commitment to strengthening the bilateral relations between the Federal Democratic Republic of Ethiopia (FDRE) and Pakistan by bridging the gap between people, institutions, and business communities.\nHe said Ambassador Jemal Beker played a crucial role in advancing fraternity and brotherhood between the two heirs of civilizations.\nAddressing the ceremony, Ambassador Jemal Beker Abdula extended gratitude to the NPJC for acknowledging his endeavours to enhance friendship and partnership between the two countries.\nHe emphasized peace as a shared value between Ethiopia and Pakistan while highlighting their significant role as major contributors to the United Nations Peacekeeping Mission to ensure peace, stability and prosperity across the globe.\nBoth nations, he noted, played pivotal roles in preserving global peace and security, with their people working hand in hand to save lives worldwide.\nThe ambassador also paid tribute to Pakistan’s brave sacrifices in the pursuit of international peace and security, stating that the nation’s unwavering commitment to this cause would forever be remembered.\nHe also noted Ethiopia’s own contributions, with a considerable number of Ethiopian soldiers sacrificing their lives for international peace and security under the blue helmet of UN peacekeeping missions in different countries.\nJemal Beker underlined the historical importance of Ethiopia as a land of justice, referring to the teachings of the Holy Prophet (SAW) in this regard, as well as the refuge provided by King Nejashei to Muslims in the past.\nStressing the significance of peace for human prosperity and development, he emphasized that in the fast-changing global landscape, peace and security were more crucial than ever.\nHe called for sustained efforts toward achieving peace through constructive dialogue, negotiation, and countering the spread of misinformation and disinformation.",
  "retrievedAt": "2025-08-11T09:23:55.608Z"
}
