{
  "title": "Balochistan Govt expresses disappointment over politicization of missing persons’ issue",
  "link": "https://www.app.com.pk/national/balochistan-govt-expresses-disappointment-over-politicization-of-missing-persons-issue/",
  "date_published": "2023-08-31T11:21:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 31 (APP):The Balochistan Government on Thursday expressed deep disappointment over the continued politicization of the issue of missing persons.\n“The government firmly advises against exploiting this sensitive matter for political gains”, a statement issued here said.\nThe government’s statement comes in response to certain political parties who have raised the issue of missing persons in the lead-up to election campaigning, accusing the government of being responsible for these disappearances.\nThe government, in its statement, vehemently denied these allegations, asserting its unwavering commitment to locating and rescuing all missing individuals.\nFurthermore, the government emphasized its zero-tolerance policy towards the politicization of this issue.\nThe government, in the statement, highlighted that the missing persons issue was often exploited as a “vote gainer” by political parties, becoming a contentious topic during election periods.\nHowever, the government clarifies that it has not received any substantial complaints regarding missing persons thus far, it added.\nMoreover, the government exposed the propaganda surrounding the missing persons’ issue, attributing it to India, the human rights industry, left-wing factions, and ethnic nationalists.\nThe government, in its statement, asserted that this propaganda merely aimed to exert pressure on the current caretaker government and law enforcement agencies.\nThe government said that the last report of the Balochistan Missing Persons Commission (BMPC) found that a total of 9,231 complaints of missing persons had been received by the Commission. Of these complaints, 5,574 cases had been solved and 3,743 missing persons had been recovered, it added.\nAccording to the statement, the BMPC also found that 241 bodies of missing persons had been received, while 974 people were in custody and 616 people who had been declared missing, were currently jailed.\nAs of November 30, 2022, there were 2,207 cases of missing persons, pending with the BMPC. These cases included multiple types of cases, including voluntary disappearances, personal enmity, and absconders.\n“By issuing this statement, the Balochistan government seeks to address the politicization of the missing persons’ issue, urging all stakeholders to prioritize the well-being and safety of the affected individuals over political gains,” it added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:24:22.089Z"
}
