{
  "title": "Interior Minister seeks briefing to cope smuggling of goods",
  "link": "https://www.app.com.pk/national/interior-minister-seeks-briefing-to-cope-smuggling-of-goods-2/",
  "date_published": "2023-08-31T17:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):Caretaker Interior Minister Sarfraz Bugti on the directions of Prime Minister Anwar ul Haq Kakar on Thursday sought a briefing from provincial governments on the stoppage of smuggling of goods.\nThe minister was chairing a meeting regarding anti-smuggling measures here. Secretary Interior Abdullah Khan Sumbul, Director General Federal Investigation Agency (FIA) Mohsin Hassan Butt and officials from the Federal Board of Revenue (FBR), ministries and provincial offices participated in the meeting.\nMinister Bugti stressed the need to make a comprehensive plan to curb the smuggling of fertilizers and sugar from the country.\nThe smuggling of necessary items including sugar and fertilizers from the country is burdening the economy, said the minister adding that the price hike due to the smuggling of goods is creating troubles for the common man.\nHe said cross-border smuggling of basic items of necessity will not be tolerated, adding that action may be initiated against those involved in illegal smuggling and their facilitators.\nHe directed for establishment of joint check posts and patrolling systems completely active and vigilant with the collaboration of federal and provincial departments.\nFederal and provincial governments will work together to curb the smuggling of basic goods, said the minister adding that the border control system will have to be made more effective and inter-provincial movements will be strictly monitored.\nA track and trace system will be installed on basic goods of necessity said the minister stressing upon the need to take special measures on the routes of smuggling along with the borders.\nThe minister directed to give priority to the needs of sugar and fertilizers for the KPK and Baluchistan province.\nHe stressed the need to make effective policies to provide ease to the common man and stoppage of smuggling.\nHe also directed the KPK and Baluchistan governments to present weekly reports on the actions against illegal smuggling which subsequently will be presented to the Prime Minster.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:23:55.682Z"
}
