{
  "title": "Non-Aligned Movement optimal role for global peace and security urged",
  "link": "https://www.app.com.pk/national/non-aligned-movement-optimal-role-for-global-peace-and-security-urged/",
  "date_published": "2023-08-31T13:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP): The speakers here at the ongoing international Online Internship Program urged the Non-Aligned Movement (NAM) to play its optimal role in global peace and security.\nThey expressed these views while addressing the participants of the internship programme co-organized by the Indonesian Embassy and the Bahria University, Islamabad said a news release on Thursday.\nExecutive Director of the Institute of Defense and Security Studies Dr. Connie Rahakundini Bakrie highlighted that the NAM has become the largest grouping of states worldwide after the United Nations; however, with hanging global politics, its relevance has been widely debated. The importance of NAM as a political power in the current international scenario is being frequently questioned.\nDr Connie also highlighted the significant transition in global geopolitics following the collapse of communism in the USSR and Eastern Europe, which was supposed to end the Cold War. She emphasized the ongoing Cold War, which is increasingly becoming ultra-cold\nIn the context of the NAM Jakarta conference in 1992, she stressed that despite the end of the Cold War, the NAM struggle must continue.\nDr. Connie said that in the current global scenario, NAM should more proactive role and cited “the NAM ‘RE-NEW’ Declaration that advocates for equality, sovereignty, friendly relations, peaceful resolution of international disputes, opposes force and weapon of mass destruction and aims to protect the entire human race”.\nShe stressed that NAM should oppose military alliances, call for a world power balance, oppose Cold Supra War models and advocate for dispute resolution through negotiation and diplomatic means.\nShe made special reference to Indonesian President Soekarno’s famous 1960 United Nations speech, “To Build the World A New,” that emphasized the importance of a fair World Order Conception.\n“Indonesia’s President Jokowi has proposed building the country as the nexus of international maritime and airspace, as it is at the heart of strategic sea line communication” she explained when sharing Indonesia’s response to the emerging situation.\nThe Asian-African Conference in Bandung in 1955 was the initial process for the birth of the Non-aligned Movement. The Conference was held on 18 – 24 April 1955 and was attended by 29 Heads of State and Heads of Government from the newly independent countries.\nThe NAM, central to Indonesia’s foreign policy, focuses on issues such as disarmament, economic development, poverty alleviation, climate change, and establishing a just world order. Indonesia supports NAM’s role in international peace, security, counter-terrorism, environmental concerns, and achieving Sustainable Development Goals.\nShe concluded that NAM should continue to maintain its influence on world peace campaign for a new international and regional economic order based on political and economic equality and continue to contribute its support in strengthening the UN organization.",
  "retrievedAt": "2025-08-11T09:23:46.145Z"
}
