{
  "title": "Foreign minister stresses safe, secure environment for UN peacekeepers",
  "link": "https://www.app.com.pk/national/foreign-minister-stresses-safe-secure-environment-for-un-peacekeepers/",
  "date_published": "2023-08-31T07:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 31 (APP):Caretaker Foreign Minister Jalil Abbas Jilani on Thursday said ensuring a safe and secure environment for United Nations peacekeepers who tirelessly maintain peace around the globe should be the foremost priority.\nAddressing the 2023 UN Peacekeeping Ministerial Preparatory Meeting on “Safety and Security of Peacekeepers” here, the foreign minister said Pakistan’s participation in UN peacekeeping, spanning over six decades, was a tangible manifestation of its contribution to the maintenance of international peace and security, in line with the UN Charter.\nHe said legal frameworks and adequate accountability mechanisms were paramount for peacekeeper safety. “We must stand firm in holding accountable the perpetrators – individuals and groups that harm or threaten UN peacekeepers.”\n?Medical care for peacekeepers is also essential, he said adding “our peacekeepers deserve the best care including mental health support. Standardized training, first aid provisions, and enhanced medical facilities are crucial for that”.\nThe FM maintained that addressing challenges, including language barriers and administrative obstacles, should also be one of our top priorities.\nHe said the spectre of threat posed by Improvised Explosive Devices (IEDs) to peacekeepers’ security needs a commensurate response. “We must intensify pre-deployment training; equip our peacekeepers with cutting-edge technology; and augment their capabilities for countering the IED threat.”\n?The minister highlighted that leveraging technology was vital to ensure the safety and security of peacekeepers. “The Strategy for the Digital Transformation of UN Peacekeeping underscores the need to enhance situational awareness, counter disinformation, and optimise the use of technology. By doing so, we empower our peacekeepers to make informed decisions and fulfil their mandates more effectively.”\nJalil Abbas Jilani said while Pakistan was proudly contributing over 4,000 troops to various ongoing UN peacekeeping missions, the attention should also be focused on the realm of peacebuilding.\n“?Just as we have established a state-of-the-art facility for the training of peacekeepers – the Centre of International Peace and Stability (CIPS), where we are gathered for this meeting – we also hope to collaborate with the UN Secretariat and our international partners to create an Institute for Peacebuilding,” he remarked.\nHe also urged the finance contributing partners to embrace a more equitable distribution of the burdens associated with peacekeeping missions.\nThe challenges faced by peacekeepers, he said were universal in their impact, and it was imperative that the financial responsibilities reflected this shared endeavour for global peace and security.\n“Open and constructive dialogue between TCCs and FCCs is essential to harmonize our efforts, ensuring that resources are allocated efficiently and fairly. Transparency in financial commitments and decision-making processes is key to building trust and enhancing mission efficacy,” he added.\nEmphasizing the significance of the United Nations Military Observer Group in India and Pakistan (UNMOGIP), a pioneering peacekeeping mission established in 1949, the foreign minister said it held a distinctive place in peacekeeping history as one of the earliest initiatives to monitor and investigate ceasefire violations in the disputed territory of Jammu and Kashmir.\n“UNMOGIP personnel encounter unprecedented adversities due to the non-cooperation of one party. We must proactively address the safety and security gaps, as identified in the recent report on UNMOGIP by the UN’s Office of Internal Oversight Services, he added.\n?He also acknowledged the indispensable and rightful role of women peacekeepers saying Pakistan was constantly endeavouring to further enhance the presence of female peacekeepers in its contingents.\nHe said women bring unique perspectives and skills that were instrumental in fostering trust and building relationships with local communities. Their presence not only promotes gender equality but also strengthens our peacekeeping efforts. “We must create an environment that empowers women peacekeepers and ensures their safety and security.”\nThe minister also eulogized the profound sacrifices by the dedicated peacekeepers in the line of duty. “These brave men and women leave behind the comfort of their homes, risking their lives to bring stability to war-torn regions”, he added.",
  "retrievedAt": "2025-08-11T09:24:07.336Z"
}
