{
  "title": "Religious scholars condemn blasphemous incidents, call for united action",
  "link": "https://www.app.com.pk/national/religious-scholars-condemn-blasphemous-incidents-call-for-united-action/",
  "date_published": "2023-08-31T17:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, August 31 (APP): The religious scholars and leaders, in a unanimous resolution on Thursday, strongly condemned the recent incidents of disrespect towards the Holy Quran.\nThey, in a conference on ‘Honoring the Holy Quran from the Perspective of Religions and Sects’ organized by the Iranian Embassy here at a local hotel, vehemently denounced the recent blasphemous incidents endorsed by the governments of Sweden and Denmark as an attack on global peace and religious freedom.\nThe religious scholars and leaders said the derogatory actions against sacred religious symbols in the name of freedom of expression were deeply regrettable and violate the principles outlined in the United Nations Resolution 2686 concerning peace, tolerance, and security.\nThey urged for urgent and effective measures from the United Nations to address this issue promptly.\nThey also made a formal appeal to the government of Pakistan to convene an emergency session of the Organization of Islamic Cooperation and unite the Muslim ummah (community) to devise a comprehensive action plan on this matter.\n“We believe in a path of knowledge and pride as a means to human excellence, condemning violence and fostering understanding. Hence, all proponents of humanity must play their part in countering this divisive agenda,” they maintained.\nThe religious scholars and leaders pledged to uphold the sanctity and reverence of the Holy Quran, utilizing all available resources to counter the assault on our beliefs.\nThey said the attack on religious freedom shall not succeed, as they were vigilant and steadfast in their efforts, united against such actions at all times.\nIn conclusion, they also condemned the Jaranwala tragedy in its all forms and manifestations and urged the government to bring the culprits to justice without any delay.\nThe conference was attended by a large number of Ulema, Mashaykh of all schools of thought, faith leaders and people of all walks of life and members of diplomatic communities.",
  "retrievedAt": "2025-08-11T09:23:32.988Z"
}
