{
  "title": "Usman Dar asks Sindh govt to stop ‘playing politics over Corona relief Tiger force",
  "link": "https://www.app.com.pk/national/usman-dar-asks-sindh-govt-to-stop-playing-politics-over-corona-relief-tiger-force/",
  "date_published": "2020-05-03T23:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 04 (APP):Special Assistant on Youth Affairs Usman Dar Monday said that corona relief Tiger force was part of Prime Minister Imran Khan’s immediate efforts to create awareness and distribution of ration among the masses but unfortunately, the Sindh government had been busy in playing politics over relief programme.\nTalking to PTV news channel, Usman Dar said that the county was going through a critical phase and the opposition should play a positive and mature role while focusing on national unity.\nHe further regretted that Sindh government has refused to accept the services of the tiger force, adding, these are the youth of Pakistan and those registered in Sindh province will operate in their respective areas.\nGovernment under leadership of prime Minister Imran Khan is confident the Tiger force volunteers would fulfill their designated duties with full vigor and enthusiasm, he mentioned.\nHe said the volunteers will render relief services at the district and tehsil level.\nHe made it clear that the Corona Relief Tiger Force will operate beyond political affiliation in the best national interest.\nReferring to Sialkot, which undertook a pilot phase of the Corona Relief Tiger Force, Dar said deputy commissioners would coordinate with all elected lawmakers, regardless of political affiliation.\nHe said that the Coronavirus Relief Tiger Force was the force of Pakistani youth and not of the PTI so government, opposition and people of Pakistan needs to work collectively to fight against coronavirus battle.\nHe said that the provincial ministers of Sindh were not on the same page about the coronavirus and they must be on the one page.\nHe also said that the main purpose should be the welfare of the people whether it served the provincial government or PTI.\nHe also hoped that Sindh Information Minister Syed Nasir Hussain Shah would talk to his government and they will allow our tiger force to work in Sindh effectively.\nReplying a question, he assured that all necessary SOPs and TROs for different sectors are being prepared to ease the restrictions and in this situation, the role of the volunteer force will gain immense importance as they have to ensure implementation of SOPs in order to avert the spread of the contagion.\nHe said we have to save the people from the pandemic as well as starvation, and the services of tiger force are required to strike a balance in the economic activity and the lockdown.",
  "retrievedAt": "2025-08-11T19:10:48.429Z"
}
