{
  "title": "NA committee on virtual session to meet on Tuesday",
  "link": "https://www.app.com.pk/national/na-committee-on-virtual-session-to-meet-on-tuesday/",
  "date_published": "2020-05-03T23:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 04 (APP):The Committee on Virtual Session of National Assembly during COVID-19 will meet at Parliament House on Tuesday with Syed Fakhar Imam, Minister for National Food Security and Research in the chair.\nBesides members of the committee, all the Parliamentary leaders in the National Assembly or their nominees had been invited to attend the meeting.\nThe committee will work out the modalities for holding physical sessions alongwith duration of each sitting of the National Assembly during COVID-19.\nThe committee will also ponder upon how to take up legislative business, question hour, calling attention notices, adjournment motions, privilege motions, etc during the said sessions.\nThe committee will deliberate upon the modus operandi for ensuring the presence of the members by the respective parliamentary leaders in every sitting in full or limited numbers in accordance with proportionate strength of each parliamentary party; and the question of quorum.\nThe commiittee will also take up the issue of health safety measures / SOPs and special logistic arrangements to enable the members and the National Assembly Staff to attend the sessions.\nThe committee was constituted by the Speaker National Assembly to make recommendations for convening virtual session of the National Assembly during COVID-19, and making amendments in the rules of procedure and conduct of business in the National Assembly.\nThe committee in its first and second meetings resolved to hold physical session instead of virtual session of the National Assembly.\nThe committee will discuss and finalise its recommendations in the instant meeting regarding holding physical session of the assembly and submit them to the Speaker National Assembly for making appropriate directions to the government.",
  "retrievedAt": "2025-08-11T19:10:47.512Z"
}
