{
  "title": "PM calls Ethiopian counterpart, emphasizes closer cooperation, bilateral ties",
  "link": "https://www.app.com.pk/national/pm-calls-ethiopian-counterpart-emphasizes-closer-cooperation-bilateral-ties/",
  "date_published": "2020-05-04T08:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 4 (APP):Prime Minister Imran Khan on Monday telephoned his Ethiopian counterpart Abiy Ahmed Ali and in the context of Pakistan’s “Engage Africa” policy, emphasized the importance of closer bilateral ties with Ethiopia.\nThe prime minister also reiterated his felicitations to Prime Minister Abiy on winning the 2019 Nobel Peace Prize.\nThe prime minister conveyed Pakistan’s solidarity with the Government and people of Ethiopia, and commended their effective measures to control the spread of COVID-19.\nThe discussion focused on debt relief matters, including Prime Minister Imran Khan’s ‘Global Initiative for Debt Relief’ for developing countries in the context of the COVID-19 pandemic. The prime minister underscored that developing countries faced the twin challenge of containing the disease and staving off hunger due to loss of livelihoods.\nHe emphasized that while debt suspension would help free up resources, enhanced measures were needed to reboot the developing economies.\nNoting that a global recession was imminent, the prime minister underlined that developing countries would need a combination of additional measures to meet urgent financial requirements, sustain growth, strengthened fragile health systems as well as to save lives and provide social protection to those below the poverty line.\nThe two leaders agreed on the importance of working together, along with the UN Secretary General and other stakeholders, to evolve a comprehensive plan on debt relief issues.\nBilaterally, Prime Minister Imran Khan stressed upon further deepening of cooperation including enhanced political and diplomatic linkages and increased mutual trade.\nPrime Minister Imran Khan reiterated his invitation to Prime Minister Abiy to visit Pakistan at the earliest convenience.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:10:53.814Z"
}
