{
  "title": "Pakistan stands steadfast in support of Palestinian cause: Qureshi",
  "link": "https://www.app.com.pk/national/pakistan-stands-steadfast-in-support-of-palestinian-cause-qureshi/",
  "date_published": "2021-05-09T09:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 9 (APP): Foreign Minister Shah Mahmood Qureshi Sunday while strongly condemning the Israeli attack on worshippers in Al-Aqsa Mosque, reiterated that Pakistan stood steadfast in support of the Palestinian cause.\n“Condemn in strongest terms attack on innocent worshippers in Al-Aqsa Mosque, first Qibla of Islam, by Israeli Occupation Forces in the holy month of Ramzan,” the foreign minister said on Twitter.\nHe said such brutality was against very spirit of humanity and human rights law.\n“Pakistan stands steadfast in support of Palestinian cause,” the foreign minister remarked and said the country had also strongly condemned the way the Palestinian people were being evicted from their homes.\nCondemn in strongest terms attack on innocent worshippers in Al-Aqsa Mosque, first Qibla of Islam, by Israeli Occupation Forces in the holy month of Ramzan. Such brutality is against very spirit of humanity & human rights law.  stands steadfast in support of Palestinian cause. pic.twitter.com/R727WUKZUp\n— Shah Mahmood Qureshi (@SMQureshiPTI) May 8, 2021\nTalking to different television channels while being in Saudi Arabia accompanying Prime Minister Imran Khan on three-day visit, he said the people of Palestine must be given their right and the Israeli aggression against them must come to an end immediately.\nForeign Minister welcomed the summoning of urgent meeting of Arab League and called it a “timely step.”\nHe said the Arab League, OIC and other countries championing the human rights must take notice of the situation.\n“I am happy that Arab league summoned an urgent meeting. Arab League should unanimously talk on and attract attention of the western states towards this issue,” he said.\nTo a question, the unity of Muslim Ummah was inevitable to attract the attention of the western powers to the issue.\nQureshi said the Muslim states would have to foil the designs of some powers trying to create difference among Ummah. By this way, the Muslim world could raise their unanimous voice through the platforms of OIC and Human Rights Council.",
  "retrievedAt": "2025-08-11T20:43:00.266Z"
}
