{
  "title": "COVID-19 claims 118 lives, infects 3,785 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-118-lives-infects-3785-more-people/",
  "date_published": "2021-05-09T11:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 09 (APP):The national tally on Sunday of total active COVID-19 cases recorded 81,830 with 3,785 more people tested positive for the deadly virus and 4,569 people recovered from the disease during the last 24 hours.\nOne hundred and eighteen corona patients died during past 24 hours, 101 of whom were under treatment in the hospitals and 17 out of the hospitals in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the past 24 hours, most of the deaths occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 118 deaths occurred in the last 24 hours 50 of them had died who were under treatment on ventilators.\nThe maximum ventilators were occupied in four cities including Lahore 67 percent, Multan 67 percent, Gujranwala 79 percent and Peshawar 51 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Gujranwala 48 percent, Swabi 52 percent, Peshawar 54 percent and Multan 63 percent.\nAround 652 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 40,736 tests were conducted across the country on Saturday, including 13,079 in Sindh, 15,148 in Punjab, 6,824 in Khyber Pakhtunkhwa (KP), 3,411 in Islamabad Capital Territory (ICT), 1,147 in Balochistan, 270 in GB, and 857 in AJK.\nAround 757,281 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 858,026 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 17,866, Balochistan 23,324, GB 5,380, ICT 77,974, KP 123,842, Punjab 317,972 and Sindh 291,668.\nAbout 18,915 deaths were recorded in country since the eruption of the contagion. Around 4,726 have perished in Sindh among four of them died in the hospitals on Saturday.\n9,032 patients in Punjab had died with 81 deaths occured in past 24 hours. 65 of them in the hospitals and 16 out of hospitals. 3,588 in KP where 25 of them died in hospitals and one out of hospitals on Saturday, 708 in ICT among two of them died in the hospitals , 247 in Balochistan among one of them died in the hospitals , 107 in GB and 507 in AJK among four of them succumbed to the deadly virus in hospitals.\nA total of 12,190,671 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities. Some 5,416 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:42:57.682Z"
}
