{
  "title": "Attack on Palestinians against all norms of humanity, int’ law: PM",
  "link": "https://www.app.com.pk/national/attack-on-palestinians-against-all-norms-of-humanity-int-law-pm/",
  "date_published": "2021-05-09T11:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 9 (APP): Prime Minister Imran Khan Sunday strongly condemned the Israeli forces’ attack on worshippers in Al-Aqsa Mosque, calling it violation of al norms and international law.\n“(I) strongly condemn Israeli Forces’ attack (especially) during Ramazan on Palestinians in Qibla-e-Awaal, Al-Aqsa Mosque, violating all norms of humanity & int law,” the prime minister said on Twitter.\nStrongly condemn Israeli Forces' attack esp during Ramazan on Palestinians in Qibla-e-Awaal, Al-Aqsa Mosque, violating all norms of humanity & int law. We reiterate support for Palestinian ppl. Int community must take immed action to protect Palestinians & their legitimate rights\n— Imran Khan (@ImranKhanPTI) May 9, 2021\nReiterating Pakistan’s support for Palestinian people, the prime minister, who is currently in Saudi Arabia on three-day visit, said the international community must take immediate action to protect Palestinians and their legitimate rights.\nEarlier, President Dr Arif Alvi also condemned the attack and said it was a shame that the Israeli apartheid continued against the Palestinian people.\nIt is a shame that Israeli apartheid against Palestinians continues. Atrocious attack on peaceful praying Muslims is given the usual media spin of 'clashes'. My brothers don't lose hope. Time is near when International Politics will be based on morality & not on vested interests.\n— Dr. Arif Alvi (@ArifAlvi) May 9, 2021\nOn Twitter, the president said that the atrocious attack on peaceful praying Muslims in Palestine was given the usual media spin of ‘clashes’.\n“My brothers don’t lose hope. Time is near when International Politics will be based on morality & not on vested interests,” the president hoped.",
  "retrievedAt": "2025-08-11T20:42:57.864Z"
}
