{
  "title": "Railways retrieve 383 acres land worth Rs 30 bln in two years",
  "link": "https://www.app.com.pk/national/railways-retrieve-383-acres-land-worth-rs-30-bln-in-two-years-2/",
  "date_published": "2020-09-20T06:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP): Pakistan Railways has retrieved around 383 acres precious land worth more than Rs 30 billion under its anti-encroachment operation across the country during last two years.\n“The encroachment operation has been launched with the assistance of railway police and district administrations,” an official in the Ministry of Railways told APP.\nThe official said Pakistan Railways owns 167,690 acres of land across the country, of which, 90,326-acre is in Punjab, 39,428-acre in Sindh, 28,228-acre in Balochistan and 9,708-acre i n Khyber Pakhtunkhwa.\nHe said the Geographic Information System (GIS) survey had also been conducted under a project regarding computerization of railway land records, in which all the encroachments and leases had been recorded in the Pakistan Railways Land Management Information System (PRLMS) software.\n“Pakistan Railways has reserved 12,808 acres land in four provinces for future operational use including 4364 acres in Punjab, 1800 acres in Khyber Pakhtunkhwa, 900 acres in Sindh and 5744 acres in Balochistan,” he added.\nTo a question, the official said the department had retrieved 38 km out of 43 km long Karachi Circular Railway (KCR) land from the land grabbers in the province.\nHe said Royal Palm Golf and Country Club case had decided in favour of Pakistan Railways by the Supreme Court – bids have been called for transparent outsourcing of the club management.\nThe official said under the Prime Minister’s Clean and Green Pakistan Campaign, Pakistan Railways have planted 500,000 saplings in last two years.\nHe said Pakistan Railways had renovated and up-graded Lahore, Hasan Abdal and Nankana Sahib Railway Stations. 1,365 numbers High Capacity/ High Speed Hopper Wagons inducted to enhance earning as well as efficiency.",
  "retrievedAt": "2025-08-11T19:49:22.320Z"
}
