{
  "title": "Pakistan reduces Ozone depleting substances’ import to 50 percent under Montreal Protocol: Amin Aslam",
  "link": "https://www.app.com.pk/national/pakistan-reduces-ozone-depleting-substances-import-to-50-percent-under-montreal-protocol-amin-aslam/",
  "date_published": "2020-09-20T10:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP): Pakistan has achieved another milestone in its environment friendly ambitions to protect the entire region and globe from man-induced climate change and ecological degradation by reducing Ozone layer depleting hazardous chemicals import to 50 percent.\nThese remarks were made by Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam in an exclusive interaction with APP.\nHe said Pakistan had surpassed its pledged target under Montreal Protocol to contain 35 percent import of HCFC causing Ozone layer to deplete and controlled 50 percent of the total hazardous material import.\nIn his message on the World Ozone Day, he said: “Today marks the 35 years of Montreal Protocol formation which Pakistan signed in 1992. World Ozone Day 2020 is being celebrated today worldwide including Pakistan. The day reminds us that the only thing that stops the earth from getting fried is the ozone layer.\nLets act together to protect [Ozone Layer] it and protect ourself. Happy World Ozone Day.” Amin said the main purpose of this protocol was that the world was getting affected due to Ozone layer depletion that protects harmful ultraviolent rays from reaching the earth.\n“Due to breaching of Ozone layer the life itself was getting affected due to harmful ultraviolent rays,” he added. Amin noted that this was one of the success stories as Montreal Protocol had become a success internationally which was implemented with a clear target, plan and financing available for conversion.\nIn Pakistan, he said, we did two things one that we converted all the technologies using Ozone depleting substances and second we contained the input of HCFCs also Hydro-chloro-fluoro-carbon that cause ozone layer to deplete.\nThe SAPM told that in 1992 agreement Pakistan pledged to control 35 percent import of the HCFC where it had achieved 50 percent and maintained over targeted performance in compliance of the Protocol.\nPakistan, he said, remained committed to all internationally committed agreements and was a responsible partner among all international protocols especially Montreal Protocol in which it had exceeded its performance.\nThe Ministry of Climate Change had also established a National Ozone Unit (NOU) that was organizing World Ozone Day seminar to highlight celebrations, Art competition on World Ozone Day theme, printed poster on the World Ozone Day theme and distributed to general masses and used to publish World Ozone Day supplement in Daily Newspaper on 16 September.\nIt had also designed awareness material for distribution among the general masses, planned radio programme on the eve of Ozone Day and shared videos developed by UNEP on social media.\n“Pakistan signed Montreal Protocol (MP) in 1992. MP has universal ratification and is recognized as most successful protocol. Pakistan met its all obligation as prescribed under MP.” The Ozone layer damaging chemicals CFCs, Halons and Methyl Bromide were phased out and banned since 31st December, 2009.\nPakistan had launched its HCFCs phase out Management Plan (HPMP) in March 2011 which was under implementation. Pakistan achieved 10 percent reduction targets of HCFCs on January 1, 2015. Pakistan achieved 50 percent reduction targets of HCFCs on January 1, 2020.\nThe compliance reporting to Ozone Secretariat was always on time. “Pakistan never exceeded the allowable import limit of HCFCs as strict compliance on import is being ensured through WeBOC system of FBR.”\nThe National Ozone Unit main activities included to regulate the import of Ozone Depleting Substances (presently HCFCs), raising awareness to stakeholders, training to servicing technicians, training to Customs Officials to control illegal imports.\nThe NOU processed and got approved conversion projects whereby industries were provided with machinery through Multilateral Funding which is environment friendly and energy efficient.\nIn the message of the NOU in connection with the World Ozone Day it said: “Pakistan is alive to changing situations in Refrigeration and Air Conditioning (RAC) sector. Efforts are underway to promote new technologies in RAC sector.\nEnergy efficiency, safety and training of servicing technicians remains priority areas including ratification of Kigali Amendments and phasing down of HFCs.\nAll this remains high priority areas as it has strong impact on GHGs emissions thus strong linkage with nationally determined commitments (NDCs).”",
  "retrievedAt": "2025-08-11T19:49:19.832Z"
}
