{
  "title": "NDMA activates NEOC in anticipation of rain-related emergencies in Punjab, Sindh",
  "link": "https://www.app.com.pk/national/ndma-activates-neoc-in-anticipation-of-rain-related-emergencies-in-punjab-sindh/",
  "date_published": "2024-07-01T10:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 01 (APP):Based on predictive modelling, the NDMA’s National Emergencies Operation Center (NEOC) has been reported a significant activity from the eastern Indian side, indicating intense cloud bursts that may hit Pakistani areas.\n“Repeated early warnings have been shared with all provinces, and moderate to heavy rainfall is likely to start over the upper catchments of all major rivers particularly Sutlej, Ravi & Chenab from July 2, 2024,” the National Disaster Management Authority (NDMA) in its news release said.\nThe NDMA has also issued an alert regarding lightning, according to which lightning was expected to strike in various cities of South and Central Punjab and Islamabad during July 5-7.\n“This may lead to rapid rises in water levels, flash flooding events, and urban flooding in metropolitan areas. NDMA warns that the anticipated rainfall poses a significant risk of low to medium level flooding in River Sutlej, with water levels expected to reach low flood levels (approximately 50,000 cusecs) by July 5 and high flood levels (approximately 120,000 cusecs) by July 10, 2024,” the NDMA said.\nThe NDMA is working closely with federal and provincial departments to ensure preparedness and response to this potential emergency.\nThe public was advised to remain vigilant and follow instructions from local authorities.\nThe NDMA advised public to stay informed and download ‘Pak NDMA Disaster Alert’ mobile app for timely alerts and closely monitor weather reports and updates on the flood situation, follow instructions, evacuate immediately if orders are issued by local authorities, protect yourself from floodwater, avoid contact with floodwater, which may be contaminated or contain debris or electrical wires.\nDevelop an evacuation plans with your family, identify a safe location, and create an emergency kit with essential supplies. Travelers are advised to avoid unnecessary travel in case of heavy rainfalls and likely flooding situations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:36:18.485Z"
}
