{
  "title": "Experts highlight importance of data for effective migrant management",
  "link": "https://www.app.com.pk/national/experts-highlight-importance-of-data-for-effective-migrant-management/",
  "date_published": "2024-07-01T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 01 (APP): The experts at a seminar on Monday underscored that data was the key to effective management of Afghan migrants on Pakistani soil.\nThis was stated by experts who were speaking at a panel discussion organized by the Institute of Regional Studies (IRS) here, a news release said.\nThis was stated experts who were speaking at a panel discussion organized by the institute of regional studies\nThe speakers highlighted that it was essential to have a central repository of data on Afghan migrants, including the UN Refugee Agency (UNHCR) mandated refugees, the Afghan Citizenship Card (ACC) holders, as well as the undocumented Afghans. They underscored that currently the data was not being maintained under one roof for ready and effective utilization by the Government of Pakistan.\nThey also called for more efficient coordination between the Government of Pakistan and UNHCR on the matter.\nIn his introductory remarks, President IRS Ambassador Jauhar Saleem stated that Pakistan had adopted various approaches to managing Afghan migrants and continues to strive for the best possible solution. The goal, he said, was to ensure the safe return of Afghan migrants to their homeland with respect and dignity while also ensuring the security of Pakistan’s citizens.\nHuman Rights lawyer, Syed Muaz Shah, shared that since the Taliban takeover in Afghanistan in 2021, Pakistan had seen an increase in the numbers of Afghan refugees from 1.44 million to 2.18 million.\nHe acknowledged Pakistan’s sovereignty in implementing the repatriation policy while also emphasizing the unique situation faced by Afghan refugees in the country. He added that many Afghan refugees wanted to work and settle in Pakistan as they had established their lives in the country and felt a stronger connection to Pakistan than to Afghanistan.\nShah emphasized the importance of recognizing their right under international law to seek refuge and work in Pakistan.\nBrigadier Shozab Majeed, an international law and Alternative Dispute Resolution (ADR) expert, noted that Pakistan had managed Afghan refugees without foreign assistance since 1996, causing significant stress on Pakistan’s economy. He suggested that providing Afghan refugees with opportunities that add value to Pakistan could help mitigate the economic burden.\nWithout such measures, he added, existing loopholes could be exploited leading to increased terrorism in the region. He advocated for statistical research to determine the contributions Afghan refugees could make to Pakistan’s economy.\nFormer Secretary Defence, Lt. Gen. (R) Asif Yasin Malik, emphasized that the solution lay in incentivizing Afghan refugees in Pakistan to repatriate to Afghanistan through a well-planned and urgent policy action in collaboration with the UNHCR and the Afghan interim government. This tripartite approach, he maintained, would ensure the safety and security of all people living in Pakistan. He stressed that such a policy needed to be pragmatic and time-sensitive.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:35:56.085Z"
}
