{
  "title": "Sanjrani clarifies media reports on Salaries, Allowances and Privileges Bill 2023",
  "link": "https://www.app.com.pk/national/sanjrani-clarifies-media-reports-on-salaries-allowances-and-privileges-bill-2023/",
  "date_published": "2023-06-19T09:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP):Chairman Senate Muhammad Sadiq Sanjrani on Monday clarified the media reports about the the salaries, allowances and Privileges Bill 2023 of members, chairman and opposition leader of the Senate.\nIn a clarification in the upper house of the parliament on some news reports being published in some media sections, the chairman Senate said that such reports were not based on solid facts and there was wrong information being communicated related to this bill.\nHe said that not a single increase of one rupee was made in this bill for the benefit of Senate chairman, deputy chairman or senate members.\nHe added only old act of 1975 was rectified and corrected as per the decisions of the concerned committees from time to time.\nHe said that as per bill, the monthly expenses of the chairman or deputy chairman office was Rs 6000, which had been increased upto Rs 50,000.\nHe however said that the chairman or deputy chairman never used this amount.\nHe said that a step was proposed for the residence of the chairman or deputy chairman as presently the chairman was residing in the place of Ministry of Housing and Works and there was no his official residence  under the Senate secretariat.\nSanjrani said that the travelling allowance of only Rs 5,000 had been proposed against Rs 75 for the chairman or deputy chairman besides telephone line for the chairman senate on availing the privilege of acting or vice president when required.\nHe said that the daily allowance of chairman senate had been proposed to increase from Rs 1,750 top Rs 10,000.\nThe chairman added besides PIA now other airline companies had been included for getting air tickets while per KM charges on PIA for the chairman Senate had been revised from Rs 2 per KM.\nThe chairman said that no change in family medical was made and added that the compensation amount for any victim as per privilege of chairman senate had been proposed to increase from Rs 300,000 to Rs 10 million.\nHe said that the senate also proposed to increase discretionary grant for deserving from Rs 600,000 to Rs 1200,000 for the chairman and Rs 300,000 to Rs 600,000 for deputy chairman senate. He added the senate also proposed to revise per KM charges on road use for the chairman.\nHe said that the bill also defined the other privileges and allowances of the senate members.\nThe chairman said that this bill was presented with an objective to make clarity on the matter without getting any financial benefit.",
  "retrievedAt": "2025-08-11T08:44:57.960Z"
}
