{
  "title": "New e-services launched to aid Hajj and Umrah",
  "link": "https://www.app.com.pk/national/new-e-services-launched-to-aid-hajj-and-umrah/",
  "date_published": "2023-06-19T18:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP):Saudi Arabia’s Ministry of Islamic Affairs, Dawah and Guidance has introduced several electronic services to improve pilgrim experience and the tasks of ministry staff.\nThe services include a Sharia awareness app that educates pilgrims on Hajj rituals and offers a translator if the pilgrim requires a language other than Arabic.\nA “Rushd” application is designed to distribute reliable e-books and is integrated with an e-library.\nThe services include a new electronic transaction platform, reports management, and a “virtual workspace” for use by ministry staff.\nIslamic Affairs Minister Sheikh Abdullatif bin Abdulaziz Al-Asheikh said: “The ministry aims to implement all digital transformation standards according to the Kingdom’s Vision 2030.”\nThe Hajj and Visit Committee said a total of 744,862 people have arrived in Madinah so far to perform this year’s pilgrimage. It said 587,845 of those were now traveling to or had arrived in Makkah, Arab News reported.\nMeanwhile, the Women’s Affairs Agency at the General Presidency for the Affairs of the Prophet’s Mosque in Madinah is delivering services to visiting female pilgrims.\nA series of training sessions have helped staff manage crowd flow, clarify regulations, and learn basic language skills to assist visitors.\nThe Presidency in Madinah has also launched a program titled “Comfort and Spirituality in the Prophet’s Mosque,” which welcomes pilgrims to the site.\nFurthermore, the Health Affairs department said that Jdeidet Arar Central Hospital has been upgraded to accommodate 50 beds, including six highly equipped intensive care beds.\nAdditionally, an operating room and an emergency department have been set up. The hospital also houses ten outpatient clinics.",
  "retrievedAt": "2025-08-11T08:44:45.896Z"
}
