{
  "title": "Khawaja Asif calls strong action against illegal human trafficking",
  "link": "https://www.app.com.pk/national/khawaja-asif-calls-strong-action-against-illegal-human-trafficking/",
  "date_published": "2023-06-19T11:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP): Defence Minister Khawaja Muhammad Asif on Monday emphasized the need for firm action against individuals involved in the illegal transportation of people abroad.\nSpeaking on floor of the National Assembly, the minister expressed deep grief and sorrow over the tragic deaths of Pakistani migrants in a recent boat incident near the coast of Greece.\nMinister Asif highlighted that numerous families in Azad Jammu Kashmir, Sialkot, Gujranwala, and Gujrat were currently enduring immense grief as a result of the incident.\nHe called for a collective effort from the government and opposition parties to take stern action against human traffickers, emphasizing the urgency to put an end to this illegal movement.\nWhile acknowledging the arrest of some individuals within the country, Asif stressed that these human trafficking networks also exist in various other countries.\nHe urged international cooperation to effectively combat this issue.\nTo demonstrate solidarity with the bereaved families affected by the boat tragedy, the nation observed a day of mourning.\nAdditionally, Khawaja Asif once again offered his sincere apologies to the Vice Chancellors for using an inappropriate word during his speech in the National Assembly.\nHe expressed deep respect for teachers and educational institutions, highlighting his personal connections with those who had provided him an education.\nHowever, he lamented the prevalent corruption within society, describing it as an unfortunate and accepted norm.\nSpeaker National Assembly Raja Pervez Asharf expressed profound grief, reflecting the collective sorrow felt by the entire nation.\nThe Chair further emphasized the government’s responsibility to take decisive action against human traffickers and stressed the importance of educating people about the risks associated with illegal immigration.\nWhile participating in the budget debate, Pakistan Muslim League Nawaz Shahnaz Saleem Malik said the government had presented a balanced budget in the face of difficult economic situation.\nShe said reduction in the prices of petroleum products had provided relief to the people.\nPakistan People Party Nafeesa Shah said political stability was a must to ensure economic stability in the country.\nShe emphasized for the economy of charter to steer the country in the right direction.\nAs regards the budget, she said it envisaged incentives for the SMEs and the IT sector while raise in salaries had been given to the employees.\nPakistan Tehreek-Insaf Asiya Azeem emphasized for enhancing the budgetary allocations for the education sector, adding it was important to take the country forward on the path of development.\nBalochistan National Party Muhammad Hashim Notezai observed that development schemes of Balochistan province had been ignored in the budget.\nHe said the ongoing schemes in the province must be completed on fast track basis.\nWaheed Alam appreciated the increase in pension of EOBI and the minimum wage to thirty two thousand rupees.",
  "retrievedAt": "2025-08-11T08:44:51.906Z"
}
