{
  "title": "PM underlines need to invest in country’s young talent",
  "link": "https://www.app.com.pk/national/pm-underlines-need-to-invest-in-countrys-young-talent/",
  "date_published": "2023-06-19T13:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 19 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday stressed that they have to make huge investments on the country’s youth because those nations had always excelled whose youth got skills and requisite degrees in different fields.\nAddressing a ceremony of Prime Minister’s National Innovation Awards, the prime minister expressed his pleasure over the strides made by the country’s youth in different fields by utilizing their talents and skills.\nThe country’s future was in the safe hands and they had to make investments on the youth’s talent as they direly deserved it, he added.\nThe prime minister said that it was a matter of satisfaction as these young people strived during their educational careers and showed their innovative skills in IT sector, biodiesel, traffic lights, motorbike etc.\nUnder Prime Minister’s National Youth Award Programme, a total of Rs 160 million were distributed among the 100 talented youths who had achieved innovative business projects.\nThe prime minister said that Pakistan was facing financial challenges, but he was confident that they would steer the country out of these issues.\nSuch situations arose in the lives of nations, he said, stressing that the Pakistani nation has to make the determination and chart its way forward and once they had decided, then nothing could hamper it.\nThe prime minister also expressed his gratitude to China for supporting Pakistan during the economic constraints by extending $1 billion loan facility.\nDuring the last 75 years, he opined that foreign debts proved a hefty burden upon Pakistan whereas those nations had progressed that utilized the foreign loans and returned it on the basis of their talent, honesty and skills.\n“We have to get rid of these debts as they could not thrive on the foreign debts,” he said, adding the country was gifted with precious resources.\nThe prime minister, without naming the previous government, said that he would not go into details about the man-made crises in the past.\nHe said the challenges were faced by the nations and stressed that they should make a promise to change fate of Pakistan without seeking foreign debts.\nReferring to 1971, he said they lost one part of Quaid’s Pakistan but never learnt lessons from the past.\nThe prime minister said the leg-pulling and game of allegations must be ceased and they all have to agree upon unified national agenda as being practiced by different countries.\n“The whole nation has to decide upon one national agenda with salient contours for foreign and economic policies,” he reiterated.\nThe prime minister also regretted that words of certain personalities in the previous government had annoyed China.\nDespite all this, China stood by Pakistan in difficult time, he said and lauded the role of other brotherly and friendly countries of Saudi Arabia, United Arab Emirates (UAE) and Qatar. China had made a $30 billion investment in flagship China Pakistan Economic Corridor (CPEC).\nTerming the achievements of young innovators as ‘outstanding’, the prime minister lauded the contributions of their teachers and parents, adding, the entire nation felt pride over them.\nReferring to awarding amount, the prime minister said that one million rupees to each winner was not sufficient considering the current inflation, as it was less when compared with the past.\nIn the past, he said as Khadim-e-Punjab, he introduced Punjab Skills Development company initiative which was first launched in the southern Punjab.\nHe said that millions of rupees were spent not on brick and mortar type of structures, but training was imparted to the talented youth.\nThey gave away Rs10,000 per student and companies trained them, he added.\nFurther elaborating his point of view, the prime minister said that governments always played a catalyst role to spur activities for industries and agriculture.\nWhereas thousands of laptops were given to the high achievers in Punjab province on pure merit. Similarly, these were also distributed in Gilgit and Baltistan and Kashmir, he added.\nThe prime minister said during the Covid pandemic, these laptops helped the students to continue their educational activities besides, providing them with self-employment opportunities.\nHe said during the tenure of former prime minister Nawaz Sharif laptops were also distributed by the federal government.\nHe said it was his desire to provide laptops to every child of the country.\nOn the occasion, the prime minister called the ambassador of Azerbaijan on stage and appreciated Azerbaijan leadership for an agreement to supply LNG to Pakistan.\nSpecial Assistant to Prime Minister on Youth Affairs Shaza Fatima Khawaja, in her speech, said meetings of the youth with top business ideas would also be arranged with the investors to implement their ideas.\nShe said Rs 100 billion business loans were dispersed in the last decade while over one million free laptops have been distributed among talented students that proved life-changing for them.\nOn average, she said Rs 7 billion per year business loans were distributed in last 10 years while Rs 30 billion in business loans were distributed among the youth in last one year.",
  "retrievedAt": "2025-08-11T08:44:48.176Z"
}
