{
  "title": "Karot Hydropower Project central to President Xi’s people-centric development vision:  Mushahid",
  "link": "https://www.app.com.pk/national/karot-hydropower-project-central-to-president-xis-people-centric-development-vision-mushahid/",
  "date_published": "2023-06-19T13:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP): Chairman Senate Standing Committee on Defence, Senator Mushahid Hussain Sayed Monday said the Karot Hydropower Project built as the flagship initiative under the China Pakistan Economic Corridor (CPEC) was central to the Chinese President Xi Jinping’s iconic vision of people-centric development rolled out in the Belt and Road Initiative (BRI).\nThe chairman led a delegation comprising of members of the Parliament to the Karot Hydropower Project (KHP) site in Kahuta on the occasion of the project’s first anniversary and the 10th anniversary of the China Pakistan Economic Corridor (CPEC) and BRI.\nSenator Mushahid Hussain Sayed who is also Chairman of Pakistan China Institute (PCI), was flanked by Executive Director of Pakistan China Institute Mustafa Haider Sayed.\nIt was the first cross-party parliamentary delegation of its kind to visit the Karot Hydropower Project, which included Senator Waleed Iqbal (PTI), Senator Taj Haider (PPP), Senator Sadia Abbasi (PML-N), Senator Palwasha Muhammad Zai Khan (PPPP) and Senator Muhammad Asad Ali Khan Junejo.\nSenator Mushahid said Karot Hydropower Project was the strong pillar of CPEC and was tantamount to the vision of Chinese President Xi Jinping who demanded the development that ensured its benefits to people at the grassroots level.\nWhile extending his gratitude to the China Three Gorges South Asia Investment Limited (CSAIL), Senator Mushahid commended the commitment and quality of work shown during the execution of KHP.\nHe said the CPEC project was changing but rather diversifying Pakistan’s economy and the lives of its people.\n“China Three Gorges Corporation (CTG) has done miracle at Karot despite various challenges and it is a living example of the BRI and CPEC success,” he added.\nHe said that KHP was an excellent example of energy security and green technology securing people of Pakistan.\nWhile lauding the Community Investment Plan (CIP) implemented by the CSAIL under its corporate social responsibility, Senator Mushahid said the CTG had invested over Rs 650 million that helped in building schools, healthcare facilities and road infrastructure in the project.\nThe top of it was Tehsil Headquarters Hospital (THQ) Kahuta which was a 60-bed facility catering the needs of masses of the local and adjoining areas and bearing a patient load of 30,000 patients per month.\nHe also appreciated the fully funded scholarships offered by the CSAIL to local masses to study in China.\nSenator Mushahid said the CPEC’s early harvest projects were completed in time in Pakistan that provided over 150,000 jobs, 6,000 megawatts (MW) power generation, 1,000 kilometers highways and motorways construction where 4,000 Pakistani students were studying in China which was a great change.\n“China came to Pakistan for investment at the time when no Muslim or Western country was ready to invest a penny in Pakistan due to terrorism, and alarming situation in Afghanistan,” he said.\nThe chairman underlined that it was pertinent to note that the CTG was a world class hightech company implementing clean and green development having least impact on the environment amid rising global warming and climate change.\nHe also mentioned that nations of both the countries were marking the 10th anniversary of the BRI and first of the Karot Hydropower Project.\nThe BRI included over a hundred countries of Asia, Africa, Latin America, the Middle East and Europe that had provided over half a million jobs, he added.\nCEO of CSAIL, Wang Minsheng, warmly welcomed the delegation and gave an introductory briefing highlighting the importance of the Karot project and the ongoing operations to boost Pakistan’s energy sector.\nHe said that Karot Hydropower Project was the flagship project of CPEC with sincere cooperation and mutual benefits between China and Pakistan.\nElaborating the benefits of the project, he said, “With an annual production capacity of about 3.2 billion kwh, the project will save about 1.4 million tonnes of standard coal and 3.5 million tonnes of carbon dioxide emissions every year.”\nExecutive Director, CPI, Mustafa Haider Sayed while appreciating visit of the parliamentary delegation termed it as an important development to build consensus and stressed the need for conducting more such visits to other CPEC locations as well.\nHe added that these visits would help in providing first-hand information and help in countering the propaganda against CPEC and China in Pakistan.\nHe added that the Karot project was significant in three respects: one as a success story of CPEC as it was completed a year ahead of schedule, second it was based on clean energy and green development, and finally it had helped local communities and improved their lives through infrastructure such as schools, hospitals, roads and bridges.\nChairperson, Senate Standing Committee on Human Rights, Senator Waleed Iqbal said that the Karot Hydropower Project was the first large-scale hydropower project under the Belt and Road Initiative.\nCounsellor of the Chinese Embassy, Bao Zhong said that due to the joint efforts of people from all walks of life of the two countries, the Karot Hydropower Project had achieved remarkable achievements, which was in the spirit of joint consultation of the “Belt and Road” initiative.\n“It is a practical picture of joint construction and development and achieving common benefits. China will work with Pakistan to implement the consensus reached between the leaders of the two countries and jointly implement the Belt and Road Initiative,” she added.\nDuring the visit, the delegation got an opportunity to inspect key parts of the project such as spillway, dam structure and power house.\nProfessionals from China Three Gorges Corporation (CTG) provided a technical briefing on the project elements and environmental protection measures implemented in the project area.\nThe delegation observed the advanced technology and infrastructure of KHP to generate clean electricity from water resources.\nThe KHP was a 720-MW hydroelectricity project established at the run of river under the Power Policy 2002 of Pakistan and located in the region of Punjab and Azad Jammu and Kashmir (AJK).\nThe project was located very close to the load center-Islamabad as mostly hydropower schemes were set up far away from the population whereas it was 76km away from the federal capital and close to national grid requiring only 3km of transmission lines.\nThe total project cost was $1.74 billion and was constructed within five years and had an operations period of 30-year and after that period it would be transferred to the Government of the Punjab for Rs1.\nThe CSAIL of CTG Corporation had paid Rs 13.34 billion in lieu off taxes to the AJK and Punjab government and Rs 675 million in terms of water revenues to the aforementioned governments.\nThe CSAIL had also built to main suspension bridges linking Punjab and AJK each of 330 meters length.",
  "retrievedAt": "2025-08-11T08:44:54.434Z"
}
