{
  "title": "SC reserves judgment on petitions regarding Reviews of Orders and Judgments Act",
  "link": "https://www.app.com.pk/national/sc-reserves-judgment-on-petitions-regarding-reviews-of-orders-and-judgments-act/",
  "date_published": "2023-06-19T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP):The Supreme Court (SC) on Monday reserved its judgment on petitions pertaining to SC Reviews of Orders and Judgments Act 2023.\nA three-member bench of the top court headed by Chief Justice of Pakistan Umar Ata Bandial and comprising Justice Ijaz ul Ahsan and Justice Munib Akhtar heard the case.\nAt the outset of the hearing, Attorney General for Pakistan (AGP) Mansoor Usman Awan argued that there were different judgments of the apex court regarding the powers of the Parliament for legislation. A separate scope had been set for the review of the judgments in cases of Article 184/3, he said.\nThe AGP said before introduction of the act which had not affected the right of anybody, there was no method for review in the cases of Article 184/3,. It did not limit the scope of review.\nHe said as per the act it was the court’s authority to choose members of the bench for a review case, and that bench should be larger than the bench, which had heard the main case.\nCJP Bandial remarked that the government could introduce legislation but giving right of appeal in the review cases did not seem appropriate. The government should take a decision on the matter after thorough consideration.\nHe noted that there was also no right of review appeal in India in cases like those of Article 184/3.\nJustice Munib Akhter questioned whether the power of review could be compared with civil laws and whether civil laws fell in the jurisdiction of provinces. The act did not mention provincial laws, he said, asking the AGP to give arguments on section-II of the act.\nHe further questioned whether the SC could raise any new legal points in the review appeal. To this, the AGP answered in affirmative.\nThe chief justice remarked that everyone was agreed on the point that the Parliament was authorized to extend the scope of reviews.\nHe said the government had converted the review into an appeal but it also had to give solid reasons for that. The government should do legislation but it should not leave anything unclear in the law.\nHe asked why the government did not interpret public interest and review.\nThe AGP prayed the court to terminate the petitions against the act as the petitioners were not directly affected with the legislation. The petitioners could challenge the legislation in high courts under Article 199 of the Constitution. The current legislation would not affect the provision of the justice and decisions in review cases, he added.\nThe court subsequently reserved its judgment after the AGP concluded his arguments in the case.",
  "retrievedAt": "2025-08-11T08:44:46.772Z"
}
