{
  "title": "Govt committed to curb extremism by promoting sports among youth: Fawad",
  "link": "https://www.app.com.pk/national/govt-committed-to-curb-extremism-by-promoting-sports-among-youth-fawad/",
  "date_published": "2021-12-09T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 9 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Thursday said the government was committed to curb extremism by allowing active and increased participation of youth in the sports activities.\n“The Kamyab Sports Drive has great importance because if you look at the incidents as like of Sialkot and Minar-e-Pakistan, youth between age brackets of 15-25 were involved in them,” he said while addressing concluding ceremony of inter universities final competitions in various sports under Kamyab Jawan Talent Hunt’s drive.\nHe said the promotion of sports was crucial to channelize negative energies of the youth into positive ones so that the scourge of extremism could be stamped out.\nIt was also imperative so that the country’s youth could not be influenced by extremist elements and could bring good name to Pakistan by representing it at the international level sports activities, he added.\nHe said it had been observed that the entire nation celebrated after the Pakistan cricket team defeated India in the T-20 world cup initial matches and made a clean sweep in recent test series against Bangladesh.\nThe respect gained by athletes at international level played critical role in uplifting morale of the nations, he added.\nHe congratulated Special Assistant to the Prime Minister on Youth Affairs Muhammad Usman Dar and the Kamyab Jawan team for organizing such big sports festival in which some 50,000 youth turned up on its first day.\nFawad said total 6,000 athletes including 3,300 boys and 2,700 girls participated in various sports. “We are proud of Pakistani girls who have been playing central role in the national progress,” he added.He said the drive would now move to the provinces and some 12 sports academies would be set up under the initiative.\nThe minister expressed the confidence that the talented youth would bring laurels to the country by winning gold medals in Olympics.\nHe urged the parents to encourage their children to play sports, besides carrying on their curricular activities so that the youth could also represent the country at international level.",
  "retrievedAt": "2025-08-11T21:42:10.806Z"
}
