{
  "title": "BISP on forefront to ensure optimum support for poor, vulnerable segments: Shazia Marri",
  "link": "https://www.app.com.pk/national/bisp-on-forefront-to-ensure-optimum-support-for-poor-vulnerable-segments-shazia-marri/",
  "date_published": "2022-09-16T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP): Federal Minister for Poverty Alleviation and Social Safety and Chairperson Benazir Income Support Programme (BISP), Ms. Shazia Marri Friday said BISP was on the forefront in extending optimum support to poor and vulnerable segments in the country.\nExpressing views in a meeting with delegation of World Bank at BISP Headquarters, she said BISP had disbursed Rs. 27,645 million to 946,967 flood affected families in recent floods across the country.\nThe delegation was briefed on the multi-component social protection strategy and widespread operations of BISP.\nSince the launch of Benazir Kafaalat Programme, Rs. 1.309 trillion had been disbursed to 7.9 million beneficiaries, she said and added Rs. 40 billion had been disbursed to 8.04 million children under Benazir Taleemi Wazaif.\nShe pointed out Rs. 20.5 billion had been disbursed for 92003 Benazir Undergraduate Scholarships and Rs. 833 million had been disbursed to 196,989 beneficiaries under Benazir Nashonuma Programme.\nCurrently Benazir Nashonuma Programme is operational in 29 districts and more Facilitation Centers are being established in other districts of the county to address the issue of stunting growth among pregnant, lactating women and their children of under 2-year of age.\nShazia Marri appreciated the role of the World Bank, as a major development partner in providing continuous and valuable support to BISP for strengthening the social protection system in Pakistan.\n“We have to take the provinces and federating units on-board to ensure that we are not leaving anyone behind in providing assistance to flood affected families across the country,” she added.\nThe WB representatives lauded the efforts of BISP in flood affected areas and ensured full support from WB in future development of the programmes like Benazir Nashonuma.\nThe delegation also congratulated BISP on updating the national socio-economic registry.\nThe delegation comprised of Ms. Lynne Sherburne-Benz, Regional Director, Human Development South Asia Region, Stefano Paternostro, Practice Manager, Social Protection and Jobs, Lire Ersado, Practice Leader Human Development and Amjad Zafar Khan, Senior Social Protection Specialist.",
  "retrievedAt": "2025-08-11T15:35:14.094Z"
}
