{
  "article_id": "2025-01-14_0ae0f7bbbe085ed4f161e92616373877",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mastermind-of-may-9-riots-to-be-tried-in-military-court-khawaja-haris-argues-before-scp/",
    "retrieved_at": "2025-08-27T11:38:46.070Z"
  },
  "metadata": {
    "title": "Mastermind of May 9 riots to be tried in Military Court, Khawaja Haris argues before SCP",
    "author": null,
    "date_published": "2025-01-14T10:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 291,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 14 (APP):Counsel for the Ministry of Defense Advocate Khwaja Haris has argued before the Supreme Court that whoever disrupt the military discipline will be tried in military courts and conspirator and mastermind of the event would also be tried under Army Act. Khwaja Haris continued his arguments before the seven-member Constitutional Bench of the Supreme Court headed by Justice Amin ud Din Khan and comprising Justice Jamal Khan Mandokhial, Justice Muhammad Ali Mazhar, Justice Hasan Azhar Rizvi, Justice Musarrat Hilali, Justice Naeem Akhtar Afghan and Justice Shahid Bilal Hasan. Justice Hasan Ali Azhar questioned the lawyer that how the protester on May 9 entered into the house of the Corps Commander without weapons? Were they interrupted by anyone? Any legal action against someone for letting the protesters enter into such a protected place? Response of the Counsel for the Ministry of Defense was in negative to questions regarding involvement and legal action. Justice Musarrat Hilali remarked that what if there is a quarrel between a civilian and a soldier on a check post? 'There is a difference between interrupting discipline and disagreements, responded Khwaja Haris. Justice Jamal observed that it seems that the counsel depends on the case of FB Ali while both military men and civilian were accused in that case. Addressing the Counsel, Justice Mandokhail said you are expending the jurisdiction of the military court to an extent where anyone can be tried under Army Act. Khwaja Haris referred to the case of Khwaja Liaquat Hussain, in which a civilian was tried by a military court. Despite the Court desire that the Counsel for the Ministry of Defense should conclude his arguments by today, the proceeding was adjourned for tomorrow and Khwaja Haris will continue his arguments.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}