{
  "article_id": "2025-01-14_fc198d608d47ebba0e409447cd30d0de",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/musadik-participates-in-meeting-of-mining-ministers-at-future-minerals-forum/",
    "retrieved_at": "2025-08-27T11:39:15.740Z"
  },
  "metadata": {
    "title": "Musadik participates in meeting of mining ministers at Future Minerals Forum",
    "author": null,
    "date_published": "2025-01-14T16:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 295,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 14 (APP):Minister for Petroleum, Dr. Musadik Malik, participated in the 4th annual international meeting of mining ministers, held on Tuesday in Riyadh. Representatives from 85 countries are participating in the international meeting, according to a news release received here. He had diverse engagements with international mining leaders and industry experts. He also visited the Pakistan Pavilion and met with key stakeholders from the minerals sector. The Future Minerals Forum (FMF) in Riyadh kicked off today, as global mining leaders, service providers, and operators from around the world began showcasing their innovations and forging new connections. The Pakistan Pavilion, one of the key highlights, welcomed over 500 visitors on the first day alone, signalling a strong interest in Pakistan's mining sector. The Pakistan Pavilion had already hosted approximately 350 visitors, including representatives from major global mining operators, industry service providers, potential investors, media personnel, and members of the diplomatic corps in Riyadh. Delegates were seen engaging in productive discussions, setting the stage for fruitful partnerships over the next two days of the forum. The Pavilion's design and exhibits garnered widespread acclaim, particularly the 'Mineral Map of Pakistan,' which creatively highlighted the country's rich mineral resources. The Pavilion is a collaborative effort between the Ministry of Energy (Petroleum Division) of Pakistan and 12 prominent companies from Pakistan, ranging from operators and joint-venture equity stakeholders to essential service providers. The Pavilion was curated and organized by Pakistan Petroleum Limited (PPL) The Pakistan Pavilion is positioned as a focal point for potential investors and collaborators eager to explore the vast opportunities in Pakistan's burgeoning mining sector. The Minister of Industry and Mineral Resources for the Kingdom of Saudi Arabia, took a tour of the FMF later in the afternoon, engaging with delegates and exploring the various exhibits.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}