{
  "article_id": "2025-01-14_107671325953ae2b2c77a59b51c527d8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pias-flights-to-uk-likely-to-resume-within-two-three-months-senate-told/",
    "retrieved_at": "2025-08-27T11:37:36.981Z"
  },
  "metadata": {
    "title": "PIA’s flights to UK likely to resume within two-three months: Senate told",
    "author": null,
    "date_published": "2025-01-14T14:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 310,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 14 (APP): Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Tuesday informed the Senate that Pakistan International Airline (PIA's) flights to the United Kingdom (UK) are likely to resume within two to three months. Replying to a calling attention notice raised by Sherry Rehman about the grounding of PIA aircrafts in the context of an unclear privatization plan, the minister said all out efforts were being made for the resumption of PIA's flight to UK. A UK aviation team would visit Pakistan by end of January for physical examination in this regard, he added. He said the losses of the national flag carriers have exceeded over Rs 650 billion. The process for PIA's privatization was very transparent and all the proceeding was live telecast, he said and added that as per the law, the government rejected the bidding as it was lower than the reserved price. He said the privatization of PIA would proceed and proper work was being done in this regard. Ishaq Dar said that out of a total of 22 operational aircraft, 6 were included Boeing, 11 Airbus and the remaining ATR in the PIA fleet. Some 11 aircraft including six Boeing and 5 Airbus were being repaired, he added. He said PIA was collecting around Rs 84 billion in revenue per annum from the UK and Europe through operating its flights before imposing ban due to a statement given by the then Aviation Minister Ghulam Sarwar Khan. He said flights have resumed to France after the government's hectic efforts. Regarding improper advertisement for the resumption of PIA flights to France, the minister said that a proper inquiry has been ordered into the matter to thoroughly probe it. Earlier, raising the issue, Sherry Rehman said that out of a total of 34 PIA aircrafts, only 19 were operational while the remaining were grounded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}