{
  "title": "FM stresses global multi-stakeholder approach to deal COVID-19",
  "link": "https://www.app.com.pk/national/fm-stresses-global-multi-stakeholder-approach-to-deal-covid-19/",
  "date_published": "2020-05-08T05:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 8 (APP):Foreign Minister Shah Mehmood Qureshi on Friday stressed the need for a multi-stakeholder global perspective approach to address the COVID-19 pandemic keeping in view its socioeconomic impact across the world.\nHe was addressing foreign intellectuals through video-link under his ‘FM Connect Digital with Global Thought Leaders’ initiative.\nThe guests included Dr William Ury (Harvard University), Professor Kishore Mahbubani (National University of Singapore), Dr Kevin P Gallagher (Boston University) and Dr Adil Najam (Boston University).\nForeign Minister Qureshi discussed with international experts the post COVID-19 realities on the global geo-political and socioeconomic landscape.\nHe apprised the intellectuals that in Pakistan, COVID-19 affected 24,073 persons and claimed 564 lives.\nHe said Pakistan’s healthcare system needed improvement to cater to the needs of emergency situations.\nHe said the government had allocated $8 billion to deal the economic impact of coronavirus situation. Under Ehsaas socio-welfare programme, Rs144 billion were being distributed among 12 million needy people, he added.\nQureshi said an amount of Rs75 billion was allocated for labourers and workers who lost jobs due to lockdown.\nHe mentioned that Pakistan suffered a dip in exports by 41 percent and feared fiscal deficit to increase by 10 percent due to the current situation.\nHe said Prime Minister Imran Khan in the same perspective proposed international community for ‘Global Debt Relief’, adding that announcement by G-20 Forum to provide financial assistance to weaker economies was welcoming.\nThe foreign minister said Pakistan was ready to host next SAARC Conference, however India changed the situation with its unilateral action of revoking the status of Jammu and Kashmir on August 5.\nHe said despite India’s irresponsible attitude, Pakistan recently hosted the SAARC meeting of health ministers through video-link amid coronavirus pandemic.\nThe intellectuals expressed their views on the COVID-19 scenario and the ways to tackle the situation.\nDr William Ury, co-founder of Harvard University’s Programme on Negotiation and one of the world’s leading experts on negotiation. He is currently a Distinguished Senior Fellow at the Harvard Negotiation Project and a bestselling, award winning author.\nProfessor Kishore Mahbubani, a Singaporean diplomat and an academic, former president of the United Nations Security Council and is a Distinguished Fellow at the Asia Research Institute (ARI), National University of Singapore (NUS).\nDr Kevin P Gallagher, professor of Global Development Policy at Boston University’s Frederick S Pardee School of Global Studies, where he directs the Global Development Policy Centre.\nDr Adil Najam, the inaugural Dean of the Frederick S Pardee School of Global Studies at Boston University.\nThe FM Connect Thought Leader platform will see the foreign minister hosting a diversity of round table digital discussions with intellectuals, writers, academics, thinkers and researchers across the globe.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:11:38.015Z"
}
