{
  "title": "Radio Pakistan to be developed on modern lines : Shibli Faraz",
  "link": "https://www.app.com.pk/national/radio-pakistan-to-be-developed-on-modern-lines-shibli-faraz/",
  "date_published": "2020-05-08T04:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 08 (APP):Minister for Information and Broadcasting Senator Shibli Faraz on Friday said the Radio Pakistan would be developed on modern lines to enhance the effectiveness of the important medium of mass communication and restore it to its previous glory.\nHe gave the remarks during a visit to Radio Pakistan’s Headquarters here. He was accompanied by Secretary Information and Broadcasting Akbar Hussain Durrani.\nThe minister said the role of radio had assumed special significance during the COVID-19 pandemic due to its mass reach and access to every nook and cranny of the country.\nShibli Faraz visited various sections of Radio Pakistan, including News, Programme, and Archives.\nPakistan Broadcasting Corporation (PBC) Director General Ambreen Jan gave a briefing to the minister on the working and role of various departments of Radio Pakistan.\nUpgradation and digitization of existing transmitters of PBC was also discussed. Shibli Faraz directed the Information Secretary to expedite the process of modernizing existing AM transmitters of 100 and 400 KW on DRM in the first phase.\nThe minister highly appreciated Saut ul Quran channel of Radio Pakistan for its religious services to the people.\nLater, exclusively talking to Radio Pakistan’s News and Current Affairs Channel, the minister said he had special affinity with Radio Pakistan as his father and prominent Urdu poet Ahmad Faraz had also started his career from the premium institution.\nHe said Radio Pakistan was endowed with rich past, heritage, and traditions, and the government would try to rebuild the institution on those values.\nThe minister said he would try to help the Radio Pakistan regain its past glory. It would be enabled to help produce artists and productions of world fame, which used to be its hallmark. The rich culture, history and national identity of the country would be promoted through Radio Pakistan.\nReferring to prevalent situation of corona pandemic, Shibli Faraz said the announcement of Prime Minister Imran Khan to relax lockdown in a phased manner was aimed at helping daily wagers earn their livelihood. The country was facing the coronavirus on one hand and hunger from lockdown on the other, and a balance was necessary.\nHe said the government wanted to create equilibrium between the life and economic necessities. He appealed to the people to strictly follow the standard operating procedures (SOPs), including wearing masks and social distancing to stop spread the virus.\nThe minister also talked with FM 101 and expressed his strong resolve to make Radio Pakistan one of the leading institutions of the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:11:38.375Z"
}
