{
  "title": "It’s been govt’s endevour to care for both lives, livelihood amid COVID-19 in country: Shibli Faraz",
  "link": "https://www.app.com.pk/national/its-been-govts-endevour-to-care-for-both-lives-livelihood-amid-covid-19-in-country-shibli-faraz/",
  "date_published": "2020-05-08T05:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 08 (APP):Federal Minister for Information and Broadcasting Senator Shibli Faraz Friday said it had been the endeavour of the government to care for both lives and livelihood following outbreak of coronavirus in the country.\nHe said during a meeting with Ambassador of Japan to Pakistan Kuninori Matsuda who called on him here.\nMatters relating to Pak-Japan bilateral relations, current COVID-19 situation and media cooperation were discussed on the occasion.\nAt the outset of meeting, the minister apprised the Japanese ambassador about the latest announcement on May 7 by Prime Minister Imran Khan to relax the COVID-19 lockdown in a phased manner.\nHe said during the lockdown in the country, special attention had been paid to the welfare of the needy and poor segments of the society.\nThe ambassador said the prime minister of Pakistan had led the national response on COVID-19 pandemic from the very beginning which was highly commendable.\nHe said the government’s due care for lives and livelihood during the campaign against corona pandemic was a great example to follow and it had really helped the cause of the poor and needy.\nHe recalled Pakistan’s support to Japan during the Tsunami and various incidents of earthquake. He said Japan in the same spirit had provided $2.16 million assistance to Pakistan to fight the COVID-19. Tokyo would keep up its support to Pakistan in this hour of need, he said.\nKuninori Matsuda expressed Japan’s keenness for support and cooperation in developing clean drinking water facilities, ecology protection and for measures regarding flood control.\nHe said Japan also intended to cooperate with Pakistan in the agricultural sector with particular emphasis on efforts for locust control.\nHe said once the situation turned to normal, a technical experts team would be invited to visit Pakistan to have meaningful exchange of views in the relevant sectors.\nHe also briefed the minister about the ongoing economic cooperation between the two countries including different projects.\nBoth sides also discussed matters pertaining to modernization and technical up-gradation of Pakistan Television and Pakistan Broadcasting Corporation.\nThe minister said Pakistan would be eager to benefit from Japan’s expertise in this sphere.\nSenator Shibli Faraz welcomed the Japan government’s $2.16 million assistance in the ongoing war against corona pandemic.\nThe information minister also expressed his gratitude for provision of medical equipment and supplies by Fair Medical Company, Japan and emergency support by Japanese NGO KnK for deserving families in Mansehra and Haripur areas.\nThe ambassador congratulated Senator Shibli Faraz for assuming his office as Minister for Information and Broadcasting and said the decision was hailed by the media community.\nHe wished him the best in his future endeavors for media development and well being of journalist community in the country.\nThe meeting was attended by senior officials from the Ministry of Information and Broadcasting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:11:38.679Z"
}
