{
  "title": "UNESCO, PJN partner for strengthening access to Information online",
  "link": "https://www.app.com.pk/national/unesco-pjn-partner-for-strengthening-access-to-information-online/",
  "date_published": "2023-09-29T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP): UNESCO, the Peace & Justice Network (PJN) and the Pakistan Information Commission (PIC) have joined hands to strengthen access to information online.\nAs part of UNESCO’s International Day for Universal Access to Information, civil society – the PJN with partners including the Pakistan Information Commission and the Embassy of the Kingdom of the Netherlands held a conference here on Friday.\nTaking forward this year’s global agenda “The importance of Online Space for Access to Information” forward, the national conference mapped priorities to address challenges faced by marginalized in accessing information online.\nIt is crucial for persons with disabilities, transgender and religious minorities, etc., to have equal access to information to promote inclusivity. The information and its access if effectively utilized can become a means for empowerment, justice, and equal participation in society.\nKeeping the United Nations’ shared value of “leaving no one behind” at the core, it is imperative to ensure that these groups leverage online spaces.\nThe online space(s) have become an indispensable resource for many communities, including marginalized groups. They are not only offering a space to engage in public discourse but is an earning source. Marginalized communities already stigmatized can leverage these spaces to uplift themselves socially and economically.\nTherefore, it is necessary to realize that online spaces and by extension internet need to be integrated with the rights perspective.\nAn approach developed by UNESCO that safeguards rights is open and accessible for all and consists of representing pluralism.\nSenator Farhatullah Babar highlighted the need for government institutions to enhance access to information to strengthen democratic values in the country.\nOn strengthening the role of information commissions Chief Information Commissioner, Shoaib Ahmad Siddiqui stressed the need for more proactive disclosure to promote a culture of accountability and transparency.\nDeputy Ambassador of the Kingdom of the Netherlands, Hajo Provo Kluit recognized the importance of access to information for marginalized groups in ensuring stronger institutions.\nDuring the session ‘Connecting the Disconnected’ moderated by Farieha Aziz, Co-founder Bolo Bhi, experts Mukhtar Ahmed Ali, Mary James Gill, Usama Khilji and Barrister Yasser Latif Hamdani presented the challenges citizens face when the government shutdown or restrict people’s Internet access, as this severely restricts their ability to exercise their rights, including the right to access information and engage in democratic processes.\nThey all highlighted the need for a strong policy framework to address internet disruptions, ensuring access to information and protecting fundamental rights.\nTo sensitize key stakeholders about access to information online specifically for marginalized groups, a session was moderated by Nayyab Ali, Gender Advisor PJN, and Syed Raza Ali CEO of PJN.\nAfter extensive deliberations by the representatives from marginalized communities, key experts from diverse backgrounds Moon Ali, Abia Akram, Mary James Gill, Jayaa Jaggi and Syed Raza Ali prepared recommendations and presented their plans to duty bearers including the Ministry of Human Rights.",
  "retrievedAt": "2025-08-11T09:52:42.395Z"
}
