{
  "title": "AJK celebrates Eid Milad un Nabi (SAWW) with fabulous zest, full religious fervor",
  "link": "https://www.app.com.pk/national/ajk-celebrates-eid-milad-un-nabi-saww-with-fabulous-zest-full-religious-fervor/",
  "date_published": "2023-09-29T10:16:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK ) : Sep 29 (APP)::The most sanctified day of Eid Milad-un-Nabi  (SAWW)  the Birth Day of the last Holy Prophet Muhammad (Peace Be Upon Him) was celebrated across Azad Jammu Kashmir including expatriates lake city of Mirpur on Friday with full traditional religious zeal and fervor.\nAll AJK  cities, towns, and villages have been beautifully decorated and illuminated to celebrate the most sacred day In the global Islamic history with milad processions and greetings to celebrate the most sacred day for humanity including the Muslim world.\nVarious Eid Milad un Nabi (PBUH) processions and rallies were taken out from various parts of the city and other parts of the district, which were the hallmark of the sanctified day.\nAll the processions later joined the main Milad procession taken out from Markazi Jamia Mosque Moulana Mufti  Abdul Hakeem at the central  Allama Iqbal Road.\nA large number of people from all spheres of life joined the procession to celebrate the birthday of Sarwar-e-Konain, Khatim-un-Nabaeen Hazrat Muhammad Mustafa (PBUH) with full religious enthusiasm and fervor.\nEminent religious scholars besides officials of Mirpur Division administration including Div. Commissioner Ch. Shoukat Mahmood,  DIG Police Ch. Sajaad Hussain,   Deputy Commissioner  Ch. Amjad Iqbal , SSP Raja Irfan Salim, ADC (G) Yasir Riaz Chaudhry,  Assistant Commissioner,  District Information Officer Javeid Mallick, Life-time Chairman of Hatam-e-Nabuat (PBUH) and Markazi Milad Committee Muhammad Riaz Alam Advocate, President  Markazi Milad Committee Ghulam Rasool Awami and others leading Islamic scholars and ulema besides eminent icons from all sections of life led the Eid Milad-un-Nabi procession which passed through its traditional routes with great jubilation and emotions of pleasure.\nAddressing the Eid Milad un Nabi (PBUH) mehfil-e-Milaad at Shaheed Chowk, speakers including leading ulema and religious scholars paid glorious tributes to Hazrat Muhammad Mustafa (Peace Be Upon Him). They said that salvation here and hereafter lies in the total implementation of Islamic teachings and acting upon the sayings of Hazrat Muhammad (PBUH) in our individual and collective lives besides acting upon the sayings of Hazrat Muhammad (Peace Be Upon Him).\nSpeakers paid glorious tributes in honour of the last Prophet Muhammad (PBUH) in beautiful words for getting humanity rid of the era of ignorance and injustice and by giving the right direction to humanity to spend life in an honorable manner in accordance with the teachings of Islam.\nSpeakers besides other participants of the Eid Milad un Nabi (SAW) processions, on this occasion,  prayed for the upholding of the teachings of Islam, Quran and Sunnah, unity, integrity and solidarity of the Muslim ummah, early liberation of the occupied Muslim Homelands including Palestine and Indian Illegally occupied Jammu Kashmir, security, stability and prosperity of Pakistan and Azad Jammu & Kashmir.\nSabeels of milk and soft drinks were set up by various organizations along the entire routes of the Milaad processions in the city and the rest of the district.\nCooked food was distributed among the people including the poor, orphans, and downtrodden to mark the jubilation over the sacred day of Eid Milad un nabi (PBUH).\nAll city streets and roads including bazaars and shopping centers, besides public and private buildings, were beautifully decorated with multi-color lights for last two nights besides banners bearing the writings about the celebration of the birth Day of the last Holy Prophet – Muhammad (PBUH).\nFor the last two nights, all private and public buildings were beautifully illuminated with colored lights to express extreme jubilation over this exceptionally auspicious day.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:53:06.934Z"
}
