{
  "title": "Won’t be in govt’s control if Imran Khan legally barred from polls: PM",
  "link": "https://www.app.com.pk/national/wont-be-in-govts-control-if-imran-khan-legally-barred-from-polls-pm/",
  "date_published": "2023-09-29T08:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 29 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar said that it would not be in the caretaker government’s control if Pakistan Tehreek-e-Insaf chief Imran Khan was legally barred from elections by the courts, after exhausting all of his legal remedies.\n“The fate of Imran Khan is not final (as yet). There are judicial remedies available to him… And if all the options are utilised judicially, then yes, there is a possibility that he may legally be barred from that process which is beyond the control of the caretaker government,” the prime minister said in an interview with BBC HARDtalk during his visit to London.\nAlso regarding Pakistan Muslim League-Nawaz Quaid Nawaz Sharif and PML-N president Shehbaz Sharif, he reiterated that if any individual was barred from the elections, it would not be due to executive decision as that could only be through judicial outcome.\nHe said that being the caretaker prime minister, he could not undo the judicial outcomes. Asked whether Nawaz Sharif would be arrested on his return from London, he said the law enforcement agencies would have to deliberate whether he had protective bail or any other legal remedies available.\nIn another interview with BBC Urdu, the prime minister said in the case of Nawaz Sharif, the law should take its course as he went abroad on a court order.\nHowever, he said he did not foresee any agitative behaviour on Nawaz Sharif’s arrest as instead of indulging in agitative politics, the PML-N leadership would prefer to take part in the elections.\nHe told the interviewer that PTI as a political party was not barred from participating in the elections.\n“If an individual is charged with riots, vandalism, arson and instigating people for violence, the laws of the land are there to counter this behaviour,” he commented.\nOn a similar question by BBC Urdu, he assured that there would absolutely be no harshness against PTI.\nHowever, those found involved in violence would be dealt with as per law. Such a people could be just 1500-2000 in numbers, out of 250 million population.\nThe prime minister reiterated his government’s resolve to steer the country out of prevailing challenging and difficult times and hold free and fair elections.\n“I am pretty much confident that upcoming elections will be free and fair. I am confident that we will achieve all indicators of transparent elections,” he remarked.\nRubbishing Imran Khan’s allegations against the military, he said the same military worked hand in glove with PTI chief during his government and that he used to famously take credit for hybrid arrangements.\nTo a question, the prime minister said Pakistan had lost over 90,000 lives in the war against terrorism as the country had to take the mess on its own after all including the NATO and ISF left the region.\nHe said Pakistan’s military and paramilitary forces were doing a “fantastic” task of dealing with terrorism.\nAbout the challenge of renewed attacks, he said those were due to the added gadgetry left by US and UK after the drawdown.\nHe said the Afghan army of 300,000 was armed with the latest equipment and after the withdrawal, those arms and equipment were sold in the black market.\nHe said Pakistan was dealing with the TTP on its soil but their asylum in Afghanistan was part of the problem.\nAbout his government’s economic priorities, Prime Minister Kakar said they had cracked down on illegal trade of currency and hoarding. The government will also go for the privatization of state-owned entities like Steel Mill, PIA and Power Discos.\nHe told the BBC Urdu that holding the elections within 90 days was the Election Commission’s mandate; however, he cited Article 254 of the Constitution saying that anything not done within the prescribed period was not tantamount to being unconstitutional or illegal.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:53:13.139Z"
}
