{
  "title": "SC adjourns hearing of pleas against trial of civilians in military courts till Wednesday",
  "link": "https://www.app.com.pk/national/sc-adjourns-hearing-of-pleas-against-trial-of-civilians-in-military-courts-till-wednesday/",
  "date_published": "2023-07-18T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 18 (APP): The Supreme Court on Tuesday adjourned hearing of pleas challenging the trial of civilians in the country’s military courts till Wednesday.\nA six-member larger bench of the apex court headed by Chief Justice of Pakistan Umar Ata Bandial and comprising Justice Ijaz Ul Ahsan, Justice Munib Akhtar, Justice Yahya Afridi, Justice Sayyed Mazahar Ali Akbar Naqvi and Justice Ayesha A Malik heard the petitions filed by former CJP Jawwad S. Khawaja, senior lawyer Aitzaz Ahsan, Karamat Ali, and Pakistan Tehreek-e-Insaf chairman.\nDuring the course of proceedings, the court rejected the Federal Government’s request to constitute a full court bench to hear the pleas.\nThe CJP observed that it was not possible to form a full court as judges were not available.\nSupreme Court Bar Association (SCBA) President Abid Zuberi said he had submitted a detailed response. He was representing the SCBA and would assist the court on five points.\nHe said that the apex court had decided in the Liaqat Hussain case that civilians could not be tried in military courts. He cited the judgement by ex-CJP Ajmal Mian that only military personnel could be tried under army laws, and that a constitutional amendment was needed to try civilians under the Army Act.\nHe said that the courts had ruled that suspects could only be tried if they were directly linked with the crime.\nJustice Ijaz Ul Ahsan said the Liaqat Hussain case was tried without introducing a constitutional amendment.\nHe asked if a constitutional amendment was needed if it concerned the army’s internal matters.\nCJP Bandial said the ruling in the Liaqat Hussain case stated that military authorities could investigate but not conduct the trial of civilians.\nHe asked Zuberi to summarise his position. He also asked what would happen if the suspect were proven to be linked to the crime.\nAbid Zuberi responded that a trial was only possible through a constitutional amendment in the current situation. The Official Secrets Act was invoked against some suspects involved in the May 9 violence but not against the others, he added.\nHe said that while the 21st Constitutional Amendment had allowed for the establishment of military courts, it had also allowed for a judicial review in the high courts and SC.\nUpon this, Justice Afridi asked whether he was saying that police should first take the accused to regular courts and have them charged before taking them to military courts.\nZuberi said that according to the law, a person was not a criminal until they were charged with the crime.\nJustice Ijaz Ahsan asked who would decide when the Army Act was applicable and when it was not.\nZuberi replied that the police was responsible for investigating and would decide as he wrapped up his arguments.\nAttorney General for Pakistan Mansoor Usman Awan said that petitioners’ counsel had talked about the 21st Amendment, the Liaqat Hussain and Brigadier F.B. Ali cases.\nHe said that a full court had decided the petitions against the 21st Amendment and called for doing the same in this case. A full court bench consisting of the judges who were available, should be constituted, he added.\nAt this, Justice Ayesha asked who would decide which judges were available.\nJustice Akhtar said that the current bench had heard the case to a large extent and urged the AGP to continue his arguments.\nSubsequently, the government’s request for constituting a full court bench was rejected and the hearing was adjourned.",
  "retrievedAt": "2025-08-11T08:56:28.948Z"
}
