{
  "title": "IIUI President calls on education minister",
  "link": "https://www.app.com.pk/national/iiui-president-calls-on-education-minister/",
  "date_published": "2023-07-18T14:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 18 (APP): President, International Islamic University, Islamabad (IIUI), Dr. Hathal Homoud Alotaibi, Tuesday, called on Federal Minister for Education and Professional Training, Rana Tanveer Hussain.\nDuring the meeting, issues of mutual interests including initiatives for the promotion of quality education and the role of universities in society building were discussed.\nThe minister desired that the university having two internationally reputed faculties of Shariah and Law and Arabic can help Pakistani job seekers in the Arab world.\nThe IIUI President said that the university will be happy to introduce Arabic language and refresher legal courses in this regard and it will be keen to expand its bilateral ties across the country with the rest of the universities through its international-level Arabic faculty.\nThe minister, while appreciating the role of IIUI in society building and services, assured of maximum support to IIUI.\nHe said universities must be given opportunities for linkages. He said that universities must promote exchange of experiences through mutual cooperation.\nTalking about bilateral relations, the minister said that Pakistan gave great importance to relations with Saudi Arabia as both are time-tested friends.\nHe added that brotherly ties between Pakistan and Saudi Arabia are getting stronger with every passing day.\nThe minister also appreciated the role of the university leadership in its progress and appreciated the keen interest of the Pro-chancellor of the university Prof. Dr Ahmed bin Salem Al Ameri.\nHe also appreciated the IIUI President for making IIUI a peaceful true educational institution where officials and students have a prime focus on education.\nOn the occasion, IIUI President invited the honourable minister for the opening of the newly established state-of-the-art academic block with the funds provided by the Saudi government. He also apprised him of the university’s new journey to infrastructural development and academic excellence.\nDr. Hathal told that the university in the previous three years has made a meaningful advancement in rankings. He added that the university has raised two new faculties, two new academic blocks have been built and two more are in the pipeline.\nHe told that the university is focusing on preparing a skilled youth equipped with the knowledge of the latest market trends.\nHe also apprised of the university’s initiatives towards digitization, distance learning and utilization of modern technology for the students facilitation.\nIIUI President briefed the minister on IIUI’s vision, future plans and strategy for academic excellence. IIUI President vowed that he will be in the leading ranks to seek guidance and extend cooperation with the ministry as per the aspirations of the minister for improvements in higher education.",
  "retrievedAt": "2025-08-11T08:56:29.850Z"
}
