{
  "title": "President for increasing, diversifying Pakistan-Brunei trade, economic relations",
  "link": "https://www.app.com.pk/national/president-for-increasing-diversifying-pakistan-brunei-trade-economic-relations/",
  "date_published": "2021-03-24T15:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):President Dr Arif Alvi on Wednesday underlined the need for increasing and diversifying trade and economic relations between Pakistan and Brunei Darussalam for mutual benefit.\nHe was talking to the outgoing High Commissioner of Brunei Darussalam, Brigadier General (R) Dato Mahmud Saidin, who called on him here at Aiwan-e-Sadr.\nThe President said that Pakistan and Brunei Darussalam were enjoying excellent relations which were deeply rooted in shared values, religious commonalities as well as shared aspirations for global peace and stability.\nHe added that Pakistan had a strong agriculture sector and Brunei could benefit from Pakistan’s expertise in this sector.\nThe President expressed satisfaction over the fact that Pak-Brunei Investment Company, a joint venture between the government of Pakistan and Brunei Investment Agency, was playing a major role in the country’s economic progress by providing an entire range of advisory services as well as financial support to viable business projects.\nHe highlighted the role of Pakistani doctors who were contributing to the well-being of the people of Brunei Darussalam.\nThe President also appreciated the services of the outgoing High Commissioner for strengthening bilateral ties as well as promoting economic relations between the two brotherly countries.\nHe emphasized the need for promoting people-to-people contacts as well as cultural exchanges that would greatly help in bringing the two countries further closer.\nBrigadier General (R) Dato Mahmud Saidin highly praised the services of Pakistani doctors who had been doing commendable job for the welfare of people in Brunei, particularly during the Covid-19 pandemic.",
  "retrievedAt": "2025-08-11T20:32:30.349Z"
}
