{
  "title": "CM announces development projects worth Rs 8.41 bln in Gurjanwala",
  "link": "https://www.app.com.pk/national/cm-announces-development-projects-worth-rs-8-41-bln-in-gurjanwala/",
  "date_published": "2021-03-24T16:10:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 24 (APP):Punjab Chief Minister Sardar Usman Buzdar visited Gujranwala on Wednesday and announced new development projects worth 8.41 billion along with the establishment of a university.\nTalking to media Chief Minister Usman Buzdar announced new projects including a flyover at Alam Chowk ,as well as internal and external link roads in the city.\nHe announced that 14 more projects will be started including a burn unit with estimated cost of Rs. 1.92 billion. He also announced University of Gujranwala project with sub-campuses of Punjab University and UET, said a handout issued here. “The necessary process has already been started and I will monitor this project”, the CM added.\nMeanwhile, the federal government will also be approached for improvement of GT Road. He also announced that a road will be constructed to link Gujranwala with Sialkot-Lahore Motorway.\nBriefing the media about steps for public welfare, the CM said Sahulat Bazaars will be established at the level of tehsil and food items will be provided at the rates of 2018 in Ramazan Bazaars.\nTo a question referring to PML-N stance, he termed it improper to take processions to institutions and asserted that law will come into action over ‘any violation of law’.\nThe CM inaugurated four projects of 7.84 billion at Ghakar Sports Arena. He also inaugurated Ghakar Sports Arena, Gujranwala Arts Council Auditorium, OPD unit of teaching hospital medical college Gujranwala and 62.5 acre landfill site project.\nHe handed over keys of 106 vehicles of Gujranwala Waste Management Company to officials and laid the foundation stone of BS Block in Government Postgraduate College for Women, Shadab Training Institute and building of Special Education Centre Kamoke worth Rs 2. 23 billion.\nThe Lahore-Sialkot Motorway will be linked with GT Road at Morr Eminabad,it was learnt. Chief Minister said, ” I will visit every nook and corner of the province to take steps for the betterment of the province”.\nEarlier, CM Buzdar met PTI leader Hamid Nasir Chattha and discussed development agenda of PTI government. He also held meetings with different delegations including PML-N MPA Ashraf Ansari and Younis Ansari and assured to resolve problems of the city.",
  "retrievedAt": "2025-08-11T20:32:29.723Z"
}
