{
  "article_id": "2025-01-11_f92f1eb1ab75d1e70f6d3a806451af70",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-hopeful-about-outcome-of-intl-conference-on-girls-education/",
    "retrieved_at": "2025-08-27T11:33:08.643Z"
  },
  "metadata": {
    "title": "PM hopeful about outcome of Int’l Conference on Girls’ Education",
    "author": null,
    "date_published": "2025-01-11T11:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 301,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 11 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday expressed his optimism that the current ongoing international conference on girls' education in Islamabad would go a long way and help them put their acts together to promote education among females in the Islamic countries. Addressing a meeting of the visiting ministers and authorities of education from various Muslim countries, the prime minister expressed gratitude to them for their participation in the conference of high importance in the present-day challenges. He said Pakistan faced different challenges in promoting education for girls. Around 22.8 million children in the country were out of schools and majority among them were girls, he added. The prime minister referred to his earlier speech in the conference wherein he had highlighted the significance of female education as emphasised upon by the Islamic teachings and the instructions of the Holy Prophet (Peace Be Upon Him). He said that they were ready to share their experience with the relevant authorities in the education sector, adding a committee had been formed in the country over reforms in this sector which was also coordinating with all the provinces. Speaking on the occasion, Deputy Prime Minister/ Foreign Minister Mohammad Ishaq Dar said that the government had undertaken a number of reforms in the education sector. Their goals were compatible with the funding and the budget allocation. He said that they were looking forward to working with the Muslim countries in future. Federal ministers, secretaries and senior officials were also present in the meeting. Representatives, ministers from Turkiye, Somalia, Kurdistan, Malaysia and Maldives also spoke on the occasion and thanked the government of Pakistan for the warm hospitality and taking initiative in the female education sector and bringing the Muslim countries to share their expertise and ensuring promotion of education for girls.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}