{
  "article_id": "2025-01-11_68e44f48d19964d726b4bd1224d6e99f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dr-mukhtar-for-making-joint-efforts-against-hcv/",
    "retrieved_at": "2025-08-27T11:32:57.456Z"
  },
  "metadata": {
    "title": "Dr Mukhtar for making joint efforts against HCV",
    "author": null,
    "date_published": "2025-01-11T14:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 439,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 11 (APP):Coordinator to the Prime Minister on National Health Services Regulations and Coordination, Dr. Malik Mukhtar Ahmad Bharath on Saturday stressed the urgent need for collective action to combat Hepatitis C (HCV). Addressing a seminar on Hepatitis Elimination organized by the Health Foundation, Dr Mukhtar said that Hepatitis C is a significant public health challenge facing Pakistan. He said, \"Pakistan has the largest population of Hepatitis C patients in the world, with 10 million of the global 60 million cases. This places us at the heart of the global effort to eliminate this disease,\" he said. He highlighted the dire consequences if action is not taken. \"If we do not act, Pakistan will face over 11 million HCV cases by 2035, leading to over 500,000 liver cirrhosis cases, 100,000 cases of liver cancer, and 130,000 HCV-related deaths. The economic impact would be a loss of over $285 million annually, he added. Dr. Bharath pointed out that as of 2021, only 16% of Hepatitis C cases in the country had received treatment, with testing and treatment access being the key challenges. He added to address these challenges, the federal government, in collaboration with provincial governments, has launched the Prime Minister's Programme for the Elimination of Hepatitis C (HCV) Infection, which is allocated Rs 34.15 billion over the next three years. In addition, provincial governments will contribute Rs 33.61 billion, bringing the total funding for the initiative to Rs 67.77 billion. \"Pakistan has made significant strides toward Hepatitis elimination,\" Dr. Bharath shared, \"including establishing a National Technical Advisory Group (TAG) for Hepatitis control, developing national and provincial strategic frameworks, ensuring the availability of affordable generic Direct-Acting Antivirals (DAAs), and advocating for nationwide scaling up of vaccination, screening, testing, and treatment efforts.\" He stressed that further support and technical assistance are needed to scale up efforts. \"We seek support in developing detailed plans for Hepatitis elimination, strengthening monitoring and healthcare systems, training healthcare workers, and expanding national software and logistics. We also call for international collaboration to help us achieve our targets,\" he added. He said that the Prime Minister's Programme aims to reach 50% of the eligible population for screening, testing, and treatment within three years. Dr. Bharath urged international partners to help Pakistan achieve 100% coverage, thus ensuring that the country meets the global HCV elimination targets before 2030. Dr. Bharath emphasized the importance of collective action. \"Hepatitis elimination is a national priority, but it requires the combined efforts of the government, international partners, civil society organizations, and non-governmental organizations.\" He added, \"Together, we can overcome this challenge and work towards a healthier, prosperous future for all Pakistanis.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}