{
  "article_id": "2025-08-08_05d6f8c04c6521bc9a50cae097160639",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/coied-disposes-of-70-complaints-of-missing-persons-after-reconstitution-of-commission/",
    "retrieved_at": "2025-08-10T10:25:23.680Z"
  },
  "metadata": {
    "title": "CoIED disposes of 70 complaints of missing persons after reconstitution of commission",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 254,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 08 (APP):The Commission of Inquiry on Enforced Disappearances (CoIED) has disposed of 70 cases of missing persons while registering 15 new complaints in the month of July after Justice (reted) Syed Arshad Hussain Shah assumed office as chairman of the commission. The commission has disposed of a total of 8,770 cases of missing persons out of 10,607 till July 31. Federal government had reconstituted CoIED and after the assumption of office of Justice (retd) Syed Arshad Hussain Shah has taken key steps to resolve the issue of missing persons. As per the report, Justice (reted) Syed Arshad Hussain Shah presided over two meetings of the committee set up to submit recommendations on cases of financial assistance to the federal government. The federal government Justice (retd) Nazar Akbar appointed as Member Sindh and Retd Judge Muhammad Bashir as Member Islamabad. To deal with cases of alleged enforced disappearances Justice (R) Syed Afsar Shah appointed as member of Khyber Pakhtunkhwa The commission stressed need for formulation of uniform policy for investigation and speedy disposal of cases of disappearances. The commission chairman had made visits of Lahore and Karachi to formulate regulations for redressal of disappearances. He heard more than 50 cases during said visits. Chairman Justice (R) Syed Arshad Hussain Shah also hold meeting with home secretaries and IGs of Police of Punjab, Khyber Pakhtunkhwa, Islamabad and Sindh The chairman had stressed timely submission of comprehensive reports of joint investigation teams and provincial task forces of all provinces, Islamabad and Azad Jammu and Kashmir.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}