{
  "article_id": "2025-08-08_cfed5005f47ad33828da2f851f500afc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mohsin-naqvi-pays-glowing-tribute-to-hero-of-the-battle-of-lakshmipur-major-tufail-muhammad-shaheed/",
    "retrieved_at": "2025-08-10T10:36:14.074Z"
  },
  "metadata": {
    "title": "Mohsin Naqvi pays glowing tribute to hero of the Battle of Lakshmipur Major Tufail Muhammad Shaheed",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 285,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 08 (APP): On the occasion of the martyrdom anniversary of Major Tufail Muhammad Shaheed, Federal Minister for Interior Mohsin Naqvi has said that on August 8, Major Tufail Muhammad Shaheed wrote a glorious chapter of bravery and courage with his precious blood, adding that he thwarted the enemy's nefarious designs and brought honor to the national Flag. The Interior Minister said the recipient of Nishan-e-Haider, a great soldier, struck the enemy deep within its own ranks. He highlighted that Major Tufail Muhammad Shaheed, while facing enemy bullets, led his battalion and set an everlasting example of courage. He stated that despite being wounded, he did not halt his advance and forced the enemy to retreat. Mohsin Naqvi said that this great moment of unmatched valor will forever teach our future generations the lessons of resolve and bravery. He underscored that the nation salutes Major Tufail Muhammad Shaheed, who stood at the forefront and changed the course of the battle. Interior Minister stated that the last words of Major Tufail Muhammad Shaheed, \"I have completed my mission, the enemy has fled,\" remain today the battle cry of every soldier of the motherland. He further emphasized that under the fearless command of Field Marshal Syed Asim Munir during the Pakistan-India war, these golden words resonated on every battlefield, compelling the enemy to suffer humiliation on every front. In the recent war, every soldier fought like Major Tufail Muhammad Shaheed, and by the grace of Almighty Allah, the nation was granted a remarkable victory, he added. The Federal Minister concluded by saluting Major Tufail Muhammad Shaheed, who delivered a crushing response to the enemy, and said that this courageous nation will forever remember his eternal sacrifice.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}