{
  "article_id": "2025-08-08_320f580b495d2cb569b2aac6e140aa16",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/annual-urs-of-hazrat-bari-imam-underway-amid-tight-security-food-safety-checks/",
    "retrieved_at": "2025-08-10T10:01:05.336Z"
  },
  "metadata": {
    "title": "Annual Urs of Hazrat Bari Imam underway amid tight security, food safety checks",
    "author": null,
    "date_published": "2025-08-10T14:48:31+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 315,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 08 (APP): The 320th three-day annual Urs of Hazrat Shah Abdul Latif Kazmi, also known as Hazrat Bari Imam, underway at the Bari Imam shrine in Islamabad with thousands of devotees expected to attend over the coming days. In this regard, the Islamabad Capital Territory (ICT) administration has completed all preparations for the annual Urs of Hazrat Bari Imam. The plan covers security, sanitation, parking, and food safety.Best restaurants near me Meanwhile, Deputy Commissioner (DC) Islamabad, Irfan Nawaz Memon, inspected the arrangements along with Additional Deputy Commissioner General and Assistant Commissioners. Their review included security deployment, lighting, water supply, sanitation, parking areas, and the organization of the Langar, the free meal service at the shrine. According to the ICT administration, walk-through gates have been installed at entry and exit points, while additional police and district staff are deployed for crowd control. DC Memon also monitored CCTV coverage and conducted security checks across the site. Similarly, the Islamabad Food Authority (IFA) is overseeing food quality at Langars, Sabeels, and stalls during the Urs. Teams are inspecting preparation areas to ensure hygiene and compliance with safety standards. IFA Deputy Director Dr. Tahira Siddique said food handlers had been directed to avoid prohibited ingredients, use only approved items, cover meals, and prepare them with filtered water. \"There will be no compromise on food quality,\" she said. Furthermore, Rescue 1122 teams and bomb disposal squads are on standby to respond to emergencies. Sanitation workers are deployed to maintain cleanliness, and extra lighting has been installed for night-time activities. Designated parking areas have been set up with shuttle services to the shrine. The annual Urs of Hazrat Bari Imam is among the capital's largest religious gatherings, drawing visitors from across Pakistan for prayers, recitations, and free food distribution. The ICT administration said it would keep strict watch over all arrangements to ensure the event runs smoothly and safely.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}