{
  "article_id": "2025-08-08_ee41c201350d7d96f08814a116341533",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tarar-flags-off-18th-pakistani-aid-consignment-to-gaza/",
    "retrieved_at": "2025-08-10T10:36:16.228Z"
  },
  "metadata": {
    "title": "Tarar flags off 18th Pakistani aid consignment to Gaza",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 195,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 08 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on Friday sent off Pakistan's 18th humanitarian aid shipment to Gaza, carrying 200 tons of food and medical supplies on the orders of Prime Minister Shehbaz Sharif to help Palestinians facing a deepening humanitarian crisis. Speaking at a ceremony at Islamabad International Airport, Tarar said the two consignments - each weighing 100 tons - contained dry rations, essential food items, and life-saving medicines. He stressed that the aid was being sent at a time when the blockade had prevented many international agencies from delivering much-needed relief to Gaza. \"Children and innocent civilians are suffering from malnutrition, and the situation is a great humanitarian crisis,\" the minister told media. Tarar highlighted that Pakistan has so far dispatched 1,800 tons of humanitarian assistance to Gaza since the escalation of hostilities. He commended the Al-Khidmat Foundation and Jamaat-e-Islami leadership for their contributions and for consistently raising the plight of Palestinians on various platforms. Reaffirming Pakistan's commitment to stand \"shoulder to shoulder\" with the people of Palestine, Tarar said the National Disaster Management Authority acted on the prime minister's directive to ensure the urgent delivery of aid.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}