{
  "article_id": "2025-08-08_135208ee6b3f3cc5fb828ad7377ac97a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tarar-slams-indian-media-calls-for-unified-response-to-misinformation/",
    "retrieved_at": "2025-08-10T10:25:17.729Z"
  },
  "metadata": {
    "title": "Tarar slams Indian media, calls for unified response to misinformation",
    "author": null,
    "date_published": "2025-08-10T15:18:01+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 458,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 08 (APP): Minister for Information and Broadcasting Attaullah Tarar on Friday strongly criticized the Indian media for spreading disinformation, asserting that Pakistan's Parliament, armed forces, media, and the nation had delivered a unified and resolute response to Indian aggression. Speaking during question hour in the National Assembly, Tarar responded to a query raised by MNA Sharmila Faruqui and lauded Parliament's role in Operation Bunyaan Marsus. He said a clear message was sent to the enemy from the floor of the House, that the Parliament of Pakistan stands firmly with its armed forces. Referring to false claims by Indian media that the ports of Lahore and Multan had been destroyed, Tarar said Pakistan's collective response effectively countered the disinformation, demonstrating that media ethics continue to hold ground in the country. He commended both government and opposition members for effectively presenting Pakistan's narrative across national television platforms, noting that media houses played a key role in shaping the domestic discourse, which enabled Pakistan to engage confidently on international media fronts. Tarar also acknowledged the contribution of Pakistan Peoples Party Chairman Bilawal Bhutto Zardari, and political parties representatives, who played a pivotal role in articulating Pakistan's position on global media platforms. The minister emphasized that combating misinformation is now a global priority, citing discussions at the World Economic Forum where international leaders identified disinformation as one of the defining challenges of the time. He noted that the issue has become significantly more complex with the rise of artificial intelligence. To address these challenges, Tarar said the Ministry of Information has launched the Fact Checker Twitter handle and amended its 1970 rules to establish Pakistan's first Digital Communication Department, equipped with modern software to ensure timely and accurate public messaging. He added that state-run media organizations-including Pakistan Broadcasting Corporation (PBC), Pakistan Television (PTV), the Associated Press of Pakistan (APP), and the Press Information Department (PID)-have developed robust systems to actively counter misinformation. He highlighted the launch of Fake News Buster, an English-language program on PTV World aimed at exposing Indian propaganda, which he said lacks a commitment to truth. Tarar stressed the need for a national alliance to expand efforts against disinformation, stating that while research is underway to identify false narratives, it is not enough. He called for coordinated action across the Ministries of Information Technology, Information, and Law to address challenges on both domestic and international fronts. To institutionalize these efforts, Tarar proposed the formation of a parliamentary committee and urged opposition members to participate constructively. He said that if the committee delivers strong recommendations, the credit would rightly belong to the National Assembly. Responding to the proposal, National Assembly Speaker Sardar Ayaz Sadiq assured that the matter would be taken up in the Ministry of Information's committee.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}