{
  "title": "Ahmer Bilal Soofi’s ‘Quranic Covenants launched to decipher divine themes",
  "link": "https://www.app.com.pk/national/ahmer-bilal-soofis-quranic-covenants-launched-to-decipher-divine-themes/",
  "date_published": "2024-05-16T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): The book titled ‘Quranic Covenants: An Introduction,’ authored by eminent international lawyer Ahmer Bilal Soofi was launched here at the Islamabad Policy Research Institute (IPRI) on Thursday and intended to decipher divine themes.\nThe book is a debut work on summarizing the themes and concepts of the divine book, the Holy Quran, by reading and deciphering it through Covenants, a news release said.\nAhmer Bilal Soofi pointed out that he undertook this work after coming across observations at a panel of OIC, wherein the need was felt for a researched collection of covenants of the Quran, to better understand the injunctions of the Almighty and take a retrospective look at all religions and societies.\nIt was also considered ideal to study the causes of revulsion and deradicalization of the society. He said the concept of Jihad (holy war) also talks of intervention in rescuing people, and not in maiming them.\nThe author noted that Holy Prophet Muhammad (PBUH) himself was a role model, and was instrumental as an international lawyer.\nHis agreements, deeds, and covenants signed were state-of-the-art legislation and are relevant to this day. He talked about believers’ thoughts and the modern law and pointed out the need for understanding the Quran from that perspective too. “Almighty had legislated on select major issues, and had left the rest on consensual adaptation of society,” he remarked.\nHe said the Covenant is one of the basic structural features of Quran and is a declaration between the Almighty and His creation.\nThe two distinguishing aspects of Covenants are “In Quran and Under Quran.”  It is as Ordained by Allah, and Under is as proscribed by Quran.\n“Under Quran, covenants are trilateral between Allah and two human parties concerned in any society, and this makes Quran part of our everyday life as it ushers in a social contract under divinity.”\nHe regretted that this connection somehow has been de-emphasized by us, and this is why society is chaotic.  He said that words such as Ahad and Mishaq were used by Quran.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:32:29.775Z"
}
