{
  "title": "PM orders policy on financial security for sportsmen through jobs in departments",
  "link": "https://www.app.com.pk/national/pm-orders-policy-on-financial-security-for-sportsmen-through-jobs-in-departments/",
  "date_published": "2024-05-16T09:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): Prime Minister Shehbaz Sharif on Thursday directed formulation of a policy to employ athletes through departments to ensure their financial security and promote sports in the country.\nHe tasked Chairman of the Prime Minister’s Youth Programme Rana Mashhood to personally oversee the policy and ensure its implementation within one week.\nThe prime minister was addressing an event held to celebrate the achievement of Pakistan hockey team that recently won silver medal in the final of 30th Sultan Azlan Shah Cup 2024 in Malaysia.\nPM Sharif said jobs for athletes would free them from the struggles of earning livelihood, thus helping them to focus on their sports.\nHe lauded the outstanding performance of the national hockey team, terming it a step to revive the glory of national sport.\nHe said the hockey team had won the hearts of the entire nation, adding that winning or losing was part of the game.\n“The way you came up with a challenging and competing spirit in the final shows a high potential of several victories in future,” he told the hockey team as Pakistan made it to the final of Azlan Shah Cup after 13 years.\nPM Sharif said the government was taking steps to promote sports in the country with a special focus on hockey. The renewed interest in hockey throughout Pakistan signalled a promising trend for future, he added.\n“The days are not far when the glory of hockey will be revived in Pakistan and we will have more legends like Islahuddin, Samiullah and Shahbaz,” he said.\nHe appreciated the hard work of team, coaches and officials of sports board. He announced to soon invite the relevant officials from sports board to discuss ways for the revival of hockey in the country.\nThe prime minister gave away cheques to the players of hockey team as a token of appreciation.\nCaptain of national hockey team Ammad Shakil Butt expressed his passion to keep up the spirit of his team and bring more laurels to the country.\nHockey legends including ‘Flying horse’ Samiullah, Olympian Islahuddin and Shahbaz Ahmed on the occasion lauded the keen interest of PM Shehbaz Sharif for the promotion of national sport in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:32:38.108Z"
}
