{
  "title": "Ethiopia, Pakistan agree to collaborate in education sector",
  "link": "https://www.app.com.pk/national/ethiopia-pakistan-agree-to-collaborate-in-education-sector/",
  "date_published": "2024-05-16T12:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP):Ethiopia and Pakistan on Thursday agreed to collaborate in diverse sectors of education including science and technology, agriculture, health and Information and Communication Technology.\nBoth sides reached this consensus during a meeting between Special Envoy and Ambassador Extraordinary and Plenipotentiary of Ethiopia, Jemal Beker Abdula and Chairman of the Higher Education Commission (HEC), Dr Mukhtar Ahmed.\nThe meeting discussed the modalities to advance mutual cooperation in the education sector to exchange knowledge, skills and expertise.\nAmbassador Jemal Beker said the Ethiopian government was keen to strengthen the already flourishing bilateral ties between the two nations through education diplomacy. “Collaboration in the education sector can be instrumental for establishing long-lasting and sustainable relations between the two countries,” he said while recalling the eagerness of the Ethiopian medical experts.\nHe said a delegation from a top-class university in Ethiopia had visited Pakistan in 2023 showing there is a strong appetite in Ethiopia for establishing institution-to-institution collaboration between the two countries.\nThe Ambassador briefed the HEC chairman on a plantation campaign led by the Ethiopian Embassy in collaboration with the Ministry of Climate Change, universities, civil society and business community across Pakistan under the Green Legacy Initiative of Prime Minister of Ethiopia, Dr Abiy Ahmed for fostering fraternity between the two great nations.\nOn the other side, the HEC chairman briefed the ambassador on advancement and digitalisation in the education sector which included the establishment of digital libraries and smart classrooms giving access to education to the millions of students in Pakistan and abroad. He assured the ambassador of all-out support for strengthening cooperation and collaboration in the education sector between Ethiopia and Pakistan.\nThe HEC chairman also extended an invitation to the ambassador to visit the HEC Headquarters and also requested for facilitating delegations exchange between the two countries for further collaboration in the education sector. “Let us help each other in the education sector to build strong nations together for global prosperity,” he remarked.\nHe informed the ambassador about the opening of Global Engagement Department at HEC which would have a desk for Africa with a special focus on Ethiopia.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:32:34.037Z"
}
