{
  "title": "Pakistan, UK resolve to enhance coordination on arms control, disarmament & non-proliferation",
  "link": "https://www.app.com.pk/national/pakistan-uk-resolve-to-enhance-coordination-on-arms-control-disarmament-non-proliferation/",
  "date_published": "2024-05-16T14:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): Pakistan and the United Kingdom have expressed their commitment to further enhance coordination on multilateral fora on matters relating to arms control, disarmament & non-proliferation.\nThe commitment was expressed during the 6th Round of Pakistan –UK Dialogue on Arms Control & Non-Proliferation held here on Wednesday (May 15), a press release issued by the Foreign Office said on Thursday.\nAdditional Foreign Secretary (Arms Control & Disarmament), Ambassador Mohammad Kamran Akhtar, and Director, Defence and International Security at the Foreign, Commonwealth and Development Office (FCDO), United Kingdom, Ambassador Stephen Lillie, led their respective delegations.\nA broad spectrum of topics relating to arms control, disarmament and non-proliferation came under discussion during the dialogue. Both sides also shared their perspectives on issues concerning global and regional security, new and emerging technologies, including the military use of artificial intelligence and the peaceful applications of nuclear technology.\nThe discussions encompassed matters pertaining to the agenda of the First Committee of the UN General Assembly, the Conference on Disarmament, as well as the International Atomic Energy Agency (IAEA) and the Organization for the Prohibition of Chemical Weapons (OPCW).\nWhile reiterating the need to ensure continuity in the conduct of the dialogue, the two sides agreed to hold the 7th round of Consultations next year in London on a mutually agreed date.\nThe dialogue is a regular feature of Pakistan-UK bilateral interactions and provides an opportunity to both countries to take stock of global arms control and disarmament landscape and to exchange views on regional and global security situation.",
  "retrievedAt": "2025-08-11T02:32:32.988Z"
}
