{
  "title": "Jazz invests Rs 5.3b to strengthen Pakistan’s digital infrastructure",
  "link": "https://www.app.com.pk/national/jazz-invests-rs-5-3b-to-strengthen-pakistans-digital-infrastructure/",
  "date_published": "2024-05-16T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): Jazz, Pakistan’s leading digital operator, invested over Rs 5.3 billion to further strengthen the digital ecosystem across fintech, cloud services and digital entertainment verticals in the first quarter of 2024, taking its overall investment in the country to $10.6 billion.\nA substantial portion of Jazz’s capital expenditure in the quarter was allocated towards network expansion and upgradation, said a news release.  This resulted in a significant increase in the 4G customer base to 45.9 million.\nOverall, the subscriber base reached 71.7 million, with monthly active users across its digital platforms reaching 67 million.\nFurthermore, Jazz emerged as the largest Voice over LTE (VoLTE) network in the region, boasting over 23 million daily active VoLTE customers. The introduction of JazzFi, allowing users to communicate over Wi-Fi connections, garnered over 4 million users within months of its launching.\nCommenting on the strategy, Jazz CEO Aamir Ibrahim said, “we are expanding the outreach and capacity of our 4G network, especially in semi-urban and rural areas, we are also serving as our customers’ digital lifestyle partner with platform Tamasha; driving financial inclusion with Pakistan’s leading fintech JazzCash; and bolstering our cloud & cyber-security offering through Garaj.\nThe growing engagement levels across all our platforms, and the fact that more than 42% of the industry-wide 4G subscriptions in the quarter were contributed by Jazz, validate our customer-centric operating model.\nWe’re also venturing into EdTech, HealthTech, and tackling the ‘AI language gap’ by developing Gen AI-powered Urdu language models and creating locally relevant AI applications, all with the goal of providing a more comprehensive and accessible digital experience for our customers.”\nThe performance of Jazz’s digital services during the quarter solidified its position as the country’s leading digital operator. Boasting a customer base of 44 million with a 30 per cent representation of women, Pakistan’s leading fintech JazzCash achieved 89 percent YoY revenue surge driven by a Gross Transaction Value during the reporting period.\nJazzCash’s extensive network, comprising 240,000 registered agents and over 300,000 registered merchants, facilitated considerable digitalization of society and payment/loan services, effectively transforming Pakistan’s financial landscape.\nPakistan’s leading entertainment platform, Tamasha, reached 12 million MAUs. Its revenue doubled YoY driven by AdTech during the Pakistan Super League cricket matches in the quarter. In tandem, Jazz’s cloud platform, Garaj, also saw considerable growth, enabling over 100 enterprises with cutting-edge cloud and cybersecurity solutions.\nIt also recently achieved Premier status of VMware Cloud Services by Broadcom, offering enterprise customers industry-leading security and scalability for their business-critical infrastructure. Moreover, the self-care and lifestyle app SIMOSA (formerly JazzWorld) increased to 14.9 million MAUs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:32:55.701Z"
}
