{
  "title": "India rushes to evacuate personnel from Kabul, Kandahar, as Taliban advances continue",
  "link": "https://www.app.com.pk/national/india-rushes-to-evacuate-personnel-from-kabul-kandahar-as-taliban-advances-continue/",
  "date_published": "2021-07-11T13:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 11 (APP): With the rapid advance of the Taliban towards the capital Kabul and the failure of the Indian government to find a sweet spot with them, the Narendra Modi regime has been left with little option but to order an evacuation of its staff from Afghanistan.\nA high-level security official confirmed news reports about the evacuation of the Indian officials from its various consulates spread across Afghanistan. The staff leaving the Afghan Consulates comprises of a few diplomats and a large number of Research and Analysis Wing operatives, working on cover positions.\nPakistan presented to the world “irrefutable evidence“ in the shape of a dossier comprising translated letters, supply chain of weapons and equipment, telephonic conversations, video recordings and funding details from banks in India to the terrorists in Pakistan, in November last year.\nEvidence was also given about Indian sponsored 66 training camps in Afghanistan for carrying out subversive activities inside Pakistan. Both Afghanistan and India had refuted, however, they failed to come up with any satisfactory answer.\n“Uncontrivable evidence reveals that Indian embassies and consulates operating along Pakistan’s borders have become the hub of terror sponsorship against Pakistan,” the spokesman of Pakistan Army Major-General Babar Iftikhar said at a press conference addressed along with Foreign Minister Shah Mehmood Qureshi.\nA senior Pakistani security official confirmed reports that the Indian Air Force C17 Globemaster aircraft were being used to evacuate staff from Kandahar and Kabul to Hindon Air Force Station, in Uttar Pradesh India. The Indian aircraft have to use longer air routes to avoid Pakistan air space.\nevacuates Indian staff from Kandahar consulate.\nAn IAF aircraft took off from Delhi and brought back Indian personnel. @avarakai pic.twitter.com/7mqWtnj368\n— Ashish Singh (@AshishSinghNews) July 11, 2021\nIndian media also reported the flurry of activity for the evacuation of its personnel. India Today reported that the country has pulled around 50 Indian diplomats and security officials posted in its consulate in Kandahar in view of the “deteriorating security situation “in Afghanistan and the Taliban gaining control of new areas around the southern Afghan city.\nForeign Policy experts termed it yet another nail in the coffin of the Narendra Modi government which has repeatedly failed at every front, be it the handling of the covid pandemic, India’s foreign policy or Afghanistan.\nThe hurried departures speak of India’s failed strategy to use the American security umbrella for its dirty operations in Afghanistan. With the departure of the American troops from Afghanistan, India once again stands exposed.\nIndia has already invested nearly USD three billion in aid and reconstruction activities in the country, however, all this effort seem to have gone to waste as the US plans to complete withdrawal of its forces from Afghanistan by the end of August, ending its almost two-decade military presence in the war-ravaged country.\nThe Indian embassy at Kabul had warned its citizens of the worsening security situation and directed them to take utmost care.\nIndian Ministry of External Affairs official spokesperson Arindam Bagchi claimed the mission at Kandahar was ‘not closed’ and shifting of the staff was “a purely temporary measure”.\n“The Consulate General of India in Kandahar has not been closed. However, due to the intense fighting near Kandahar city, India based personnel have been brought back for the time being,” the spokesman said.\nOur response to media queries on the Indian Consulate in Kandahar:  https://t.co/aQ0YPgl6Vf pic.twitter.com/DAPT3kYdM4\n— Arindam Bagchi (@MEAIndia) July 11, 2021\nThe security official said the decision to leave the Afghan soil came after the negotiations failed between the Indian government and the Taliban.\nALSO READ: Exposed on backing terror outfits, Indian FM pays ‘face saving’ trips to Russia, Iran\nHowever, the Indian media did not report that its military aircraft were also airlifting ammunition for Ashraf Ghani’s faltering Afghan National Army and were making last-ditch efforts by rushing in supplies of ammunition to support the ANA against the advancing Taliban forces.\nOn July 10 an Indian airforce aircraft C-17 landed at Kandahar airfield at around midnight and unloaded a lethal cargo of 40 tons of bullets of 122mm cannon.\nCartons of ammunition – 40 tons of bullets for 122mm cannon, brought to Kabul on IAF C17 aircraft from India being loaded on ANA trucks. Another IAF aircraft C-17 arrived at Kabul airfield in the wee hours of Sunday – July 11 and brought another cargo of 40 tons of bullets for 122mm cannon.  The aircraft on their return transport the staff used for covert operations in Afghanistan to the airbases at Uttar Pardesh, Chandigarh and Jaipur.",
  "retrievedAt": "2025-08-11T20:57:28.695Z"
}
