{
  "title": "FM leaves for Tajikistan to attend SCO-CFM",
  "link": "https://www.app.com.pk/national/fm-leaves-for-tajikistan-to-attend-sco-council-meeting/",
  "date_published": "2021-07-11T15:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 11 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi Sunday left for Dushanbe, Tajikistan to attend Shanghai Cooperation Organization (SCO) Council of Foreign Ministers (CFM).\nDuring his three-day visit, the foreign minister will lead Pakistan’s delegation at the SCO-CFM.\nThe invitation to the foreign minister to attend the SCO-CFM was extended by Tajik Foreign Minister Sirojiddin Muhriddin, the host and chair of the meeting.\nThe foreign ministers of all SCO member states will be participating in the SCO-CFM which deliberates on important regional and international issues and considers documents for approval and adoption by the Council of Heads of State.\nThe foreign minister will also participate in the meeting of SCO-Afghanistan Contact Group, being held at the ministerial level.\nHe  will share Pakistan’s perspective on the situation in Afghanistan and stress the imperative of a peaceful, negotiated political solution.\nThe foreign minister will confer extensively with foreign ministers from SCO countries and underscore Pakistan’s efforts in support of the Afghan peace process and durable peace and stability in the region.\nOn the sidelines of the meeting, he is scheduled to meet with his counterparts from Tajikistan, Kyrgyzstan, Uzbekistan, Afghanistan, Russia and China.\nBilateral and regional ties, besides issues of mutual interests would be discussed during these meetings. \nDuring his stay, foreign minister Qureshi will call on President of Tajikistan Emomali Rahmon .\nThe Dushanbe SCO-CFM will consider several important documents for subsequent adoption in the SCO Council of Heads of State in September 2021.\nThe SCO’s major objectives include promoting mutual confidence and good-neighborly relations among member states, strengthening regional peace, security and stability, and create a framework for effective cooperation in the fields of politics, trade and economy, culture, science and technology, education, energy, transportation, tourism, environmental protection etc.\nSCO is an important forum for further enhancement of our deep rooted historical and cultural links with member states, providing these ties a sound economic foundation, and promoting Pakistan as a regional trade and transit corridor.\nSince becoming a member in 2017, Pakistan has been actively contributing towards achieving SCO’s multi-sectoral agenda through participation in various SCO mechanisms.",
  "retrievedAt": "2025-08-11T20:57:25.952Z"
}
