{
  "title": "NAB absolutely committed to bring corrupt to Justice: NAB Chairman",
  "link": "https://www.app.com.pk/national/nab-absolutely-committed-to-bring-corrupt-to-justice-nab-chairman/",
  "date_published": "2021-07-11T16:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): National Accountability Bureau (NAB) is absolutely committed to bring corrupt elements to justice by adopting the “Accountability for All” policy as Corruption is the mother of all evils and a major hurdle in the development and prosperity of the country.\nNAB Chairman Justice (Retd) Javed Iqbal said in a statement that the bureau has no affiliation with any political party, group and individual.\nNAB officials have been directed to perform their duties in accordance with law with the realization that eradication of corruption is their national duty.\nHe said that Pakistan and China have inked Memorandum of Understanding (MoU) for eradication of corruption. Pakistan and China are jointly working for ensuring transparency in China Pakistan economic coordination in the CPEC project.\nHe said that NAB is the focal department under the United Nations Convention against Corruption which is pride for Pakistan. NAB has established a state of the art Pakistan Anti Corruption Training Academy on modern lines to train its investigation officers and Prosecutors in order to inquire/investigate white collar cases more professionally and to plead them very vigorously in the respected Courts on the basis of solid evidence as per law.\nHe said that NAB’s proactive Anti-Corruption Strategy has started yielding positive dividends. Due to its effective anti corruption strategy, NAB has not only recovered Rs. 814 billion looted money from corrupt directly and indirectly since its inception and deposited it in the national exchequer which is a record achievement of any Anti Corruption Organization working in Pakistan.\nNAB’s conviction ratio is about 66 percent. NAB is utilizing all its resources to apprehend Proclaimed Offenders and Absconders to bring them to justice as per law.\nThe NAB Chairman said that there are about 1,273 references under trial in respective Accountability Courts and their approximately worth is Rs 1,300 billion. NAB has conducted probes in 56 public limited companies, probes in offshore companies, Fake Accounts, money laundering and misuse of authority, assets beyond known sources of income and cheating the public at large in illegal Housing/Cooperative Societies and Modaraba scams etc.\nHe said that plea bargains are deemed convictions which are approved by respected Accountability Courts. After a plea bargain, the accused not only accepts his/her guilt in writing before the Court but also returns to its looted money in the national exchequer.\nHe said that NAB has great regard for the business community as they are the backbone of the development of any country. NAB has established special cells for addressing the complaints of the business community related to NAB.\nHe said that NAB also respects bureaucracy and directed all concerned to ensure self respect of all persons visiting NAB offices as per law. He said that NAB during the period of present management of three years has recovered Rs. 533 billion from corrupt elements which is a record achievement.\nThe Chairman said that NAB has established its first Forensic Science Lab (FSL) in NAB and has rationalize its workload and timelines have been prescribed for efficient, effective and expeditious disposal of cases putting a maximum limit of 10 months which is a challenging target to investigate cases of even white collar crimes.\nNAB has also introduced a new System of Combine Investigation Team (CIT) in order to benefit from the experience and collective wisdom of senior supervisory officers, a system of CIT consisting of Director, Additional Director, Investigation Officer and a Senior Legal Counsel has been put in place.\nThis is not only lending quality to the work. He said that the concept of CIT has proved very successful in order to improve the quality of inquiry and investigations and benefit from the experience and collective wisdom of senior officers.\nThe comparative figures for the latest three years are indicative of the hard work being put in by all ranks of NAB staff in an atmosphere of renewed energy and dynamism, where fighting against corruption is being taken as a national duty.\nIncrease in the number of complaints also reflects enhanced public trust in the NAB besides appreciation of reputed national and international organizations about NAB’s excellent performance. NAB’s faith is corruption free Pakistan. Efforts are being made to achieve this goal by putting best of the best efforts with the help of all stakeholders.",
  "retrievedAt": "2025-08-11T20:57:25.685Z"
}
