{
  "title": "Asad calls for controlling population growth to ensure basic facilities for all",
  "link": "https://www.app.com.pk/national/asad-calls-for-controlling-population-growth-to-ensure-basic-facilities-for-all/",
  "date_published": "2021-07-11T11:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): Minister for Planning, Development and Special Initiatives Asad Umar on Sunday called upon all the citizens to limit the number of kids to ensure provision of all basic facilities to the whole population.\n“We must ensure appropriate birth spacing and limit the number of kids for the welfare of our family as well as society at large,” he said in his video message.\nThe minister said need for schools, healthcare facilities, electric and gas supply was directly related to the growth in population.\n“Being a Planning Minister, I tell you all that with this alarming increase in our population, it has become quite difficult for us to provide the people with the basic necessities of life,” he remarked.\nAsad said with humongous growth in population, resources which were in plenty, start diminishing over time.\n“Here in Pakistan resources are already limited. Apart from this, a woman giving birth to a number of children puts her life at stake as well as her kids,” he added.\nMeanwhile in his tweet in connection with the international day of Family Planning, the minister said one of the key challenges for Pakistan was its high population growth.\n“It makes increasing literacy, providing health care, ensuring livelihood opportunities, providing electricity & gas, and meeting all other development needs much more difficult.”\nHe said Pakistan had enough capacity to provide quality education to only half its kids but if Pakistan population growth dropped to that of Bangladesh, in 10 years we would accommodate every child in the country of primary school age and in 15 years in secondary school.\nAsad Umar said with such a phenomenal impact in such short duration on key development outcomes, “we should make population growth reduction as one of our top national priorities”.",
  "retrievedAt": "2025-08-11T20:57:28.913Z"
}
