{
  "title": "Vaccination certificate must for tourists’ hotel bookings in AJK, northern areas: NCOC",
  "link": "https://www.app.com.pk/national/vaccination-certificate-must-for-tourists-hotel-bookings-in-ajk-northern-areas-ncoc/",
  "date_published": "2021-07-11T10:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP): The National Command and Operation Centre (NCOC) on Sunday has initiated special measures to strictly implement SOPs in all high risk sectors and made vaccination certificate mandatory for tourists’ hotel bookings in AJK and Northern Areas.\nThe NCOC taking serious note of deadly COVID-19 virus strains prevailing in the country, also violations of standard operating procedures to prevent COVID-19 and the risk of pandemic spread in view of the arrival of Eid-ul-Azha.\nThe Forum has declared vaccination mandatory for hotel bookings for tourists visiting Gilgit-Baltistan, Azad Jammu and Kashmir (AJK) and Khyber Pakhtunkhwa. The Forum has issued an elaborate procedure for verification of vaccine certificate at the entrances of tourist sites and hotels.\nThe Forum has issued detailed instructions to all provinces for strict implementation of SOPs. The Forum has also formed teams to ensure compliance of wearing facemasks and implementation of social distancing and safety protocols.\nThe Forum, in the light of these instructions, had also issued directives for implementation of SOPs related to cattle markets and Eid-ul-Azha to limit disease spread.\nThe special directives issued for the management of restaurants, gyms, cinemas and wedding halls would also help ensure confirmation of vaccination certificates, the Forum said.\nThe Forum had also directed to ensure guidelines’ implementation of pre-existing SOPs for bus terminals, railway stations, intercity and intra-city transport, mosques and bazaars.\nThe Forum had also issued a detailed checklist for district administrations also including comprehensive inspection procedure mentioned in the instructions for ensuring safety protocols in high risk sectors.\nHowever, strict disciplinary action would be taken against the violators and the institution not complying with the SOPs, the Forum warned.",
  "retrievedAt": "2025-08-11T20:57:28.627Z"
}
