{
  "title": "Shibli urges opposition to abandon public meetings to check coronavirus.",
  "link": "https://www.app.com.pk/national/shibli-urges-opposition-to-abandon-public-meetings-to-check-coronavirus/",
  "date_published": "2020-11-18T16:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP):Minister for Information and Broadcasting Senator Shibli Faraz on Wednesday urged the opposition parties to avoid public meetings in order to mitigate the impact of the second wave of coronavirus.\nAddressing a press conference, he said the Pakistan Tehreek I Insaf (PTI) had cancelled all its public meetings, including postponing the event in Rashakai.\nHe said the neighbouring countries were suffering from the disease badly and fearing the worst.\nShibli Faraz said the Pakistan Democratic Movement (PDM) parties were divided on issues. Theleadership of the Pakistan Muslim League-Nawaz and the Pakistan Peoples Party had the idea that they were not on the same page.\nThe ‘swindlers’ in the opposition had no rational thinking and the cracks in their ranks were evident from their contradictory statements, he added.\nHe said PDM head Maulana Fazlur Rehman had always done politics on the basis of religion keeping his business and vested interests in view.\nHe pointed out that former Federal Board of Revenue chairman Shabbar Zaidi had denied the statement attributed to him by Maulana Fazl, stating that Prime Minister Imran Khan had the best leadership qualities. The Maulana had no courage to tender apology for the fake statement, he added.\nThe Jamiat Ulema Islam-F did not win seats in Gilgit Baltistan, he said and added the opposition parties had no programme for the welfare of people. They were holding public meetings despite the onset of deadly second coronavirus wave.\nMaulana Fazl should better guide the people on the adverse impacts of the COVID-19, he said, quoting a Hadith of Prophet Muhammad (Peace Be Upon Him ) for not entering or leaving the area affected by the plague. On the contrary, the opposition leaders were opting for a political drama by holding public gatherings, he added.\nThe minister said the people, however, did not approve the opposition’s activities as evident from their public meeting in Mansehra today. Such gatherings would eventually spread the virus and “we have to take all the precautionary measures,” he added.\nThe opposition leaders, he said, were just interested in expanding their businesses. There were some persons in the ranks of opposition, who had looted the national wealth and bought properties abroad, he added.\nThe minister said the people had rejected the opposition parties in the 2018 election and the recent Gilgit Baltistan polls. They were not in a position to reject the results of GB polls, which were held in a free and fair manner, he added.\nHe reiterated that the opposition politicians were businessmen and would remain the same, who were damaging the country. They were pursuing a venomous narrative of maligning the institutions, which was rejected by the people, he added.\nThe minister said the government had improved the economy despite the difficulties arising due to the coronavirus. “We as a government assure that the prices will be brought down and the issues being faced by the people will be resolved.”\nHe assured assured that the issues related to sugar price would be settled.\nHe said the PML-N would continue to feel the agony of rejection by the people in the shape of electoral defeats.\nHe said whenever their plunder was detected, the opposition leaders resorted to levelling allegations of political victimization. They had committed corruption and only accepted the court decisions which were in their favour, he added.\nShibli Faraz advised the people to stay away from the opposition’s public meetings and take the threat of coronavirus seriously by participating only in the economic and business activities.\nTo a question, he said a committee led by Education Minister Shafqat Mehmood had discussed the matter of closure of schools due to the coronavirus and a decision would be taken in the next two days.\nA memorandum of understanding would be signed among the Ministry of Information, the Pakistan Television and the Pakistan Radio to hold online classes for the students, he added.",
  "retrievedAt": "2025-08-11T20:01:46.119Z"
}
