{
  "title": "Shafqat expresses concerns over fast spread of COVID-19",
  "link": "https://www.app.com.pk/national/shafqat-expresses-concerns-over-fast-spread-of-covid-19/",
  "date_published": "2020-11-18T13:45:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 18 (APP):Federal Minister for Education and Professional Trainings, Shafqat Mahmood on Wednesday expressed his serious concern over the fast spread of COVID-19 in the country saying final decision about educational institutions would be taken on Nov 23.\nWhile speaking at two-day conference ‘The Future Summit” via video link with the Provincial Education Ministers, he said that the safety of students’ lives was top priority of the government.\nThe conference was also attended by representatives of many capital market and financial institutions including commercial banks besides top government functionaries. Advisor to the Prime Minister on Finance and Revenue, Dr. Abdul Hafeez Shaikh also addressed.\nMinister said the education sector had been worst affected by COVID-19 pandemic since March. It was really hard for the government to decide for the closure of educational institutions once again. However, he said, “ Children’s life is precious to us.”\nThe school children, especially enrolled in government schools, had suffered education loss over this COVID-19 period. However, government took certain steps to minimize this loss which included online teaching and tele-school system which gave good results.\nNow, Radio schools system was being launched to reach maximum number of students mainly of rural and remote areas, he added.\nHe said the government was also thinking over different options i.e. suspension of summer vacations or extending academic year.\nThe minister said uniform curriculum was almost ready and it would be implemented in the government schools throughout the country from April 2021 and in private schools from August 2021.\nTo another query about cut in syllabus in the backdrop of long prevalence of COVID-19 pandemic in the country, he said Punjab and Khyber Pakhtunkhwa governments had already reduced their syllabi of secondary schools and colleges.\nHe said 20 million children were already out of the school and COVID-19 had aggravated the issue.\nReferring to the event titled “The Future Summit”, he said the country was in dire need for institutional reforms – in civil service, judiciary, police and education- to ensure good governance, inexpensive and quick justice to the common man and sense of security among the people.\n“We shall have to bring new set of laws in the country to ensure equal social and economic rights for the poor also,” he remarked adding that there was need for fixing government regulations.\nHe spoke of the various initiatives taken by incumbent government for the welfare of the people , especially for low income group.\nThese included Sehat Sahulat Card facility where one family could get treatment up to Rs 45,000 at any government hospital.\n“Initially, Sehat Card is for lower income section of the society but later on, this health initiative will cover every citizen”, he said.",
  "retrievedAt": "2025-08-11T20:01:50.636Z"
}
