{
  "title": "PML-N leaders banking on anti-state statements for vested interests: Official",
  "link": "https://www.app.com.pk/national/pml-n-leaders-banking-on-anti-state-statements-for-vested-interests-official/",
  "date_published": "2020-11-18T15:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): The controversial statement by Pakistan Muslim League-N leader Ayaz Sadiq on release of captured Indian pilot was an attempt to destabilize the country for vested interests and turn a victory into defeat.\nTerming it “an unforgiveable crime”, a senior security official Wednesday said “such misleading and factually incorrect statements were deliberately being made” by the PML-N leaders to safeguard their vested interests.\nThe official said unfortunately, such irresponsible statements were fully in line with the enemy’s agenda of distorting the country’s image internationally. He pointed that the narrative built by Ayaz Sadiq provided the Indian media an opportunity to unleash propaganda against Pakistan.\nHe regretted that a political party made the matter of national pride controversial and portrayed Pakistan’s success as its defeat. However, he said the nation has rejected the anti-Pakistan narrative of Ayaz Sadiq and others.\n“Issuing false statements on matters of national security was tantamount to committing treason with the country,” he said and added the law must take its course to stop such attempts to damage Pakistan’s national institutions in future.\nIssuing false statements on matters of national security was tantamount to committing treason with the country\nThe official said instead of tendering an apology, Ayaz Sadiq and his party had been adamant in defending their lethal statement. Ayaz Sadiq said at the floor of the house that Wing Commander Abhinandan Varthaman was released as the country feared an attack by India. The Indian pilot was captured by Pakistani army on Feb 27, 2019 after his MiG-21 aircraft was shot down by Pakistan Air Force after it intruded inside the country.\n“It seems that the main objective of these statements is to create chaos and sabotage economic stability in the country, only to avoid the ongoing accountability process.”\nHe said, the armed forces and the people of Pakistan would never let that happen and added that there are certain “red lines” related to Pakistan’s national interests, that must not be crossed by anyone, as it causes irreparable damage.\nThe official said the armed forces of Pakistan were sacrificing their lives while defending the motherland and the whole nation recognised these supreme sacrifices of the Pakistan Army‘s valiant soldiers for their motherland.\nThe official said Pakistan came into being on ideological basis and all those who tried to damage it have been fully exposed. The statement by Ayaz Sadiq was an attempt to weaken the State and transform the defeat of the enemy into its victory.\n“More worrying fact is that he has shown no regret over his remarks, neither has any other leader from his party nor from other opposition parties,” he added.\nThe official pointed that it was encouraging that some saner voices from within PML-N had come out to openly condemn the remarks by the former Speaker National Assembly to stoke instability in the country.\nHe said such attitude clearly reflected that some members of the PML-N were more loyal to a family than their motherland.\n“The 220 million Pakistanis adore their armed forces and country … the nation has always stood with them and will continue to do so,” he added.",
  "retrievedAt": "2025-08-11T20:01:48.963Z"
}
