{
  "title": "NA body defers Constitution Amendment bill till next meeting",
  "link": "https://www.app.com.pk/national/na-body-defers-constitution-amendment-bill-till-next-meeting/",
  "date_published": "2020-11-18T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP):The National Assembly (NA) standing committee on Law and Justice on Wednesday deferred various constitutional amendment bills due to non-availability and request of the mover.\nThe NA body met here under the chairmanship of Riaz Fatyana.\nThe committee discussed Nusrat Wahid’s amendment bill for amending Article 26A of the Constitution.\nHighlighting the important features of the bill, Nusrat Wahid said provision of healthy environment to citizens was mandatory and clean water, pollution free air was the right of every citizen, she added.\nShe said that the purpose of this bill was to provide a healthy environment to all citizens.\nAfter detailed deliberation, the committee recommended that all the amendments in the bill were already included in Climate Change Act and Environment Protection Act.\nThe Secretary, Ministry of Law and Justice said that there was no need to amend the constitution for the proposed amendment.\nThe committee also discussed Kesoo Mal Kheeal Das’s amendment bill\n(Article 251) and (Article 25A) seeking national language status for all regional languages.\nKheeal Das said that all regional languages should be given the status of national language.\nCommittee members Mahmood Bashir Virk and Sanaullah Mustikhel opposed the amendment bill to declare all regional languages as national languages.\nMahmood Bashir said Urdu was a language which could be expressed at any corner\nof the country.\nNafisa Shah said people should themselves patriotic but they did not do anything for Urdu language.\nSyed Hussain Tariq remarked that Kheeal Das presented the amendment bill regarding regional language to strengthen the federation.\nSana Ullah Khan said Pakistan was divided on the basis of languages in the past.\nThe Law Secretary said that the law ministry had opposed the bill and added that concrete steps could be taken to protect these languages.\nAfter deliberation it was recommended with majority that the bill should not be\npassed by the Assembly.\nThe committee rejected the bill after voting as there were ten votes against and\nthree in favor of the bill.\nThe commitlee also considered the Conttltutlon (Amendment) BIll, 2019 (Article 89) by Abdul Qadir Patel and after detail deliberation, recommended that the bill should not be passed by the Assembly.\nThe Committee considered, the Legal Aid and Juttice Authority (Amendment) Bill,\n2020, (Section 2, 6 & 9A) by Uzma Riaz and deferred the same till next meeting due to\nnon-availability and request of the mover.\nThe committee considered the Constitution (Amendment) Bill, 2020 (Article 51) moved by Junaid Akbar and after detailed deliberations deferred the same till next meeting.\nThe committee unanimously welcomed Junaid Akbar as member of the committee.\nMembers of committee and movers of bills including Atta Ullah, Lal Chand, Kishwar Zehra, Muhammad Sana Ullah Khan Masti Khail, Malik Muhammad Ehsan Ullah Tiwana, Junaid Akbar, Ms Shunila Ruth, Ch Mehmood Bashir Virk, Usman lbrahim, Mohsin Nawaz Ranjha,\nSyed Hussain Tariq, Dr. Nafeesa Shah, Aliya Kamran, Ms Nusrat Wahid and Kesoo Mal Kheeal Das besides the Secretary Ministry of Law and Justice, Secretary Election Commitiion of Pakistan along with their staff attended the meeting.",
  "retrievedAt": "2025-08-11T20:01:49.720Z"
}
