{
  "title": "Govt taking steps to revive national economy: Hammad Azhar",
  "link": "https://www.app.com.pk/national/govt-taking-steps-to-revive-national-economy-hammad-azhar/",
  "date_published": "2020-11-18T13:41:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Nov 18 (APP):Federal Minister for Industries and Production Hammad Azhar has said the PTI government is taking all possible measures to revive the national economy.\nHe was addressing the industrialists and traders community at a local hotel on Wednesday.\nHe said that the government had put the country on the right track and now the economy was flourishing day by day under the vision of Prime Minister Imran Khan.\nHe said the industrial sector of the country had reached at the verge of collapse and\nunemployment rate was very high when the Pakistan Tehrik-e-Insaf (PTI) came to\npower.\nHe said now the industrial sector was running with full capacity due to effective steps\ntaken by the government, adding that international institutions had now upgraded\nstatus of the country’s economy.\nHammad Azhar said the Pakistan Muslim League-Nawaz had controlled the value of currency artificially, adding that the country’s exports were reduced to 1 billion US dollar in the era of Nawaz Sharif.\nHe said the government was promoting ease of doing business, adding that\nCOVID-19 badly affected the world, including Pakistan, but the government had taken in time decisions and saved industry, labour and exports and opened the construction sector.\nHe said that the world economy was squeezing from 4 to 5 per cent but the national\neconomy was flourishing and a major increase had been recorded in exports.\nLoan deferment, payment of three months’ electricity bills of small shopkeepers, construction package, tax free budget, industrial relief package, end of peak hours for industrial sector were incentives given by the incumbent government, the minister said.\nHe said that the government had paid refund claims of Rs 248 billion during previous year\nand Rs 148 billion during the current year.\nHe said that sale of cement touched the highest level in the country’s history while increase\nin sale of Urea was also recorded.",
  "retrievedAt": "2025-08-11T20:01:50.635Z"
}
