{
  "title": "Chairman PAEC extends felicitations to China on 40 years of IAEA membership",
  "link": "https://www.app.com.pk/national/chairman-paec-extends-felicitations-to-china-on-40-years-of-iaea-membership/",
  "date_published": "2024-09-18T17:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): Chairman of the Pakistan Atomic Energy Commission (PAEC), Dr Raja Ali, on Wednesday extended heartfelt felicitations to China on completing 40 years as a member state of the International Atomic Energy Agency (IAEA).\nChairman of the Pakistan Atomic Energy Commission (PAEC), Dr. Raja Ali Raza Anwar, shared his thoughts at an event organized by China to commemorate 40 years of its partnership with the International Atomic Energy Agency (IAEA).\nThe event took place on the sidelines of the IAEA General Conference.\nDr. Raja Ali Raza Anwar was invited as one of the guest speakers, alongside IAEA Director General Mr. Rafael Grossi, according to a news release received here.\nThe Chairman observed that the Pakistan-China friendship has blossomed into an All-Weather Strategic Cooperative Partnership and that the lasting Pakistan-China friendship was a legacy of our forefathers and cherished by every generation of Pakistanis.\nHe further said that Pakistan and China had a history of bilateral relationships characterized by feelings of mutual trust, respect, and goodwill towards each other. With the launching of China-Pakistan Economic Corridor (CPEC), a flagship project of Chinese President, Xi Jinping’s initiative of “One Road and One Belt”, the bilateral relationship has been elevated to a higher level, he added.\nHe said, “As we are gathered here to talk about peaceful applications of nuclear science and technology, I would like to mention our long-standing cooperation with China in the field of nuclear energy.”\nChairman PAEC highlighted that Pakistan was safely operating six nuclear power plants (NPPs) constituting a total electricity generation capacity of 3,530 megawatts (MW). All these NPPs were constructed in cooperation with China.\nAnother NPP of 1200 MW is under construction with the cooperation of China.\nPakistan looks forward to further enhancing this cooperation with our Chinese friends in other areas including Food and Agriculture, Human Health, Water Resource Management and Industrial Applications.”\nDr. Raja Ali Raza Anwar concluded his speech that Pakistan and China by commending the active role being played by Pakistan and China at the IAEA. Both countries have well-established Collaborating Centres of the IAEA.\nPakistan looks forward to establishing collaboration between IAEA Collaborating Centres of both countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:12:42.226Z"
}
