{
  "title": "Extensive consultations on constitutional package underway: Tarar",
  "link": "https://www.app.com.pk/national/extensive-consultations-on-constitutional-package-underway-tarar/",
  "date_published": "2024-09-18T13:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar on Wednesday said that extensive consultations with all political parties on the proposed constitutional package were underway.\nTalking to the media, he said that all the political parties tried to reach a consensus on the draft bill both inside and outside the Parliament.\nThe parties on both sides of the aisle in the Parliament had thorough discussions on the constitutional amendments, he added.\nTarar said the role of the Law Minister in the drafting of constitutional amendments and engaging all political forces was highly commendable.\nHe cited that many countries, including Italy, Germany and Spain, had supreme courts and constitutional courts side by side.\n“Constitutional matters go to constitutional courts so that common citizens do not face any obstacles in the way of justice and their cases reach logical conclusion well in time.”\nCiting the example of the United States, he said that cases on the Capitol Hill attack were concluded within a span of few months and the culprits were brought to justice. Similarly. Likewise, the perpetrators of London riots had also been punished by the courts.\nUnfortunately in Pakistan, he said, the cases related to the May 9 events were still pending. It was a question mark that why the culprits were roaming free, he added.\nHe said the countries where constitutional courts were operational, the system of timely provision of justice was functioning, with easy evaluation of the judges’ performance.\nTarar quoted Law and Justice Minister Azam Nazeer Tarar stating that his client from Attock had been released after completion of his jail term but still his case was pending in the Supreme Court.\nHe said that the main objective behind the creation of the constitutional court was to segregate constitutional petitions from criminal, civil and corporate cases. It was the best option to provide speedy justice to the common man, he added.\nThe minister lamented that the leaders of a party were trying to get political mileage from the situation by demanding release of their leader.\nHe, however, made it clear that nobody would be allowed to use the issue as a bargaining chip for getting an NRO.\nHe said that the consultation process was being expanded and Jamiat Ulema-e-Islam-F chief Maulana Fazlur Rahman was being engaged.\nThe minister clarified that the draft of the constitutional amendments was prepared by the legal team of the Ministry of Law and Justice under the guidance of Law Minister Azam Nazeer Tarar.\nThe draft had been shared with the Pakistan People’s Party, JUI-F and other parties and discussion was held with the on every section, he added.\nThe minister said that the creation of a constitutional court was part of the Charter of Democracy. The lawyers bodies had given their stance on the issue, he said.\nHe reiterated that consultations would continue for building consensus on the amendments. He urged the opposition parties not to create confusion and indulge in speculations as it was a matter of national integrity and constitution.",
  "retrievedAt": "2025-08-10T21:11:24.962Z"
}
