{
  "title": "NIH issues advisory on Chikungunya Viral Infection",
  "link": "https://www.app.com.pk/national/nih-issues-advisory-on-chikungunya-viral-infection/",
  "date_published": "2024-09-18T17:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP):National Institute of Health (NIH) has issued an advisory for the prevention and control of Chikungunya Viral Infection.\nAccording to advisory, Chikungunya is a viral disease caused by Chikungunya Virus (CHKV) and transmitted by Aedes mosquitoes to humans.\nThe proximity of mosquito breeding sites to human habitation is a significant risk factor.\nThe viruses can circulate in same area with dengue and cause occasional co-infections in the same patient.\nFollowing outbreaks of Chikungunya in Karachi and other different parts of the country, the disease is now endemic in many parts of the country like Dengue Fever.\nThe advisory said that keeping in view the hyper active season of mosquitoes, and previous seasonal trends of the disease, it was imperative to undertake preventive measures while staying vigilant to pick suspected cases, confirming the disease, and taking steps to interrupt further transmission.\nThe objective of this advisory was to sensitize health care authorities to further strengthen and improve the level of preparedness in prevention and control of Acute Febrile Viral Illness (suspected Chikungunya) Infection.\nOnset of illness usually occurs four to eight days after exposure but can range from two to 12 days. Viraemia persists for five to seven days from the onset of symptoms.\nChikungunya is spread by the bite of Aedes mosquitoes, primarily Aedes aegypti and also Aedes albopictus.\nThese mosquitoes are active during the day. Both species are found biting outdoors, but Aedes aegypti readily feed indoors.\nMostly the transmission usually occurs during or just after the hot rainy season.\nChikungunya occurs in tropical countries and has been reported from Africa, South Asia and South-East Asia.\nThe disease shares some clinical signs with dengue, and can be misdiagnosed in areas where dengue is common. However, the CHKV infections are rarely fatal without any significant hemorrhagic manifestations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:12:56.322Z"
}
