{
  "title": "Pakistan’s first 3-day ‘Sirat Festival’ to take place from Sept 20",
  "link": "https://www.app.com.pk/national/pakistans-first-3-day-sirat-festival-to-take-place-from-sept-20/",
  "date_published": "2024-09-18T17:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): For the first time in Pakistan’s history, the three-day ‘Sirat Festival’ will take place from September 20 to 22 in Islamabad, themed ‘Searching for World Peace: In the Light of the Prophet’s Teachings.’\nThe festival, will be organized by the National Rahmatul-lil-Alameen Wa Khatam an-Nabiyyin Authority (NRKNA), will feature over sixty research papers presented by scholars from both Pakistan and abroad.\nSpecial sessions dedicated to children, women, and minorities will also be included in the festival agenda.\nAt a joint press conference held in Islamabad on Wednesday, Khurshid Nadeem, Chairman of the National Rahmatul Lil Alameen Wa Khatam-ul-Nabieen Authority, along with Federal Education Secretary Muhyuddin Ahmad Wani, announced that the festival will transform the atmosphere of the capital during Rabi-ul-Awwal. The event will be held at the National Skills University in I-8 Islamabad.\nChairman Nadeem described the festival as a multifaceted gathering. “The two-day international conference, ‘Searching for World Peace: In the Light of the Prophet’s Teachings,’ will bring scholars from around the world to explore various aspects of the Prophet’s biography,” he said. “Our aim is to promote scholarly engagement with the teachings of the Prophet Muhammad.” Publishers from Pakistan will offer discounts of up to 50% on biographical books, making this a unique opportunity for the public.\nThe festival will also showcase the beauty of Islamic art and culture through an exhibition of calligraphy, featuring stunning representations of the names of the Prophet (Peace Be Upon Him). Additionally, poetry readings and documentary screenings will highlight the life and teachings of the Holy Prophet, aiming to convey messages of moral integrity based on Quranic verses and prophetic sayings.\nFederal Secretary of Education, Muhyuddin Wani, emphasized the engagement of all educational institutions under the ministry in this noble initiative. “Every institution is enthusiastically participating in this event,” he stated.\nThe National Book Foundation will also offer a nationwide 50% discount on its publications during the festival, showcasing the collective effort in promoting the knowledge and teachings of the Prophet.\nSignificant academic and administrative support is provided by Allama Iqbal Open University and its Department of Islamic Studies, alongside contributions from the Federal Board of Education, IBCC, PEIRA, the Federal Directorate of Education, Dame Darme Sukhne, the Institute of Islamic Research, the Message of Pakistan, and Jamia Muhammadi Sharif Chiniot.\nKhurshid Nadeem further articulated that the NRKNA is dedicated to researching the biography of the Holy Prophet Muhammad to foster moral development within society. “We believe character building should be prioritized in our educational system,” he added. “This initiative is now part of our strategy, which was implemented in August this year, and we are working to disseminate this message of character development across provinces.”\nThe Authority has also initiated the formation of ‘Rahmatul Lil Alameen Youth Clubs’ in educational institutions to encourage young people to engage with the life and teachings of the Holy Prophet (PBUH). These clubs aim to cultivate a passion for studying the Prophet’s biography and deepen the youth’s connection with these teachings. “It is essential for our younger generation to develop a practical relationship with the Prophet’s life,” Nadeem stated.\nIn alignment with the message of inclusivity, the Authority has adopted ‘mercy for all’ as a guiding principle, assuring religious minorities that the compassion of Prophet Muhammad extends to everyone. “A society modelled after the Prophet’s teachings ensures justice and protection of religious freedoms for all its citizens,” Nadeem emphasized.\nHe recalled the guidance of Quaid-i-Azam Muhammad Ali Jinnah offered on August 11, 1947, which resonated with the teachings of the Prophet regarding religious freedom.\n“Join us for this historic event as we explore the significance of the Prophet’s teachings and strive for world peace” he urged the people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:12:38.948Z"
}
