{
  "title": "ICC announces equal prize money for men, women",
  "link": "https://www.app.com.pk/national/icc-announces-equal-prize-money-for-men-women/",
  "date_published": "2024-09-18T14:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP):The ICC Women’s T20 World Cup 2024 will be the first ICC event where women will receive the same prize money as their male counterparts, marking a significant milestone in the sport’s history. The decision was taken at the ICC Annual Conference in July 2023, when the ICC Board took the step of reaching its prize money equity target seven years ahead of its schedule of 2030, making cricket the only major team sport to have equal prize money for its men’s and women’s World Cup events, said a press release.\nThe winners of the tournament, which will now be staged in the United Arab Emirates (UAE), will receive US$2.34million, a massive,134 per cent increase on the $1 million awarded to Australia when they clinched the title in South Africa in 2023.\nThe runners-up will receive $1.17 million, an increase of 134 per cent in comparison to the $500,000 South Africa received for reaching the final on home soil at Newlands Cricket Ground.\nThe two losing semi-finalists will earn $675, 000 (up from $210 000 in 2023), with the overall prize pot totalling $7,958,080, a massive increase of 225 per cent from last year’s total fund of $2.45 million.\nThis move is in line with the ICC’s strategy to prioritise the women’s game and accelerate its growth by 2032. Teams will now receive equal prize money for the equivalent finishing position at comparable events as well as the same amount for winning a match at those events. The ICC Men’s T20 World Cup 2024 event prize money is only higher on account of 10 additional teams participating and 32 more matches played.\nEach win during the group stages will see teams take home $31,154, while the six teams who fail to reach the semi-finals will share a pool of $1.35 million depending on their finishing positions.\nIn comparison, the equivalent pool for the six teams in 2023 was $180,000, shared equally. Teams who finish third or fourth in their group will take $270,000 each while the teams who finish fifth in their group will both receive $135,000. All 10 participating teams are assured of $112,500.\nThe increase in prize money for the ICC Women’s T20 World Cup 2024 comes in line with the prize pot for the ICC Women’s Cricket World Cup 2022 also increasing to $3.5 million in total.\nThe ICC Women’s T20 World Cup 2024 will open on October 3 with Bangladesh taking on Scotland at Sharjah Cricket Stadium. There has been a minor change to the match order for the double header on Saturday October 5 in Sharjah, with Australia now facing Sri Lanka in the afternoon at 14h00, followed by the Bangladesh versus England match taking the evening slot at 1800 local time. Ten teams will play 23 matches in Dubai and Sharjah to decide the 2024 champions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:11:44.157Z"
}
