{
  "title": "Women tech entrepreneurs worldwide invited to showcase innovations",
  "link": "https://www.app.com.pk/national/women-tech-entrepreneurs-worldwide-invited-to-showcase-innovations/",
  "date_published": "2024-09-18T13:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): Applications for the 2025 Aurora Tech Award, opening on September 2, are invited from women tech entrepreneurs worldwide to showcase their innovations.\nAs the tech industry evolves, the need for diverse voices and leadership continues to grow.\nThe Aurora Tech Award was established in 2020 to recognize and empower women founders of IT startups who are driving innovation and breaking down barriers.\nThis year, the award returns with expanded opportunities, increased financial support, and an ongoing commitment to nurturing the next generation of women tech leaders.\nThe 2025 Aurora Tech Award introduces several updates to provide greater resources and opportunities for women entrepreneurs.\nIn recognition of the vital role women play in the tech industry, the prize fund has been significantly increased.\nThe application process now includes three stages of assessment: longlist, midlist, and shortlist. After an initial evaluation by venture fund analysts, 100 participants will be selected for a pitching session.\nFifteen of these will advance to the final shortlist.\nShortlisted participants will benefit from an enhanced mentoring program offering sessions with leading industry experts.\nThis mentorship will span 2 to 2.5 months and will provide critical insights and guidance to help participants refine their projects and implement strategic changes.\nAsya Vildt, Operations Excellence and Sustainability Director at inDrive, explains the company’s commitment to women’s empowerment: “Supporting women in tech isn’t just about leveling the playing field; it’s about unlocking the full potential of innovation. Women entrepreneurs bring fresh perspectives that are essential for solving today’s complex problems. At inDrive, we are committed to creating opportunities that empower women to lead in technology, as their success drives positive change across industries and communities. The Aurora Tech Award reflects our belief in the power of diverse leadership to shape a better, more sustainable future.”\nApplications are open from September 2 to November 21, 2024 and interested applicants can submit their entries through the Aurora Tech Award website at https://www.auroratechaward.com/.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:11:50.240Z"
}
