{
  "title": "Japan to open its marketplace for talented Pakistan’s youth",
  "link": "https://www.app.com.pk/national/japan-to-open-its-marketplace-for-talented-pakistans-youth/",
  "date_published": "2020-10-04T11:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 04 (APP): The government of Japan has offered Pakistani youth to exhibit their talent in the modern hi-tech Japanese industrial sector and benefit from the employment opportunities offered by different sector of the Japanese economy.\n“Japan wants to give chance to the talented youth of Pakistan to get themselves connected with the modern and innovating Japanese industrial sector for enhancing their skills to promote the concept of shared development and prosperity,” the Charge d’ Affairs, Embassy of Japan in Pakistan, Yusuke Shindo told APP here.\nHe said that Pakistan was the country having majority youth population and “we want to see an emerging vibrant Pakistan by connecting it with the global value chain for achieving the economic and trade competitiveness of the international market.\nHe said that in Japanese Market, Pakistan could get a huge share as it intends to import 3, 45 000 skilled manpower from 10 countries of the world.\nThe Memorandum of Cooperation (MoC) already signed between both sides, would open new avenues for Pakistanis to work in 14 Japanese sectors, including nursing care, building clinic, agriculture, fisheries, hotel management, food and beverages, aircraft maintenance and airports ground handling staff, shipbuilding, material processing, industrial machinery, constructions, car mechanic, electronics and electronic machinery in cards to import skilled labor force, he said.\nThe senior diplomat made it clear that there was no particular quota for any of these 10 countries around the world and hoped that Pakistani would get maximum benefits from this huge opportunity in the Japanese market.\nReplying to a question on cooperation and facilities given by manpower importing countries to Japan, he said the government of Pakistan had nominated only two recruitment organizations including National Vocational and Technical Training Commission (NAVTTC) and National University of Technology (NUTEC) for carrying out necessary service including recruitment of candidates in collaboration with Japanese counterparts.\nWhile other competitors countries, alike Vietnam nominated 392, Philippines 274 and Myanmar has nominated 248 organizations for the rapid recruitment process and even some countries have already exported their manpower to Japan.\nHe expressed his reservation on some delays in manpower import from Pakistan and said that labor recruitment agencies were working hard by their need to expand the number of organizations for this process and hope that soon Pakistan would start its manpower export to Japan.\nHe urged the need for increasing the recruitment organization to manage the fast-track process of manpower export from Pakistan to Japan and help maximum employment opportunities to the local youth.\nThe senior diplomat said that during COVID-19 pandemic situation a lot of time was wasted and now there was a need to speed up the process of manpower import from Pakistan to Japan.\nShindo said the government of Pakistan (GoP) had nominated National Vocational and Technical Training Commission (NAVTTC) and National University of Technology (NUTEC) for carrying out necessary service including recruitment of candidates in collaboration with Japanese counterparts.\nHe also emphasized that the Japanese embassy in Islamabad had not hired any other promoter or facilitator for continuing the process of labor import from Pakistan, instead of these two above mentioned institutions nominated by Pakistan’s government.\nSharing strategy and action plan with APP, he said that applications have been invited from skilled Pakistanis, who can submit their application along with their particulars already for recruitment in relevant sectors.\nThe candidates should have gone through Japanese language test before their final selection for recruitment; he said adding that the test would be conducted at National University of Modern Languages (NUML) Islamabad.\nThe senior diplomat said that three different categories were part of the plan including Technical Intern, ‘Specified Skilled Workers’ and highly skilled professional.\nMentioning the skilled and language proficiency for all three categories, he said that purpose of first category of ‘Technical Intern Training’ program is to transfer technical skills, techniques and knowledge to foreign countries including Pakistan, through an experience of ‘On Job Training (OJT) to contribute to the human resources development in Pakistan.\nFor this program, he said that Japan and Pakistan had also signed a Memorandum of Cooperation on February 2019 in Tokyo.\nHe informed that the foreign nationals, who have successfully completed “Technical Intern Training” are exempted from tests that are normally required for the other two categories.\nWhile giving information regarding the second category of ‘Specified Skilled Workers’, he said that for this program both sides had signed the Memorandum of Cooperation (MoC) in last December 23 and through this agreement foreign national have to prove their necessary level of skill and Japanese language proficiency by appropriate means such as passing skills and language test in different 14 skilled sectors accordingly.\nThis is a status of residence for foreign nationals with higher skill compared with the ‘Specified Skilled workers.\nCurrently the fields of Information Technology (IT) Construction industry, Agriculture, nursing and care sector are applicable and candidates should prove necessary skills by a test or other means.\nWhile informed that the third category of highly skilled covers a variety of fields including engineering, specialist in humanities and international services.\nThe status of residence is permitted for foreigners, who have higher expertise, techniques such as academic background or career history with a contract with a public and private entity in Japan.\nReplying to question, he said that “these are the reasons beyond the modernization and development of Japan, we achieved through a strong education base, harmony and peace in our society.”\nHe said that Japan has desired a modernized, economically developed and strong Pakistan saying that in order to achieve this, the country must have to follow policy of export led growth through industrial and technological growth.",
  "retrievedAt": "2025-08-11T19:52:07.250Z"
}
