{
  "title": "Abdullah Abdullah sees promise for good relations between Pakistan and Afghanistan",
  "link": "https://www.app.com.pk/national/abdullah-abdullah-sees-promise-for-good-relations-between-pakistan-and-afghanistan/",
  "date_published": "2020-10-04T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 4 (APP): Chairman of the High Council for National Reconciliation (HCNR) of Afghanistan Abdullah Abdullah on Saturday said that he saw promise for good relations between Pakistan and Afghanistan, saying that although small steps had been made, they would have a “big impact”.\nAbdullah’s comments came during an interview to a private news channel, in response to what opportunities he sees for strategic cooperation between Afghanistan and Pakistan.\n“Things start from small steps. Complaints exist on both sides but there has been progress in the interactions and status of relations between both countries and even those small steps will have a big impact,” he said.\nHighlighting Pakistan’s role in the intra-Afghan dialogue he said, “We are appreciative of Pakistan’s role in the Doha agreement and later on in the negotiations.”\n“I was also appreciative of Prime Minister Imran Khan’s message that called for a reduction in the violence leading to a ceasefire, which is very important,” he said, adding that he expressed his gratitude to the Pakistani leadership during his three-day official visit.\nThe Afghan official said that he was leaving Pakistan with a positive image of the country and that he had no doubt that peace in Afghanistan wouuld lead to peace in Pakistan, and ultimately the region.\n“As neighbours we have no other choice but to work together,” he added.\nThe Afghan leader said that the more both sides “address each other’s legitimate concerns and work on the basis of common interest, mutual interest the better it will be”.\nHe appreciated the recently approved visa policy for Afghanistan which which he termed a good development on that front.\n“This will be helpful in people to people relations,” Abdullah said.\nSpeaking on his role as the head of the body tasked with building consensus in Afghanistan, he said that he was even willing to speak with the Taliban himself in the interest of consensus building and for a peaceful settlement in Afghanistan.\nTo a question, he said, “The issue is that I am leading the whole efforts towards reconciliation and peace. Within Afghanistan, we need consensus-building which is important among those who are under the banner of the Islamic Republic of Afghanistan.\nThey need to be unified. “At the same time, we need consensus-building in the region which fortunately we now have a broad understanding in support of peace. “If the time comes, if it is needed that I negotiate with the Taliban leaders and they agree, I will do that,” Abdullah said.\nThe Afghan leader said that he was in constant contact with the negotiations team.\nOn the deal struck between him and Afghan President Ashraf Ghani, he said that despite there being no foreign guarantor, the agreement would not fall apart.\nTalking about the peace deal that is facing several hurdles, he said that both parties; the Afghan government and Taliban decided to initiate talks after “nearly three decades of fighting”.\n“Through war, there are no winners and through inclusive peace, there are no losers,” he said, adding: “Personally, I would have preferred it to move in a more speedy manner.”\nThe Afghan official said that the people were looking forward to results — a decrease in violence and reaching an agreement of ceasefire.\nWhen asked to comment on how several regional powers were not a part of the peace talks, he said: “As a whole, all the countries are supporting a peaceful settlement.”\nResponding to whether he perceives a threat to the peace process if after the US presidential elections Joe Biden comes into power, he said that despite different approaches, both leaders (US President Donald Trump and Biden) are “supportive of a peaceful settlement in Afghanistan”.\n“Going back to the old days of tens of thousands of troops would not be possible,” he added.\nHe said the issue bears greater urgency for Afghanistan and Pakistan, and the entire region, “because we would be the ones most impacted if peaceful settlement is not secured”.\nSpeaking about Mohammad Sadiq’s appointment as the special envoy for Pakistan, he said he already knew him when he was an ambassador to Pakistan and when he served Pakistan’s Cabinet Committee on National Security and that he considered him to have “good knowledge of the situation in Afghanistan”.\n“He has boosted efforts already underway in support of bilateral cooperation,” Abdullah said.\nResponding to a question about whether Afghanistan will like to be part of the China Pakistan Economic Corridor (CPEC), he said: “The Belt and Road Initiative is important.\nWe will judge it when we see the benefits for ourselves. But anything that benefits trade, transit and changes, we welcome it.”",
  "retrievedAt": "2025-08-11T19:52:06.944Z"
}
