{
  "title": "Law State Minister welcomes Supreme Court verdict",
  "author": null,
  "content": "ISLAMABAD, Jun 27 (APP):Minister of State for Law and Justice, Barrister Aqeel Malik on Friday said that the Supreme Court’s recent ruling regarding the allocation of reserved seats in legislatures, aligns with constitutional principles and strengthens democratic values.\nIn a tweet on X, he stated that only those political parties which contest elections and secure public mandate are eligible for reserved seats.\nHe said the court’s judgment is consistent with the constitution and upholds the framework of parliamentary democracy.\nAccording to the minister, reserved seats are meant for political parties that take part in general elections and receive direct support from voters.\n“Only those parties that are constitutionally present in the electoral process with a public mandate can be entitled to reserved seats,” Barrister Malik said.\nHe described the decision as an important step toward strengthening institutional safeguards for democracy. He said that the Supreme Court’s review presented a clear majority opinion which sends a strong message about the importance of voter representation in the democratic process.\nBarrister Aqeel Malik stressed that public representation must come through votes and not through political tactics or backdoor methods. “Representation belongs to those chosen by the people, not to those seeking shortcuts or relying on technical maneuvers,” he said.\nThe Ministry of Law and Justice has welcomed the Supreme Court’s decision. Barrister Malik said the ruling not only reinforces the rule of law but also supports political clarity and transparency.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:32:15.667Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/law-state-minister-welcomes-supreme-court-verdict/",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T18:01:00.000Z"
}
