{
  "title": "No recognition for Israel until two-state solution with Al-Quds as Palestine’s capital: Dar",
  "author": null,
  "content": "ISLAMABAD, Jun 27 (APP): Deputy Prime Minister and Foreign Minister (DPM/FM) Senator Mohammad Ishaq Dar on Friday brushed aside speculations about the recognition of Israel as a state and reaffirmed Pakistan’s principled position on Palestine\nthat it would not recognize Israel until there is a two-state solution with Al-Quds as Palestine’s capital.\nThe DPM/FM delivered a comprehensive media briefing, sharing key outcomes of his recent diplomatic missions to Turkiye and the United Arab Emirates, where Pakistan actively contributed to regional peace initiatives, bilateral cooperation, and multilateral diplomacy on critical issues including Palestine, Kashmir, Islamophobia, and Iran-Israel tensions.\nSenator Dar commenced by recounting his participation at the Organization of Islamic Cooperation (OIC) Council of Foreign Ministers (CFM) meeting in Istanbul, held from June 20 to 23. He emphasized Pakistan’s leading role in calling for a separate session dedicated to Iran amidst escalating tensions with Israel. During the summit, Pakistan advocated a strong collective OIC position in support of Iran’s sovereignty and restraint in the face of provocations.\n“Iran acknowledged Pakistan’s early and steadfast support, and even during President Masoud Pezeshkian’s address to the Iranian parliament, Pakistan was singled out for its diplomatic solidarity,” Dar noted, adding that Field Marshal Asim Munir also engaged with Turkiye and Iranian leadership alongside him to promote a dignified ceasefire.\nDar pointed out that Pakistan remained in continuous contact with Tehran during the conflict, offering assistance and facilitating behind-the-scenes diplomacy. Iran’s eventual retaliation and subsequent agreement to a ceasefire, he said, were seen as steps toward regional de-escalation, crediting Pakistan’s efforts as pivotal in maintaining the peace momentum.\nThe DPM highlighted Pakistan’s successful initiative to convene a meeting of the OIC Contact Group on Jammu and Kashmir. “My intervention was the longest and most detailed, laying out the case for Kashmiri self-determination and exposing Indian atrocities,” Dar said.\nThe Istanbul Declaration issued after the summit included strong language on the Kashmir dispute, Palestinian genocide, rising Islamophobia, regional security in South Asia, and reaffirmed support for the Indus Waters Treaty. “This was a diplomatic win for Pakistan, as our position on multiple fronts was reflected comprehensively in the final communiqué,”\nhe added.\nIn Istanbul alone, Ishaq Dar held 13 bilateral meetings with counterparts from Saudi Arabia, Kuwait, Iran, Turkiye, Egypt, Malaysia, Azerbaijan, Uzbekistan, Kazakhstan, Bangladesh, Brunei, and Afghanistan. Strategic topics ranged from investments, connectivity, and counter-terrorism cooperation to the 624 km trilateral railway project between Pakistan, Afghanistan, and Uzbekistan.\nMalaysia extended an invitation to Ishaq Dar for the upcoming ASEAN Summit on July 10, which he accepted, indicating further regional outreach in the upcoming weeks.\nHe also briefed on the UAE visit where the Pakistan-UAE Joint Ministerial Commission (JMC) was convened after 12 years. A 10-member delegation, led by him, included top bureaucrats from key ministries. The UAE agreed to exempt diplomatic and official blue passport holders from visa requirements, effective after 30 days from the date of signing\nof the document of understanding on June 24th.\n“We also discussed easing visa issues for general Pakistanis, especially addressing concerns of those detained for criminal activities like drug trafficking or begging,” he said. Pakistani authorities shared improvements in screening mechanisms, which UAE authorities appreciated.\nThe delegation secured MOUs across multiple sectors including Artificial Intelligence, investment, and trade. Dar confirmed that discussions were held on converting UAE financial deposits into direct investments, including renewed interest in Pakistan’s ML-1 railway project.\nIn response to media queries, Ishaq Dar disclosed that Pakistan had formally nominated former U.S. President Donald Trump for the Nobel Peace Prize, recognizing his role in defusing tensions during a near-conflict situation with India. “The nomination was signed by me on June 11, with full approval of the Prime Minister,” he added.\nHe reiterated that Pakistan will only engage India in a composite dialogue covering terrorism, Kashmir, trade, and water disputes. “We will not accept talks limited to terrorism. It takes two to tango,” he added.\nHe emphasized Pakistan’s commitment to peaceful resolution of disputes and announced that Pakistan will chair a key session of the UN Security Council’s Ministerial Forum. “We have joined the International Organization of Mediation and will advance themes like conflict resolution and peace-building,” he said.\nSenator Ishaq Dar noted: “Pakistan is regaining its stature as a responsible, peace-seeking and diplomatically active nation, balancing strong principles with pragmatic engagement.”\nHe concluded by reaffirming that Pakistan’s leadership, civilian and military, are aligned in promoting stability in the region and globally through constructive diplomacy.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:32:48.449Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/no-recognition-for-israel-until-two-state-solution-with-al-quds-as-palestines-capital-dar/",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T12:37:00.000Z"
}
