{
  "title": "Read Japan Project: Japan embassy donates a collection of 92 books to NUTECH Islamabad",
  "author": null,
  "content": "ISLAMABAD, June 27 (APP): The Embassy of Japan, in collaboration with the Nippon Foundation, has donated a collection of 92 books on Japan to the National University of Technology (NUTECH) Islamabad as a part of the ‘Read Japan Project’ for fostering a deeper understanding of Japan’s rich culture, politics and economics through books.\nAmbassador of Japan to Pakistan, AKAMATSU Shuichi, on behalf of the Nippon Foundation, presented the books to Rector NUTECH, Lt. General (Retd) Moazzam Ejaz at a ceremony held on Friday at the university premises. The 92 carefully selected books in English language cover a range of topics related to Japan such as history, politics, economy, security, philosophy, literature, art and culture.\nSpeaking on the occasion, Ambassador AKAMATSU congratulated the students and teachers for receiving this valuable gift from the Nippon Foundation and expressed the hope that with these books, students, faculty members, and intellectuals will have more fascinating information on Japan as these books are windows into Japan’s rich history, vibrant culture, advanced technology, and unique values.\nHe appreciated the services rendered by NUTECH for offering not only the degree programs but also vocational training and language courses and has cultivated talented students, contributing to Pakistan’s human capital. He said that NUTECH’s relationship with Japan is noteworthy as it’s a registered organization which is sending interns for Japan’s Technical Intern Training Program (TITP). “I believe that NUTECH is playing a pivotal role in people-to-people exchange between Japan and Pakistan,” said Ambassador AKAMATSU.\nIn his remarks, the Rector NUTECH Lt. General (Retd) Moazzam Ejaz thanked the Nippon Foundation and Japan embassy for their generous gift of knowledge, expressing hope that the students will use this opportunity to learn about Japan and strengthen future Japan-Pakistan bilateral relations.\nThe ‘Read Japan Project’ was initiated by the Nippon Foundation in 2008 to promote the understanding of Japan through the donation of Japan related books in English to universities and libraries around the world.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:33:05.240Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/read-japan-project-japan-embassy-donates-a-collection-of-92-books-to-nutech-islamabad/",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T13:01:00.000Z"
}
