{
  "title": "Pak-EPA seizes 40kg single-use plastic in F7 sector",
  "author": null,
  "content": "ISLAMABAD, Jun 27 (APP):Pakistan Environmental Protection Agency (Pak-EPA) on Friday seized 40 kilograms of single-use plastic items in a targeted operation conducted in a posh sector F-7.\nThe enforcement team confiscated prohibited plastic products, including plates, spoons, forks, boxes, and glasses, during inspections at multiple restaurants and cafes, said its spokesperson.\nThe operation, carried out under the Single-Use Plastic (Prohibition) Regulations 2023, aimed to curb the illegal use of environmentally harmful plastics within the Islamabad Capital Territory (ICT).\nThe Pak-EPA team visited various food establishments in F-7 Markaz, issuing warnings to violators and seizing non-compliant items.\nAuthorities also distributed public notices detailing the prohibition regulations, instructing businesses to display them prominently to inform customers.\nThe crackdown is part of Pak-EPA’s broader campaign to phase out single-use plastics, which contribute significantly to pollution and environmental degradation.\nThe Pak-EPA spokesperson emphasized that the agency would continue strict monitoring and enforcement across the capital.\n“The use of single-use plastics is a serious environmental hazard, and we will not tolerate violations,” the official stated. “Businesses must shift to sustainable alternatives to avoid penalties, including fines and potential closures.”\nThe Single-Use Plastic (Prohibition) Regulations 2023 ban the manufacturing, distribution, and sale of disposable plastic items in ICT, with exemptions for essential medical and industrial uses.\nDespite the regulations being in effect for over two years, enforcement has intensified in recent months as authorities push for full compliance.\nWhile some restaurant owners claimed they were unaware of the ban, others acknowledged the need for eco-friendly alternatives but cited higher costs as a challenge.\nEnvironmental activists praised the crackdown, urging stricter penalties for repeat offenders.\nCitizens have also been encouraged to report violations via Pak-EPA’s helpline, as the agency vows to expand inspections to other sectors of the city.\nPak-EPA has announced plans for further raids in commercial areas, including markets and wholesale suppliers, to ensure a complete ban on single-use plastics.\nThe agency is also working with the Islamabad Chamber of Commerce to promote affordable biodegradable alternatives.\nWith plastic pollution remaining a critical issue in Pakistan, this enforcement action signals the government’s commitment to meeting its environmental sustainability goals, and to enforce environmental regulations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:33:26.895Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pak-epa-seizes-40kg-single-use-plastic-in-f7-sector/",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T11:25:00.000Z"
}
