{
  "title": "Chairperson BISP reaffirms commitment to transparency and women’s dignity",
  "author": null,
  "content": "ISLAMABAD, Jun 27 (APP): Chairperson Benazir Income Support Programme (BISP), Senator Rubina Khalid Friday reaffirmed her commitment to transparency, dignity and service delivery during a visit to Larkana- the city of Shaheed Mohtarma Benazir Bhutto, whom she called a symbol of bravery and sacrifice.\nSpeaking at a meeting held at the Deputy Commissioner’s Office, attended by BISP officials, PPP workers, and members of the public, Senator Rubina urged beneficiaries to raise their voices against any injustice or irregularities. “Unless complaints are brought forward, action cannot be taken. This city belongs to the brave people who stand up for their rights,” she emphasized.\nShe informed the gathering that cash assistance is currently being disbursed to around 10 million beneficiaries across the country under BISP. Highlighting the significance of fair disbursement, she added, “If anyone faces unjust deductions or treatment, they must speak up.”\nThe Chairperson shared that President Asif Ali Zardari had instructed her to ensure that women receive their full entitlements without any cuts, and are treated with the respect they deserve. Party Chairman Bilawal Bhutto Zardari also directed her to personally visit Larkana and listen to the concerns of poor women.\nShe revealed that over 99,000 payments are being processed in Larkana, with efforts underway to facilitate ATM and bank transfers for greater convenience and security.\nShe also announced the extension of mobile registration and payment vans to remote areas and the inclusion of poor students in the programme for educational stipends.\nSenator Rubina further announced the launch of a new dynamic survey to re-evaluate and re-register families who have been part of the programme for the past three years.\nShe directed BISP officials to maintain transparent and updated records to prevent any injustice.\nEarlier, Deputy Commissioner Dr Sharjeel Noor Channa briefed the audience on payment center operations and recommended routing all payments through banks to enhance transparency.\nFollowing the meeting, the Chairperson visited the BISP payment site at Otha Chowk, where she interacted with women facing deductions and inadequate facilities.\nUpon their requests, she directed BISP officials to immediately provide shaded waiting areas and clean drinking water, stressing that beneficiary dignity must remain a priority, as envisioned by Shaheed Mohtarma Benazir Bhutto.\nLater, she visited Garhi Khuda Bakhsh Bhutto and paid respects at the graves of Shaheed Zulfikar Ali Bhutto, Shaheed Mohtarma Benazir Bhutto, and other PPP martyrs, laying floral wreaths and offering prayers.\nShe was accompanied by BISP Director General Zulfiqar Ali Sheikh, institutional officers, and party workers throughout the visit.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:32:18.351Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/chairperson-bisp-reaffirms-commitment-to-transparency-and-womens-dignity/",
  "dateList": "2025-06-27",
  "date_published": "2025-06-27T15:51:00.000Z"
}
