{
  "title": "Khursheed Shah for convening conference on climate change, water issues",
  "link": "https://www.app.com.pk/national/khursheed-shah-for-convening-conference-on-climate-change-water-issues/",
  "date_published": "2022-05-25T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Minister for Water Resources Syed Khursheed Ahmed Shah on Wednesday underlined the need for convening a conference on important national issues like climate change and water scarcity aimed at devising an effective strategy to tackle the confronted challenges.\nResponding to a Calling Attention Notice regarding the shortage of water in Cholistan, he said there was a drought-like situation, the area had faced in\n1910 and the shortage of water supply would further deteriorate the situation.\nCurrently, the water in and out-flow at almost all dams had considerably decreased and even the Mangla dam reached below its dead level, declaring it ‘dangerous’ having a negative impact on the national economy.\nThe minister said the climate change was badly affecting the country as in August there would be excessive water due to melting of snow in mountains, advising the Ministry of Climate change to work on war-footing and suggest corrected measures for the agriculture sector for effective utilization of water.\nAnswering a supplementary question, Khursheed Shah also stressed the need for judicious utilization of underground water for irrigation purposes, adding at present there was around 45-47 per cent water shortage.\nHe said the country had sufficient water but there was a need for better management by increasing its storage capacity with the construction of new dams.\nHe was of the view that there should be more dams in the next 4-5 years to preserve\nthe water that went to the sea unutilized, and vowed to make utmost efforts for allocating 10 per cent of the next PSDP to funds for the construction of dams. “It will help build 2-3 new dams by 2025-26, and there will be no problem of water shortage.”\nThe minister said if looked at the increasing population, there could be severe issues of food security and water shortage by 2030, adding it was the collective responsibility of everyone to make future planning in that regard.\nMinister for Defence Khawaja Muhammad Asif said the country had enough water but storage capacity had decreased over time and increased consumption of water.\nHe said natural storages had also vanished due to a fast pace of construction activities in rural areas.\nHe underscored the significance of using modern irrigation techniques as these would help preserve water and produce better yields. “Around 70 per cent water of the country is used for irrigation, if the modern techniques are adopted it will preserve half of it (70%).”\nThe minister also highlighted the issue of water wastage and theft that needed due attention for its redressal, suggesting hiring services of experts that how water could be preserved and better utilized.\nHe requested owners of television channels to air a public-service message of 5-10 seconds creating awareness among the public for judicious utilization of water and stopping its wastage.",
  "retrievedAt": "2025-08-11T14:57:46.422Z"
}
