{
  "title": "Long March; No reconciliation with armed group threatening constitutional government: Khurram",
  "link": "https://www.app.com.pk/national/long-march-no-reconciliation-with-armed-group-threatening-constitutional-government-khurram-2/",
  "date_published": "2022-05-25T08:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Minister for Power Khurram Dastgir Khan on Wednesday said there would be no reconciliation with the armed group, planning advancement towards Islamabad in the name of long march against the democratic and constitutional government.\nAddressing a news conference along with Minister of State for Petroleum Senator Dr Musadik Malik here, he said all possible measures would be taken to ensure protection of life and property.\n“The government has decided that there will be no reconciliation with Imrani group,” he said, adding freedom of expression was the constitutional and democratic right but no one would be allowed to create anarchy.\n“It is our unflinching resolve that we will defend the constitutional government, life and property at all costs,” he said.\nHe recalled that in 2014 the PTI had staged a violent 126-day long protest/sit-in in the Federal Capital, during which its workers led by Imran Khan resorted to attack on Parliament, Police, Radio & PTV buildings, instigating the public for civil disobedience.\nNow, the PTI leadership was hurling the same threats and bloodshed to achieve their ulterior motives.\nThe minister said the PTI was using Khyber Pakhtunkwa government’s resources in its long march.\nHe said the federal government was acting upon the guidelines in the light of the apex court’s 2019 decision in the Faizabad sit-in case, which clearly stated that constitutional right of public gathering could not be used to topple a constitutional government. “The right to assembly is recognized as a right to preserve the democratic order, it cannot be used to overthrow a lawful government nor can the right of assembly be used to bring about a revolution or insurrection,” he said quoting some part of the judgment.\nHe said the court also observed that the roads neither could be used for ‘camping grounds’ nor blocked for indefinite period, as these were meant for free public mobility.\nKhurram was of the view that the right of assembly could not be used for bulldozing the rights of other citizens like routine life and employment related activities.\nBesides, he said, the court observed that if any party attempted fanning hatred, contempt and violence against governments, it would fall in ‘sedition.’\nMinister of State for Petroleum Dr Musadik Malik said staging protest was the constitutional right of every citizen but no one could be allowed to besiege the federal capital and putting the life and property at risk in the pretext of long march.\nHe said it was evident from the public speeches of PTI leadership that the long march would be ‘bloody’ that had now been confirmed through some intelligence reports about carrying weapons and ammunition in the rally with the sole purpose of creating anarchy in the country.\nBased on the intelligence reports, he said, the government had decided ‘door-knocking’ of some people to investigate them in that regard, during which a constable embraced martyrdom. “It proved the march is bloody.”\nRecently, he said, during a raid automatic weapons and ammunition were allegedly recovered from the House of PTI’s general secretary.\nDr Musadik said the apex court had asked the PTI to give in writing that the long march would be peaceful, but they refused.\nKeeping in view all these things, he reiterated that all possible steps were being adopted for the rule of law, protection to life and property of public and “strengthening the state.”\nAnswering a question, the Petroleum minister said the government had ensured sufficient stocks of petroleum products in the country, saying there were 15-20 percent additional stocks for May as compared to the same month of the last year.",
  "retrievedAt": "2025-08-11T14:57:52.014Z"
}
