{
  "title": "Pak-Iran Joint working group formed to improve health cooperation",
  "link": "https://www.app.com.pk/national/pak-iran-joint-working-group-formed-to-improve-health-cooperation/",
  "date_published": "2022-05-25T08:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Pakistan and Iran on Wednesday decided to form a joint working group to further explore opportunities in the health sector for further strengthening cooperation in this area.\nThe Director General Health Pakistan and Special Assistant to Iranian Health Minister were identified as focal points from both sides, says a fax message received here from Geneva on Wednesday.\nThe decision was made during a meeting held between Federal Minister for Health Abdul Qadir Patel and Minister of Health and Medical Education, Iran Dr. Bahram Einollahi, on the sidelines of World Health Assembly in Geneva.\nThe minister said Pakistan and Iran enjoy long-standing brotherly relations. Both countries have commonality of views on global public health issues and enhanced consultation and coordination would be useful, he said.\nHe said that Iran has carried out excellent reforms in the health sector specially in terms of improving health care services. Iran has done commendable work in extending health insurance coverage, he said.\nThe situation created by the COVID-19 pandemic necessitates stepped up bilateral cooperation and exchange of views. Achieving international public health security remains a key objective and it will however face challenges of funding sources and priorities, he said.\nHe said,”Pakistan believes there is a need for enhanced international cooperation and assistance to strengthen national health systems and to ensure all people enjoy the basic right to health.”\nBoth dignitaries consider areas of cooperation including enhanced cross border cooperation for infectious diseases control, exchange of experts for technical assistance on Universal Health Coverage focusing on strengthening public health and primary health care delivery,\nExchange of healthcare financing experts for lesson sharing and guidance for developing healthcare financing policies, cooperation in medical training and research, and assist medical professionals by granting fellowships from respective institutions and cooperation in developing mental health infrastructure and trainings regarding mental health services in outreach facilities.\nDuring the meeting it was highlighted that in the global health context, both countries should work closely with other EMRO Member States and WHO to ensure that realization of tangible measures to promote health remains at the forefront of the global development agenda.\nFor this purpose it was agreed that respective Missions of both countries in Geneva may work closely especially on important matters like the upcoming negotiations on proposed pandemic treaty, International Health Regulations amendments, and sustainable finances of WHO.\nPakistan has recently been selected as one of the recipients of mRNA technology. “Once this arrangement matures, we would help expand vaccine supply to EMRO region and beyond,” the minister shared.",
  "retrievedAt": "2025-08-11T14:57:53.599Z"
}
