{
  "title": "Govt not to tolerate terrorism in guise of politics: Rana Sanaullah",
  "link": "https://www.app.com.pk/national/govt-not-to-tolerate-terrorism-in-guise-of-politics-rana-sanaullah/",
  "date_published": "2022-05-25T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 25 (APP): Minister for Interior, Rana Sanaullah Khan Wednesday said the government will not tolerate terrorism in guise of politics as police seized huge cache of weapons from residence of Pakistan Tehreek-e-Insaf (PTI) leader in provincial capital of Punjab ahead of their long march.\n“The seizure of heavy arms and ammunition from the houses of Pakistan Tehreek-i-Insaf (PTI) officials is evidence of a bloody march”, the federal minister said in a statement.\nThe federal minister said that PTI General Secretary’s house is a depot of ammunition and the discovery of arms from the homes of PTI officials is proof of a bloody march. The nation has seen that from where did the bullet came which killed an innocent police personnel.\nThis incident has proved that PTI’s march is not a peaceful political caravan but an armed struggle, he said.\nRana Sanaullah said that Imran Niazi cannot be trusted after the martyrdom of a young policeman and recovery of heavy arms and ammunition from the houses of PTI officials.\nHe urged former prime minister Imran Khan to follow the constitution and law.\nThe minister also warned that Imran Khan should not use the machinery and resources of the Khyber Pakhtunkhwa government for inciting riots in the country. “Those filling up the foundations of the economy with explosives will not be allowed to destroy the peace of the society”, he said.\nThe constitution and the law will be strictly enforced and those who will take law into their hands will be dealt strictly.\nHe said the government would ensure protection of life and property of the people at all cost.\nThose who have been putting the nation behind the lights of the truck of promises for three and a half years are now making noise in the `Batti Chowk’ in Lahore.",
  "retrievedAt": "2025-08-11T14:57:51.360Z"
}
