{
  "title": "Australian High Commissioner highlights education and trade cooperation with Pakistan",
  "link": "https://www.app.com.pk/national/australian-high-commissioner-highlights-education-and-trade-cooperation-with-pakistan/",
  "date_published": "2024-06-09T09:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 09 (APP): Australian High Commissioner to Pakistan Neil Hawkins on Sunday emphasized Australia’s commitment to investing in Pakistan’s future through education and trade.\nIn an exclusive talk with the Associated Press of Pakistan (APP), he said, “By investing in the people of Pakistan, particularly the young people who study in Australia, we hope they will return with valuable skills to contribute to Pakistan’s future,” Hawkins stated.\nHe highlighted the sustained efforts to offer scholarships, focusing on women in executive leadership, climate change and agriculture. “Gender equality and climate change are major focuses for us,” he said, underscoring the shared climate challenges between the two nations and the potential for cooperative efforts.\nThe environmental focus, particularly on water and agriculture, remains a critical aspect of their support, with Hawkins noting his recent visit to northern Pakistan to witness climate change impacts firsthand.\nRegarding trade, Hawkins noted a significant increase from the 2.5 billion dollars trade volume in 2022, with a 30 percent rise this year. Key exports include agricultural products like cattle, wheat, and canola, with nearly 90 percent of Pakistan’s canola sourced from Australia. “If you’re enjoying chana or chickpeas for breakfast, they’re likely from Australia as well,” he added.\nThis dialogue was part of an event celebrating the achievements of 60 Pakistani scholars who completed their studies in Australia through the prestigious Australia Awards scholarship program. These scholars, including 21 men and 39 women, were recognized for their academic excellence and dedication.\n“I am proud to join the celebrations with these Pakistani scholars who have completed their studies funded by Australia,” Hawkins said. “I congratulate them on their hard work and dedication. I am confident their newly acquired knowledge and skills will contribute to the development of Pakistan. It’s an investment by Australia in Pakistan’s future.”\nThe Australia Awards scholarship program is a key component of the Australian Government’s development assistance to Pakistan. The program equips scholars with the expertise needed to drive progress in Pakistan.\nHigh Commissioner Hawkins said, “We’re keen to ensure representation from across all regions in Pakistan and to ensure we support the empowerment of women – promoting gender equality is central to Australia’s foreign policy.”\nThe High Commissioner however expressed concern over a number of cases where, despite having given undertakings to return, some scholarship recipients had remained in Australia post-graduation.\nHe cautioned such actions not only contravene the terms of the scholarship but also undermine the very purpose of this initiative and could ultimately ‘jeopardise the future of the program and deprive aspiring Pakistani scholars from an Australian education.”",
  "retrievedAt": "2025-08-11T03:06:12.518Z"
}
