{
  "title": "Kashmiris on both sides of LoC observe Jammu Martyrs Day",
  "link": "https://www.app.com.pk/national/kashmiris-on-both-sides-of-loc-observe-jammu-martyrs-day/",
  "date_published": "2024-11-06T10:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 6 (APP): Kashmiris on both sides of the Line of Control and around the world observed Jammu Martyrs’ Day on Wednesday in memory of the tens of thousands of Muslims who were brutally massacred in Jammu on November 6,1947.\nThe day observed every year served as a reminder of the sacrifices made by the martyrs and reinforced the Kashmiri people’s commitment to their struggle for self-determination.\nIn early November 1947, hundreds of thousands of Muslims were killed by Dogra forces, the Indian Army, and Hindu extremists while attempting to migrate to Pakistan. This massacre, considered one of the first major cases of ethnic cleansing after World War II, aimed to alter the demographics of Jammu and Kashmir by eliminating the Muslim population in the Jammu region.\nIn Pakistan as well as Azad Jammu and Kashmir, a series of events including anti-India demonstrations, seminars, and special prayer meetings have been organized to pay homage to the Jammu martyrs. The day began with prayers in mosques across AJK, seeking the early liberation of Indian illegally occupied Jammu and Kashmir and for the prosperity of Pakistan and AJK. Quran Khawani sessions and gatherings are being held by social, political, and religious organizations to honor the sacrifices made by the Kashmiri people.\nIn early November 1947, hundreds of thousands of Muslims were killed by Dogra forces, the Indian Army, and Hindu extremists while attempting to migrate to Pakistan. This massacre, considered one of the first major cases of ethnic cleansing after World War II, was aimed to alter the demographics of Jammu and Kashmir by eliminating the Muslim population in the Jammu region.\nIn Azad Jammu and Kashmir, as well as in Pakistan, a series of events including anti-India demonstrations, seminars, and special prayer meetings have been organized to pay homage to the Jammu martyrs. The day began with prayers in mosques across AJK, seeking the early liberation of Indian illegally occupied Jammu and Kashmir and for the prosperity of Pakistan and AJK. Quran Khawani sessions and gatherings are being held by social, political, and religious organizations to honor the sacrifices made by the Kashmiri people.\nKashmiri activists and leaders describe the Jammu massacre as a dark chapter in human history and a glaring example of Hindutva-inspired violence aimed at Kashmiris. They argue that the tragic events of 1947 continue to resonate, as atrocities in IIOJK persist under the current BJP-led government in India. Activists contend that Hindutva forces seek to replicate the demographic changes attempted in Jammu by suppressing the Kashmiri Muslim population through systematic genocide and policies designed to dilute their political and cultural identity.\nCivil society organizations have been urging the international community to intervene and hold the Indian government accountable for war crimes and crimes against humanity. Many believe that the ongoing violence and denial of self-determination are rooted in the unresolved issue of Jammu and Kashmir’s status.\nAs Kashmiris across the world remember the martyrs of the 1947 Jammu massacre, they pledge to continue their resistance against what they view as an oppressive occupation. They call for international attention to the Kashmir issue, underscoring that the scars of the 1947 massacre remain deeply embedded in the collective memory of the Kashmiri people.",
  "retrievedAt": "2025-08-10T15:05:21.282Z"
}
