{
  "title": "ILF to celebrate decade of literary excellence showcasing sustainability",
  "link": "https://www.app.com.pk/national/ilf-to-celebrate-decade-of-literary-excellence-showcasing-sustainability/",
  "date_published": "2024-11-06T15:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 6 (APP): The 10th edition of the Islamabad Literature Festival (ILF), one of Pakistan’s most anticipated literary events, is set to take place from 8th to 10th November 2024 at Gandhara Citizen’s Club, Fatima Jinnah (F-9) Park.\nThe festival will organize by Oxford University Press (OUP) Pakistan in collaboration with Getz Pharma, this year’s ILF celebrates its decennial with the theme, “Sustainability: Words Change Mindsets,” said a press release on Wednesday.\nThis annual festival of literature, arts, and intellectual exchange promises a dynamic array of voices, ideas, and perspectives, creating an enriching experience for literature enthusiasts, writers, scholars, and the general public. With 55 sessions and 15 book launches, ILF 2024 offers an extensive lineup of discussions, workshops, and cultural activities.\nArshad Saeed Husain, Managing Director of OUP Pakistan, emphasized the importance of sustainability and the transformative power of words. He highlighted the festival’s role in inspiring change, challenging outdated perspectives, and celebrating the art of storytelling. “Literature has the unique power to shape perspectives, inspire action, and drive societal change. As we celebrate the 10th edition of the Islamabad Literature Festival, we are not only looking back on a decade of fostering dialogue but also forward to a future where words can lead us to a more sustainable and inclusive world. ILF serves as a vital platform for meaningful conversations that challenge conventional thinking and ignite new ideas, empowering individuals to contribute towards a better Pakistan.”\nThis year’s ILF will feature renowned authors, poets, and intellectuals from around the world, who will engage in panel discussions on literature, history, current affairs, and socio-political issues.\nThe inaugural keynote address will be delivered by Jane Marriott CMG OBE, British High Commissioner to Pakistan, alongside distinguished speakers Zehra Nigah (renowned poet), Maleeha Lodhi (former Pakistan representative to the UN), Federal Minister for Finance & Revenue Muhammad Aurangzeb, Mohyuddin Ahmad Wani, Special Secretary of the Ministry of Federal Education and Professional Training, Rana Sikandar Hayat, Provincial Minister of School Education for Punjab, Iftikhar Arif, Urdu Poet, Scholar and Littérateur, and Najeeba Arif, Eminent Scholar, Creative Writer, Critic and Researcher.\nWith an impressive roster of national and international speakers, ILF’s 10th edition continues its mission of fostering cultural dialogue, literary discourse, and the exchange of diverse perspectives. Notable participants include Hamid Mir, Nasim Zehra, Faisal Bari, Kishwar Naheed, Anwar Masood, Alamgir Hashmi, Baela Raza Jamil, Andrew Coombe, Muneeza Shamsie, and others.\nThe festival will also feature a book fair, offering a diverse selection of books from various genres, giving attendees the chance to explore and purchase works by their favourite authors. Cultural performances, including music, dance, and other forms of artistic expression to showcase Pakistan’s vibrant art scene, allowing attendees to experience the richness of the country’s culture.\nThis year’s Islamabad Literature Festival promises to be a landmark event, celebrating a decade of promoting literature and intellectual exchange in Pakistan.",
  "retrievedAt": "2025-08-10T15:06:15.252Z"
}
