{
  "title": "Experts propose measures to achieve sustainable targets",
  "link": "https://www.app.com.pk/national/experts-propose-measures-to-achieve-sustainable-targets/",
  "date_published": "2024-11-06T15:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 06 (APP):Amid sluggish growth and increasing poverty ratio in the country, experts on Wednesday recommended certain measures to policymakers that focused on achieving sustainable targets and plugging loopholes in a number of sectors that impeded economic growth.\nPanel discussions, policy dialogue, roundtables and thematic sessions continued on the third day of the ongoing Sustainable Development Conference organised by the Sustainable Development Policy Institute (SDPI), said a press release.\nAt a session titled, ‘Role of Microfinance Institutions for Climate Risk Insurance’, speakers said with Pakistan’s increasing vulnerability to climate change, conventional funding alone was insufficient to achieve climate resilience and required more innovation and products to be added.\nWazirzada Yasir, senior official at the Security and Exchange Commission of Pakistan (SECP), proposed launching climate risk insurance products through pool by several insurance companies to enhance its outreach at a reduced cost.\nHead of Strategy Mobilink Microfinance Bank Ltd Khowla Shoaib said the bank had made several strides to bring the marginalised segments of society into financial inclusion through resolving female account owner App.\nHead Programme and Partnerships, IBA, Syed Bulent Sohail outlined key lessons for Pakistan while recommending dedicated climate risk insurance products, strengthening public-private partnerships, expanding ESG and climate-focused lending and comprehensive climate adaptation programme.\nDirector SELF India Anuradhapura Mirikar said the region was facing the same challenge from climate change.\nUmer Baloch from World Bank said the role of MFIs was catalyst for financial inclusion.\nIn another session on the ‘Local Government System in Pakistan: From Challenges to Resilience’, MNA Nafisa Shah, the convener of the Parliamentary Forum on Energy and Economy, said after the 18th Amendment, Article 140-A had been strengthened and now local governments had become a provincial subject, adding that there were challenges but even then, governance should be devolved.\nMuttahida Qaumi Movement-Pakistan (MQM-P) leader Jawed Hanif Khan and National Assembly Standing Committee of Commerce chairman said the local government system was not being strengthened because they were not being provided sufficient funds.\nSpeaking at the podium discussion titled ‘Societal Cohesion: Promoting Tolerance and Peace for Inclusive Development’, Senator Afrasiab Khattak of Awami National Party (ANP) said lack of peace and tolerance in the society had sprouted from the policy decisions taken by the state.\nKaron Shaiva, IDOBRO & RIF, India, said societal cohesion development and peace were critical as cohesion showed stability and strength that builds foundation for societal development.\nFormer federal secretary Dr Syed Kaleem Imam said trust, due process, social contract and ethics were necessary for social cohesion.\nSenior journalist and anchor Asma Shirazi said the system had been destroyed aggressively that demanded abrupt measures to reclaim it.\n“The entire war is of economics that had shattered our social cohesion and good economy will only bring good ethics and societal development,” she said.\nSpeakers at the session, ‘Opportunities and Challenges for Today’s Youth and Future Human Capital’, emphasised that empowering the youth through social protection measures was essential for fostering resilience and enabling meaningful contributions to the nation’s economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:06:31.913Z"
}
