{
  "title": "SIE 2024: Private sector drives green change for sustainable Pakistan",
  "link": "https://www.app.com.pk/national/sie-2024-private-sector-drives-green-change-for-sustainable-pakistan/",
  "date_published": "2024-11-06T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 06 (APP): As the second edition of the Sustainability Investment Expo (SIE 2024) is underway here at Pak-China Friendship Centre, the event features a variety of eco-friendly initiatives from the private sector aimed at creating a greener Pakistan.\nWith the theme “Pioneering Solutions for Climate Resilience,” the expo was inaugurated by Chairperson Senate Standing Committee on Climate Change and Environmental Coordination, Senator Sherry Rehman.\n“SIE is not just an expo, but a knowledge base,” said Sherry Rehman. “This event is a vital platform for raising awareness and driving change. It is essential to empower the private sector, whose innovation and commitment will be key to addressing the climate challenges we face.”\nThe event featured a variety of stalls from the local and international companies, along with startups and small businesses committed to sustainable technologies, renewable energy solutions, and environmentally friendly practices.\nOne of the key highlights was the participation of green tech startups, which showcased cutting-edge products like biodegradable packaging and energy-efficient appliances. “We believe that the private sector holds the key to a sustainable future,” said Hafsa Syed, a representative of ECO Gen., focusing on eco-friendly projects.\n“We have started a number of initiatives like EcoGen: recycling waste into fertilizer, and Evenger is a unique platform aimed at teaching children sustainable habits,” Syed said.\nSustainability was also at the forefront for companies like Roshan Packages Limited (RPL), which has been a pioneer in reducing paper waste. Waseem Mufti, Marketing Manager at RPL, stated, “We’re committed to sustainability from day one, reusing and recycling paper products for packaging. Events like this give us the opportunity to connect with like-minded investors who support our vision for a greener future.”\nA Forest Officer from Ministry of Climate Change, Muhammad Hashim at expo said, “We are displaying various initiatives of the government under the ‘Green Pakistan Programme’ at our stall. , “We are implementing a range of initiatives to increase biodiversity and promote conservation. These interventions include tree plantations and strategies for protecting various ecosystems.”\nThe expo highlighting the crucial role of private enterprises in achieving Pakistan’s sustainability goals. Companies like Hutchison Ports Pakistan are also leading by example. Naveed Qureshi, Assistant General Manager (AGM) at Hutchison Ports, talking to APP said, “Our electric and hybrid cranes are part of our broader effort to reduce emissions, and we are set to introduce e-trucks in Pakistan as well.”\n“We are committed to the UN SDGs, delivering on our promise for a resilient and thriving Pakistan by planting 1 million mangroves in partnership with WWF by 2030”, he said.\nAddressing the alarming issue of plastic waste, ‘Green Plastic Private Limited’ has developed an innovative solution by manufacturing plastic bags from potato peels. Maria Qayyum, the company’s Chief Operational Officer, explained, “By using organic materials like potato peels, we are reducing single-use plastic pollution and organic waste at the same time. We currently produce 20 bags a day manually, and our aim is to scale this up to make a larger environmental impact.”\nIn a bid to combine technology and sustainability, Programe Manager at atomcamp Amina said, “Sustainability lab is new initiative by atomcamp under which we work at the intersection of climate change, data and AI. “We are introducing evidence-based thinking for climate change in Pakistan and making contribution to tackle climate challenges with data driven strategies.”\n“We have conducted ‘Green Space’ study in Rawalpindi which found that only 4.6% of Rawalpindi’s area is green space, far below the UN’s recommended 15%.”\nThe expo highlighted that the private sector is not only responding to global environmental challenges but also spearheading efforts to make eco-friendly innovations scalable and accessible.\nThe visitors including students, environmental activists, and business leaders, lauded the private sector’s contributions and said Pakistan stands at a crucial juncture in its journey towards sustainability.\nThe 2nd edition of Sustainability Investment Expo will continue until November 7, besides 27th Sustainable Development Conference.\n/395",
  "retrievedAt": "2025-08-10T15:05:00.570Z"
}
