{
  "title": "PM Shehbaz inaugurates model village for flood-hit Ghizer people",
  "link": "https://www.app.com.pk/national/pm-shehbaz-inaugurates-model-village-for-flood-hit-ghizer-people/",
  "date_published": "2024-11-06T09:34:00.000Z",
  "source": "APP",
  "content": "GHIZER, Nov 6 (APP): Prime Minister Shehbaz Sharif on Wednesday inaugurated a model village to provide a housing facility to the people of the Bubar Village of Gilgit’s Ghizer district, who had lost their homes consequent to the floods in 2022.\nThe model village has been built over 110 kanal of land. Every home in the village consists of two bedrooms and is equipped with a water supply, solar power, and road connectivity.\nThe prime minister, who earlier distributed allotment certificates among a few of the entitled people, asked the authorities concerned to immediately build a school, dispensary and playground for the village. The dispensary should be equipped with first aid, ultrasound, X-ray and maternity care facilities, he added.\nHe also called for the third-party validation of the project to address the shortcomings and asked to add chimneys in all the newly constructed houses to avert any untoward incident, particularly during the winter.\nWearing a traditional Gilgit cap Pakul and robe, he instructed Federal Education Minister Khalid Maqbool Siddiqui to supervise the construction of the school at the village.\nPrime Minister Shehbaz, who had also visited the flood-hit village in 2022 after it was completely destroyed, recalled teenage girl Qandeel and her father were among the only survivors of their family.\nHe said that he had announced Rs5 million endowment fund for Qandeel that had increased to Rs6.7 million to support her expenditures and make her pursue her dreams.\nThe prime minister appreciated GB Chief Minister Haji Gulbar Khan and other senior officers for supervising the project.\nEarlier, the prime minister also unveiled the plaque for the 216-kilometer Gilgt Shandur Road that would be completed by November 2025 and reduce the inter-city travel duration from eight hours to three hours.\nIn his address, GB Chief Minister Gulbar Khan thanked the prime minister for supporting the GB people in distress. He said the 2022 floods killed several residents in the Bubar village and the newly built model village was equipped with all basic amenities including connectivity.\nIn his remarks, a Community Member of the Village also thanked the prime minister, GB chief minister, former CM Hafiz Hafeezur Rehman and district administration for their efforts to build the model village and the rehabilitation of the flood-affected people.\nFederal ministers Ahsan Iqbal, Khalid Maqbool Siddiqui, Attaullah Tarar and Amir Muqam accompanied the prime minister.\nThe prime minister, who earlier distributed allotment certificates among a few of the entitled people, asked the authorities concerned to immediately build a school, dispensary and playground for the village. The dispensary should be equipped with first aid, ultrasound, X-ray and maternity care facilities.",
  "retrievedAt": "2025-08-10T15:05:25.497Z"
}
