{
  "title": "PM visits Chinese embassy to condemn firing on Chinese nationals in Karachi",
  "link": "https://www.app.com.pk/national/pm-visits-chinese-embassy-to-condemn-firing-on-chinese-nationals-in-karachi/",
  "date_published": "2024-11-06T15:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 06 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday visited the Chinese Embassy to condemn a firing incident, in Karachi yesterday, in which Chinese nationals were injured and assured exemplary punishment to those involved in the incident.\nTalking to Chinese Ambassador to Pakistan Jiang Zaidong, the prime minister said that he came to condemn the yesterday’s attack on Chinese nationals and to inquire after the health of those injured in the incident.\nThe prime minister assured the Chinese ambassador that those responsible in the incident would be apprehended soon and would be awarded exemplary punishment, PM Office Media Wing said in a press release.\nHe further informed the Chinese ambassador that he was personally supervising the process of arresting those involved in the incident and bringing them to justice.\nMoreover, he had directed to provide the best medical facilities to the Chinese citizens injured in the incident, he said, adding that it was a matter of satisfaction that the health of the injured Chinese nationals was improving.\nDeputy Prime Minister and Foreign Minister Mohammad Ishaq Dar, Minister for Interior Mohsin Raza Naqvi and Special Assistant to PM Tariq Fatemi accompanied the prime minister.\nPrime Minister Sharif said that China was a long-standing friend of Pakistan and the attack on the Chinese nationals was a desperate attempt to damage Pakistan-China fraternal relations.\nHe reiterated that the security of Chinese nationals, working in Pakistan, was the top priority of the government.\nThe Chinese ambassador thanked the prime minister for his visit and hoped that he would play his role in bringing those responsible for the incident to justice soon.",
  "retrievedAt": "2025-08-10T15:06:08.364Z"
}
