{
  "title": "Experts discuss climate action, economic growth challenges for Pakistan at 27th SDC",
  "link": "https://www.app.com.pk/national/experts-discuss-climate-action-economic-growth-challenges-for-pakistan-at-27th-sdc/",
  "date_published": "2024-11-05T19:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP):The second day of the Sustainable Development Conference (SDC) saw a number of panel discussions, with speakers deliberating on issues including regional connectivity, climate change, plastic waste management, women empowerment, debt justice, economic zones, textile industry and accountability.\nThe conference is being organised by the Sustainable Development Policy Institute (SDPI). In a panel discussion on ‘Leveraging new economic geography for shared prosperity, stability and resilience’ speakers on Tuesday stressed the need to translate Pakistan’s regional connectivity and infrastructure into economic incentives, said a press release.\nVice Chancellor (VC) of BeaconHouse National University, Lahore, Dr Moeed Yusuf said that the problem is that we continue to hold conversations on regional cooperation while the world was moving on.\nFormer ambassador to China Naghmana Hashmi said CPEC was never about power connectivity alone, “we were supposed to develop our industrial zones based on the connectivity from CPEC”.\nFormer federal minister, Khurram Dastgir Khan said Pakistan had always been leveraging its geographical location to determine our foreign policy.\nDr Dushni Weerakoon, Institute of Policy Studies Sri Lanka executive director, said we have similar conversations about the “tyranny of location” in Sri Lanka.\nDr Paras Kharel from South Asia Watch on Trade, Economics and Environment, Nepal, spoke on the importance of South Asian Association for Regional Cooperation (SAARC) in connection with regional cooperation.\nDr Rajan Suresh Ratna from UNESCAP-SSWA, India, said it was not just about cooperation, it was also about peace and development, adding that Saarc region hosts half of the poor population of the world.\nIn a session titled ‘Role of Textile Industry in Strengthening Climate Action in Pakistan’, Chief Operating Officer, Younas Textiles, Mohammad Nisar Palla said the textile industry was playing an important role in the country’s economy, therefore it should be facilitated.\nAsad Naqvi from UNEP-Geneva said if Pakistan wanted to compete internationally, it would have to reduce its per unit cost of electricity and use recyclable material.\nAhmed Qazi from the European Union (EU) Delegation to Pakistan said if we get into a discussion on who was producing more pollution, we would not be able to come up with a solution.\nSenior Joint Secretary, Climate Change Ministry, Mohammad Farooq said we needed investment for decarbonization, therefore public-private partnership was required, whether in textile, transport or agriculture.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:05:50.462Z"
}
