{
  "title": "Govt to setup 10,000 EV charging stations by 2030: Rana Tanveer",
  "link": "https://www.app.com.pk/national/govt-to-setup-10000-ev-charging-stations-by-2030-rana-tanveer/",
  "date_published": "2024-11-06T10:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 6 (APP):Minister for Industries and Production Rana Tanveer Hussain on Wednesday unveiled the government plan to transform the transportation landscape by setting up 10,000 electric vehicle (EV) charging stations by 2030.\nAddressing an “exhibition of electric bike models” organized by the Engineering Development Board (EDB), he emphasized the government’s commitment to reducing fuel dependency, cutting carbon emissions, and promoting cleaner, sustainable transportation.\nWith growing private sector interest and government-backed incentives, this push toward electric mobility is poised to significantly benefit both the economy and the environment.\nThe ministers said around 31 companies have expressed interest in investing in electric vehicles in Pakistan while 2 companies were granted permission to manufacture electric vehicles.\nHe said “Pakistan is now in a position to export three-wheelers”. The minister highlighted some key initiatives to promote electric vehicles across the country.\nHe said that manufacturing activities will soon begin by private companies, boosting the industry.\nHe said that the government would launch the second electric vehicle policy by November 30 to promote eco-friendly transportation.\nHe said, Punjab government was also working on two and three-wheeler electric vehicles.\nThe minister also announced that 100 students will receive electric bikes based on merit through a bidding process conducted in a transparent and fair manner.\nThe government has earmarked Rs 4 billion for electric motorcycles.\nHe said, the private sector plays a vital role in Pakistan’s economic development, with the country’s economy moving towards improvement, he remarked.\nThis shift towards eco-friendly transportation is expected to have a positive impact on Pakistan’s environment and economy.\nWith the government’s support and private sector investment, the country is poised for a greener future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:05:24.271Z"
}
