{
  "title": "ICT admin bans wall chalking, arrests 16 violators",
  "link": "https://www.app.com.pk/national/ict-admin-bans-wall-chalking-arrests-16-violators/",
  "date_published": "2024-11-06T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 06 (APP): The Islamabad Capital Territory (ICT) administration launched a city-wide crackdown against unauthorized wall chalking, leading to several arrests and charges.\nThis swift action aims to enforce the recent ban on wall chalking in public spaces, targeting those who deface city walls for promotional campaigns, said the spokesman of ICT administration on Wednesday.\nIn a recent operation, the Islamabad district administration intensified efforts against illegal wall chalking across the city.\nAs many as eleven people were arrested for violating the ban. Of these, seven were detained by the Assistant Commissioner (AC) of the Secretariat area in Barakahu, while four were taken into custody by the AC Saddar from Margalla Avenue. Authorities have registered cases against all accused individuals involved.\nThe Deputy Commissioner (DC) of Islamabad, Irfan Nawaz Memon, has issued strict instructions to clamp down on wall chalking across the city.\nMemon emphasized that both the individuals creating the chalking and the businesses behind them will face consequences.\nThis crackdown targets advertisements by various entities, including private clinics, flats, marriage halls, a wood company, and a training institute, which had been promoting their services through wall chalking.\nMeanwhile, five more individuals were apprehended in connection with recent theft cases linked to this ongoing campaign.\nThe AC Secretariat registered a case at the local police station against the latest group of individuals, reinforcing the administration’s stance against defacing public property.\nDC Islamabad Irfan Memon has directed his team to identify all parties involved in running such ad campaigns on city walls and ensure compliance with the wall chalking ban throughout Islamabad.",
  "retrievedAt": "2025-08-10T15:05:00.652Z"
}
