{
  "title": "CDA, FIA collaborate to tackle human trafficking",
  "link": "https://www.app.com.pk/national/cda-fia-collaborate-to-tackle-human-trafficking/",
  "date_published": "2024-11-06T16:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 06 (APP):In a significant move to combat human trafficking in the Islamabad Capital Territory (ICT), Chairman Capital Development Authority (CDA), Muhammad Ali Randhawa, met with Director Anti-Human Smuggling Wing Federal Investigation Agency (FIA) Saqib Sultan Mehmood, to strategize efforts against Trafficking in Persons (TIP).\nThis high-level meeting, attended by officials from ICT departments, aimed at establishing clear targets and action plans to address the pressing issue.\nA primary focus of the discussion centered on findings from the 2024 Trafficking in Persons (TIP) Report released by the U.S. Department of State.\nDuring the briefing, the FIA Director highlighted the urgency of decisive action to prevent Pakistan from being placed on the TIP Watch List.\nHe stressed that proactive measures are essential to uphold Pakistan’s reputation and international standing on human rights issues.\nCommissioner Randhawa emphasized the commitment of Islamabad’s authorities to tackle all forms of human trafficking, including forced begging and bonded labour.\nHe issued directives for the immediate convening of the District Vigilance Committee for ICT, tasked with implementing key recommendations from the TIP report.\nFurthermore, he instructed ICT departments to improve data collection and coordination with the FIA’s Anti-Human Smuggling Wing on cases of trafficking, particularly those involving sexual exploitation, forced and bonded labour, and forced begging.\nThe meeting underscored the necessity of training and capacity building for relevant departments, as well as conducting public awareness campaigns to educate citizens on TIP issues.\nOfficials stressed the importance of coordinated stakeholder efforts to ensure thorough investigation, prosecution, and conviction of traffickers.\nComprehensive data collection, including case registrations, prosecutions, and convictions, as well as details on victim referrals to social services, will play a crucial role in the ongoing fight against trafficking.\nThe session concluded with a collective resolve to strengthen efforts to prevent trafficking and provide justice for victims, focusing on the three pillars of prosecution, protection, and prevention.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:06:13.817Z"
}
