{
  "title": "Govt notifies ADR Mediation Accreditation (Eligibility) Rules 2023",
  "link": "https://www.app.com.pk/national/govt-notifies-adr-mediation-accreditation-eligibility-rules-2023/",
  "date_published": "2023-03-09T09:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 9 (APP): The federal government, in exercise of powers conferred by section 25(1) read with section 4(1) and other relevant provisions of the Alternative Dispute Resolution Act 2017, has made and notified the ADR Mediation Accreditation (Eligibility) Rules 2023.\nThe rules called as the ADR Mediation Accreditation (Eligibility) Rules 2023 shall come into force at once, a notification dated February 21, 2023 of the Ministry of Law and Justice and issued here on Thursday said.\nAccording to the notification “Words and expressions used but not defined in these rules would bear the meanings given thereto in the Alternative Dispute Resolution Act, 2017.\nThe notification stated that an ADR Centre providing mediation services or a mediator would be eligible for accreditation where the end-to-end mediation process framework by which it proclaimed to be bound.\nThe framework administered or recommended by an organisation listed in the annexe to these rules and is adopted by the ADR Centre or mediator, with the permission of the organisation, if required, or developed by itself and is found by the accreditation committee to be confirmed in material aspects to the frameworks of the organisations referred to in the annexe to these rules, it added.\nThe notification further stated that in either of the cases, the applicant will sign a bond in favour of and in the form specified by the accreditation committee undertaking to remain faithfully bound to its mediation process framework.\nThe mediators empanelled by an ADR Centre at the time of application and at all times thereafter are trained and certified by an organisation listed in the annexe to these rules or by a trainer certified by such organisation to impart training, it added.\nAccording to the Rules, an applicant ADR Centre shall either be a company or a statutory corporation and the mediation is undertaken to be carried out at own, leased or usage-based-access premises with a minimum of two rooms for private sessions and one larger room for common sessions in addition to its administrative and managerial rooms with fit for purpose secretarial, communication, facilitation, case management, IT and record keeping facilities.\nAn ADR Centre or a mediator seeking to empanel with the high court for court-referred mediations will meet such additional requirements as may be specified by the high court in a circular issued for the purpose.",
  "retrievedAt": "2025-08-11T06:19:41.687Z"
}
