{
  "title": "IT parks to generate job opportunities, attract foreign exchange",
  "link": "https://www.app.com.pk/national/it-parks-to-generate-job-opportunities-attract-foreign-exchange/",
  "date_published": "2023-03-09T08:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 9 (APP): The state-of-the-art Information Technology Parks across the country would generate job opportunities for IT professionals, attract millions of dollars in precious foreign exchange, boost the IT industry and increase its exports after their completion.\n“Work on IT parks in Karachi at the cost of Rs 41 billion and Islamabad IT park at the cost of Rs 13.72 billion is underway. At their completion, they would provide job opportunities for 20000 and 15000 IT professionals respectively,” said an official of the Ministry of Information Technology.\n“Karachi IT Park is the largest IT project of its kind in Pakistan, which will benefit not only the citizens of Karachi but also the IT professionals and companies of Sindh and the rest of Pakistan,” he added.\nThe Establishment of IT Park, Karachi was approved by the Executive Committee of the National Economic Council (ECNEC) in its meeting held on June 4, 2021, at a capital cost of USD 186.658 million including USD 158.416 million from Korean Exim Bank as a loan and PSDP local share of USD 28.242 million. The project shall be completed in June 2026.\nThe land was acquired near Jinnah International Airport from Civil Aviation Authority for the park.\nThe official of the Ministry of IT said technology parks must comply with basic infrastructure requirements such as clean facilities and ample working space. However, tech parks were also equipped with the latest technology and telecommunication facilities that make it easy to establish and manage a business.\nThe main objective of technology parks was to support the creation and development of knowledge-based enterprises.The range of services offered by the parks was closely linked to the functions that they had to fulfil, he said, adding the benefits of the technology parks were not limited to enterprises and tenants of the parks, but also for companies outside the parks. The benefits of technology parks included a boost in the knowledge-based economy, entrepreneurship and the latest technologies, he said.\nThe IT Park Karachi was an eleven-storey (8 storeys above and 3 underground floors) self-contained building having a covered area of 106,449 square meters. The Technology Park, Karachi is providing office space to approx. 225 start-ups and small to medium enterprises and other ancillary facilities like testing laboratories, classrooms, industry-academia linkage centers, auditoriums etc.",
  "retrievedAt": "2025-08-11T06:19:46.733Z"
}
