{
  "title": "AJK observes World Thalassemia Day with renewal of pledge to combat the diseases",
  "link": "https://www.app.com.pk/national/ajk-observes-world-thalassemia-day-with-renewal-of-pledge-to-combat-the-diseases/",
  "date_published": "2020-05-08T21:59:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): May 09 (APP):World Thalassemia Day was observed in Azad Jammu Kashmir (AJK) on Saturday with renewal of the pledge to utilize maximum possible efforts to save the patients of thalassemia by ensuring regular transfusion of blood and other required treatment.\nSpecial ceremonies were held in the public sector hospitals in various parts of AJK to observe the day while a special ceremony was held to mark the day at Thalassaemia Treatment Centre located in DHQ Hospital Mirpur under the auspices of Young Doctors Association of Mirpur.\nSpeakers including the chief guest Dr. Tanveer Sadiq, Suregeon Dr. Ahmed Naeem Kiyanai, Chairman YDA Mirpur Dr. Khuram Hussain Shah, President YDA Dr. Gohar Latif Kaalis, President YDA MBBS College, De. Waqas Ahmed Neuro Suregon, Div. Director Information Deptt. Javed Mallik, Muhammad Wasim and Muhammad Zakir From Paramedical Association and others highlighted, on this occasion, the individual and collective role of the society including philanthropists to combat the disease of thalassemia with the coordination and cooperation of the state health institutions by raising awareness among the masses especially for undergoing the blood tests by both genders before marriages.\nThey underlined that a modern Thalassemia Treatment Centre in AJK is functioning in Mirpur DHQ hospital since about past one decade providing the possible due latest treatment to the children suffering with Thalassemia disease.\nThe center, it may be added, was set up in collaboration with philanthropists engaged in serving the ailing humanity.\nThe emergence of the Thalassaemia Centre in Mirpur was the pilot project of the integrated plan chalked out to extend the latest medical treatment to thalassemia patients through establishment of special treatment centers in all ten DHQ hospitals in AJK under an integrated phased program.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:11:51.043Z"
}
