{
  "title": "Sh Rashid sees prominent role of Pakistan among nations in future",
  "link": "https://www.app.com.pk/national/sh-rashid-sees-prominent-role-of-pakistan-among-nations-in-future/",
  "date_published": "2020-05-09T06:20:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 09 (APP):Pakistan Railways Minister Sheikh Rashid Ahmad has said that role of Pakistan would become more prominent in the region in the wake of coronavirus pandemic due shifting global scenario as well as world politics.\nAddressing a press conference at the PR headquarters here on Saturday, he said that India could try to attempt any conspiracy against Pakistan, adding it’s brutalities in Indian Occupied Kashmir were on the rise. He condemned that atrocities against Muslim citizens were spreading in different parts of India.\nHowever, he said, “It will be a blunder of Indian prime minister Narendra Modi if he would ever under estimate Pakistan”.\nTo a question,Sheikh Rashid said, “Credit goes to Prime Minister Imran Khan and his cabinet which pointed out the illegal import of medicines from India.”\nHe assured the nation that Prime Minister Imran Khan would never spare culprits involved in any scam, adding that he (PM) would never spare the culprits of sugar and flour scams after declaration of forensic report of the investigation. In this context ,he said that National Accountability Bureau (NAB) would focus to bring looters of every political party in the court without any discrimination.\nHe said that PML (N) leader Shehbaz Sharif once again wanted to flee, but this time he would not be able to do so as he failed to answer the questions of NAB regarding his illegal assets.\nTo a question about investigation commission to probe IPPs scam, he said that it could take five to six months as its body had not been constituted yet.\nHe said that Pak Railways was ready to start its train operation with 30 trains and the federal government had also agreed but some provinces had reservations therefore the restoration of train service was delayed.\n“We were operating 142 trains before lockdown, but now we are ready to restore it with 30 trains initially in the first phase,” he added.\nTo another question, he said that strict action against concerned senior officers, instead of junior staff, would be taken in case of any accident in railways in the future.\nHe said that the railways was going to install electricity metres of the Lahore Electricity Supply Company (LESCO) in railway colonies till December 30, adding that it would be beneficial for both labourers and railways.\nThe minister said that the PR had decided to reduce freight charges by 10 per cent on transportation of coal, fertilizers, cement and other products as the rates of sales tax had been reduced. He added that freight charges of Rs 5000 per container wagon would be reduced after this decision.",
  "retrievedAt": "2025-08-11T19:11:46.911Z"
}
