{
  "title": "1080 cases, including 583 in city, 246 in Pir-jo-Goth detected: CM Sindh",
  "link": "https://www.app.com.pk/national/1080-cases-including-583-in-city-246-in-pir-jo-goth-detected-cm-sindh/",
  "date_published": "2020-05-08T21:05:00.000Z",
  "source": "APP",
  "content": "KARACHI, May 09 (APP):Sindh Chief Minister Syed Murad Ali Shah Saturday said that for the first time since eruption of epidemic, the province diagnosed 1080 cases by conducting 5498 tests which means 20 percent of the tested people came positive.\n“This is the highest ratio ever reported in any province and worst situation has emerged in Pir-jo-Goth of Khairpur district where 246 new cases have been diagnosed in a day,” this he said in his video message issued from the CM’s House.\nThe chief minister said that for the first time 5498 tests were conducted against which 1080 cases or 20 percent of the tests were detected.\n“This seems to be the peak and it may rise further with increasing the number tests,” he said and added testing capacity was being enhanced to 6450 per day.\nMurad Ali Shah said that the Sindh government had conducted 87,108 tests against which 10,771 cases were diagnosed which constituted 12.4 percent of the total tests.\nHe said that four more patients lost their lives while struggling against the virus and now the death toll had reached to 180 which was 1.7 percent of the total patients.\nThe chief minister said that at present 8571 patients were under treatment, including 7432 in home isolation, 609 at Isolation Centers and 530 at different hospitals. “I am sorry to say that 101 patients or 17.2 percent of the total patients were in critical condition, of them 23 are on ventilators,” he said. He also said that 80 more patients were cured and sent back to their homes with necessary advice and prescriptions.\nOut of total 1080 new case, the chief minister said 583 belonged to Karachi. Giving their details, he said 143 cases had been detected in district South, 133 in Malir, 113 East, 76 in Central, 61 in Korangi and 55 in the West.\nSyed Murad Ali Shah said that through a special drive of random testing at grocery and vegetables shops, their vendors and customers, were conducted and some of the shopkeepers and the customers were found positive. “This is a dangerous sign and speaks loud of local spread, this is why I have been requesting people not to go out of home unnecessarily and even it is necessary people must wear masks and follow the SOPs,” he said.\nThe chief minister said that local spread had hit high various districts but the worst affected district is Khairpur where taluka Pir-jo-Goth has produced 246 cases in a single day.\nHe added that a woman of Pir-jo-Goth visited Hyderabad and when returned had fallen ill and within two days she died. “I think she was coronavirus suspect case, since she was not tested, therefore she was not being counted in coronavirus patients/deaths,” he said and added he was suspecting that she brought the virus back to Pir-jo-Goth from Hyderabad and infected others in the village.\nHer Namaz-e-Jinaza was offered without observing SOP, he said and added there the government had started testing all those who were her family members and had attended her funeral.\nGiving details of the samples tested so far, Syed Murad Ali Shah said that on 4 May 35 people of Pir-jo-Goth were tested, of them 10 were diagnosed as positive, on 6 May, 97 villagers were tested and found 14 positive. On 7 May, 59 more people were tested and seven came positive and finally 251 were tested on May 8 and found 246 as positive. “This is a very serious situation and the cases are multiplying in Pir-jo-Goth,” he said.\nSyed Murad Ali Shah directed the district administration of Khairpur to impose strict lockdown in Pir-jo-Goth and isolate the patients in their homes or shift them to Isolation center Sukkur.\nSyed Murad Ali Shah said that 15 testing kits have been sent to Pir-jo-Goth where seven sampling teams have been deployed to test people.\nSharing the number of cases in districts other than Karachi, the chief minister said that 265 Khairpur, including 246 of Pir-jo-Goth, 34 Sukkur, 19 Hyderabad, 17 Ghotki, 17 Larkana, eight Kandhkot-Kashmore, seven Shaheed Benazirabad, five Matiari, four Mirpurkhas, three each in Jamshoro and Kambar-Shahdadkot, two Tando Allahyar, each one in Jacobabad, Sanghar, Sujawal and Thatta.",
  "retrievedAt": "2025-08-11T19:11:51.805Z"
}
