{
  "title": "COAS calls on key civil, military leadership of Ukraine",
  "link": "https://www.app.com.pk/national/coas-calls-on-key-civil-military-leadership-of-ukraine/",
  "date_published": "2021-05-20T18:11:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, May 20 (APP): Chief of Army Staff (COAS) General Qamar Javed Bajwa Thursday called on top civil and military leadership of Ukraine during his official visit and expressed Pakistan’s keen interest to enhance defence cooperation with Ukraine.\nThe Army Chief said, “Pakistan is keen to enhance defence cooperation with Ukraine on the basis of Transfer of Technology (ToT) and Joint Ventures (JVs) in future as both sides can benefit from each other’s experience.”\nWhile on official visit to Ukraine, the Army Chief visited Cabinet of Ministers of Ukraine where he held separate meetings with Prime Minister of Ukraine Shmyhal Denys and Deputy Prime Minister and Minister for Strategic Industries of Ukraine Uruskyi Oleh, said an Inter Services Public Relations (ISPR) news release, received here.\nDuring the meetings, matters of mutual interest, regional security situation including recent developments in Afghan Peace Process and enhanced bilateral and defence cooperation in various fields were discussed.\nSpeaking on the occasion, the COAS said, “Pakistan attaches great importance to furthering bilateral relations with Ukraine and believes that both nations would develop meaningful and long term relationship through enhanced cooperation.”\nBoth dignitaries appreciated Pakistan’s contributions for conflict prevention in the region, especially the Afghan Peace Process.\nEarlier, the COAS also called on Minister of Defence of Ukraine Taran Andrii, Chief of the General Staff of the Armed Forces of Ukraine Lieutenant General Serhii Korniichuk, Commander of the Army of the Armed Forces of Ukraine Lieutenant General Oleksandr Syrskyi and Minister of Internal Affairs of Ukraine Avakov Arsen.\nUpon arrival at the Ministry of Defence, the COAS was presented Guard of Honour by a smartly turned out military contingent.\nBesides mutual and professional interests, matters of defence and security collaboration between both countries and overall regional security situation were discussed during the meetings.\nBoth sides agreed to further optimize military to military ties particularly in defence production, training, counter terrorism and intelligence domains.\nThe dignitaries appreciated Pakistan’s sincere efforts for bringing peace and stability in the region and reiterated Ukraine’s desire for enhancing bilateral cooperation in all domains.\nMeanwhile, Army Chief also visited a Military Test Site in Kharkiv region of Ukraine and witnessed field tests of various weapons and equipment.\nThe COAS took keen interest in the tests and appreciated the performance of all ranks associated with the projects.\nThe COAS, on the occasion, said, “Defence cooperation between both countries has always been traditionally an important component of our bilateral relations.”",
  "retrievedAt": "2025-08-11T20:44:49.354Z"
}
