{
  "title": "Bilawal ‘successor’ of loot, snatch politics: Farrukh",
  "link": "https://www.app.com.pk/national/bilawal-successor-of-loot-snatch-politics-farrukh/",
  "date_published": "2021-05-20T09:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):Minister of State for Information and Broadcasting Farrukh Habib Thursday said Pakistan Peoples Party (PPP) chairman Bilawal Zardari was the ‘successor’ of the politics of loot and snatch.\n“It is impossible for Bilawal Zardari to understand the concept of a welfare state,” he said while reacting on a statement of the PPP chairman.\nFarrukh said Prime Minister Imran Khan had introduced a new concept of the state to the masses by launching the Pakistan Tehreek-i-Insaf (PTI) government’s flagship project ‘Ehsas’ to mitigate financial sufferings of the downtrodden segments of the society.\nDespite the economic slowdown and financial constraints caused by the coronavirus pandemic, he said the PM’s economic strategy continued revolving around the welfare and wellbeing of the common man.\nContrary to it, the minister said the economic strategy of the PPP government was limited to fill the lockers of the looters, adding the Bialwal allies had taken the country on verge of bankruptcy.\nHe said the culture of money laundering and depositing the looted wealth in foreign accounts was introduced and promoted by Bailwal and his allies ‘Sharifs,’ adding PM Imran Khan had purged the national economy of the Sharif family’s wrongdoings. “They are Bailwal’s allies who fled the country, not us.”\nFarrukh said it was unfortunate that the PPP government itself manipulated the wheat stock amounting to Rs 14 billion in Sindh and blamed mice for eating it.\nHe said the Sindh government allocated Rs 5 billion on account of ‘COVID Response’ but did not spend even a single penny during a period of six months.\nToday, the minister said, the public was bearing the brunt of the corruption committed by the PPP and PML-N in power and gas sectors during their previous tenures.\nHe said when Imran Khan was in opposition, he had brought his whole life’s earnings to Pakistan.\nAs a result, he said, now overseas Pakistanis were sending record remittances to the motherland because of their confidence in the leadership of PM Imran Khan.\nFarrukh said Bilawal should not worry as it was impossible to restart the practice of loot and plunder in the country, adding “sooner or later they [looters] would have no option except returning the plundered money.”",
  "retrievedAt": "2025-08-11T20:44:55.019Z"
}
