{
  "title": "Education dept’s inaction causes hardships for students in Khyber - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: A seemingly perpetual inaction by education department and district administration over allocation and distribution of leftover prefabricated classrooms to schools without proper building or fully damaged ones has been causing immense hardships to students in different parts of Khyber tribal district, particularly in upper Bara.\n\nSources in education department told this scribe that after reconstruction of more than 50 per cent militancy-affected schools in Bara with the financial assistance of China, about 27 prefabricated classrooms of the total 52 such rooms as replacement for the damaged classrooms were lying unused.\n\nThese prefabricated classrooms were provided by Sarhad Rural Support Programme to damaged and destroyed schools of Bara after the return of internally displaced families in 2015-16.\n\nSources said that at least two prefabricated classrooms in Shalobar area of Bara were uprooted and rendered useless during the windstorm and torrential rains on August 30 while in some other localities the watchmen of schools refused to shoulder responsibility of looking after those rooms after reconstruction of the main buildings where those watchmen were posted.\n\nSummary of education dept shows 24 damaged schools in the district\n\nSipah Khidmat-i-Khalq Organisation, a Bara based welfare body, had early this year floated a request for provision of some of these prefabricated classrooms to five community primary schools in upper Bara of Tirah valley as none of these informal schools has a formal building since their creation in September 2023.\n\nThe education department is yet to establish a formal school in entire upper Bara, comprising a population of more than 7,000 and majority of displaced families had already returned in 2022.\n\nIn response, officials argued that leftover prefabricated classrooms could be allocated only to formal schools operating under the department that were either fully damaged or had excess enrolment of students, as per rules and regulations.\n\nSources in Bara said that the matter was later referred to district administration as all the five informal schools in upper Bara were operating under the open sky with local teacher sending their students early to their homes in bad weather conditions.\n\nThe district administration after consultations with education department constituted a committee to propose judicious utilisation of leftover prefabricated classrooms and devise a mechanism for their allocation to community schools in upper Bara.\n\nThe committee, in its letter sent to deputy commissioner in August, expressed inability to resolve the issue owing to undue interference by parliamentarians of Bara and ‘some external factors beyond their control’.\n\nSources said that MNA Iqbal Afridi in a letter dated August 15 told education department that no prefabricated classroom should be shifted from any school without his prior knowledge and consent.\n\nOn the other hand, MPA Suhail Afridi is demanding that some of the prefabricated classrooms should be installed in damaged or overcrowded schools in his Jarumd constituency.\n\nA summary of education department showed that there were 24 damaged schools in the district while nine more needed urgent repair. Residents of upper Bara, however, insisted that no new enrolment of their children was conducted since September 2023 owing to absence of formal schools.\n\nThey said that the future of 450 students currently studying in five community schools with one teacher each in every school was also in danger as they would soon complete their primary level education with no access to middle grade schooling and proper school buildings.\n\nHaji Waak Khan, a resident of upper Bara where he had established one of the community schools, said that provision of prefabricated classrooms would greatly benefit their children.\n\nHe said that local customs and traditions too were not in favour of a co-education system beyond primary level and their girls would continue studies only if education department provided them with better facilities, including prefabricated classrooms.\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c47f9f6cde3.jpg",
  "retrievedAt": "2025-10-12T04:08:54.047Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941494/education-depts-inaction-causes-hardships-for-students-in-khyber",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:02:28.000Z"
}
