{
  "title": "Not just focusing on Pakistan-India match, but winning Asia Cup: Saim Ayub - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan batter Saim Ayub said on Saturday that the team was not just focusing on the Pakistan-India match, but winning the men’s Asia Cup.\n\nThe arch-rivals will clash in a geopolitically-charged men’s Asia Cup contest in Dubai on Sunday. It will be the first cricket match between the sides since four days of military conflict between the nuclear-armed neighbours in May.\n\nWhile reigning T20 world champions India are the firm favourites to retain their title, Pakistan are on a high, having convincingly beaten Afghanistan to win the final of a tri-series and Oman in the lead-up to the contest.\n\nSpeaking at the pre-match press conference in Dubai, Saim said: “We are not just looking forward to the Pakistan-India match, but we are looking forward to winning the tournament.”\n\nHe added that the current tournament is what matters at this moment.\n\nResponding to a question about Pakistan’s new batting approach against the quality of the Indian attack, Saim said: “The focus is on playing fearless cricket against all opponents”\n\nSpeaking on the India match after the Green Shirts’ thumping victory against Oman on Friday, Pakistan skipper Salman Ali Agha said: “We have been playing good cricket in the last two-three months and we just have to play good cricket.”\n\n“If we can execute our plans for a long enough period, we can beat any team,” he added.\n\nEarlier in the week, Pakistan’s white-ball head coach Mike Hesson dismissed concerns about the national squad’s batting performance on Thursday ahead of the upcoming Asia Cup clash with India.\n\nHesson said he was “not quite sure” where the concerns were arising from, saying the team had played against the “best wrist spin attack” in the world and won by over 70 runs against Afghanistan in the tri-series final.\n\n“It’s very much a developing batting lineup. There’s many players who can win you the game on their day, but they don’t have as many good days as you’d like at the moment … the thing for us is that we are more interested in the sum of the parts as a batting group.”\n\nMeanwhile, India assistant coach Ryan ten Doeschate said the players need to put their emotions to one side.\n\nAsked if public sentiment in India weighs on the minds of the players, Ten Doeschate on Saturday said: “Yes, I think it will. It’s a very sensitive issue, and I’ve got no doubt the players share the compassion and feeling of the vast majority of the Indian public.\n\n“The Asia Cup was in a limbo for a long period of time and we were just waiting. We didn’t think we were going to be coming at one stage,” said Ten Doeschate, a former Dutch all-rounder.\n\n“Obviously, you know what the Indian government’s stance is on it, and now the team and particularly the players, you have to put those sentiments and the emotions behind, that’s something we addressed in the team meeting,” he added.\n\nTen Doeschate accepted that India start as favourites.\n\n“Being totally honest, and looking at recent form and how the teams have played, India do start as favourites tomorrow. We will be focused on 120 balls with bat and ball,” Ten Doeschate said.\n\nTen Doeschate said India have done their homework after Pakistan dropped star batters Babar Azam and Mohammad Rizwan.\n\nIndia go into the match after beating the United Arab Emirates by nine wickets after bowling them out for 57 in 13.1 overs before returning to chase down the target in 27 balls on Thursday.\n\nEven before the clashes in May, which nearly escalated into a full-blown war, bilateral cricket ties were suspended. The arch-rivals now play each other only in multi-team tournaments.\n\nPolitical relations have deteriorated further since the clashes, with several former Indian players urging the Board of Control for Cricket in India (BCCI) to boycott what will be the first meeting between the teams since the recent hostilities.\n\nWhile the threat of a boycott is over, sparks may fly with Salman and his Indian counterpart ruling out dialling down aggression in the much-anticipated Group A fixture.\n\n“Once the BCCI said they are aligned with the government, we are here to play,” India’s batting coach Sitanshu Kotak told reporters on Friday.\n\n“Once we are here to play, I think players are focused on playing cricket. I personally don’t think they have anything in mind apart from playing cricket and that’s what we focus on.”\n\nThe eight-nation T20 tournament began on Tuesday with Afghanistan beating Hong Kong by 94 runs. India crushed the hosts, the UAE, by nine wickets on Wednesday.\n\nPakistan, India, Oman and UAE are in Group A, while Sri Lanka, Afghanistan, Hong Kong and Bangladesh form Group B.\n\nThe top two teams from each Group will qualify for the Super Four stage.\n\nThe top two teams will then play the September 28 final in Dubai.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/1318413981dbe68.webp",
  "retrievedAt": "2025-09-19T14:37:17.580Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941725/not-just-focusing-on-pakistan-india-match-but-winning-asia-cup-saim-ayub",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T14:30:26.000Z"
}
