{
  "title": "PM Shehbaz seeks urgent cross-examination in Rs10bn suit against PTI founder - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Prime Minister Sheh­baz Sharif on Friday requested a sessions court to conclude his cross-examination in a Rs10 billion defamation suit against incarcerated PTI founder Imran Khan within two days, citing his engagement with meetings on the ongoing flood situation.\n\nEarlier, Additional District & Sessions Judge Yalmaz Ghani conducted the proceedings, with the prime minister appearing via a video link.\n\nDuring the hearing, PM Shehbaz’s counsel Mustafa Ramday objected to several questions posed by Advocate Muhammad Hussain Chotia, the counsel for the defendant.\n\nAt the outset, the prime minister objected to the late arrival of the defendant’s lawyer, saying he had returned from an official visit to Qatar for the case. He asked the judge to proceed strictly in accordance with law.\n\nMeetings on ongoing flood situation cited as reason for the request\n\nLater, PM Shehbaz took oath to speak the truth and admitted that the receipts of the legal notice bore the name of his lawyer but did not specify who received them.\n\nHe maintained that the legal notice had been issued on his instructions, although he could not recall the complete text of the notice. The prime minister read the legal notice aloud in the court.\n\nThe defendant’s counsel pointed out that the defamation suit mentioned the Panama Papers but the legal notice did not.\n\nHowever, PM Shehbaz said that he had repeatedly clarified that he had no connection to the Panama Papers.\n\n“It is very clear in the suit and there is no need for further questions on this point,” he pressed.\n\nAdvocate Ramday also objected, calling the questions posed by the defendant’s counsel irrelevant and meaningless.\n\nThe judge adjourned further hearing till Sept 16 to continue the cross-examination of the prime minister.\n\nIn his suit filed in 2017, PM Shehbaz said Imran Khan levelled baseless allegations against him.\n\nHe sought a decree for recovery of Rs10bn as compensation from the defendant for publication of defamatory content.\n\nThe former prime minister had filed his reply to the suit with a delay of four years in 2021, saying one of his friends told him that someone known to him and the Sharif family had approached him with an offer to pay billions of rupees if he could convince him (Mr Khan) to stop pursuing the Panama Papers case.\n\nThe former prime minister said he disclosed the incident for the consumption of the public at large and an act in the interest of the public good does not constitute any defamation. Mr Khan said he did not specifically attribute any statement to the plaintiff (PM Shehbaz) while narrating the incident.\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:09:09.670Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941598/pm-shehbaz-seeks-urgent-cross-examination-in-rs10bn-suit-against-pti-founder",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:01:35.000Z"
}
