{
  "title": "BYC’s Mahrang Baloch granted bail by Karachi ATC in ‘terrorism and sedition’ case - Pakistan - DAWN.COM",
  "author": null,
  "content": "Baloch Yakjehti Committee (BYC) chief Dr Mahrang Baloch on Saturday was granted bail by an anti-terrorism court (ATC) in Karachi in a case pertaining to terrorism and sedition charges from October last year.\n\nThe BYC chief is currently in police custody on physical remand, which was extended for 15 more days by an ATC in Quetta on Thursday. Mahrang was arrested on March 22 on allegations of “attacking” the Quetta Civil Hospital and “inciting people to violence” and has been remanded several times.\n\nAccording to a copy of today’s court order available with Dawn.com, the state prosecutor “vehemently” opposed the court granting bail to the BYC chief because the allegations against Mahrang are of a serious nature and the investigating officer collected sufficient evidence which could be presented in court.\n\nLast October, Mahrang was booked in a terrorism case as a first information report (FIR) was registered by Malir district’s Quaidabad police on the complaint of a local resident who claimed that the BYC leader was inciting violence in his area.\n\n“She (prosecutor) further argued that the accused has incited hatred against state institutions, and spread seditious material with [the] intent to cause public unrest. Therefore, [the] accused is not entitled for the concession of bail,” the order read.\n\nThe order added that the complainant in the October FIR did not produce any independent witnesses to corroborate the allegations, nor did he appear in court despite the investigating officer (IO) being instructed to produce him.\n\n“Moreover, during [the] investigation at the time of visiting place of incident, neither [the] IO called any private/independent witness from [the] locality nor made [any] query from area people regarding alleged incident,” the order read.\n\nThe order added that the IO submitted a report to declare Mahrang an absconder in the case, but the defence counsel submitted the Quetta ATC’s remand order, which showed that she is in police custody.\n\n“Moreover, FIR regarding alleged incident was registered against the applicant/accused on October 11, 2024, while [the IO] submitted [a report] before [the] … Anti-Terrorism Courts Karachi Division on August 16, after the delay of 10 months and in this regard IO has not furnished reason why he submitted [a report] against the accused after delay of 10 months,” the order read.\n\n“In view of the above, I have come to the conclusion that [the] applicant/accused has made out her case for further enquiry,” it added, quoting the ATC judge. “Therefore, I hereby admit the applicant/accused on bail subject to furnishing solvent surety in the sum of Rs100,000 in the like amount to the satisfaction of this court.”\n\nMahrang was taken into custody under Section 3 of the Mainte­nance of Public Order (MPO) — a law that empowers authorities to arrest and detain individuals suspected of posing a threat to public order — and remains in custody.\n\nFollowing her detention under the MPO, cases were also registered against her and other BYC leaders under different sections of the Anti-Terrorism Act and the Pakistan Penal Code.\n\nThe BYC is a Baloch advocacy group working against enforced disappearances since 2018.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:37:15.183Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941716/bycs-mahrang-baloch-granted-bail-by-karachi-atc-in-terrorism-and-sedition-case",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T12:01:41.000Z"
}
