{
  "title": "Four key takeaways from Pakistan’s victory against Oman - Sport - DAWN.COM",
  "author": null,
  "content": "A disclaimer to start with: it was just Oman. So, Pakistan fans, don’t get too excited. I hope most of you won’t, since, traditionally, this team keeps finding new ways to disappoint us.\n\nWith the emotions now set aside, let’s “objectively” look into what Pakistan came up with in their Asia Cup opener at the Dubai International Cricket Stadium on Friday.\n\nThe boys in green, as expected from them, swept aside the Omanis with utter disdain, continuing the pattern of big sides staying unchallenged by the minnows in the tournament.\n\nLike the good old days, the Pakistan bowlers starred. It was a display of what turned out to be unplayable spin bowling for Oman on a slow, sluggish, sticky surface — on which Pakistan failed to consistently put bat on ball as well, but more on that later.\n\nPakistan are ripe with spin resources. They may not be the best in the Asia Cup with Afghanistan and India boasting the services of some proven pros, but they showed they are getting there with a top show against Oman.\n\nPakistan captain Salman Ali Agha put so-called part-timer Saim Ayub into the attack right away, and his sly “mystery” spin stuck into the surface, deviated and left the Oman top-order bamboozled, adding weight to Saim’s claim into Pakistan’s XI despite his inconsistency with that bat.\n\nWith Oman openers Aamir Kaleem and Jatinder Singh trapped lbw and cleaned up respectively by Saim, Salman had three more proper spin options.\n\nHe called in Sufyan Moqeem — the left-arm wrist-spinner, having consolidated his place in the side at least for the matches taking place on slow surfaces.\n\nBut Sufyan didn’t rely on a typical slow delivery to get his first wicket, bouncing out Mohammad Nadeem with a surprise short-ball, reminding us all of former Pakistan star Shahid Afridi.\n\nSufyan’s second hunt was purely Salman’s brilliance at slip; the skipper chewing a chewing gum, composed as ever, acting as if nothing happened after having dived to his left to take a blinder to dismiss a well-set Hammad Mirza.\n\nIn between both dismissals, Pakistan’s “best spinner in the world” according to head coach Mike Hesson, Mohammad Nawaz continued his top form after making his comeback in the side, chipping in with Sufiyan Mehmood’s wicket.\n\nOn a wicket like this, the fast bowlers had to go untested, but the pace pairing of Shaheen Shah Afridi and Faheem Ashraf accounted for three wickets.\n\nWhile Pakistan were destructive with the ball, they were far from impressive with the bat. It can be argued that the pitch didn’t support batters as much. But again, it was just Oman.\n\nTheir start was horrendous; Saim falling on the first ball, going across the line of the ball for an audacious attempt to hit it out of the park. Backed for his potential impact, the left-hander — no matter how highly-rated — is struggling with the consistency part of his game. Saim averages less than 25 in the last 15 outings, since Hesson took charge of the team.\n\nWhat Saim lacked, however, was somehow made up by another batter under the press; Mohammad Haris. The flamboyant right-hander from Peshawar has been a subject of debate since he first showed up in the Pakistan colours for his perceived “irresponsible” approach. He was pushed down to number six in the recent tri-series, which Salman said was a “sacrifice”.\n\nBut Haris, in his preferred number three position, bounced back with a blistering half-century and a man-of-the-match award. He did not smash every ball for his 43-ball 66.\n\nThe 24-year-old’s seven fours were mainly about manoeuvring the gaps with brilliance, while his strong slog-sweep was incredibly effective for his three sixes.\n\nAt one point, it looked like the batters on the other end — Sahibzada Farhan and Fakhar Zaman — were doing their best to help Haris post a big score, but that seemed to slow Pakistan down, and the pressure that heaped upon the batters came into play later on.\n\nAfter Haris played Aamir Kaleem onto his stumps attempting a rash reverse-sweep, Salman fell on a dolly before Fakhar and the incoming Hasan Nawaz added to Pakistan’s dot-balls, more than 30 of them.\n\nThe pair failed to go hard against the Oman bowlers, raising concerns over Pakistan’s prospects against a stronger attack of archrivals India, whom they face on Sunday. Fakhar being asked to bat at number four was also an interesting decision by the Pakistan management after the experienced pro was brought back to the opening spot in the recent series.\n\nNawaz’s form with the bat was evident down the order, the left-hander putting the pitch out of the question and finding gaps brilliantly for his 19 off 10.\n\nWhile Pakistan crushed Oman by a huge 93-run margin, they would still need to up their game for the India clash.\n\nTo be played in Dubai again, India will arrive for the high-octane clash with the likes of spinners Kuldeep Yadav and Varun Chakarvarty, the kind of quality Pakistan would require a special show against.\n\nThe bowlers, too, would have to prove that they can be as good against the T20 World Champions as they were against Oman.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/130002335f8f70f.webp",
  "retrievedAt": "2025-09-19T14:37:55.219Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941488/four-key-takeaways-from-pakistans-victory-against-oman",
  "dateList": "2025-09-13",
  "date_published": "2025-09-12T19:11:14.000Z"
}
