{
  "title": "FO confirms PM Shehbaz’s participation in Arab-Islamic moot on Israeli strikes in Qatar - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif was confirmed on Saturday to attend a summit of Arab and Muslim leaders in Qatar to denounce Israel’s attack on Hamas officials in Doha and to show solidarity with the Gulf state.\n\nQatar said earlier today it would hold the emergency moot in light of the recent developments in the region. Foreign ministry spokesman Majed al-Ansari said Monday’s meeting would consider “a draft resolution on the Israeli attack on the state of Qatar” to be drafted on Sunday at a ministerial meeting.\n\nIsrael targeted Hamas leaders on Tuesday in strikes on the Qatari capital, killing five Hamas members and a Qatari security officer. The attack drew widespread international condemnation, including from Gulf monarchies allied with the United States, Israel’s main backer.\n\nAl-Ansari was quoted as saying by the official QNA news agency that the summit reflected “broad Arab and Islamic solidarity with the State of Qatar in the face of Israel’s cowardly aggression … and the categorical rejection of Israel’s state terrorism”.\n\nConfirming PM Shehbaz’s participation, the Foreign Office (FO) said in a statement posted on X that Pakistan was a co-sponsor of the summit. It added that the Israeli attempts to occupy Gaza, expand settlement activities in the occupied West Bank and forcibly displace Palestinians were also part of the decision to hold the summit.\n\n“Heads of states and governments and senior officials from the Organisation of Islamic Cooperation member countries are expected to participate in the summit. The summit will be preceded by the preparatory meeting of the foreign ministers on September 14, 2025. Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar will participate in the preparatory session,” the FO said.\n\nThe FO reiterated that ​Pakistan accorded high importance to its relations with Qatar and strongly condemned Israeli aggression against the country and other regional states.\n\nAmong the leaders attending will be Iranian President Masoud Pezeshkian and Iraqi Prime Minister Mohammed Shia al-Sudani. Turkish President Recep Tayyip Erdogan will also be in Doha, but his presence at the meeting is yet to be confirmed.\n\nAnalysts say the summit is meant to send Israel a clear signal.\n\nQatar, which hosts the largest US base in the region, plays a mediation role in the Gaza war alongside the United States and Egypt.\n\nThe Israeli strikes were “seen across the Gulf as an unprecedented violation of sovereignty and an attack on diplomacy itself”, Andreas Krieg of King’s College London said, adding the summit signalled that “such aggression can’t be normalised”.\n\n“The goal is to draw clear red lines and end the sense in Israel that it can act with impunity,” he said. “Expect a sharper stance on Palestine and a harder edge on Israeli actions.”\n\nEarlier, US President Donald Trump held dinner with the Qatari prime minister in New York on Friday.\n\nSeparately, Trump expressed annoyance about the strike in a phone call with Israeli Prime Minister Benjamin Netanyahu and sought to assure the Qataris that such attacks would not happen again.\n\nTrump and Qatari Prime Minister Sheikh Mohammed bin Abdulrahman al-Thani were joined by a top Trump adviser, US special envoy Steve Witkoff.\n\n“Great dinner with POTUS. Just ended,” Qatar’s deputy chief of mission, Hamah Al-Muftah, said on X.\n\nThe White House confirmed the dinner had taken place but offered no details. The session followed an hour-long meeting that al-Thani had at the White House on Friday with Vice President JD Vance and Secretary of State Marco Rubio.\n\nA source briefed on the meeting said they discussed Qatar’s future as a mediator in the region and defence cooperation in the wake of the Israeli strikes against Hamas in Doha.\n\nTrump said he was unhappy with Israel’s strike, which he described as a unilateral action that did not advance US or Israeli interests.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/1318094961fc1bb.webp",
  "retrievedAt": "2025-10-12T04:08:54.613Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941661/fo-confirms-pm-shehbazs-participation-in-arab-islamic-moot-on-israeli-strikes-in-qatar",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T05:55:44.000Z"
}
