{
  "title": "KP jirga demands peace talks with Afghanistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: A jirga comprising people from across the province on Friday demanded immediate negotiations with the interim Afghan government for regional peace with the involvement of tribal elders.\n\nThe participants, who showed up here from across the province, also called for the immediate withdrawal of all the cases filed against those who raised voice against terrorism and for peace in the province.\n\nOrganised by the Insaf Students Federation and Insaf Youth Wing, the jirga demanded that all those charged and arrested under treason cases be immediately released.\n\nThe organisers said it’s not a political gathering but people from all districts, mostly from terrorism-hit ones, including peace activists were invited to hold debate on the problem and find solutions.\n\nOpposes fresh military operation in KP\n\n“We have made several demands in the declaration. Some issues fall within the domain of the federal government while some are related to the provincial government. Whoever does it, we want our issues resolved,” IYW regional president Sajjad Mohmand said.\n\nMr Mohmand said that all those, who had been raising their voice for peace, campaigning for peace, were invited to attend the jirga.\n\n“It was not a political show but peace activists, belonging to any political party, were asked to attend,” he said, adding that a second jirga would be held in Karak on Friday.\n\nAccording to the declaration issued after the jirga, the jirga members said that they would never allow any military operation in Khyber Pakhtunkhwa.\n\nThey said that they wanted peace in the province and demanded the state must reconsider its policy regarding any military offensive in future.\n\nThey said that tribal elders must be involved in restoring peace in the province. “Now, as the situation has reached this point, jirgas should be held to resolve the issue instead of carrying out any military operation,” the declaration read.\n\nIt read that the KP Assembly recently passed a unanimous resolution against the KP Action (in Aid of civil power) Ordinance and had declared it against basic human rights.\n\nThey said that the Peshawar High Court had also declared the Ordinance against basic human rights but the provincial government had filed a plea against the Peshawar High Court’s verdict in the Supreme Court and urged the provincial government to withdraw its appeal from the apex court.\n\nThe jirga members said that Afghanistan was a brotherly country, so all those concerned held talks with the interim Afghan government by involving tribal elders.\n\nIt demanded that all those concerned immediately reopen all the trade routes including Gorsal, Ghulam Khan, Nawapas and Srarogha border crossings with Afghanistan in order to boost economic activities in the province.\n\nThe declaration read that taking over the province’s resources would never be allowed.\n\nThe jirga members said that an agreement was signed between Frontier Works Organisation and the American company and demanded that progress on the agreement should be stopped immediately, which was done in violation of the 18th Constitutional Amendment.\n\nThe jirga members also demanded that before merger, the merged districts were promised three per cent in the National Finance Commission. It demanded that the promises should be fulfilled besides the arrears of the promised Rs100 billion annual funds for the merged districts, should also be paid.\n\nThe jirga members said that many people were martyred in drone attacks and mortar shell explosions. They demanded that their cases be registered, adding that those, who had left their homes due to military operations, should be repatriated and all their losses compensated.\n\nThe jirga called for an end to unannounced curfews in several parts of the tribal districts.\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:08:31.386Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941510/kp-jirga-demands-peace-talks-with-afghanistan",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:02:28.000Z"
}
