{
  "title": "Afghan woman ‘gang-raped’ in Haripur - Pakistan - DAWN.COM",
  "author": null,
  "content": "HARIPUR: A married Afghan woman was allegedly gang-raped by five Afghan refugees in the limits of Khalabat Township, police said here on Friday.\n\nThe initial medical examination of the victim confirmed the offence, the police said.\n\nKhalabat Township police quoted the victim, 21, as saying that her husband was abroad and she was living in a rented house in the New Abadi Sector 3, Khalabat Township, on a valid Pakistani visa.\n\nOn Thursday evening, she said that she was on way to Afghan camp No 16 on foot to see some of her relatives when a young man overpowered her and dragged her into the fields, where he, who introduced himself as Bacha, forcibly raped her.\n\n“I was preparing to leave when four accomplices of the man reached there and sexually assaulted me one after the other”, SHO Khalabat Inspector Sidiq Shah quoted the victim as saying.\n\nHe told Dawn that one of the alleged rapists also slapped and punched her in the face when she attempted to put up resistance.\n\nThe victim identified the five rapists who all were reportedly Afghan refugees namely Nadi, Rozi, Khan Sher, Javed and Naseer.\n\n“The initial medical report conducted at the Trauma Centre Haripur has established the offence of rape while the detailed Forensic analysis report would be received from FSL later,” said SHO Sidiq Shah, adding that the accused have been arrested and a case under section 375-A of the PPC was registered against them.\n\nAccording to the SHO the accused would be produced before the court of area magistrate for physical remand on Saturday.\n\nDENGUE CONTROL: Intensified efforts under a multi-pronged strategy of the district administration have helped in bringing under control the transmission of the viral dengue disease with zero death across the district.\n\nThis was claimed by the deputy commissioner, Waseem Ahmed, the other day while briefing journalists about the dengue fever and the measures that the administration and health department have jointly taken to protect the residents of Haripur from the disease.\n\nHe said that in line with the directives from the provincial government, active engagement of all the line departments, private educational institutions, social activists and local community was ensured and the communities especially in hotspot areas were educated about the protection measures against the mosquito bite during daily community sessions.\n\n“Daily surveillance of hotspot areas, identification of mosquito breeding spots, targeted home sprays helped us to control the transmission of dengue as compare to the year 2022 which was the worst of its kind in terms of dengue fever transmission”, he informed the media.\n\nHe said that under the supervision of assistant commissioners of all tehsils and the district entomologists, the staff of DHO office, TMAs concerned and line departments conduct daily visits to the nurseries, block factories, tyre shops, open water containers and houses of hotspot areas.\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:37:17.471Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941499/afghan-woman-gang-raped-in-haripur",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:02:28.000Z"
}
