{
  "title": "PPP baffled by Centre’s dilly-dallying on global aid appeal - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The PPP has moved a resolution in the Senate highlighting the need for coordinated humanitarian and agricultural interventions amid floods, as its chairperson Bilawal Bhutto-Zardari criticised the federal government for the delay in seeking international assistance to deal with the climate-induced disaster.\n\nThe PPP chairman said it was “beyond comprehension” as to why the Centre had not sought international assistance despite a disaster of this scale. “This is standard practice for disasters of this scale internationally. It was done for the last floods when I was foreign minister, before that, the 2010 floods and the 2005 earthquake.\n\nCountries all over the world do the same within the first 72 hours of such disasters,” he said on his X (formerly Twitter) account.\n\n“There is no excuse to cut off the millions affected from this assistance,” he said.\n\nSherry Rehman moves resolution in Senate, urges govt to use BISP to help survivors\n\nMr Bhutto-Zardari welcomed the government’s decision to announce a climate and agricultural emergency and called for the announcement of relief through the Benazir Income Support Programme for flood-impacted areas. He also expressed support for the agricultural community, calling it the “most devastated sector” due to the recent floods.\n\nResolution\n\nThe resolution submitted to the Senate, moved by Senator Sherry Rehman, emphasised that immediate humanitarian relief was critical, including the waiver of electricity bills for the millions of vulnerable citizens now displaced or affected.\n\nKey points of the resolution included acknowledging the current crisis as a climate, flood, agricultural, and humanitarian emergency, and emphasising that delays in mobilising support were unacceptable, regardless of the pace of international response, said a statement issued by the PPP.\n\nThe destruction of crops and displacement of communities had created a multi-faceted emergency, requiring both immediate national action and robust international support.\n\nThe federal government must expedite direct cash transfers to displaced families and affected farmers via the Benazir Income Support Programme (BISP), following the successful model of 2022, the resolution said, besides emphasising the urgent need for basic medical care and medicines.\n\n“There is a need for a renewed call for the government of Pakistan to launch an international flash appeal through the United Nations to enable swift donor mobilisation,” it added.\n\nSyed Irfan Raza in Islamabad also contributed to this report\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:08:34.175Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941620/ppp-baffled-by-centres-dilly-dallying-on-global-aid-appeal",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:01:29.000Z"
}
