{
  "title": "Larkana under flood threat, Indus banks’ dwellers must move to safe places immediately: district admin - Pakistan - DAWN.COM",
  "author": null,
  "content": "LARKANA: The district administration of Larkana on Friday afternoon issued an alert for the general public warning that there is a possibility of 700,000 cusecs or even heavier flood peak reaching Guddu Barrage within the next 24 hours.\n\nIt said all those living along the riverbanks and within the katcha (riverine) and low-lying areas must move to safe places “as soon as possible”.\n\nIn case of any emergency or for assistance, people may contact the provincial control room by dialing 021-99222967, 021-99222902, 021-99222758, 021-99222759, Larkana office at 074-9410243, PDMA at 1736 or Rescue services at 1122.\n\nMeanwhile, MPA Mir Nadir Magsi, who has been inspecting flood protective dykes between Guddu Barrage and all vulnerable areas for many days, has said such visits by ministers, lawmakers and relevant officials were necessitated to ensure people’s safety.\n\nAround 700,000-cusec flood peak likely to reach Guddu today, warn officials; MPA Nadir Magsi says situation at Larkana-Khairpur, Dadu-Moro and Amri-Sehwan bridges is ‘not good’\n\nPunjab has suffered massive destruction by rains and floods in recent weeks, and now flood water is about to reach Sindh, he said.\n\nSpeaking to Dawn at the Ruk Loop Bund in Shikarpur district on Friday, MPA Magsi said that last time, when the Tori dyke was washed away in flood, Sindh had submerged. “I have already visited Tori, KK, Ruk and Moria Loop bunds to inspect their strength. Strengthening work there is under way,” he said. At Ruk bund, a T-spur has recently been constructed under the Sindh Flood Reconstru­ction Project.\n\nThe lawmaker said that at KK (Kandhkot-Kashmore) bund, particularly at its 18-Mile point, water volume is huge. “Since it is shaped like an island and its riverbed is narrow, the pressure on the bund and noise of water flow are very high, which had caused concern,” he said.\n\nHe said that stone-dumping work there was under way. Currently, the water level at these dykes is rising.\n\n“Floodwater causes more damage in the receding than rising phase, he believed, and prayed that such a situation should not occur.\n\nAccording to him, the flood pressure in the Indus at the moment is on its right bank — between Guddu and Naushahro Feroze — where the chief engineer has carried out perfect work.\n\nSituation grim\n\nNadir Magsi observed that the situation at the Larkana-Khairpur, Dadu-Moro, and Amri-Sehwan bridges “is not good”. But the water reduces by the time it reaches here, he said alluding to past experiences. “Larkana is under threat from the Larkana-Khairpur Bridge, where the riverbed is wide but the bridge itself is narrow.\n\nHe recalled that since 2010, he had been telling the authorities concerned that this bridge should either be widened or gates should be installed at it to reduce water pressure. “If the water pressure increased, everything will be destroyed,” he warned, arguing that the lower areas are within the river’s course and they would also be hit badly.\n\nMPA Magsi said that the Abad Loop Bund had eroded last time but strengthening work had now been carried out there. “However, in my view, it remains the ‘most sensitive’ dyke. He added that water entering Sindh comes from, besides Chanab, other rivers which are dead channels, but when extra water comes from India and when dams break, floodwaters also enter Sindh.\n\nWherever water flows through the Indus River into Sindh, those routes are encroached upon, blocked with different structures or occupied by settlements. He estimated that the Indus River is carrying around 700,000 cusecs.\n\nEarlier, MPA Magsi, along with the chief engineer of the right bank of Indus and other officials, visited five spurs of the Ruk Bund where the engineers concerned briefed him about the situation with the help of maps and satellite images.\n\nHe was optimistic that dykes would sustain the pressure.\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c493ae2eb9d.jpg",
  "retrievedAt": "2025-09-19T14:37:29.810Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941553/larkana-under-flood-threat-indus-banks-dwellers-must-move-to-safe-places-immediately-district-admin",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:02:10.000Z"
}
