{
  "title": "Govt cuts provident fund returns amid fiscal constraints - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government has reduced the return on provident funds for 2024-25 to 12.46 per cent, down from 13.97pc in the previous year, marking a 1.51 percentage point decrease.\n\nThe new rate applies to both the General Provident Fund (GPF) and the Contributory Provident Fund (CPF), covering all subscriptions and balances in these funds during the fiscal year, according to a Ministry of Finance notification.\n\nThis reduction continues the government’s trend of lowering returns on provident funds. Last year, the return was reduced from 14.22pc for FY23. The new rate will also affect provident fund balances under the control of the Ministry of Railways and Ministry of Defence, although these departments will issue separate instructions regarding their specific profit rates for FY25.\n\nThe government’s move to reduce returns comes as part of its broader fiscal policy, which includes reducing the mark-up on loans extended to provinces and state-owned enterprises (SOEs). For instance, in late August, the government lowered the interest rate on development loans to provincial governments, local bodies, and public sector financial institutions by nearly 0.1 percentage point.\n\nThe mark-up on cash development loans (CDLs) for FY25 was fixed at 17.74pc, slightly down from 17.84pc in FY24. This reduction follows a sharp rise in interest rates in previous years, as the rate had increased by over 73pc from 10.30pc in FY21.\n\nSlashes rate by 151bps to 12.46pc for 2024-25\n\nSince FY17, the interest charged by the federal government on development loans has surged by nearly 175pc, rising from 6.54pc. These loans are a major source of revenue for the federal government, with Rs245bn expected to be collected from interest on loans in FY25, including Rs95.45bn from provinces and Rs155bn from SOEs and other entities. The government’s target for interest revenue in FY26 is Rs284bn.\n\nWhile the government borrows at relatively low rates from international lenders, it extends these funds to provincial governments and public institutions at significantly higher interest rates.\n\nThese loans, including Cash Development Loans (CDLs) and Foreign Re-lent Loans, are essential for financing provincial development programmes and social initiatives, with the interest collected contributing significantly to federal revenue. The rates on these loans are revised annually based on the government’s own debt servicing costs.\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:08:35.246Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941601/govt-cuts-provident-fund-returns-amid-fiscal-constraints",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:01:48.000Z"
}
