{
  "title": "Indian hardliners give religious twist to Nepal protests - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: Protesters in Nepal ousted the prime minister and set parliament ablaze over the government’s ban on social media and corruption allegations, but in India the violence is being misrepresented online as something else entirely: a religious uprising.\n\nWhile some claim that the demonstrations are a demand for a “Hindu state”, others say the opposite — that they are an attack on the faith.\n\nFuelling the narrative are allegations from Indian broadcasters and politicians that rioters vandalised Nepal’s Pash­u­pa­ti­nath temple, a revered Hindu site.\n\n“Some rioters, hiding within the crowd of protesters, attempted to vandalise the temple, and it was only after this incident that the army was deployed,” an anchor for the right-wing Zee News channel said in a report featuring a clip of people climbing onto the temple’s gate and violently shaking it.\n\nJivesh Mishra, a member of India’s ruling Bharatiya Janata Party (BJP) in Bihar state, which shares a border with Nepal, told reporters on Wednesday: “An attack on a temple is an attack on (the) Hindu faith.”\n\nRight-wing influencers also amplified the claim to their thousands of followers.\n\nBut fact-checkers traced the footage to a religious ritual called Naxal Bhagwati Jatra, filmed weeks before the violence.\n\nK. N. Swami, a renowned monk in the temple, also posted clips on social media to refute claims it had been attacked.\n\n“I am currently inside the temple, and everything is peaceful here,” he said.\n\nNepal’s demonstrations began in the capital Kathmandu on Monday, driven by angry young protesters and now dubbed the “Gen Z” movement.\n\nThe protests escalated into an outpouring of rage nationwide, with government buildings set ablaze after a deadly crackdown. Sharma Oli quit as prime minister shortly after demonstrators set fire to his house.\n\n‘Instigated and funded’\n\nHundreds of social media posts have clai­med without evidence that the protests were “instigated and funded” by “anti-Hindu forces and Islamists” to attack religious sites. Nepal, a secular republic since 2008, has witnessed frequent demonstrations by groups demanding a return to Hindu statehood.\n\nOld visuals of the rallies resurfaced online this week, misleadingly presented as the current protests.\n\nFootage of protesters calling for a Hindu monarchy in the past was falsely shared as evidence that Nepal’s “Gen Z” movement is more about religion than corruption.\n\nAnother image circulated with a claim that demonstrators wanted India’s firebrand Hindu monk Yogi Adityanath as Nepal’s prime minister.\n\n‘Hindu nation’\n\nHashtags in favour of a “Hindu Nation” — a popular catchphrase of the BJP — have trended across social media platforms in India.\n\nThe posts warn the country to “prepare for similar youth uprisings”.\n\n“The urge to break news fast in India is higher, and that led to misinformation from their side,” said Prashant Das, a research fellow at South Asian University.\n\n“What is rife now are speculations and rumours, which are natural responses of people in such situations.”\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/1310502645cace8.webp",
  "retrievedAt": "2025-10-12T04:07:50.975Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941588/indian-hardliners-give-religious-twist-to-nepal-protests",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:02:04.000Z"
}
