{
  "title": "UNHCR urges Pakistan to extend stay for Afghans - World - DAWN.COM",
  "author": null,
  "content": "• Warns of ‘crisis within a crisis’ as returns coincide with quake devastation\n• Suspends eight cash and support centres due to Taliban ban on female staff\n• Appeals for $259m to sustain life-saving assistance\n\nISLAMABAD: The top official of the UN Refugee Agency (UNHCR) in Afghanistan has called on Pakistan to uphold its long-standing humanitarian approach towards Afghan refugees and extend the legal stay of those still in need of international protection, particularly groups at heightened risk if forced to return.\n\nIn a statement issued from Geneva on Friday, UNHCR Representative to Afghanistan Arafat Jamal said the agency stood ready to support Pakistan in developing practical mechanisms to identify vulnerable individuals and expand regulated migration pathways for Afghans.\n\nHe also urged regional countries to ensure that all returns remain voluntary, safe, dignified and sustainable, stressing that no one should be forced back to danger or to a country already stretched to absorb new arrivals.\n\n“Without additional funding, we will not be able to sustain life-saving assistance for Afghan families facing these overlapping crises. We have updated our regional appeal for returns in light of recent events and are calling for $258.6 million,” Mr Jamal said.\n\nAs Pakistan resumes implementation of its “Illegal Foreigners Repatriation Plan”, more than 554,000 Afghans have returned since April, including 143,000 in August alone.\n\nIn recent weeks, the pace has surged further: in the first week of September alone, nearly 100,000 people crossed back from Pakistan, stretching capacities to the limit.\n\nTogether with partners, UNHCR is providing returnees with immediate assistance — cash support, protection and other essential services — both at border points and in their areas of return, to help families begin rebuilding their lives.\n\nHowever, in recent days, UNHCR has been forced to temporarily suspend operations at its cash and support centres across Afghanistan, as the de facto authorities have been preventing national female UN staff members from entering UN compounds.\n\n“This is a problem affecting the entire UN, including UNHCR, and any agency head would tell a similar story. It is not possible to serve women without female staff. We reiterate our call for the immediate lifting of these restrictions and for an urgent solution to be found,” the statement said.\n\nMr Jamal said the agency closed eight centres providing cash and other support to returnees on Sept 9 because of the ban on female aid workers.\n\n“This was an operational decision. It is not a decision taken to punish anyone or to make a statement, but it simply demonstrates that we cannot work without female workers in certain circumstances,” he told a Geneva press briefing by video link from Kabul, according to Reuters.\n\n“It is a huge step, and it is creating an enormous amount of suffering for these people,” he said, adding that these centres typically helped around 7,000 people a day.\n\nThe work at the centres involves personal interviews and biometrics, which he said cannot be done by men on Afghan women, he added.\n\nRestrictions on women\n\nMeanwhile, the United Nations in Afghanistan has called on Taliban authorities to lift restrictions barring women national staff from entering its premises, APP reported.\n\n“These measures are putting life-saving humanitarian assistance and other essential services for hundreds of thousands of people affected by a recent deadly earthquake at risk,” the UN Assistance Mission in Afghanistan (UNAMA) warned in a statement.\n\nThe UN Refugee Agency cautioned that a “crisis within a crisis” was emerging, as forced returns from Pakistan coincide with devastating earthquakes in many of the same areas where returnees are arriving.\n\nSince the start of the year, about 2.6 million Afghans have returned from neighbouring countries, many against their will. Some have not set foot in Afghanistan for decades, while others are being brought into the country for the first time.\n\nThe agency “remains grateful to governments, companies and individuals who have already stepped up to support UNHCR’s work in Afghanistan and across the region. But our resources are running out quickly”, Mr Jamal cautioned.\n\nMeanwhile, in the earthquake-affected areas, UNHCR has met families who had only just returned from Pakistan before losing their homes once again. “We are distributing thousands of tents and other relief items, including in some of the most remote locations, while also scaling up protection assessments and programmes already in place in these provinces for returnees,” he added.\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c4b2a9ba0cd.gif",
  "retrievedAt": "2025-10-12T04:07:53.036Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941596/unhcr-urges-pakistan-to-extend-stay-for-afghans",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:01:35.000Z"
}
