{
  "title": "Confronting the 26th Amendment - Newspaper - DAWN.COM",
  "author": null,
  "content": "IF there were ever a burning question, it would be regarding the pending 26th Ame­ndment cases. In fact, there might be more. One of the questions, I suspect, may revolve around why such critical cases are being treated so uncritically.\n\nAnother would pertain to the reasons that compelled the Supreme Court to prioritise infructuous matters, or matters of dissimilar import, over those which hit the court’s credibility and integrity. Another may orbit around how the judiciary can even talk about judicial reform when it cannot decide the limits of its own judicial form.\n\nFinally, one may ponder over what justice the Supreme Court can hope to deliver to others, when it evidently is unable to deliver justice to itself. All or any of these questions may be considered critical, and it can be debated which one deserves to be answered first. But what is beyond question is the silence of the court when it comes to answering any of them.\n\nWhichever way one looks at it, the problem in the curious case of the challenges to the 26th Amendment lies in its very fundamentals. In essence, the changes brought about by the amendment appear to touch upon the very scheme of the Constitution it seeks to amend. The Supreme Court has itself referred to this ‘scheme’ in different ways on different occasions — as a ‘basic structure’, or as ‘salient features’, or ‘prominent characteristics’.\n\nWhichever permutation you prefer, the gist of the argument remains the same: the Constitution retains certain fundamental features that make it what it is, and without them, it would perhaps no longer be the Constitution of Pakistan. In layman’s terms, the salient features are the Constitution, or at the very least, it’s soul.\n\nWhile there may be many salient features, democracy, a parliamentary form of government, and independence of the judiciary are three definite ones. A long history of cases previously has acknowledged the presence of such features in one form or the other. However, on whether a constitutional amendment itself can be struck down on the touchstone of the same, the case law has been less enthusiastic.\n\nInterestingly, Pakistan’s courts have traditionally been seen as more resistant to striking down a constitutional amendment on the basis of the doctrine of salient features, as opposed to Indian jurisdiction’s accommodating and more welcoming position on the issue.\n\nThis, however, seems to have changed in 2015, when the Supreme Court, hearing matters relating to the vires of the 18th Amendment, along with the 19th and 21st Amendments, specifically addressed this question. Out of a total of 17 judges, 11 not only upheld the presence of salient features in the Constitution in one form or the other, but also acknowledged and upheld the judicial review of a constitutional amendment on the basis of an infringement of the same. This is not to say that the judiciary retained unlimited powers to undo such amendments, which would be an overstatement.\n\nJudicial independence is called a ‘principle’ of law for a reason.\n\nHowever, in the context of the changes in the judicial appointment mechanism, as made by the 18th and 19th Amendments, and which revolved around the composition and functions of the judicial commission and parliamentary committee, the Supreme Court provided certain insightful observations.\n\nIn the context of Article 175-A of the Constitution, the court held that the litmus test for judicial independence appears to be that the power to initiate, as well as the primacy and decisiveness of the final outcome of the appointment process, must vest in the chief justices and members of the judiciary. Essentially, the judiciary must be given a decisive role in making such appointments and initiating them.\n\nEarlier, in relation to the challenges to the 18th Amendment, and prior to the enactment of the 19th Amendment, the Supreme Court had articulated how the Constitution envisions a judiciary which is free from executive influence or oversight, and free from the shackles of legislative blackmail. It delineated such a principle on the basis of the constitutional provisions relating to a fair trial, separation of the executive from the judiciary, and securing an independent judiciary. It was actually in light of these principles that the need for the 19th Amendment was felt, which had whittled down the 18th Amendment in order to ensure that the executive and legislature would lack undue influence in judicial processes overall.\n\nIn my opinion, such influence would not merely be limited to considering the ratio of judicial officers to non-judicial representatives in the judicial commission, but would also have to consider the number of members, judicial or otherwise, being directly or indirectly appointed by the executive or legislature.\n\nWhen the current challenges to the 26th Amendment are seen from this prism, the amendment does not seem to fulfil the above-mentioned litmus test or preserve the Constitution’s salient features. And that is perhaps why no one wants to deal with these cases. They have the potential to be messy, comes at an undesirable time, and is — for a lack of a better word — inconvenient.\n\nThat said, judicial independence is called a ‘principle’ of law for a reason. A ‘principle’ is a position one takes and stays committed to even in difficult times. If you remain committed to your principles only when it is convenient, it isn’t a principle, but a trend. In the past, the judiciary typically chose the path of least resistance when dealing with critical constitutional issues such as these, thereby being seen as facilitating power. Over the decades, it garnered criticism and lost much face.\n\nOne hopes that this time round, unlike its chequered past, it treats judicial independence as the principle it should be, and not as the trend it is now becoming.\n\nThe writer is a Karachi-based lawyer.\n\nbasil.nabi@gmail.com\n\nX: @basilnabi\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c4c566b57dc.jpg",
  "retrievedAt": "2025-10-12T04:08:40.360Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941634",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:17:13.000Z"
}
