{
  "title": "Convict to await judge’s note in Noor Mukadam murder case - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Supreme Court on Friday took up a review petition filed by Zahir Zakir Jaffer, who is challenging the capital punishment awarded to him for the 2021 murder of Noor Mukadam, and asked him to wait for an additional note that a judge has yet to deliver, in support of the May 20 judgement.\n\nAs the hearing began, Justice Ali Baqar Najafi told senior counsel Khawaja Haris Ahmed, representing the convict, that it would be more appropriate for him to start arguments after going through the additional note, which he still has to issue, despite having endorsed the majority verdict of May 20.\n\nA three-judge bench, headed by Justice Hashim Kakar and comprising Justice Ishtiaq Ibrahim and Justice Najafi, took up the review petition. Justice Kakar recalled that senior counsel Salman Safdar had represented the convict in the earlier round of litigation.\n\nKhawaja Haris, however, pointed out that after the adoption of the Supreme Court Rules 2025, a litigant may appoint counsel of choice at the stage of review petitions.\n\nSC directs counsel to study new court rules; review petition claims social media prejudiced trial proceedings\n\nAt this, Justice Kakar wondered whether the rule change was intended for a particular case or applied generally.\n\nThe court adjourned the proceedings for three weeks with an observation that the counsel should not only wait for the additional note but also study the newly adopted court rules.\n\nOn May 20, the Supreme Court had confir­med the death sentence awar­ded to Zahir Jaffer by rejecting his appeal in the Noor Mukadam murder case, which shocked society in 2021.\n\nNoor Mukadam, 27, was brutally murdered on July 20, 2021, at the convict’s residence in Sector F-7/4, Islamabad. Following the discovery of her body, he was arrested as the prime suspect.\n\nOn Feb 24, 2022, a trial court in Islamabad sentenced him to death for Noor Mukadam’s murder. He was also convicted of rape and handed 25 years of rigorous imprisonment along with a fine of Rs200,000.\n\nLater, on March 14, a division bench of the Islamabad High Court (IHC) upheld the death sentence while converting his life imprisonment into a death sentence.\n\nThrough a detailed verdict on June 10, two SC judges explained the significance of digital evidence, ruling that video footage is admissible under the “silent witness theory” if properly authenticated, eliminating the need for eyewitness testimony.\n\n“It is a well-known fact that technology has become so ingrained in our lives that everyone is utilising one form of technology or another,” observed Justice Hashim Kakar, supported by Justice Ibrahim. Justice Najafi has yet to issue his additional note.\n\nThe petition\n\nIn his review petition, the convict argued that the social media hype following Noor Mu­­kadam’s murder had created prejudice against him during the investigation, trial and appeal stages, breaching his fundamental right to a fair trial and due process. He contended that the May 20 judgement did not address the issue of his unsoundness of mind or mental capacity, a point raised before the court. The plea, he said, was critical for determining both the validity of the trial and the severity of his sentence.\n\nThe petition also claimed that the trial was influenced by a planned and sustained social media campaign by the complainant, and that the trial judge failed to consider his plea within the framework of law.\n\nPublished in Dawn, September 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:37:43.066Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941614/convict-to-await-judges-note-in-noor-mukadam-murder-case",
  "dateList": "2025-09-13",
  "date_published": "2025-09-13T01:01:41.000Z"
}
