{
  "title": "OIC stands by Pakistan in fight against terrorism: OIC Secy Gen",
  "link": "https://www.app.com.pk/national/oic-stands-by-pakistan-in-fight-against-terrorism-oic-secy-gen/",
  "date_published": "2020-06-29T23:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 30 (APP):Secretary General of Organization of Islamic Cooperation (OIC) Dr Yousaf bin Ahmed Al-Othaimeen on Tuesday said the OIC would support and stand by Pakistan in its fight against terrorism.\nThe OIC secretary general offered condolences over the loss of lives in the attack on Pakistan Stock Exchange during a video-link meeting of the Board of Trustees of International Islamic University Islamabad (IIUI) chaired by President Dr Arif Alvi, here at the Aiwan-e-Sadr.\nThe meeting unanimously approved Dr Hathal bin Hamoud Al-Otaibi as the IIUI president, earlier serving at Imam Muhammad bin Saud Islamic University in Riyadh, Saudi Arabia.\nSpeaking from Jeddah, the OIC secretary general thanked the Government of Pakistan for offering 100 scholarships to the students of 15 under-developed countries.\nPresident Dr Arif Alvi while terming the IIUI a great centre of learning, said the institution was providing students a balance of contemporary education along with the knowledge about Sharia, and Islamic history and culture.\nHe directed the IIUI management to set its specific goals and vision, and fix a timeframe to achieve them.\nDr Alvi lauded the cooperation extended by Saudi Arabia and the Islamic Development Bank (IDB) to the IIUI and also expressed gratitude to Al-Azhar University, Egypt for sending 30 teachers and bearing their financial responsibilities.\nThe president also admired the services and contributions rendered by former IIUI president Dr Ahmad bin Yousaf Al-Darwesh, for the promotion of education.\nAlso speaking through video-link from Jeddah, President of Islamic Development Bank Dr. Bandar M.H Hajjar assured the meeting that the Bank would continue to fund the Waqf project of IIUI.\nIIUI Rector Prof Dr. Masoom Yasinzai briefed the participants about the activities and role of the IIUI in promoting education in the country.\nOther participants that joined via video-link, included President of Al-Azhar University Egypt Prof. Mohamed Othman Elkhosht, IIUI Pro-Chancellor Prof Ahmad Salem Muhammad Al-Ameri, and Acting President of Islamic University of Madina Dr. Abdullah Al-Utaibi.\nThe meeting was attended at the Aiwan-e-Sadr by IIUI Rector Prof. Dr. Masoom Yasinzai and Vice President Prof. Dr. Aqdas Naveed Malik, Federal Shariat Court Chief Justice Muhammad Noor Meskanzai, Chairman of the Council of Islamic Ideology Prof. Dr. Qibla Ayaz, Higher Education Commission Chairman Prof. Dr. Tariq Banuri, Secretary Finance Naveed Kamran Baloch, Secretary Foreign Affairs Sohail Mahmood and Secretary to the President of Pakistan Tariq Najeeb Najmi.",
  "retrievedAt": "2025-08-11T19:25:30.005Z"
}
