{
  "title": "Kurram conundrum - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE validity of the claim by state functionaries that the violence in KP’s Kurram district stems from a ‘tribal dispute’ has been severely put to the test by recent events.\n\nAfter an attack on a convoy in the Bagan area on Thursday led to the loss of security personnel, a counterterrorism operation seems imminent, and the state has prepared plans to shift civilians to safer areas. While tribal disputes over land and water have played a key role in exacerbating tensions in Kurram, the fact is that sectarian groups and terrorist outfits have exploited these differences to establish footholds in the district, as the state has fumbled for responses.\n\nAt least two security men were martyred in the convoy attack, which is the second of its kind; an earlier attack had targeted the then Kurram DC, who survived the ambush. In the latest outrage, militants looted the trucks carrying goods to Parachinar, while four drivers have been found dead, with their hands tied and their bodies bearing signs of torture.\n\nUnfortunately, if the state — all institutions, including the centre, the KP government, and the security establishment — had moved with alacrity when violence initially flared up last year, such bloodshed could have been avoided. But it seems that the administration was in denial, letting the Kurram cauldron boil until it was ready to explode, which it certainly has. Now, thousands of people will be displaced as the security forces go after militants. Besides, matters will be complicated by the fact that the local militants — including those fighters allied with the banned TTP and IS-K — have ideological comrades just across the border in Afghanistan.\n\nSadly, the state took a slothful approach to addressing the underlying land and water disputes which have fuelled conflict. Moreover, the government displayed great callousness by allowing Parachinar to be blocked off from the rest of the country for months following the deadly targeting of a convoy in Lower Kurram in November. This resulted in a grave humanitarian crisis in Kurram’s main town, with children and newborns particularly affected due to lack of food and medicine.\n\nBut the state took its time to address the ‘tribal dispute’. Even the peace pact hammered out by a jirga on Jan 1 has failed to stem the violence, as the recent convoy attacks show, and now a CT operation is being seen as the last resort. If terrorists and sectarian groups — regardless of their confessional affiliations — had been neutralised earlier, we would not be at this juncture today.\n\nFurthermore, the blockade of any region even for a single day should not have been tolerated by the state. The days ahead will tell whether the government succeeds in bringing peace to this forsaken area.\n\nPublished in Dawn, January 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:47:37.635Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886210",
  "dateList": "2025-01-19",
  "date_published": "2025-01-19T02:50:15.000Z"
}
