{
  "title": "Journalist in Khairpur staged his own kidnapping for ransom: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A journalist from Sindh’s Khairpur district “faked his own kidnapping,” police said on Sunday, after a video posted on his Facebook account showed him chained and pleading for release, claiming to have been abducted by dacoits for a ransom of Rs10 million.\n\nThe video posted on Friday, which also showed the journalist, Fayyaz Solangi, being tortured by a masked armed man, sparked a strong outcry from the journalist community in the upper region of Sindh, leading to demonstrations in several towns on Saturday.\n\nSolangi’s colleague, Ghulam Hussain Chang, said at Hingorja Press Club that the journalist went missing on Jan 12, with his motorcycle found parked along a link road around 7:00 pm. Police and fellow journalists searched for him but failed to locate him. After the video confirmed his abduction, Solangi’s uncle claimed that he received a call from kidnappers demanding Rs10 million ransom.\n\nSindh Chief Minister Syed Murad Ali Shah later directed the Sindh inspector-general of police to recover the journalist and submit a report.\n\nIn a joint press conference today, Senior Superintendent of Police (SSP) Khairpur Tawheed Memon and SSP Kashmore Zubair Nazir Shaikh said that the police had recovered the journalist by conducting an operation in the Kashmore area.\n\n“However, Fayyaz Solangi had pretended to be abducted to make a false case against his cousins, with whom he had a land dispute,” SSP Memon said. “The journalist had concocted a drama to make a false case against his cousins.”\n\nThe officials added that the journalist’s uncle, Mazhar Solangi, was also arrested in Khairpur for being the “main character behind the fake kidnapping.”\n\nMeanwhile, in a statement, KTN News Group, Solangi’s employer, confirmed his dismissal for faking his kidnapping and stated that the organisation no longer had any association with him.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:47:35.148Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886291/journalist-in-khairpur-staged-his-own-kidnapping-for-ransom-police",
  "dateList": "2025-01-19",
  "date_published": "2025-01-19T12:32:35.000Z"
}
