{
  "title": "Rwanda seeks to expand direct trade - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: High Commissioner of Rwanda Harerimana Fatou has revealed that 45 per cent of tea arriving in Pakistan originates from Rwanda but is routed through Kenya.\n\n“The business community of Karachi must look into the possibility of directly importing tea from Rwanda instead of Kenya. I am here to connect you with Rwandan tea and coffee producers to promote direct exports from Kigali to Karachi,” she stressed during a meeting with the Karachi Chamber of Commerce and Industry (KCCI) members on Saturday.\n\nPakistan’s total tea imports in FY24 stood at 260,286 tonnes ($656m), up by 12.4pc in quantity and 15pc in value year-on-year. Official data showed that imports in 5MFY25 were 102,364 tonnes ($258m), down by 12pc in quantity and 7pc in value during 5MFY24.\n\nShe mentioned that Rwanda also exports minerals, vegetables, and beans in small quantities which can be increased. On the other hand, Pakistan exports rice, cooking oil, and pharmaceuticals in smaller amounts to Rwanda. “We import these products in large quantities from India and China. Why not source them from Pakistan?” she questioned.\n\nShe urged the KCCI to establish and enhance bilateral trade and investment relations with Rwanda by connecting with the Rwanda Development Board.\n\nDespite being a small country, Rwanda is keen to work with Pakistan. Being small and landlocked is not an issue as Rwanda, a member of the East Africa Community, Common Market for Eastern and Southern Africa, and the African Union, thinks big, she said. As an open market, Rwanda can be easily accessed, and Pakistani businessmen can benefit from Rwanda’s FTAs with many countries in the African region, she added.\n\nPublished in Dawn, January 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:54:53.521Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886221/rwanda-seeks-to-expand-direct-trade",
  "dateList": "2025-01-19",
  "date_published": "2025-01-19T03:04:17.000Z"
}
