{
  "title": "Games chiefs warn 2026 Olympic bobsleigh track faces ‘challenging’ schedule - Sport - DAWN.COM",
  "author": null,
  "content": "ROME: Organisers of the 2026 Winter Olympics are battling to finish the bobsleigh, luge and skeleton track in Cortina d’Ampezzo for an approval deadline in March, officials said on Friday.\n\nAt the end of a two-day inspection by representatives of the International Olympic Committee (IOC), the International Bobsleigh Federation and International Luge Federation, the schedule was described as “tight and challenging”.\n\n“All the participants acknowledged...the progresses made,” said a joint-statement by 2026 Olympics organisers and Simico, the construction delivery company.\n\n“Meanwhile, the schedule remains tight and challenging in order to be ready for the start of ice making at the beginning of March and the pre-homologation of the track at the end of March.”\n\nThe controversial track has been a political problem for the sprawling Milan-Cortina Games.\n\nIn their bid file, Milan-Cortina planned to renovate the old track used for the 1956 Olympics.\n\nThey changed their minds as their call for tenders went unanswered and announced in October 2023 that the sliding competitions would be held outside host nation Italy.\n\nThe decision quicklybecame a political football in Italy, with the country’s government led by prime minister Giorgia Meloni pushing for all events to stay at home.\n\nThe resulting decision to build a completely new track was heavily criticised by both the IOC and local environmental activists.\n\nWork only started in January 2024. Italian construction company Pizzarotti, the sole bidder for the contract, had just over a year to build a 1,445m-long (4,740-foot) track with 16 bends and complex refrigeration systems.\n\nThe IOC pointed out that no such track had ever been built “in such a short space of time”.\n\nOrganisers have said that if the track is not ready for the Olympic fortnight, they would hold the events in the USA, on the Lake Placid track, renovated in 2010, used for the 1932 and 1980 Olympics.\n\nPublished in Dawn, January 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:55:20.403Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886131/games-chiefs-warn-2026-olympic-bobsleigh-track-faces-challenging-schedule",
  "dateList": "2025-01-19",
  "date_published": "2025-01-19T02:36:44.000Z"
}
