{
  "title": "Metro to be closed for two days to complete repair work in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The Rawalpindi Development Authority (RDA) plans to close Metro Bus Service for at least two days as it has failed to complete the repair work of the metro track from Saddar to Faizabad despite the lapse of two deadlines.\n\nIt may be mentioned that due to the repair work, commuters, especially office goers and students, travelling between the twin cities have faced problems.\n\nThe rehabilitation of the metro corridor from Saddar to Faizabad costing Rs718.945 million started in July and was supposed to be completed by December 31, but the RDA not only missed the first deadline but also the second one, January 15.\n\n“Due to slow work, the repair work of metro track has not yet been completed. The work on Chandni Chowk metro bus station elevated road and 50 joints of the track is pending and the RDA plans to close Metro Bus Service for a day or two to complete the work at Chandni Chowk,” said a senior official of the Punjab Mass Transit Authority.\n\nHe said the RDA had intimated about the dire need to close the bus service to repair the elevated road at Chandni Chowk but it did not mention any dates, adding that in the coming week Metro Bus Service may be suspended for a day or two.\n\nHe said due to slow work the passengers have been complaining of slow speed of buses in Rawalpindi section from Saddar to Faizabad. “The speed of the buses is slow due to construction work. The RDA had assured to carry out the pending work at night but it failed to do so,” he said.\n\nHe said after completion of the Rawalpindi section metro track, the repair work in Islamabad would begin. However, he said the RDA says the closure of roads from July to December due to political protests also played a role in the failure to meet the deadlines.\n\nHe said about 90 per cent work had been completed so far and the remaining was likely to be complete by February, adding the RDA would have to speed up the work so that the passengers did not face any disturbance.\n\nRDA Director General Kinza Murtaza was not available for comments; however, a senior RDA official said the work would be completed in two weeks, adding the contractor faced difficulties in the repair work as he had to do it during metro bus operations.\n\nHe further said the Chandni Chowk section would be completed in next week and the 50 joints of the track would also be repaired soon.\n\n“We are working day and night to ensure the quality of work and there is no more hurdle in the completion of work,” he added.\n\nOn the other hand, Punjab Mass Transit Authority Rawalpindi and Islamabad chapter Manager Operations Wajid Saleem said that the metro bus service in Rawalpindi section will be closed in coming week on the request of the RDA.\n\nHowever, he said that the date of the suspension of bus service was not fixed yet.\n\nPublished in Dawn, January 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/678c192f393e4.jpg",
  "retrievedAt": "2025-10-12T01:13:13.608Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886151/metro-to-be-closed-for-two-days-to-complete-repair-work-in-rawalpindi",
  "dateList": "2025-01-19",
  "date_published": "2025-01-19T02:37:00.000Z"
}
