{
  "title": "Minorities in Pakistan safe; EU resolution contrary to facts: Ashrafi",
  "link": "https://www.app.com.pk/national/minorities-in-pakistan-safe-eu-resolution-contrary-to-facts-ashrafi/",
  "date_published": "2021-05-03T18:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP): Special Representative to the Prime Minister on Religious Harmony and Middle East Hafiz Muhammad Tahir Mahmood Ashrafi Monday said that minorities in Pakistan were absolutely safe and European Union’s resolution was contrary to the facts.\nAddressing a news conference, he said that not a single case of forced conversion had been reported in the last several months. Minorities were living with peace and harmony and EU should visit Pakistan and see that our judiciary took decisions after evaluating the situation and facts.\nPrime Minister Imran Khan would visit Saudi Arabia this week to meet crown prince Muhammad Bin Salman and Saudi leadership. The PM would also perform Umrah during his visit. Pakistan would play pro active role in achieving green Middle East targets.\nHe said Pakistan welcomed the Saudi gift of King Salman mosque in International Islamic University.\nThe mosque having the capacity of around 12,000 worshipers would be constructed inside the International Islamic University, Islamabad.Pakistan was enjoying excellent relations with Saudi Arabia and gulf states, he added.\nHe said PM met with envoys of OIC ( Organisation of the Islamic Conference) last day and stressed forging unity among Muslim ummah.\nThe PM reiterated his love for the holy Prophet (PBUH). The OIC envoys appreciated the initiatives taken by Prime Minister Imran Khan. “Our agenda was unity and solidarity of the Muslim Ummah,” he said, adding linking Islam with terrorism and sectarianism was a great injustice. At present, the biggest issue was regarding the interpretation of Islam, he added.\nThe government will not compromise over the honor and dignity of the blessed holy Prophet (PBUH) the day will soon come when there will be legislation on protecting the honor and sanctity of the holy Prophet (PBUH) globally,\nTahir Ashrafi said that the federal government had not imposed any ban on observing I’tikaf, however “we have to follow the SOPs, (standard operating procedures) we have not closed the mosques, we are proud that precautions were being followed.”\nTo a question he said solving the problems of Pakistanis abroad was the top priority of the prime minister.",
  "retrievedAt": "2025-08-11T20:41:26.430Z"
}
