{
  "title": "Govt for introduction of modern technology to end rigging allegations: Fawad",
  "link": "https://www.app.com.pk/national/govt-for-introduction-of-modern-technology-to-end-rigging-allegations-fawad/",
  "date_published": "2021-05-03T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 3 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Monday said that the government wanted to introduce modern technology in the electoral process to end the controversy of rigging forever.\nFree and transparent elections were prerequisite for the democracy and use of Electronic Voting Machines was a means to achieve this target, he said while addressing a press conference flanked by the PM Adviser on Parliamentary Affairs Babar Awan.\nHe recalled that Prime Minister Imran Khan was the first captain in the international cricket who pleaded to introduce neutral umpires in cricket. He said after neutral umpires and introduction of new technology, the controversy of umpires’ biasness in country’s electoral process would be banished.\nChaudhry Fawad said that the government wanted to introduce similar fairness in the electoral process and use of Electronic Voting Machines was meant to achieve this goal. He reminded that the prime minister in his first speech in the\nNational Assembly after assuming his office’s charge went to the seat of the Opposition Leader Shahbaz Sharif and offered formation of a committee to investigate allegations of rigging.\nHe said that after the 2013 elections the then rulers took four years and a sit in for formation of a committee to investigate rigging allegations. He said that PML- N claimed that in 2018 RTS system failed and the committees were asked to bring details of RTS failure and non submission of Form 45 in the committee but they failed to do so.\nHe said that after 2018 elections 25 petitions regarding rigging were filed in Punjab out of which 13 were filed by PTI candidates and only 11 by the PML-N. He said that in recent Karachi bye elections PML- N has accused PPP of rigging. Fawad said that the PTI tried its best for open balloting in the Senate election in March and this was also agreed in the Charter of Democracy signed between PML- N and PPP.\nHe said that the PML- N in 2015 was also in favour of open balloting in Senate elections but when Imran Khan suggested this they took a 180 degree U-turn and started opposing it.\nHe said that Yusuf Raza Gilani’s election as senator and his defeat as chairman Senate there was controversy on both the occasions.\nHe said if the political parties would continue fighting over the election results, the country would not be able to make progress. He said that Imran Khan desired that the political parties should sit together for finalization of electoral reforms and also tweeted for talks on electoral reforms.\nThe minister said that the PTI wanted to introduce new technology and electronic voting machines which can give results in half an hour.This would help increase the trust of the people, political parties\nand intelligentsia in the electoral process.\nHe said that the PML-N said that they oppose negotiations and the Election Commission of Pakistan should decide about bringing reforms in the electoral system and this stance was tantamount to undermine the authority of the Parliament. He said that respect of the vote could not be restored till the Parliament was given respect.\nHe said that Shahbaz Sharif, Shahid Khaqan Abbasi and Ahsan Iqbal had not seen the electronic voting machines and rejected their use. He said that the scientists who prepared the EVMs were assets of the nation and they should be encouraged for their invention.\nFawad Hussain said that it was a fact that the PML-N always came to power through conspiracies but now time had come to rise above personal interests and think about the future of the country.\nReplying to media persons’ questions, Fawad Hussain said the\ngovernment wanted to proceed for electoral reforms with consensus and\nthe opposition was needed to play its role in this regard.\nThe minister said if both PPP and PML-N were not in favour\nof voting right to the overseas Pakistanis and their contesting the\nelections they should come forward and oppose it openly.\nHe said that the government was enjoying majority in the\nNational Assembly and the Senate and hence did not require support of\nthe opposition parties for general electoral reforms but for the constitutional\nreforms their support was necessary for the two constitutional amendments.\nReferring to the PML-N’s opposition on the use of electronic\nvoting machines in future elections, the minister insisted that\ninstead of rejecting it they should seek input from their own technical\nexperts.\nHe also referred to the attempts made by the government on\nseveral occasions and the non-cooperation of the opposition while PPP\nhad named Naveed Qamar as its focal person with regard to the\nparliamentary committee on electoral reforms whereas the PML-N had\nnot responded to the letter written by the NA Speaker.\nHe said that the prime minister, the speaker of the National Assembly\nand the federal ministers were appealing to the opposition for\nelectoral reforms.\nReplying to a question, the minister said that one of the\nreforms was that the demarcation would be carried out on the basis of\npopulation and the voters in each constituency would be equally\ndistributed to put an end to voters’ disparity in constituencies.\nThe minister also ruled out the possibility of hacking of EVMs, as\nthese would not be connected to the internet as such and be in stand\nalone position. He said that therefore, the chances of hacking were zero.",
  "retrievedAt": "2025-08-11T20:41:32.689Z"
}
