{
  "title": "COVID-19 claims 79 lives, infects 4,213 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-79-lives-infects-4213-more-people/",
  "date_published": "2021-05-03T08:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP): The national tally on Monday of total active COVID-19 cases recorded 87,953 with 4,213 more people tested positive for the deadly virus and 5,842 people recovered from the disease during the last 24 hours.\nSeventy-nine corona patients have died during past 24 hours, 73 of whom were under treatment in hospital and six out of the hospital in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the past 24 hours, most of the deaths have occurred in Khyber Pakhtunkhwa followed by the Punjab.\nOut of the total 79 deaths occurred in the last 24 hours, 24 of them had died who were under treatment on ventilators.\nThe maximum ventilators were occupied in four major areas including Lahore 70 percent, Multan 74 percent, Gujranwala 57 percent and Mardan 80 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) were also occupied in four major areas of Lahore 59 percent, Mardan 70 percent, Peshawar 65 percent and Swat 63 percent.\nAround 670 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Gilgit Baltistan (GB) and Balochistan.\nSome 45,954 tests were conducted across the country on Sunday, including 16,469 in Sindh, 16,307 in Punjab, 7,794 in Khyber Pakhtunkhwa (KP), 3,815 in Islamabad Capital Territory (ICT), 558 in Balochistan, 385 in GB, and 626 in AJK.\nAround 728,044 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 834,146 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 17,371, Balochistan 22,620, GB 5,327, ICT 76,209, KP 120,064, Punjab 306,929 and Sindh 285,626.\nAbout 18,149 deaths were recorded in country since the eruption of the contagion. Around 4,667 have perished in Sindh among six of them died in hospital and three out of the hospital on Sunday.\n8,572 in Punjab had died with 22 deaths occurred in past 24 hours. 19 of them in the hospital and three out of hospital. 3,392 in KP where 42 of them died in hospital on Sunday, 691 in ICT, 237 in Balochistan, 107 in GB and 483 in AJK among six of them succumbed to the deadly virus in hospital on Sunday.\nA total of 11,928,095 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 6,534 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:41:33.877Z"
}
