{
  "title": "Huawei, IT ministry to train 1,000 govt staffers on ICT skills: President told",
  "link": "https://www.app.com.pk/national/huawei-it-ministry-to-train-1000-govt-staffers-on-ict-skills-president-told/",
  "date_published": "2021-05-03T11:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 3 (APP): Vice President of Huawei Middle East Region Li Xiangyu Monday called on President Arif Alvi wherein he told that his organization, in coordination with IT ministry would train 1,000 government employees to achieve Digital Pakistan Initiative.\nLi Xiangyu, who was accompanied by a delegation, said the government officials would be registered and enrolled for training programs which would be conducted by Huawei experts.\nThe meeting was attended by Secretary Ministry of Science and Technology, Dr Arshad Mahmood, Secretary Federal Education Farah Hamid, Additional Secretary IT&T Ali Sher Mehsud, and other senior government officials. Chairman PM’s Task Force on Science and Technology Dr Atta-ur-Rehman attended the meeting via video link.\nLi Xiangyu gave a presentation about the role of his organization in the promotion of IT skills in Pakistan.\nPresident Arif Alvi appreciated the initiative of Huawei to provide training and ICT skills to the people of Pakistan.\nHe asked the Ministry of Information Technology and Telecommunication to develop an action plan and set timelines for launching training programs for the government employees to train them in fields like artificial intelligence, cloud technology, big data, blockchain, neural networks and communication technologies.\nhttp://https://youtu.be/kTGqZRwmKds\nHe urged the ministry to come up with more innovative ideas and enhance collaboration with Huawei for early realization of Digital Pakistan Initiative.\nPresident Alvi called for promoting knowledge-economy and digitalization of government organizations to enhance the efficiency of work and service delivery.\nHe said that Pakistan was blessed with immense talent and resources and the government was making serious efforts to channelize this potential in the right direction.\nLi Xiangyu informed the meeting that Huawei had contributed to Pakistan’s economy by providing 10,000 jobs and paying $120 million in taxes to the government from 2018 to 2020, besides spending $6 million to support disaster-relief efforts of the government.\nHe highlighted that his organization had contributed to Pakistan’s Information and Communication Technology (ICT) talent by providing 10,000 certifications in 2020.",
  "retrievedAt": "2025-08-11T20:41:31.646Z"
}
