{
  "title": "Railways plan to induct 80 High-Capacity freight Wagons this year",
  "link": "https://www.app.com.pk/national/railways-plan-to-induct-80-high-capacity-freight-wagons-this-year-2/",
  "date_published": "2024-12-29T10:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 29 (APP):Pakistan Railways has planned to induct around 80 new High-Capacity freight Wagons and 32 passenger AC standard coaches this year which would help increase the revenue of the department.\nThe department has also assembled 92 freight wagons in Mughalpura Workshops during the last three years to improve the department’s performance, generate income and ensure smooth goods forwarding service across the country, an official in the Ministry of Railways told APP.\n“Besides, 508 more freight wagons will be assembled at Mughalpura Workshops and Pakistan Locomotives Factory, Risalpur by next year,” he added.\nSimilarly, the official said that as many as 184 new passenger coaches would also be assembled at Pakistan Railways Carriage Factory, Islamabad during the next three years.\nAccordingly, he said raw material for assembling of 64 passenger coaches has been received by the department while the work would be initiated to meet the requirement soon.\nTo a question, he said during the fiscal year 2023-24, Pakistan Railways registered record earnings of Rs. 87.5 billion which was made possible through implementation of financial restructuring plans aimed at reducing operational costs, optimizing revenue generation and improving financial discipline.\nThe official said the passenger trains are being operated on the average with 19 coaches which has resulted in revenue of Rs. 43.512 billion (Rs. 7.763 billion over target).\nThe freight trains with a load of 3,400 tonnes has enhanced revenue freight earnings up to Rs. 25.025 billion (Rs. 2.699 billion over target), the official added.\nHe said the commercial management of 13 trains has been outsourced by Pakistan Railways for better efficiency and earning. Brake vans and luggage vans have been outsourced to optimize the utilization of available resources which has boosted the earning of Pakistan Railway.\nThe official said the electric connections of railway residential units have been handed over to respective DISCOs for direct billing to the consumers. Solar systems have been installed at selected sites to reduce utility bills.\nHe said Pakistan Railways has developed long-term strategic plans to revitalize the Rail sector, improve service quality, enhance safety standards and ensure sustainability in revenue generation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:08:16.741Z"
}
