{
  "title": "Aleem Khan lauds “Sobia Mahal” for preserving Islamic heritage",
  "link": "https://www.app.com.pk/national/aleem-khan-lauds-sobia-mahal-for-preserving-islamic-heritage/",
  "date_published": "2024-12-29T13:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 29 (APP):President Istehkam-e-Pakistan Party and Federal Minister for Privatization, Board of Investment, and Communications, Abdul Aleem Khan, on Sunday visited the private museum “Sobia Mahal” in Islamabad, where he lauded the collection of rare copies of the Holy Quran, Islamic calligraphy, and historical artifacts.\nDuring his visit, Aleem Khan, inspected the museum’s extensive collection of Indus Valley artifacts, historical pieces, and modern art. He praised renowned educationist and senior historian Zahid Pervaiz Butt for his personal efforts in curating this unique exhibition, which brings together various elements of Islamic civilization.\n“This center is an important achievement, uniting different objects related to Islamic history, and will help the new generation connect with their roots and history,” Aleem said. “This initiative is not only a national service but also a religious one.”\nFederal Minister also examined the samples of Islamic calligraphy and art housed at ‘Sobia Mahal’ and commended their preservation and quality. He emphasized the need for more Islamic centers across the country, stating that such centers could inspire the younger generation to develop both intellectual and religious inclinations.\nAleem Khan also praised the services of  Zahid Pervaiz Butt in promoting ‘Sobia Mahal.’ He expressed his pleasure in witnessing the Allah, Muhammad Gallery, describing it as ‘a specially blessed work.'”\nZahid Pervaiz Butt, Executive Director and Patron of “Sobia Mahal,” expressed his gratitude for the visit and acknowledged the Federal Minister’s appreciation. “This museum is a family legacy and a special effort passed down through three generations, ensuring that the people of Pakistan stay informed about their history and achievements,” Butt said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:07:52.034Z"
}
