{
  "title": "Pakistan too vulnerable to disastrous issue of water shortage amid depleting snags",
  "link": "https://www.app.com.pk/national/pakistan-too-vulnerable-to-disastrous-issue-of-water-shortage-amid-depleting-snags-2/",
  "date_published": "2023-10-01T10:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 01 (APP): Pakistan has become too vulnerable to the disastrous issue of water shortage due to tree loss resulting in declined rainfall as the Forest Department in the north of the country is rapidly removing snags under the garb of dead, infected and dried up trees.\nSenior biodiversity expert and Chairman Scientific Committee of the Islamabad Widlife Management Board, Prof. Dr. Z.B. Mirza told APP on Sunday that the Khyber-Pakhtunkhwa Forest Department was removing snags from the forests, under a false excuse of removing the diseased dead and dried up forest trees (3-Ds). The fact is that often the tallest trees, such as Silver Fir and Deodar in a forest are killed by lightning of storm clouds.\n“It is not understandable, how can one tallest single tree in a dense forest can suddenly die due to a disease? A dead tree is called a ‘Snag’ in language of forestry. As a snag stands for years and it rots very slowly by the microbes and insects. The dead tree loses its dense canopy of leaves and the dried branches remain. The sunlight reaches the ground. This gives the opportunity to the seeds of surrounding flora to germinate around it, covering the soil,” Prof Mirza said.\nMostly, the moist Temperate forests of the Himalayan slopes have snags. These stand along with live trees to protect the precious top soil of the forest from erosion.\nHeavy rainfall, even cloud burst, cannot erode the soil, for the simple reason that close-pack tree trunks, undergrowth of shrubs, bushes, herbs and densely growing long grasses do not let the rain water flow fast, at least at the floor of the forest to wash down the soil. Water may come down the slopes rushing and gushing, but it is above the slow-moving water close to the ground cover.\nWhy call forest topsoil, precious? Simply, because forests cannot grow again on eroded slopes of the mountains. Soil can be formed again, with the rubbing and crushing action of nature.\nIt may take thousands and millions of years to cover the rocks with soil. Try making a tea spoon full of soil by rubbing two stones and then imagine how much time nature might have taken to form billions and trillions of tons of soil on the rocky slopes of mountains.\nHe said topsoil covered with flora is fertile, because the dead leaves that form the covering layer, function as an insulating layer, that retains moisture. The moisture favours the growth of Microbes (bacteria and fungi).\nThe moist dead leaves below the dried upper insulating layer, get rotten by the soil microbes, which also need solar energy trapped in the biomass of dead leaves. This activity forms the compost for the trees.\nThe trees get the nutrients from the compost with the help of mycorrhiza or root fungi. The trees cannot live without the help of these microscopic creatures, and the microbes cannot live without decomposing the fallen leaves.\n“We all know that during timber harvesting, the roots of the trees are also removed as fuelwood. Uprooting loosens the forest’s fertile soil, which is eroded from the slopes of the mountains, during the first rainfall.\nWith that, the soil biodiversity is also lost. The soil biodiversity includes microbes, macroinvertebrates and vertebrates.\nNot only do these creatures create nutrients from the dead organic matter of the fallen leaves, but also their mobility increases the porosity of the soil. This enhances the rainwater absorption capacity of that soil.\nThe subsoil aquifers are replenished and the springs flow in the valleys, even in the dry season,” Dr Mirza said.\nWoodpeckers make holes in the snags to eat wood borers and to make nests. A snag has many such cavities, which are occupied by several cavity-nesting birds during breeding season.\nThese holes are also niches of invertebrates, small reptiles and small mammals. Under the wildlife protection Ordinances and Acts of the provinces, it is illegal to destroy the breeding places of wildlife.\nIn spring and early summer, the insect infestation of forests takes place. The larval stage of insects is harmful to the foliage of the forests.\nThe breeding season of the cavity-nesting birds coincides with insect infestation. Insectivorous birds and some grainivorous birds as well, feed their nestlings on insect larvae, which constitute a high protein diet for faster growth of the nestlings and fledglings.\nThe stress of the forest is reduced with the reduction of insect larvae, which are voracious eaters of soft leaves and buds of the forest flora, Therefore, the ecological role of the snags is vital for forest health.\nForests cause rain in the monsoon period. Thermal air currents rise along the southern slopes of the mountains.\nAs these air currents pass through the forest, evaporation from stomata under the leaves produce cool.\nThis cool air when it meets the warm and moist monsoon clouds, the phenomenon of rainfall starts.\nThe streams and tributary rivers of Indus flow. We grow food crops, fruits, vegetables, cotton, livestock, and poultry and our entire living system runs for our happy living. We should thank woodpeckers for making holes in the snags.\nThe snow lying in a mountain forest melts slowly for the sustainable supply of water to lower ecosystems. Its moisture is absorbed by the soil. There are many more eco-linkages, with many socio-economic benefits\nImagine the harm that our nation will suffer for this meager benefit from the sale of snags.",
  "retrievedAt": "2025-08-11T09:54:16.423Z"
}
