{
  "title": "COMSTECH organizes public lecture on ‘Game Changing Technologies’",
  "link": "https://www.app.com.pk/national/comstech-organizes-public-lecture-on-game-changing-technologies/",
  "date_published": "2024-01-19T12:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP):COMSTECH-the OIC Ministerial Standing Committee of Scientific and Technological Cooperation Friday organized a public lecture on game-changing technologies.\nThe lecture was delivered by Prof. Dr. Javaid Leghari, former Chairman Higher Education Commission, Senator, former Acting Coordinator General COMSTECH and President of the Forum for Dialogue and Diplomacy, Houston.\nSpeaking on the occasion, Prof. Leghari said that in the rapidly evolving landscape of innovation, we find ourselves on the cusp of a new era driven by groundbreaking technologies that have the potential to revolutionize every aspect of daily life.\nHe said that Artificial Intelligence, Virtual Reality, Metaverse, Quantum Computing, Robotics and automation, and drones are some of these game-changing technologies.\nProf. Leghari discussed the examples of the use of artificial intelligence, virtual reality, metaverse, robotics and automation.\nProf. Leghari said that in today’s world skills are becoming more important than degrees.\nHe informed that technology companies are not asking for degrees, they are looking for skills, and three, six or nine month’s skill development courses are more effective than a degree.\nHe suggested COMSTECH keep following these technological developments and take these technologies to the OIC member states for the better uplift of the socio-economic and science and technology development at a rapid speed.\nProf. Leghari informed that these technologies are changing the world at a very fast pace, and we have to focus, learn, and practice these game-changing technologies to keep up with the rapidly changing world.\nAdvisor COMSTECH on Media and Outreach, Mr. Murtaza Noor presented a souvenir to him on behalf of COMSTECH.\nThe lecture was attended by more than 50 participants from different backgrounds in person at the COMSTECH lecture room.\nProf. Dr. Javaid Laghari is a former Senator and Chairperson of the Higher Education Commission of Pakistan.\nHe has served as acting Coordinator General of COMSTECH, founding president of SZABIST, Professor of Electrical and Computer Engineering and Director of Space Power Institute at SUNY Buffalo, and Commissioner at the Ministry of Education, UAE. Currently, he is the President of the Forum for Dialogue and Diplomacy, Houston.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:44:57.602Z"
}
