{
  "title": "PNCA hosts grand opening of “Mashq-e-Ishq” calligraphy exhibition",
  "link": "https://www.app.com.pk/national/pnca-hosts-grand-opening-of-mashq-e-ishq-calligraphy-exhibition/",
  "date_published": "2024-01-19T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP):The Pakistan National Council of the Arts (PNCA) on Friday unveiled the grand opening of the captivating calligraphy exhibition, “Mashq-e-Ishq,” by the esteemed Lt. Gen. (R) Humayun Khan Bangash.\nThe event witnessed a diverse audience eager to explore the exquisite world of calligraphy by the seasoned artist, Director Public said while talking to APP.\nThe exhibition was inaugurated by Caretaker Minister for National Heritage and Culture Division Jamal Shah along with Director General PNCA M. Ayoub Jamali. The exhibition drew attention to the remarkable artistic journey of Gen. (R) Humayun Bangash.\nThe event highlighted the significance of “Mashq-e-Ishq” as a celebration of Gen. (retd) Bangash’s unparalleled contributions to the art of calligraphy.\nGen. (R) Bangash’s artistic trajectory, showcased in the exhibition, served as an inspiration, revealing that artistic expression knows no age constraints. Undiscovered until the age of 70, Gen. (R) Bangash emerged as a highly accomplished calligrapher in a remarkably short period, showcasing the synergy of discipline, creativity, and passion.\nThe Visual Arts Division team received commendation for their dedication in bringing this extraordinary exhibition to life. The event underscored Gen. (R) Bangash’s notable impact on the cultural landscape, duly acknowledged during the ceremony.\nIn his remarks, Minister for National Heritage and Culture Division Jamal Shah expressed heartfelt gratitude to Gen. (R) Humayun Khan Bangash for his remarkable artistry and significant contribution to the cultural landscape. The minister praised Gen. (R) Bangash’s creative brilliance and emphasized the enriching presence of the artist in the artistic community.\n“After assuming the charge of Federal Minister for National Heritage and Culture Division, I took the initiative to request PNCA to organize an exhibition featuring Gen. (R) Humayun Bangash’s beautiful calligraphic paintings. I express my heartfelt gratitude to Ayoub Jamali, the Director General of PNCA, and the artist for their collaboration, making this exhibition a reality,” said Jamal Shah.\nThe minister anticipates more surprises from Gen. (R) Humayun Bangash in the realm of creativity, emphasizing that art, as a serious and intimate engagement with life, knows no age limits. He hopes that “Mashq-e-Ishq” will stand as a testament to the diverse talents and unwavering support shaping the artistic landscape.\nThe exhibition will continue till January 28. The daily timings are 10 am to 4 pm and the gallery is closed on Saturdays.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:44:30.386Z"
}
