{
  "title": "ISSI welcomes Italian think-tank’s president",
  "link": "https://www.app.com.pk/national/issi-welcomes-italian-think-tanks-president/",
  "date_published": "2024-01-19T14:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP): The Centre for Strategic Perspectives (CSP) at the Institute of Strategic Studies Islamabad (ISSI) hosted a fruitful in-house session with President of the Centre for International Studies (CeSI), Italy, Andrea Margelleti.\nThe meeting brought together key representatives from both organizations, including ISSI Director General Ambassador Sohail Mahmood, the CSP director and research team, and members of the Italian mission in Pakistan.\nThe exchange of views covered key global and regional developments of mutual interest.\nThere was a particular focus on Pakistan-Italy relations, which both sides acknowledged as robust and enduring in nature.\nThey expressed gratification that the bilateral relationship was steadily expanding across a broad spectrum.\nIn the global and regional arena, the two sides discussed Ukraine and the security issues in Europe; developments in the Asia-Pacific; situation in the Middle East since October 7, 2023; regional stability in South Asia; post-August 2021 Afghanistan; and recent developments in West Asia.\n“These in-depth exchanges underscored the shared commitment of both institutions to actively promote and contribute to mutual understanding on issues related to global peace and stability. The dialogue reflected a shared recognition of the intricate interconnections between regional and international dynamics, underscoring the importance of cooperative efforts in fostering a more secure and harmonious global environment,” the press release said.\nThe session concluded with the signing of a Memorandum of Understanding (MoU) between the Institute of Strategic Studies Islamabad and the Centre for International Studies.\nAmbassador Sohail Mahmood, on behalf of ISSI, and Andrea Margelleti, representing CeSI, signed the MoU, reaffirming their commitment to deeper collaboration between the two think-tanks on various research initiatives and academic endeavors in the future.",
  "retrievedAt": "2025-08-10T23:44:21.606Z"
}
