{
  "title": "SAPM Sohrab meets with Qatar’s Minister of State for Interior Affairs",
  "link": "https://www.app.com.pk/national/sapm-sohrab-meets-with-qatars-minister-of-state-for-interior-affairs/",
  "date_published": "2024-01-19T07:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP):Special Assistant to Prime Minister on Overseas Pakistanis and Human Resource Development (SAPM) Jawad Sohrab Malik met on Friday with Qatar’s Minister of State for Interior Affairs, Sheikh Abdulaziz bin Faisal Al Thani and both Leaders reviewed cooperation in the security fields.\nA significant meeting was held between Jawad Sohrab Malik and Abdulaziz bin Faisal Al Thani, marking a momentous occasion for bilateral collaboration and economic development, said a press release.\nDuring the meeting, the SAPM congratulated the Minister of State Interior, Qatar on the successful hosting of the FIFA World Cup 2022. He emphasized the exemplary nature of the World Cup 2022 and its high standards, setting a benchmark for other countries to follow.\nThe SAPM highlighted the crucial role of the Pakistani diaspora in Qatar’s infrastructure development and expressed the intention to continue providing highly skilled and professional manpower to support Qatar’s economic modernization. To ensure the ongoing mobility of Pakistani workers to Qatar, the SAPM proposed the establishment of additional Qatar Visa Centers (QVCs) across Pakistan, particularly in Peshawar and Lahore in the initial phase. Additionally, the SAPM commended Qatar’s humanitarian efforts and commitments to the Gaza conflict, affirming Pakistan’s support for Qatar’s stance. He also extended an invitation for the Minister of State Interior to visit Pakistan.\nThe Minister of State for Interior, Qatar acknowledged the significant role of the Pakistani diaspora in Qatar’s development, emphasizing the shared values of Pakistanis and Qataris.\nHe highlighted the longstanding ties in trade, economy, and defence cooperation between the two countries. Regarding the QVCs, he mentioned that the proposal is under consideration, and a feasibility study is underway to determine the potential opening of additional QVCs in Pakistan. Moreover, topics of mutual interests and reviewed cooperation in security fields were discussed along with ways to support and develop them. During the meeting, the SAPM was accompanied by the Ambassador of Pakistan to Qatar and Community Welfare Attaches.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:45:37.015Z"
}
