{
  "title": "Pakistan, Iran should address each other’s security concerns: NSC",
  "link": "https://www.app.com.pk/national/national-security-committee-reviews-security-situation/",
  "date_published": "2024-01-19T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP):The National Security Committee (NSC) Friday observed that Iran was a neighbourly and brotherly Muslim country and existing multiple communication channels between the two countries should be mutually utilised to address each other’s security concerns in the larger interest of regional peace and stability.\nThe committee, which met with Caretaker Prime Minister Anwaar-ul-Haq Kakar in the chair to deliberate upon matters of national security, hoped that in line with the universal principles governing the conduct of good neighbourly relations, the two countries would mutually be able to overcome minor irritants through dialogue and diplomacy and pave the way to further deepen their historic relations.\nThe forum reviewed the overall security in view of the situation between Pakistan and Iran.\nIt undertook a wholesome review of the situation and lauded the professional, calibrated and proportionate response by the Armed Forces of Pakistan against unprovoked and unlawful violation of Pakistan’s sovereignty.\nDuring the meeting, participants were briefed about political and diplomatic developments bearing upon the prevailing situation between Pakistan and Iran, and its impact on the overall security milieu in the region.\nThe forum also took stock of the ‘Operation Marg Bar Sarmachar’, which was successfully executed against Pakistani origin Baloch terrorists residing on the ungoverned spaces inside Iran.\nAn update on the situation along the borders and necessary full preparations done to comprehensively respond to any further violation of national sovereignty was also deliberated about.\nThe forum reiterated the unflinching resolve that sovereignty and territorial integrity of Pakistan were absolutely inviolable and sacrosanct, and any attempt by anyone to breach it on any pretext would be responded with full might of the state.\nThe meeting reaffirmed that the security and safety of the people of Pakistan were  of paramount importance and no stone would be left unturned to ensure it.\nThe forum impressed upon Pakistan’s commitment to sovereignty and territorial integrity of all countries in accordance with the United Nations Charter and international norms.\nThe committee also reiterated the resolve to deal with the menace of terrorism, in all its forms and manifestations, with an iron hand.\nThe forum also highlighted that Pakistan had suffered far more than any other country due to the scourge of terrorism.\nThe meeting was attended by the caretaker ministers for Defence, Foreign Affairs, Finance and Information, Chairman of Joint Chiefs of Staff Committee, Chief of the Army Staff, Chief of Naval Staff and Chief of Air Staff as well as heads of intelligence agencies.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:44:18.633Z"
}
