{
  "title": "Railways Hospitals to be opened for general public",
  "link": "https://www.app.com.pk/national/railways-hospitals-to-be-opened-for-general-public/",
  "date_published": "2024-01-19T08:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP): Pakistan Railways has planned to open all its hospitals for the general public to provide state-of-the-art medical facilities to its employees and the general public across the country.\n“The decision to open all the hospitals of the department in January has been taken on the directions of Minister for Railways, Shahid Ashraf Tarar,” an official in the Ministry of Railways told APP.\nThe official said the minister has appreciated the management of Pakistan Railways for already opening the Cairns Hospital, Lahore for the general public within a stipulated time frame.\n“Pakistan Railways will take all possible measures to improve railway health sector services in which the expertise of private health experts will also be taken,” the official added.\nHe said that Pakistan Railways will not engage the public-private partners to upgrade and improve the services of hospitals.\nThe department directed the concerned officials to submit a business model shortly to earn revenue from Railway Hospitals.\nTo a question, he said Pakistan Railways has started the upgradation of five major railway stations across the country on modern lines to facilitate the passengers and help the department generate more revenue.\n“The purpose of upgrading the railway stations is to make them commercial hubs for business activities and facilitate the passengers,” he added.\nHe said the stations included Karachi, Lahore, Faisalabad, Peshawar and Quetta, while the department was taking other steps to improve the performance of Pakistan Railways and would provide maximum facilities to the masses.\nThe government has allocated Rs 50 million in the Public Sector Development Programme (PSDP), in the last three years for the up-gradation and renovation of railway stations across the country, he added.\nThe official said the renovation of the railway stations had been approved by the Central Development Working Party (CDWP) and the department had already upgraded six railway stations in different parts of the country.\nThe names of the upgraded railway stations were Bahawalpur, Raiwind, Narowal, Okara, Sahiwal and Gujranwala.\nThe basic aim of the upgrade was to facilitate the passengers and improve the outlook and modernize the railway stations.\nPakistan Railways had upgraded the passenger waiting halls, prayer area, operation offices, water filtration plant, toilets, passenger shelter, platforms, ticket counters, parking area and external development work.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:45:21.601Z"
}
