{
  "title": "Chairman PMIC expresses concerns of PM over delays in completion of PSDP",
  "link": "https://www.app.com.pk/national/chairman-pmic-expresses-concerns-of-pm-over-delays-in-completion-of-psdp/",
  "date_published": "2024-01-19T08:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP): Chairman of the Prime Minister’s Inspection Commission (PMIC), Brig. (Retd.) Muzaffar Ali Ranjha has taken cognizance of the concerns of the Prime Minister over the unwarranted delays in the completion of Public Sector Development Program (PSDP) projects.\nThe Chairman of PMIC, Brig. (Retd.) Muzaffar Ali Ranjha, expressed these views while chairing a meeting at the Prime Minister’s Inspection Commission, Prime Minister’s Office, Islamabad, said a news release.\nThe meeting was attended by PMIC Officer Engr. Aamir Hasan, Member, Muhammad Saleh Narejo, Director, and officers from the Ministry of Finance. Also present were representatives from all other concerned stakeholders, including the Ministry of Kashmir Affairs and Gilgit Baltistan, the Chief Engineer PWD Highways (South), and the Project Director of the Government of AJ&K, NESPAK, and FWO.\nAfter showing dissatisfaction over the implementation status the monitoring task has been given to Engr. Aamir Hasan, Member PMIC and former retired Federal Secretary for ensuring effective supervision of the project, currently under Monitoring, Evolution and Inspection at PMIC, said in a news release.\nThe representatives of the Ministry of Finance and all other concerned stakeholders Ministry of Kashmir Affairs and Gilgit Baltistan, the Chief Engineer PWD Highways (South) and the Project Director of the government of AJ&K, NESPAK and FWO briefed the Chairman on the latest progress of the project.\nThe Project Director of the Rathoua Haryam bridge briefed the issues about the design of the bridge, revision of PC-I and allocation of funds.\nAfter detailed deliberations with the representatives of the Ministry of Finance and all other concerned stakeholders Ministry of Kashmir Affairs and Gilgit Baltistan, Chief Engineer PWD Highways (South) and Project Director of Government of AJ&K, NESPAK and FWO; it was decided that FWO  immediately share the design of the bridge with the NESPAK for vetting and NESPAK after vetting the design of the bridge would submit their expert opinion on it to FWO before January, 25, accordingly the revision of PC-I will be processed at Ministry of Planning, Development and Special Initiatives for the approval of revision of PC-I.\nIt would facilitate the local people of AJ&K and will curtail the travelling distance between Mirpur and Islamgarh, Chaksawari, Dudyal, Kotli and Charhoi by 21 km and travelling time by 25 minutes.\nThe Chairman, PMIC has stressed for completion of the project in true letter and spirit. The progress report of the project will be submitted to the Prime Minister.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:45:20.749Z"
}
