{
  "title": "In “positive exchanges” Pak, Iran diplomats emphasise dialogue, brotherhood",
  "link": "https://www.app.com.pk/national/in-positive-exchanges-pak-iran-diplomats-emphasise-dialogue-brotherhood/",
  "date_published": "2024-01-19T05:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 19 (APP):The diplomats of Pakistan and Iran engaged in “some positive exchanges” emphasising positive dialogue and restoration of trust, hours after Pakistan carried out military strikes inside Iran to hit terrorists’ hideouts.\nIn a “highly complex” and “specifically targeted” precision military strikes, Pakistan on Thursday morning had hit the Pakistan-origin terrorists’ hideouts in Siestan-o-Baluchistan province of Iran, killing a number of them.\nPakistan’s action came a day after the Iranian side violated Pakistan’s airspace which was called a “blatant breach of Pakistan’s sovereignty” and the violation of the international law.\nThe developments prompted Caretaker Prime Minister Anwaar-ul-Haq Kakar and Interim Foreign Minister Jalil Abbas Jilani to cut short their respective foreign visits of Switzerland and Uganda, besides triggering reactions from the world.\nHowever, on Thursday night, the diplomats of both sides engaged in what Foreign Office spokesperson Mumtaz Zahra Baloch called “some positive exchanges” with both sides stressing for dialogue and restoration of trust.\nOn his X account, Iranian Deputy Foreign Minister Seyed Rasoul Mousavi shared the statement of the Iranian foreign ministry which said, “Iran adheres to the policy of good neighborliness and brotherhood between the two nations and the two governments of the Islamic Republic of Iran and Pakistan.”\nThe statement also read, “It does not allow enemies to strain the amicable and brotherly relations of Tehran and Islamabad… especially when the genocide and crimes of the Zionist regime are the foremost issues affecting the Islamic world.”\nIn his translated remarks, Mousavi called his ministry’s statement “the endpoint of the waves of tension between Iran and Pakistan.\n“Leaders and high officials of both countries know that only terrorists and enemies of both countries benefit from the existing tension between the two neighboring countries,” he wrote on his personal social media account.\nEchoing the Iranian foreign ministry’s statement, Mousavi said, “Today, the main problem of the Islamic world is to stop the Zionist crimes in Gaza.”\nFollowing this, Rahim Hayat Qureshi, Additional Foreign Secretary of Pakistan also took to the his personal account on the social media platform and responded by reciprocating the sentiments of “dear brother” Mousavi.\n“Pakistan and Iran have fraternal relations and shall move forward to resolve all issues through positive dialogue,” said Qureshi who had also served as Pakistan’s Ambassador in Iran and Permanent Representative to ECO.\nHe said it was important to restore the trust and confidence that has always defined the Pak-Iran bilateral relations.\n“Our common challenges including terrorism require coordinated action,” he commented.\nLater, Foreign Office spokesperson Mumtaz Zahra Baloch also commented on her personal X account calling the conversation “some positive exchanges.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:45:42.948Z"
}
