{
  "title": "FM for immediate steps to protect Palestinians against Israeli aggression",
  "link": "https://www.app.com.pk/national/fm-for-immediate-steps-to-protect-palestinians-against-israeli-aggression/",
  "date_published": "2021-05-16T10:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi on Sunday reaffirming Pakistan’s abiding support for the Palestinian people, called for immediate protection of Palestinians against Israeli aggression, implementation of United Nations resolutions, and an accountability of Israel’s crimes against humanity.\nAddressing the virtual open-ended emergency meeting of the Organization of Islamic Cooperation (OIC) executive committee to discuss Israel’s aggression against Palestine, the foreign minister stressed that all necessary steps must be taken for stopping the ongoing aggression against the Palestinian people and their properties.\nHe said the international community must protect the Palestinians against the blatant and illegal use of force and flagrant violations of human rights.\n“It should urgently intervene and take concerted actions to stop Israeli atrocities against civilian population in Gaza. The bombardment in Gaza must be stopped immediately,” he added.\nForeign minister Qureshi also underlined that implementing forthwith resolutions adopted by the UN Security Council, UN General Assembly and the UN Human Rights Council was both critical and urgent.\nIsrael’s crimes against humanity should not escape accountability, he said, adding, there should be no impunity for Israel’s violation of international law, including the Fourth Geneva and the other various human rights Conventions.\n“Attempts to create a false equivalence between Israel, the aggressor, and Palestinians, the victims, are inexcusable and as the collective voice of the Muslim Ummah the OIC should work in unity to dispel this deliberately deceptive perception,” he said.\nToday, at the Emergency Meeting of the @OIC_OCI I reiterated the following:Support for Palestinian cause defining principle of  foreign policy  Indiscriminate use of force by Israeli forces against defenceless Palestinians defies all international law. 1/4 pic.twitter.com/Z1TmegRtoI\n— Shah Mahmood Qureshi (@SMQureshiPTI) May 16, 2021\nAttempts to silence media and reporting, through tyranny, the foreign minister said, was evident from Israel’s horrifying air strike yesterday, bringing down a high rise building in Gaza that housed media outlets was unacceptable.\nThe foreign minister said Pakistan, was appalled by the sheer magnitude of illegal, disproportionate and indiscriminate use of force, tyranny and injustice being perpetrated by the Israeli occupation forces against defenseless Palestinians.\n“There are no words strong enough to condemn the systematic and barbaric crimes against the Palestinians. The deteriorating conditions in the Occupied Palestinian Territories due to the illegal practices of Israel, its colonial policies, and its continued aggression, siege and collective punishment, are sickening,” he added.\nQureshi said the indiscriminate use of force by Israeli forces against defenseless Palestinians was tantamount to grave violations of principles underpinned in international law, including international humanitarian and human rights law.\n“The latest spate of Israeli aggression cannot be justified or condoned,” he stressed.\nThere comes a time in the history of  nations when decisions taken are remembered by posterity and it is important to be on the right side of history. This is one such moment. We must not fail the Palestinian people at this critical juncture. 4/4 #PakistanForPalestine\nAt this somber juncture, the foreign minister said Pakistan  reaffirmed its unflinching solidarity with the government and people of Palestine – valiantly defending their legitimate rights.\n“We salute their courage in the face of unabated Israeli atrocities and preserving their Arab and Islamic identity,” he added.\nForeign minister Qureshi further said that Pakistan condemned in the strongest possible terms the continuing air strikes by Israel in Gaza that had resulted in deaths and injuries to so many innocent Palestinians.\nPakistan also condemned, in the strongest possible terms, he said, attacks on innocent worshippers in Al-Aqsa Mosque, violating the very sanctity of Qibla-e-Awal.\n“Death and destruction in the holy month of Ramzan; during Eid-ul-Fitr is unacceptable. Endless, senseless violence must end,” he said.\nThe foreign minister said the respect for sanctity of religious places was well-established in international law.\nIn this regard, Pakistan played a key role during its non-permanent term in the Security Council in 1968-69. In addition to adopting Pakistan-initiated resolutions 252 and 267, the Security Council also adopted resolution 271 (5 September 1969), also initiated by Pakistan, following the burning of Al-Aqsa Mosque on 5 August 1969.\n“We are also gravely concerned at the continuing expansion of Israeli settlements in the occupied territories and expulsion of Palestinians from their properties,” he maintained.\nThe foreign minister said the tragedy of forced evictions of Palestinians from the Shaikh Jarrah neighborhood of Al-Quds Al-Shareef was the latest manifestation of the systematic Israeli effort to change the demographic structure; historical and legal status; and Arab-Islamic and Christian character of Al-Quds Al-Shareef.\n“This is patently illegal, immoral and unacceptable,” he said.\nCreating false equivalence between Israel, the aggressor and Palestinians, the victims, is inexcusable. Attempts to silence media through tyranny, unacceptable. OIC owes genesis to Palestinian issue. Muslim Ummah must exhibit strong solidarity for people of , with action.\nThe foreign minister said the OIC owed its genesis to the Palestinian issue. In this hour of need, the Muslim Ummah must exhibit strong solidarity and support for their Palestinian brothers and sisters.\n“In the absence of such a solution, any notion of human dignity would remain tainted, regional peace elusive, and international security imperiled. We must not fail the Palestinian people at this critical juncture,” he stressed.\nAs a member of the Executive Committee and the next Chair of the Council of Foreign Ministers, Pakistan remained ready to join hands with other OIC Member States in any move to stop the ongoing bloodshed, and restore human dignity and human rights of the Palestinian people in the occupied territories, he said.\n“Let me conclude by reaffirming Pakistan’s abiding support for the Palestinian people in their just struggle to secure legitimate rights, particularly their inalienable right to self-determination. I also reiterate Pakistan’s support for a two-state solution in accordance with the relevant United Nations and OIC resolutions, with the pre-1967 borders, and Al-Quds Al-Shareef as the capital of a viable, independent and contiguous Palestinian State,” Foreign minister Qureshi said.\nThe foreign minister also thanked Prince Faisal bin Farhan Al-Saud for calling this important session of the OIC Executive Committee and OIC Secretary General and his team for making the necessary arrangements for the emergency session.\nHe said this timely interaction would help them in developing a strong and unified response to the Israeli aggression in the occupied Palestinian territories, especially Al-Quds Al-Shareef and Gaza.\nTragedy of forced evictions of Palestinians from Sheikh Jarrah neighborhood of Al-Quds Al-Shareef is latest manifestation of systematic Israeli effort to change demographic structure, historical & legal status & Arab-Islamic / Christian character of Al-Quds Al-Shareef. 2/4\nSupport for the Palestinian cause has been a defining principle of Pakistan’s foreign policy since our inception, he said, adding the founding father, Quaid-i-Azam Muhammad Ali Jinnah, was unrelenting in upholding the legitimate rights of the Palestinian people.\nIn the wake of the deteriorating conditions for the people of Palestine, Prime Minister Imran Khan had spoken with the Custodian of the Two Holy Mosques King Salman bin Abdulaziz, Turkish President Recip Tayyip Erdogan, and the President of Palestine Mahmoud Abbas, he added.\nHe said that he had also been in touch with my key regional counterparts, including brother Riyad Al-Maliki.",
  "retrievedAt": "2025-08-11T20:43:59.808Z"
}
