{
  "title": "Barrick Gold Corporation sets up primary school at Humai village",
  "link": "https://www.app.com.pk/national/barrick-gold-corporation-sets-up-primary-school-at-humai-village/",
  "date_published": "2023-03-18T10:08:00.000Z",
  "source": "APP",
  "content": "ISLAMAABAD, Mar 18 (APP): To provide free education to the children of local community and adjoining area, Barrick Gold Corporation set up a primary school at Humai village near Reko Diq on Saturday.\nThe school was set up under the company’s social investment program, said a press release received here.Speaking at the inauguration ceremony, Reko Diq Pakistan Country Manager, Ali E. Rind said that Barrick being a genuine partner to the host communities, was bringing real change and building stronger and more sustainable communities.\nHe hoped that the primary school at Humai would open doors to quality education and opportunities for local children.\n“Our focus on education will continue and the Humai Primary School is planned to be upgraded in phases. Additionally, the access to education in three nearby villages and Nokkundi are planned to start this year,” he said.Rind said these initiatives are in keeping with Barrick’s policy of educating local communities and preparing them for future employment in the mining industry. “We will continue to expand our educational initiatives in the rest of the Chagai district”, he added.\nOn the occasion, the local community leaders and district administration expressed their appreciation to Barrick for being responsive to community needs as the children of Humai village previously had no access to schools and formal education.\nA local community leader said, “We want to thank Barrick for making the school functional by refurbishing it, appointing a trained teacher and providing free books and uniforms to our children. We now have hope for a better future for our children.”\nBarrick’s social investment portfolio is guided by the Community Development Committees (CDC), which have local stakeholders and community leaders as key members. In line with this policy, the CDC for nearby villages of Humai Mashki Chah, Nok Chah and Durban Chah has been formed.\nNamed after a local mountain, “Par-e-Koh”, the CDC will determine the two-year development plan with priority projects focused on food security, local economic development and access to education, healthcare, and potable water, at its next meeting.\nThe new Reko Diq agreement ensures that benefits from the project start accruing to the people of Balochistan well before the mine goes into production through advance royalties and social development funds.\nReko Diq will be a multi-generational mine with a life of at least 40 years. During peak stage construction the project is expected to employ 7,500 people and once in production it willcreate 4,000 long-term jobs.\nBarrick’s policy of prioritizing local employment and suppliers will have a positive impact on the local economy.The company plans to complete the Reko Diq feasibility study update by 2024 and target of 2028 has been set for first production from the giant copper-gold mine in the country’s Balochistan province.",
  "retrievedAt": "2025-08-11T06:25:31.136Z"
}
