{
  "title": "PEMRA ‘prohibits’ coverage of rally, public gathering for today",
  "link": "https://www.app.com.pk/national/pemra-prohibits-coverage-of-rally-public-gathering-for-today/",
  "date_published": "2023-03-18T09:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP): The Pakistan Electronic Media Regulatory Authority (PEMRA) has “prohibited live/recorded coverage of any kind of rally, public gathering, procession by any party, organization and individual” for Saturday (March 18).\nThe ban has also been imposed on coverage of the rally or procession by any political party from the Judicial Complex, Islamabad, said a notification of PEMRA shared with the media.\nAccording to the notification, the “Competent Authority” imposed the ban while “exercising powers vested under Section 27(a) of the PEMRA Ordinance 2002 as amended by PEMRA (Amendment) Act 2007.”\nIn case of non-compliance, PEMRA said “license shall be suspended under Section 30 (3) of PEMRA Ordinance 2002 as amended by PEMRA (Amendment) Act 2007, without any show cause notice in the public interest along with other enabling provisions of law.”\nThe action to this effect was taken as the Law Enforcement Agency of Islamabad communicated its concern to PEMRA regarding airing of “live footages / images of violent mob, attacks on police and law enforcing agencies” by satellite TV channels.\nIt was noted that live telecast of such footages on different satellite TV channels created chaos and panic among the viewers and Police.\n“Airing of such content is in violation of judgment of the Hon’ble Supreme Court of Pakistan passed in Suo Moto Case No. 28 of 2018 reported as PLD 2019 Supreme Court1, Section 20 of PEMRA Ordinance, 2002 as amended by PEMRA (Amendment) Act 2007, Rule 15(1) of PEMRA Rules, 2009, Regulation 18 of PEMRA (Television Broadcast Station Operations) Regulations 2012, Clause 4 (10), 5, 17 & 24 of Electronic Media (Programmes and Advertisements) Code of Conduct 2015 read with Section 27 of PEMRA Ordinance, 2002 as amended by PEMRA (Amendment) Act 2007,” read the notification.",
  "retrievedAt": "2025-08-11T06:25:36.195Z"
}
