{
  "title": "PMD forecast rains across country from June 26 till July 01",
  "link": "https://www.app.com.pk/national/pmd-forecast-rains-across-country-from-june-26-till-july-01/",
  "date_published": "2024-06-25T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP):Pakistan Meteorological Department (PMD) has forecast rain across the country from June 26 till July 01 which may cause urban flooding in the vulnerable areas and disrupt daily routines.\nThe monsoon currents from Arabian sea and Bay of Bengal are likely to penetrate eastern parts of the country from June 26 and a low pressure was also lying over south of Indian Gujrat.\nRain wind/thundershower with isolated heavyfall/hailstorm is expected in Islamabad, Rawalpindi, Murree, Galliyat, Attock, Chakwal, Jhelum, Mandi Bahauddin, Gujrat, Gujranwala, Hafizabad, Wazirabad, Lahore, Sheikhupura, Sialkot, Narowal, Sahiwal, Jhang, Toba Tek Singh, Nankana Sahib, Chiniot, Faisalabad, Okara, Kasur, Khushab, Sargodha, Bhakkar and Mianwali from June 27 to July 01 with occasional gaps.\nIn Sindh, rain wind/thundershower with isolated heavyfall is expected in Mithi, Umarkot, Mirpur Khas, Sanghar, Tando Allahyar, Badin, Thatta, Karachi, Hyderabad, Jamshoro, Shaheed Benazirabad, Nausheroferoze, Khairpur, Dadu, Sukkur, Jacobabad, Kashmore and Larkana from June 26 to July 01 with occasional gaps.\nRain/thundershower is expected in Bahawalpur, Bahawalnagar, Dera Ghazi Khan, Multan, Khanewal, Lodhran, Muzaffargarh, Rajanpur, Rahimyar Khan and Layyah from June 26-30.\nIn Gilgit-Baltistan, rain wind/thunderstorm is expected in Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche, Shigar while in Kashmir, rain wind/thunderstorm is likely in Neelum valley, Muzaffarabad, Rawalakot, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, Mirpur from June 28 to July 01 with occasional gaps. Few heavy falls are also likely in Kashmir during the period.\nIn Khyber-Pakhtunkhwa, rain wind/thundershower with isolated heavyfall expected in Dir, Chitral, Swat, Kohistan, Malakand, Bajaur, Shangla, Battagram, Buner, Kohat, Bajaur, Mohmand, Khyber, Mansehra, Abbottabad, Haripur, Peshawar, Mardan, Hangu and Kurram from June 28 to July 01 with occasional gaps.\nIn Balochistan, rain wind/thundershower is expected in Lasbella, Khuzdar, Awaran, Jhal Magsi, Kalat, Naseerabad, Jaffarabad, Dera Bugti, Kohlu, Zhob and Barkhan from June 26-28.\nAbout the possible impacts, the PMD said that heavy rains may cause urban/flash flood in Islamabad, Rawalpindi, Lahore, Sialkot, Gujranwala, Narowal hilly areas of Kashmir from June 28-30.\nDuststorm/windstorm and lightning may affect daily routines, loose structures like electric poles, vehicles and solar panels etc during the period.\nThe PMD has advised all the concerned authorities to remain alert and take necessary measures to avoid any untoward situation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:28:08.000Z"
}
