{
  "title": "Empowered young girls can play key role in country’s development: Senator Ayesha Farooq",
  "link": "https://www.app.com.pk/national/empowered-young-girls-can-play-key-role-in-countrys-development-senator-ayesha-farooq/",
  "date_published": "2024-06-25T13:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP): The young girls can play a key role in development of the country if they are empowered, given proper guidance and confidence, said Chairperson National Commission on Rights of the Child Senator Ayesha Raza Farooq.\nShe was addressing as the chief guest to the opening ceremony of the Youth Forum organized by Pakistan Girl Guides Association National Headquarters from 25th to 28th June 2024. More than 50 Young Leaders from all regions of the country are participating. The theme of the Youth Forum is “Empowering Youth for Leadership and Governance, said a press release.\nSpeaking on the occasion, Senator Ayesha Raza Farooq appreciated the Pakistan Girl Guides Association for its efforts to empower young girls and said it is a unique program offered to Girls which helps them develop into confident and responsible citizens.\nShe also highlighted the role youth can play for the betterment of the country. She said that in a world that is constantly evolving, the skills and principles instilled through Girl Guiding are more important than ever. Guides’ ability to adapt, lead with empathy, and embrace diversity and inclusion are qualities that will serve girls not only today but throughout their lives.\nShe hoped that during the coming days of the Youth Forum, the participants would discover their potential and polish their leadership skills.\nShe informed the participants about the work of the National Commission on the Rights of the Child and looked forward to young leaders to becoming he supporters of Child Rights in their communities.\nEarlier, Mrs. Maria Maud Sabri, National Commissioner of the Pakistan Girl Guides Association welcomed them and other guests. She informed them about Guiding in Pakistan.\nShe briefed the guests that in Guiding we start working on our mission of leadership development as soon as a girl joins in. Each working group of 6-8 girls elects their leader. She said this is the first step in learning democracy and leadership. Leaders change regularly so that everyone gets a chance to lead, she said, adding that activities are selected by the girls themselves.\nThe entire program of Guiding aims to give skills and develop confidence to take initiative. The girls learn to take action to solve their problems and learn to love their community and country, she added.\nShe further said that the participant girls are encouraged to think about social issues and take steps, however small to tackle them. Guiding aims to make girls agents of change.\nAs girls become young women, the need to give them more responsibility in the Association emerges. It was with the idea of preparing future leaders of the Association that the Youth Forum was formed.\nHere we have young women, capable of shouldering responsibilities and eager to venture into adulthood. We would like them to assume the leadership of our movement. We hope that these girls will join the Association on various committees in their respective Chapters and learn to lead.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:27:42.150Z"
}
