{
  "title": "Balochistan govt values UN cooperation, need to further enhance mutual cooperation in all other sectors: CM Bugti",
  "link": "https://www.app.com.pk/national/balochistan-govt-values-un-cooperation-need-to-further-enhance-mutual-cooperation-in-all-other-sectors-cm-bugti/",
  "date_published": "2024-06-25T16:27:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jun 25 (APP): The Balochistan Chief Minister Mir Sarfraz Bugti while talking to the United Nations Resident and Humanitarian Coordinator in Pakistan, Mohamed Yahya, said that the provincial government values the UN cooperation and there is a need to further enhance mutual cooperation in all other sectors including education, health, agriculture and technical skills.\nThe UN Resident and Humanitarian Coordinator in Pakistan Mohamed Yahya, along with his team, called on Balochistan Chief Minister Mir Sarfraz Bugti here.\nSarfraz Bugti said that the climate change is the biggest challenge, despite the lack of action in the emission of green gases.\nThe Chief Minister said that training programs for teachers are being started to provide quality education. He said that the provision of technical education to the youth is one of the key priorities of the provincial government.\nHe said that the government has started a special program to provide technical education to the youth under the public private partnership PPP mode.\nThe Chief Minister said the government has increased the education budget by 300 percent along with a substantial increase in the health budget for the fiscal year 2024-25.\nThe Chief Minister said that merit and transparency would be ensured to establish good governance in the province.\nHe asked the United Nations to provide support to the provincial government in teachers’ training, water conservation and skill development program.\nSarfraz Bugti said that the area of Balochistan is very large and the development program of the United Nations is important in this regard.\nThe Chief Minister reiterated his commitment that better governance and planning would be ensured for smooth running of the affairs.\nUnited Nations Resident and Humanitarian Coordinator Mohamed Yahya while appreciating the vision of the Chief Minister said that the strong guidance of the provincial government is necessary for mutual cooperation.",
  "retrievedAt": "2025-08-11T03:26:57.660Z"
}
