{
  "title": "Rubina Khalid advocates for economic empowerment through imparting technical training skills",
  "link": "https://www.app.com.pk/national/rubina-khalid-advocates-for-economic-empowerment-through-imparting-technical-training-skills/",
  "date_published": "2024-06-25T15:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP): Chairperson Benazir Income Support Programme (BISP), Senator Rubina Khalid Tuesday emphasized the critical importance of economic empowerment as the foundation for all forms of empowerment.\nShe highlighted BISP ‘s initiative to provide technical skills to its beneficiaries, aiming to lift them out of poverty.\nSenator Rubina Khalid was speaking during a meeting with Amjad Zafar, Team Lead at the World Bank, and Gul Najam Jamy, held today at BISP headquarters.\nThe Chairperson BISP pointed out the global demand for human resource development, stressing the need to implement a Poverty Graduation Programme focused on women empowerment.\nShe noted BISP’s strong working relationship with the World Bank and underscored the necessity of further strengthening this collaboration.\nIn addition, Senator Rubina Khalid highlighted the importance of adopting a new payment mechanism with the support of the World Bank to ensure transparency.\nShe also emphasized the need to improve financial literacy among women beneficiaries. She reaffirmed the political leadership’s directive that every BISP beneficiary must receive their full stipend amount without any deductions, in a dignified manner.\nThe World Bank team assured their complete technical support in these initiatives and confirmed their availability for a follow-up meeting within the week to present their proposed payment model system for BISP beneficiaries.\nEarlier in the day, Vice Chairperson of Punjab Social Protection (PSP), Jahan Ara Watto, also met Senator Rubina Khalid. Ms. Jahan Ara Watto expressed her appreciation for the BISP database, which PSP has been utilizing for its education and health related projects. She highlighted the value of the BISP database in effectively reaching the targeted beneficiaries.\nRubina Khalid emphasized the importance of collaboration between BISP and Punjab Social Protection to ensure the welfare of the poor and to avoid duplication of efforts between federal and provincial government initiatives.",
  "retrievedAt": "2025-08-11T03:27:16.954Z"
}
