{
  "title": "Farrukh for transforming education system to build knowledge economy",
  "link": "https://www.app.com.pk/national/farrukh-for-transforming-education-system-to-build-knowledge-economy/",
  "date_published": "2021-10-29T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP):Minister for State for Information and Broadcasting Farrukh Habib on Friday underlined the need for transforming education system to set up knowledge economy by equipping students with latest skills to meet modern day needs.\nAddressing oath taking ceremony of Student Council at Beacon House System at Metropolitan Campus , he said human resources was the country’s most valuable asset as young people comprised 60 percent of total population of the country.\n“We have to transform our education system in such a way that it can meet the requirements of knowledge economy – enabling our students to play their role in progress of national economy even during their studies,” he said. He said human resource was not burden but valuable asset of the country. The country was providing easy loans to unemployed persons aged 18 to 45 years under Kamyab Jawan Programme with the aim to earn their livelihood on their own besides contributing to national economy, he added.\nThe minister said some 200,000 people were being imparted various technical trainings as the government wanted to create job opportunities extensively.Furthermore, the government was also creating conducive atmosphere for creating job opportunities for private sector, he added.\nThe IT exports will be $ 03 billion mark during the current financial year. While IT exports will touch $ 10 billion mark in next three to four years.\nHe said, the abilities of a girl or boy student studying in school, college or university, was further enhanced, if, he or she was entrusted additional responsibilities of student council’s head as once you start achieving your goals, your chances of moving forward increase.\nFor moving forward, the idol of fear and self must be broken, he added.  He urged the students to focus on creativity in educational institutions, go beyond the “copy-paste” system.\nThe minister said that the Skill for All program had been launched on the instructions of Prime Minister Imran Khan in which more than 100 courses including certification, high tech, block chain technology, cloud computing had been introduced to help the youth stand on their own feet.\nHe said the technical training of over 200,000 youths were continuing right now. From out of Rs 100 billion allocated to help the youth to make them self-sufficient in society, Rs 28 billion had been distributed which would have to be repaid in easy installments in 10 to 15 years, he added.\nThe program is proving very beneficial for youth who have idea but not money to materialize it.\n“Instead of taking jobs, we have to move towards a job-giving system. Young people can be earn their livelihood on their own if provided technical training, but they can also help creating a lot of job opportunities,” he said.He urged Beacon House School to devise a strategy in collaboration with private educational institutions to enable the new generation to get education as well as technical training.\nSpeaking on the occasion, CEO Nasir Kasuri congratulated the new Student Council, Beacon House School, adding that Beacon House School was moving towards a new learning management system.\nThe school had all the world class facilities for the students which were getting better with each passing day, he added.\nHe said that we had taken our students towards technology in a timely manner as per the requirements of modern times.\nBeacon House School, Chief Executive Officer (CEO) Nasir Kasuri, Cluster Director Safia Qasim, faculty members including headmistress, a large number of students were present.",
  "retrievedAt": "2025-08-11T21:32:15.514Z"
}
