{
  "title": "Punjab IGP told to review Crime Control Department encounters - Newspaper - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court (LHC) on Wednesday directed Punjab Inspector General of Police (IGP) Dr Usman Anwar to review the encounters being carried out by the newly-created Crime Control Department (CCD).\n\nEarlier, in compliance with the court’s order, the police chief appeared before LHC Chief Justice Aalia Neelum in connection with a woman’s petition against the killing of her son in an alleged CCD encounter.\n\nA report submitted by the IGP stated that the suspect was being taken away after a recovery, when the police vehicle’s tyre punctured and his accomplices launched an attack. It said the suspect was killed by the firing of his own accomplices.\n\nThe chief justice said the IGP was summoned after the SHO concerned failed to satisfy the court. She found the IGP’s report complete and satisfactory.\n\nHowever, the chief justice questioned, “Whenever there is firing on a police vehicle, how does the bullet directly hit a suspect? Why it never hits a constable or the police vehicle?”\n\nShe mentioned that the LHC was receiving 50 petitions daily regarding fake police encounters. She observed that the current wave of CCD encounters must be assessed.\n\nChief Justice Neelum directed the IGP to conduct a thorough review of the ongoing encounters. She instructed the police chief to sit with senior officers and ensure that such fake encounters were not repeated in the future.\n\nThe CJ disposed of the petition by Farhat Bibi.\n\nThe petitioner’s counsel had stated that his client’s two sons, Ghazanfar Aslam and Ansar Aslam, were arrested by Sharqpur police. He said that Ghazanfar was killed in a fake encounter on April 22 and there was a serious threat to the life of the petitioner’s other son.\n\nHe argued that ever since the CCD was established, all police encounters followed the same scripted pattern.\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:11:16.278Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926231",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T04:37:04.000Z"
}
