{
  "title": "India expulsions to Bangladesh unlawful, target Muslims: HRW - World - DAWN.COM",
  "author": null,
  "content": "India has pushed hundreds of ethnic Bengali-speaking Muslims into Bangladesh without due process, Human Rights Watch said on Thursday, accusing the government of flouting rules and fuelling bias on religious lines.\n\nThe Hindu nationalist government of Prime Minister Narendra Modi has long taken a hardline stance on immigration — particularly from Muslim-majority Bangladesh — with top authorities referring to them as “termites” and “infiltrators”.\n\nCritics also accuse the government of sparking fear among India’s estimated 200 million Muslims, especially among speakers of Bengali, which is widely spoken in both eastern India and Bangladesh.\n\nHRW, a New York-based nonprofit, said that India forcibly expelled more than 1,500 Muslim men, women, and children to Bangladesh between May 7 and June 15, quoting Bangladeshi authorities.\n\n“India’s ruling BJP (Bharatiya Janata Party) is fuelling discrimination by arbitrarily expelling Bengali Muslims from the country, including Indian citizens,” Elaine Pearson, Asia director at the nonprofit, said.\n\n“The Indian government is putting thousands of vulnerable people at risk in apparent pursuit of unauthorised immigrants, but their actions reflect broader discriminatory policies against Muslims.”\n\nNew Delhi insists that the people deported are undocumented migrants.\n\nHowever, claims by authorities that the expulsions were to manage illegal immigration were “unconvincing”, Pearson added, because of “their disregard for due process rights, domestic guarantees, and international human rights standards”.\n\nHRW said that it had sent the report’s findings and questions to the country’s home ministry but had received no response.\n\nThe report documented the experiences of 18 people.\n\nA 51-year-old daily wage worker told HRW that he “walked into Bangladesh like a dead body” after India’s Border Security Force (BSF) took him to the border after midnight.\n\n“I thought they (the BSF) would kill me because they were holding guns and no one from my family would know,” the report quotes the worker as saying.\n\nBangladesh, largely encircled by land by India, has seen relations with New Delhi turn icy since a mass uprising in 2024 toppled Dhaka’s government, an ally of India.\n\nIndia also ramped up operations against migrants in the wake of the attack in India-occupied Kashmir in April that killed 26 people, mainly Hindu tourists.\n\nNew Delhi, without evidence, accused Pakistan of supporting the attack, an allegation denied by Islamabad.\n\nIn an unprecedented countrywide security drive, Indian authorities detained thousands, with many of them being eventually pushed across the border to Bangladesh.\n\n“The government is undercutting India’s long history of providing refuge to the persecuted as it tries to generate political support,” Pearson said.\n\nIndia has also been accused of forcibly deporting Muslim Rohingya refugees from Myanmar, with navy ships dropping them off the coast of the war-torn nation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/24122245c9c2584.jpg",
  "retrievedAt": "2025-08-17T21:11:09.450Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926263/india-expulsions-to-bangladesh-unlawful-target-muslims-hrw",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T07:36:34.000Z"
}
