{
  "title": "PM Shehbaz lauds World Bank support for Pakistan’s ‘legitimate position’ on Indus Waters Treaty - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Thursday appreciated the World Bank’s (WB) support for Pakistan’s position in light of India’s suspension of the Indus Waters Treaty (IWT).\n\nIn April, India held the IWT in abeyance following the attack in occupied Kashmir’s Pahalgam that killed 26 — an incident New Delhi blamed on Islamabad without evidence. Pakistan termed any attempt to suspend its water share an “act of war”, noting that the IWT had no provision for unilateral suspension.\n\nIn a meeting with the WB’s regional vice president for the Middle East, North Africa, Afghanistan and Pakistan (MENAAP), Ousmane Dione, in Islamabad, the premier acknowledged the institution’s principled support for Pakistan’s legitimate position on India’s “unilateral and unlawful actions”, which undermined “important international agreements” such as the IWT.\n\nHe reaffirmed Pakistan’s commitment to upholding international law, achieving prosperity, maintaining regional peace and reiterated the country’s resolve to resolve all issues through dialogue.\n\nThe prime minister further thanked the WB for its timely and generous assistance during the devastating floods of 2022, which helped Pakistan initiate immediate relief efforts and begin reconstruction and rehabilitation activities.\n\nHe especially thanked World Bank President Ajay Banga and former country director for Pakistan Najy Benhassine for their pivotal role in advancing the new country partnership framework (CPF) for Pakistan.\n\nIn January, Pakistan became the first country to launch a longer-term CPF with the WB, after the bank’s board of directors approved the 10-year programme and pledged to provide $20 billion to Pakistan.\n\nAccording to a World Bank statement, the new framework for the country aimed to “support inclusive and sustainable development through a strong focus on building human capital”, in addition to fostering durable private sector growth.\n\nPM Shehbaz appreciated the strategic role of the CPF in supporting Pakistan’s development priorities, particularly in the areas of energy, human capital, climate change, and governance reforms.\n\nDione expressed gratitude to the premier for the warm hospitality extended during his visit to Pakistan.\n\nHe reaffirmed the WB’s commitment to deepening and expanding its longstanding partnership with Pakistan and enhancing collaboration in key sectors of the economy.\n\nDione appreciated Pakistan’s ongoing macroeconomic recovery and praised the prime minister’s government for steering the country toward financial stability and sustainable growth.\n\nHe particularly commended the current administration’s reform agenda, noting the premier’s strong leadership in advancing institutional reforms, restoring investor confidence, and promoting inclusive economic development.\n\nPM Shehbaz and Dione expressed a shared commitment to further strengthening cooperation in the coming years, to achieve long-term development goals and build a prosperous future for the people of Pakistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/2417175227f5ae1.png",
  "retrievedAt": "2025-08-17T21:10:19.795Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926316/pm-shehbaz-lauds-world-bank-support-for-pakistans-legitimate-position-on-indus-waters-treaty",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T14:21:04.000Z"
}
