{
  "title": "London mayor urges Britain to recognise Palestinian state - World - DAWN.COM",
  "author": null,
  "content": "LONDON: London Mayor Sadiq Khan has called on the UK government to immediately recognise Palestinian statehood, intensifying pressure on Prime Minister Keir Starmer as outrage mounts over the deepening humanitarian catastrophe in Gaza.\n\nIn a powerful statement posted on X, Khan described the situation as “absolutely harrowing”, saying: “Starving children searching hopelessly for food in the rubble. Family members shot dead by Israeli soldiers as they search for aid.\n\n“The international community — including our own government — must do far more to pressure the Israeli government to stop this horrific, senseless killing and let vital, life-saving aid in. Nothing justifies the actions of the Israeli government.\n\n“The UK must immediately recognise Palestinian statehood. There can be no two-state solution if there is no viable state to call Palestine.”\n\nKhan’s comments come amid growing internal pressure on the UK leadership. A number of senior cabinet members are reported to have urged Starmer to lead international efforts to recognise Palestine, as a means to pressure Israel and prevent further civilian suffering.\n\nSpeaking in Parliament, Health Secretary Wes Streeting echoed the sentiment, calling for recognition “while there’s still a state of Palestine left to recognise” and condemning Israeli actions that “go well beyond legitimate self-defence”.\n\nMore than 100 aid organisation, including Doctors Without Borders, Save the Children, and Oxfam have issued a joint statement warning that “mass starvation” is spreading in Gaza due to Israeli restrictions on aid delivery. “Our colleagues and those we serve are wasting away,” they said.\n\nThe UN has reported that over 1,000 Palestinians have been killed by Israeli forces while attempting to access food since the UN aid system was dismantled in May.\n\nForeign Secretary David Lammy described being “appalled, sickened” by scenes of starving civilians being shot and said the UK would “play its part” in achieving a two-state solution.\n\nSadiq Khan’s latest intervention is one of several recent moves where he has broken with Starmer’s leadership. The three-term mayor, believed unlikely to seek re-election, previously opposed controversial disability benefit changes backed by the Labour leader.\n\nHis statement was met with mixed reactions online, with many agreeing with his call to recognise Palestine and condemning war crimes and others criticising what they said was Khan’s failure to address how crime rate and cost of living crisis are affecting London.\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/688198a61de73.jpg",
  "retrievedAt": "2025-08-17T21:12:28.264Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926181/london-mayor-urges-britain-to-recognise-palestinian-state",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T02:22:05.000Z"
}
