{
  "title": "Australian women win right to sue Qatar Airways over forced strip searches - World - DAWN.COM",
  "author": null,
  "content": "Five Australian women who say they were pulled from a Qatar Airways flight by armed guards and strip-searched have won the right to sue the airline, after a court on Thursday overturned an earlier decision to throw out the case.\n\nWomen on 10 Qatar Airways flights, including 13 Australians, were subjected to invasive examinations to see if they had recently given birth after a newborn baby was found abandoned at Doha’s Hamad Airport in October 2020.\n\nThe incident made headlines around the world, sparked outrage in Australia and strained diplomatic ties with Qatar.\n\nA group of five women on a Sydney-bound flight launched legal proceedings in 2022 against Qatar Airways, the operator of Doha Airport Matar, and Qatar’s Civil Aviation Authority.\n\nThey brought claims under the Montreal Convention, which covers airline liability, as well as negligence, assault and false imprisonment.\n\nThe women sought damages for the impact on their mental health, including depression and post-traumatic stress disorder, stemming from the “unlawful physical contact”.\n\nAfter being escorted off their flight by armed Qatari authorities, some women claimed they were made to take off their underwear and subjected to non-consensual gynaecological inspections by a nurse in ambulances on the tarmac.\n\nFederal Court Justice John Halley dismissed the claims against Qatar Airways last year, finding they had no reasonable prospect of success, and that Qatar’s Civil Aviation Authority amounted to a foreign state immune from Australian law.\n\nOn Thursday, the full federal court overturned the ruling on Qatar Airways saying the issue was too complex to be dismissed summarily.\n\n“Whether or not the claims come within the scope of [the Montreal Convention] is a matter of some complexity,” the summary judgment said.\n\n“It is therefore not an issue apt to be decided at the stage of summary dismissal.”\n\nThe judgement allows the women to continue their lawsuit against Qatar Airways and Matar. Both companies were ordered to pay the costs of the appeal.\n\n“Our clients endured a traumatic experience on that night in Doha, and they deserve to have their day in court and compensation for their suffering,” said Damian Sturzaker, the lawyer from Marque Lawyers representing the women.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2021/11/6192035b49243.jpg",
  "retrievedAt": "2025-08-17T21:10:31.705Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926312/australian-women-win-right-to-sue-qatar-airways-over-forced-strip-searches",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T14:04:03.000Z"
}
