{
  "title": "Justice or spectacle? - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT was another reminder of how intractable Pakistan’s present political crisis remains. Two separate ATCs on Tuesday handed down wholesale convictions and lengthy jail sentences to several political leaders and party workers for delivering ‘provocative’ speeches, engaging in rioting, and acts of vandalism seen on May 9, 2023.\n\nInstead of providing closure, however, these verdicts will add more fuel to the ongoing political instability. Critics say the cases were prosecuted without believable testimony or tangible evidence tying the individuals to their crime, and will fall apart when taken to higher courts. This would be nothing new. Pakistan has a long and chequered history of political leaders being tried on serious charges like murder, treason, sedition and anti-state activities, only to be absolved by the passage of time. Politicians who have languished for years, even decades, in jail cells have later returned to lead governments and shape policy. Many are in the ruling coalition today.\n\nPolitical matters are rarely settled in courtrooms. More often, they are judged not by jurists but by ordinary people, who scrutinise not just the accused but also those who bring the accusations. This is why the May 9 cases should have been handled with more care. There was no need, for example, for cases involving political speeches and political violence to be sent to anti-terrorism courts. Prosecuting them under standard criminal laws would have sufficed.\n\nInstead, the state preferred the optics of treating political dissent as terrorism. It also decided that the trials would be held in camera, giving the public more reason to doubt their fairness. If it had ‘irrefutable evidence’ and ‘undeniable testimonies’ against the accused, as it claimed, it should have shared these with the public. Instead, justice was never ‘seen’ to be done because of how the trials were conducted, and suspicions will continue to linger regarding how these convictions were secured.\n\nFor two years, the suspects held in connection with various May 9 cases have remained in custody, repeatedly denied bail, awaiting the outcome of the cases against them. Even the verdicts delivered by the Lahore and Sargodha ATCs might have been further delayed had the Supreme Court not set a deadline for concluding all such cases. It can only be hoped that subsequent proceedings will be open to the public, allowing observers to form an independent opinion on them.\n\nMeanwhile, it appears that Pakistan has been dragged back into a political maelstrom from which it has been struggling to escape. Those at the helm must come to terms with the one lesson that has remained unchanged through the decades: they may silence their critics momentarily with court judgements, but it is the people who ultimately deliver political verdicts. The sooner they realise this, the better it will be for the country.\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/23075137e827809.jpg?r=075221",
  "retrievedAt": "2025-08-17T21:11:52.249Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926197",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T02:36:12.000Z"
}
