{
  "title": "UK sanctions target people smugglers, small boat dealer - World - DAWN.COM",
  "author": null,
  "content": "LONDON: The UK imposed sanctions on Wednesday on more than two dozen people, groups and suppliers from the Balkans, the Middle East and China accused of helping migrants cross the Channel.\n\nIn what it called a “landmark” first use of new powers, the move came as the government faces political pressure to stem migrant arrivals on small boats from northern France, at record levels.\n\nThe asset freezes and travel bans announced target individuals and entities “driving irregular migration to the UK”, and include four “gangs” and “gangland bosses” operating in the Balkans, the Foreign Office said.\n\nThey also hit a small boat supplier in China, so-called “hawala” money movers in the Middle East, and seven alleged people-smugglers linked to Iraq.\n\nUse of artificial intelligence planned to assess disputed ages of asylum seekers\n\nForeign Secretary David Lammy called it “a landmark moment in the government’s work to tackle organised immigration crime” impacting the UK.\n\n“From Europe to Asia we are taking the fight to the people-smugglers who enable irregular migration, targeting them wherever they are in the world,” he added.\n\n“My message to the gangs who callously risk vulnerable lives for profit is this: we know who you are, and we will work with our partners around the world to hold you to account.”\n\n‘Terrorising refugees’\n\nPrime Minister Keir Starmer took office a year ago promising to curb the journeys by “smashing the gangs” that facilitate the crossings, but he has struggled to deliver.\n\nNearly 24,000 migrants have made the perilous journey across the Channel so far in 2025, the highest ever tally at this point in a year.\n\nThe issue has become politically perilous in the UK, blamed for helping to fuel the rise of the far-right and violence at anti-migrant demonstrations.\n\nProtests have erupted sporadically outside hotels believed to house asylum-seekers, with a recent demonstration outside one in Epping, east of London, descending into clashes that injured eight police officers.\n\nRiots sparked by the stabbing to death of three young girls in northwestern Southport a year ago also saw suspected asylum-seeker hotels attacked and anti-migrant sentiment on display.\n\nAs part of its strategy to curb new arrivals, the government is also cracking down on illegal working, which European neighbours cite as a “pull factor” for UK-bound migrants.\n\nIt announced on Tuesday a new agreement with delivery firms Deliveroo, Just Eat and Uber Eats which includes sharing the locations of asylum hotels to help tackle illegal working.\n\nMeanwhile in another new tactic, artificial intelligence technology will be trialled to assess disputed ages of asylum-seekers who claim to be children, the interior ministry said on Tuesday.\n\n‘Far-fetched’\n\nWednesday’s designations represent the UK’s first use of its new “Global Irregular Migration Sanctions Regime”.\n\nIt claims the regime is a “world first”, empowering the Foreign Office to target foreign financiers and companies as well as individuals allegedly involved in facilitating people-smuggling to the UK.\n\nIn all, it sanctioned 20 individuals, four gangs — two Balkan groups and two of North African origin operating in the Balkans — and Chinese firm Weihai Yamar Outdoor Product Co.\n\nIt has advertised its small boats online “explicitly for the purpose of people-smuggling,” the Foreign Office said.\n\nAmong those facing curbs was Bledar Lala, described as an Albanian controlling “the ‘Belgium operations’ of an organised criminal group” involved in the crossings.\n\nThe UK also targeted Alen Basil, a former police translator it accused of now leading a large smuggling network in Serbia, “terrorising refugees, with the aid of corrupt policemen”.\n\nLondon hit alleged “gangland boss” Mohammed Tetwani with sanctions, noting he was dubbed the “King of Horgos” over his brutal running of a migrant camp in the Serbian town Horgos.\n\nAuthor and researcher Tom Keatinge, of the Royal United Services Institute (RUSI), said the sanctions were “a new front in the UK’s efforts to control a business model that brings profit to the enablers” and misery to victims.\n\n“However, I would caution against overpromising,” he said. “Talk of freezing assets and using sanctions to ‘smash the gangs’ seems far-fetched and remains to be seen.\n\n“History suggests that such assertions hold governments hostage to fortune.”\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/1217324638ab41c.jpg?r=173307",
  "retrievedAt": "2025-08-17T21:12:20.128Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926179/uk-sanctions-target-people-smugglers-small-boat-dealer",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T02:22:06.000Z"
}
