{
  "title": "PCB chief Naqvi hails positive ACC AGM, says Asia Cup fate to be announced soon - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan Cricket Board (PCB) Chairman and Asian Cricket Council (ACC) President Mohsin Naqvi on Thursday hailed the positive environment in which the council’s annual general meeting (AGM) was held and said the fate of the upcoming Asia Cup would be announced soon.\n\nThe meeting, hosted by the Bangladesh Cricket Board (BCB), comes ahead of the Asia Cup tournament, scheduled to be hosted by India in September. The tournament remains in limbo amid strained India-Pakistan ties following a military encounter in May.\n\nOn Wednesday, Hindustan Times reported that the Board of Control for Cricket in India (BCCI), reversing an earlier decision, would attend the Asian Cricket Council’s annual meeting virtually. The BCCI had previously declined to travel to Dhaka, citing tensions with Bangladesh and threatening to boycott the meeting.\n\nThe AGM was held in Dhaka today with 24 other members in attendance.\n\nAddressing the media after the meeting, Naqvi said: “The meeting went very well. We have 25 ACC members and all of them participated in this meeting”\n\nHe thanked all members who attended the meeting in person and those who attended it virtually. “We have all decided to work for cricket. None of us wants politics inside any of our organisations and it was a very good meeting in a very good atmosphere,” he added, expressing hope that such meetings would continue in the future as well.\n\nRegarding the upcoming Asia Cup’s schedule and its fate, he said: “That will be announced soon. We are in consultation with the BCCI and we will resolve [that matter] very soon.”\n\nQuestioned about India’s lack of participation in person, Naqvi downplayed the matter, saying: “Several countries were not able to come to Dhaka. It happens every time whenever you have meetings. I was not able to go to Singapore because I was stuck so this is a normal thing.”\n\nHe said that all members participated in the meeting. He reiterated that he was hopeful of the ACC and BCCI resolving their pending issues “and we will have the Asia Cup also”.\n\nA press release issued by the ACC said the meeting was with “100 per cent” attendance.\n\nIt said the meeting approved the comprehensive tournament calendar for 2025–2026, in line with the ACC’s sustained commitment to delivering structured development and high-quality cricketing opportunities across its member countries.\n\nIt also announced the inclusion of cricket in the upcoming Asian Games 2026 to be held in Japan, which would see the participation of 10 men’s and eight women’s teams from across the continent, to be chosen based on their rankings.\n\nThe organisation also welcomed three new nations, Mongolia, Uzbekistan and the Philippines, as members, “extending the reach of the sport into new and emerging cricket regions”.\n\nThe council and members also reaffirmed their support for the development and promotion of Asian cricket “whilst always putting cricket first”.\n\nThe meeting was adjourned with members “reiterating their joint commitment to a forward-looking vision; one that nurtures excellence, inclusion and broadens the game’s reach across the continent”.\n\nAddressing a reception hosted by the BCB earlier, Naqvi said in an apparent reference to the ongoing situation: “It’s not just that you’re here; it’s about a team, as we discussed, that we need to work as a team. We need to put aside all our political differences and work just for cricket.”\n\nThe PCB chairman added: “It is a family of cricketing nations, where we all need to support and strengthen each other. The most important thing is, whoever wins means we all will win; so, let’s get together and discuss how we can strengthen the ACC and how we can help our associate members.”\n\nHe stressed that he wanted all member teams to have stronger players to put up a stronger competition, paving the way for a stronger market for cricketing events in Asia.\n\n“As the president of ACC, I can assure you that we will do whatever is required to make this body the strongest body for Asian games,” he said, adding that it was important to expand cricket in other countries.\n\nWhether Pakistan visit India for the Asia Cup or a hybrid model will be followed — similar to the one adopted for the International Cricket Council events — is yet to be decided.\n\nHowever, considering that the BCCI and the PCB are not keen on playing on each other’s venues, particularly after the 2024 hybrid model, the UAE has emerged as a frontrunner to host the latest edition of the Asia Cup.\n\nLast night, the BCB also hosted a dinner for ACC delegations and the Pakistani team. The PCB chairman thanked the associate members of the council and BCB President Aminul Islam for his hospitality during his speech at the meeting.\n\n“He worked day and night to make this happen,” Naqvi said. “I am really looking forward to receiving him in Pakistan.”\n\nNaqvi also met Bangladesh’s Minister for Youth and Sports, Local Government and Rural Development Asif Mahmood for a friendly and forward-looking discussion.\n\nThe two leaders talked about working together to promote cricket, train umpires and create more opportunities for young people in both countries.\n\nThe talks resulted in a broad agreement to strengthen bilateral cooperation in sports, particularly cricket, and the development of umpiring and youth engagement programmes.\n\nThe two sides agreed to sign a formal memorandum of understanding between the PCB and the Bangladesh Cricket Board (BCB) to promote cricket and institutionalise training programmes.\n\nNaqvi invited Bangladeshi umpires to Pakistan for professional training, underscoring Pakistan’s willingness to share technical expertise and resources for regional sporting development.\n\nSpecial focus was placed on enhancing women’s cricket, with both ministers agreeing to develop joint initiatives aimed at nurturing female athletes across both countries.\n\nIn addition to sports, the agenda extended to youth skill-building, employment generation and educational cooperation. Discussions included scholarship opportunities, higher education exchange programmes, and experience-sharing in educational reforms.\n\nThe ministers also explored collaboration in renewable energy, particularly solar energy innovation, marking a growing interest in sustainable technology exchanges.\n\nNaqvi also introduced Pakistan’s secure identity infrastructure, highlighting the success and technological advancement of the National Database and Registration Authority.\n\nMahmood expressed a strong interest in Pakistan’s identity management systems and welcomed an invitation for a Bangladeshi delegation to visit Nadra. A high-level Bangladeshi delegation is expected to visit Pakistan in the near future to pursue this collaboration further.\n\nEmphasising the demographic parallels between the two nations, Naqvi stated that youth made up the majority of both populations. “By investing in sports, skills, and education, we can create lasting opportunities for our young people,” he said.\n\nThe meeting signalled a shared commitment to deepening multifaceted ties between Pakistan and Bangladesh, particularly in sports diplomacy and youth development.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/241843069f9f494.jpg",
  "retrievedAt": "2025-08-17T21:10:27.390Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926256/pcb-chief-naqvi-hails-positive-acc-agm-says-asia-cup-fate-to-be-announced-soon",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T12:27:25.000Z"
}
