{
  "title": "Pakistan, Afghanistan sign trade agreement - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan and Afghanistan on Wednesday signed an Early Harvest Programme (EHP) to reduce tariffs on eight agricultural items for one year, laying the foundation for a broader preferential trade agreement (PTA) between the two countries.\n\nThe EHP, which takes effect on Aug 1, will remain in force for one year and is renewable. It also allows for the future inclusion of additional items, making it the first tangible step towards launching negotiations on a comprehensive PTA.\n\nThe agreement was signed by Pakistan’s Commerce Secretary, Jawad Paul, and Afghanistan’s Deputy Minister of Industry and Commerce, Mullah Ahmadullah Zahid, who was accompanied by a delegation of senior technical officials. The Afghan delegation arrived in Islamabad on Monday night to hold detailed negotiations with Pakistan’s Ministry of Commerce.\n\nUnder the agreement, tariffs on four Afghan agricultural exports to Pakistan — grapes, pomegranates, apples, and tomatoes — and four Pakistani exports to Afghanistan — mangoes, kinnows, bananas, and potatoes — will be reduced to 27pc, down from over 60pc previously.\n\nA senior official at the Ministry of Commerce told Dawn the agreement will serve as a catalyst for reviving formal PTA negotiations, which had been dormant for nearly a decade. “We will now resume talks to discuss the details of the PTA,” the official added.\n\nIn 2014, both countries agreed to initiate PTA talks, and Pakistan subsequently shared a draft agreement. However, progress stalled when the Afghan side, under then-President Ashraf Ghani, linked further talks to allowing the import of Indian goods via the Wagah border — a proposal repeatedly rejected by Islamabad. As a result, negotiations remained suspended in the following years.\n\nIn the meantime, Pakistan has taken several steps to facilitate bilateral trade, including offering transactions in Pakistani rupees and allowing limited barter trade in the wake of Afghanistan’s banking crisis.\n\nOfficial data shows that Pakistan’s exports to Afghanistan surged 38.68pc to $773.89m in FY25, up from $558.03m in the previous fiscal year. Imports from Afghanistan more than doubled to $25.89m from $11.96m in FY24, an increase of 116.47pc.Pakistan’s key export to Afghanistan this year has been sugar, with over 700,000 tonnes shipped in the past four months alone.\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6881b5c592fb1.jpg",
  "retrievedAt": "2025-08-17T21:11:35.046Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926219/pakistan-afghanistan-sign-trade-agreement",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T04:25:00.000Z"
}
