{
  "title": "11 suspects sent on 2-day physical remand in Swat student death case - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Khwazakhela judicial magistrate on Thursday handed over 11 suspects to police custody on a two-day physical remand in relation to the death of a madressah student in Khyber Pakhtunkhwa’s Swat.\n\nA young student was allegedly beaten to death by his madressah teachers on Monday evening in Swat’s Chaliyar village. He was rushed to the nearest hospital by students and teachers, but doctors declared him dead upon arrival. Police announced the arrest of 11 individuals a day ago, including the administrator of the unregistered seminary, in connection with the brutal killing.\n\nThe police presented the 11 suspects before the Khwazakhela judicial magistrate today — the administrator of the madressah and another key individual.\n\nSwat District Police Officer (DPO) Omar Khan told Dawn.com that the police had formed special teams and a search operation was underway to apprehend the remaining two suspects.\n\n“We have some key leads to locate the main suspects and will reach them soon,” he said.\n\nMeanwhile, the provincial head of Wifaqul Madaris Al-Arabia, Maulana Hussain Ahmad, strongly condemned the brutal beating and killing of the student. He called the incident “a deeply tragic and painful event” for the entire community.\n\n“It is unfortunate that in the aftermath of this incident, a targeted propaganda campaign has been launched against Islamic seminaries, ignoring their decades of collective service to society,” Ahmad said at a press conference, where multiple other religious leaders and scholars expressed their condolences.\n\nA day earlier, authorities said that the madressah where the incident occurred had been sealed, adding that police detained all madressah staff, with nine more taken into custody. A case was registered on the police’s complaint under the Child Protection Act.\n\nUnder the Khyber Pakhtunkhwa Child Protection and Welfare Act 2010 and its 2018 regulations, corporal punishment is a punishable offence, violation of which can result in up to six months of imprisonment or a Rs50,000 fine, or both.\n\nIn May this year, the KP Private Schools Regulatory Authority, through a notification, strictly prohibited corporal punishment in all private schools across the province after receiving complaints.\n\nViolations, however, continue to prevail. According to a recent report by the KP Child Protection and Welfare Commission, children across the province were subjected to 33 different forms of abuses, including 14 incidents of corporal punishment.\n\nIn April, a seminary teacher in Kasur was arrested for allegedly beating a student with a hot iron for not memorising his lesson at Bangla Kambovan.\n\nSeparately, a cleric was arrested in the Swabi district for “torturing” a six-year-old child in a local mosque in Swabi’s Chota Lahor area, Deputy Superintendent of Police (DSP) Muhammad Noman said.\n\nHe said, “The cleric tortured the child for not remembering his lesson,” adding that a case was registered against the suspect under Section 44 of the KP Child Protection and Welfare Act, 2010.\n\nAccording to a first information report (FIR), seen by Dawn.com, the incident occurred a day ago at 6pm.\n\nAccording to a press release issued by the DPO office, the father of the child informed the police that his son was acquiring religious education at the Jamia Masjid in Meera Dhok, Mohalla, near Chota Lahor.\n\nThe father said his son went to the mosque as per his normal routine, but red marks were clearly visible on his son’s back and he was in pain when he returned home, adding that his teacher had beaten the child with a stick for being late.\n\nThe statement said a police team immediately reached the spot and arrested the suspect, registering a case against him.\n\nDSP Noman said that such incidents should be reported to the local police immediately and they were bound to take prompt and result-oriented steps.\n\n“The children of this society are the children of all of us,” he said in a press conference.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/23175339da02829.jpg?r=181345",
  "retrievedAt": "2025-08-17T21:10:12.032Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926318/11-suspects-sent-on-2-day-physical-remand-in-swat-student-death-case",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T18:14:38.000Z"
}
