{
  "title": "Pakistani passport still ranked among ‘weakest’ despite improvement - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: While the passports of other Asian countries have emerged as the most powerful in the world, Pakistan’s travel document continues to be ranked among the ‘weakest’ in the world, with visa-free access available to only 32 destinations.\n\nAccording to the Henley Passport Index for 2025, Pakistan currently ranks 96th on the list — ahead of the war-torn nations of Somalia, Yemen, Iraq, Syria and Afghanistan.\n\nAlthough still quite low, the country’s ranking has improved slightly; in 2024, the Pakistani passport was tied with Yemen as the fourth-worst in the world for the fourth consecutive year.\n\nThe Henley Passport Index compares the visa-free access of 199 different passports to 227 travel destinations, and ranks all the world’s passports based on the number of destinations their holders can enter without a prior visa.\n\nSingapore, Japan and South Korea top the list; Afghanistan placed at the bottom\n\nIf no visa is required, then that passport is given a score value of 1. The same applies if you can obtain a visa on arrival (VOA), a visitor’s permit, or an electronic travel authority (ETA) when entering the destination.\n\nWhere a visa is required, or where a passport holder has to obtain a government-approved electronic visa (e-Visa) before departure, a score with value of 0 is assigned. This also applies if you need pre-departure government approval for a visa on arrival.\n\nThe total score for each passport is equal to the number of destinations for which no visa is required.\n\nSingapore occupies the top spot, with Japan and South Korea sharing second place on the index. Seven EU passports share 3rd place — Denmark, Finland, France, Germany, Ireland, Italy, and Spain.\n\nAnother seven-nation Euro­pean cohort are joint 4th — Austria, Belgium, Luxembourg, Neth­erlands, Norway, Portugal, and Sweden. Meanwhile, New Zealand is tied for 5th place with Greece and Switzerland.\n\nThe UK and US have each dropped a place in the global passport rankings since January, continuing a long-term downward trend. Once the most powerful passports in the world — the UK in 2015 and the US in 2014 — they now rank 6th and 10th, respectively.\n\nIndia has recorded the largest jump in ranking over the past six months, climbing eight places from 85th to 77th. Meanwhile, Saudi Arabia has made the biggest gain in visa-free access.\n\nThe UAE continues to be a standout among the top risers, shooting up 34 places over the last 10 years from 42nd to 8th place, making it the only big riser to break into the Top 10 in the ranking.\n\nAnother notable country is China, also rising 34 places from 94th to 60th since 2015 — particularly impressive considering that it has not yet gained visa-free access to Europe’s Schengen Area.\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/07/242347336419235.jpg?r=234735",
  "retrievedAt": "2025-08-17T21:13:49.102Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926158/pakistani-passport-still-ranked-among-weakest-despite-improvement",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T02:10:05.000Z"
}
