{
  "title": "Israeli lawmakers pass symbolic motion on West Bank annexation - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: More than 70 Israeli lawmakers passed a motion on Wednesday urging the government to impose sovereignty over the West Bank, though the symbolic move does not affect the occupied Palestinian territory’s legal status.\n\nThe non-binding vote in Israel’s parliament, the Knesset, was backed by members of Prime Minister Benjamin Netanyahu’s right-wing coalition, as well as some opposition lawmakers.\n\nThey said that annexing the West Bank “will strengthen the state of Israel, its security and prevent any questioning of the fundamental right of the Jewish people to peace and security in their homeland”.\n\n“Sovereignty in Judea and Samaria” – the name Israel uses for the occupied West Bank, which it has occupied since 1967 – was “an integral part of the realisation of Zionism and the national vision of the Jewish people”, the text stated.\n\nIt passed by a vote of 71 to 13, with 36 other lawmakers absent.\n\nHussein al Sheikh, deputy to Palestinian Authority President Mahmud Abbas, said the motion was “a direct assault on the rights of the Palestinian people” that “undermines the prospects for peace, stability and the two-state solution”.\n\n“These unilateral Israeli actions blatantly violate international law and the ongoing international consensus regarding the status of the Palestinian territories, including the West Bank,” he wrote on X.\n\nSome 500,000 Israelis live in settlements in the occupied territory, which is home to around three million Palestinians.\n\nIsraeli settlement there is regularly condemned by the UN and is considered illegal under international law.\n\nTurkiye calls motion `illegitimate’\n\nTurkiye branded the Israeli parliament’s vote calling for the annexation of occupied West Bank an “illegitimate and provocative gesture aimed at undermining peace efforts”.\n\nPointing out that West Bank is a “Palestinian territory under Israeli occupation since 1967”, Turkiye’s foreign ministry said the bid was “null and void under international law and without any validity”.­\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/687d7a3b600a1.gif",
  "retrievedAt": "2025-08-17T21:12:09.706Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926178/israeli-lawmakers-pass-symbolic-motion-on-west-bank-annexation",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T02:22:06.000Z"
}
