{
  "title": "Masked agents detain Afghan who helped US military - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: An Afghan who moved to the United States after working for the US military in his home country was seized by armed, masked immigration agents, put in a van and taken out of state, attorneys and members of Congress said on Tuesday.\n\nIdentified only as Zia by members of Congress and his attorney out of concern for his safety and that of his family, the man had worked as an interpreter for the US military in Afghanistan.\n\nHe was in the United States legally and was arrested after an appointment in Connecticut related to his application for a green card under a programme to protect people who worked for US forces, according to human rights advocates, his attorney and members of Congress.\n\nSince starting his second term in January, Republican President Donald Trump has pursued a broad crackdown on immigration.\n\nZia was allowed temporary permission last year due to threat from Taliban, attorney says\n\n“What happened to him is the worst kind of abhorrent violation of basic decency,” Democratic Senator Richard Blumenthal of Connecticut told reporters on a call with advocates to draw attention to the case of Zia and at least two other Afghans who worked for the US and have been seized by Immigration and Customs Enforcement.\n\n“He actually worked and risked his life in Afghanistan to uphold the values and rights that are central to democracy,” Blumenthal said.\n\nBlumenthal and two other Democrats, representatives Jahana Hayes, who serves Zia’s constituency in Connecticut, and Bill Keating, who represents the Massachusetts city where Zia is being held, all pledged to fight for his release.\n\nAllegations, denied by attorney\n\nAsked for comment, the Department of Homeland Security said the Afghan national entered the US on Oct 8 last year and is under investigation for a “serious criminal allegation”.\n\n“All of his claims will be heard by a judge. Any Afghan who fears persecution is able to request relief.”\n\nZia’s attorney, Lauren Petersen, said he was approved for humanitarian parole last year due to a direct threat from Taliban rulers.\n\nShe said he has no criminal history and, when asked about DHS’s statement that he was under investigation for a “serious criminal allegation”, she said she had no understanding of what they were referring to.\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/17165324147d673.jpg?r=165649",
  "retrievedAt": "2025-08-17T21:12:17.244Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926180/masked-agents-detain-afghan-who-helped-us-military",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T02:22:06.000Z"
}
