{
  "title": "Arshad Nadeem focused on World Championships as post-surgery rehab mars upcoming competitions - Sport - DAWN.COM",
  "author": null,
  "content": "Javelin ace Arshad Nadeem could miss two upcoming Diamond League championships next month as he undergoes post-surgery rehabilitation in London, in the hopes of a full recovery ahead of the Tokyo World Athletic Championships this September.\n\nThe Olympic champion was set to travel to England this month to prepare for the World Championships, ahead of the Diamond League meet in Silesia, Poland on August 16 and Zurich, Switzerland on Aug 27-28.\n\nLast week, however, he underwent surgery on his calf muscle to address a recurring injury. The interventional procedure was done by Dr Ali Bajwa at Spire Hospital in Cambridge, United Kingdom.\n\n“We are now doing rehab work with a physiotherapist in London,” Arshad Nadeem’s coach, Salman Butt, told Dawn.com.\n\n“This is a two-week plan before we test ourselves for going back to regular workouts,” Butt added.\n\n“We are trying to achieve good form for the World Championship in Tokyo and maybe compete in one competition before Tokyo if Arshad regains good form by then.”\n\nIt was after his fifth-place finish at the Tokyo 2020 Olympics that Butt began coaching Arshad. A gold medal at the World Championships will complete his trifecta after he won gold at last year’s Paris Olympics and the 2022 Commonwealth Games in Birmingham.\n\nHe won a silver medal at the previous edition of the World Championships in Budapest in 2023, behind Indian rival Neeraj Chopra.\n\nIn an earlier conversation with Dawn.com, Butt had noted that the rehabilitation process would take about two weeks. Ahead of the surgery, he said that Arshad was pain-free and his team had adopted a quick remedy.\n\n“We contacted our doctor at Cambridge, got an appointment within three days, and had an MRI done,” Butt had said, adding that he was grateful for the expedited process. At the time, it was unclear whether Arshad would recover in time for the Diamond League championships in Poland and Switzerland.\n\nArshad made this year’s international debut in style when he won gold with an 86.40m throw at the Asian Athletics Championship in Gumi, South Korea, in May. A month later, he was named in Forbes’ 30 Under 30 Asia List for what they called a “stunning show” at the Olympics.\n\nDespite his mammoth successes, Arshad has maintained a relatively low profile at international meets compared to competitors like Julian Weber and Neeraj Chopra, particularly owing to injury.\n\nLast June, he pulled out of the Paavo Nurmi Games in Finland due to a mild calf muscle injury, but returned to competition in July at the Paris Diamond League ahead of the Olympics.\n\nThe Asian Athletics Championship in May is his first and only competition of the year so far. He has not competed at a Diamond League yet, putting him out of the league’s standings topped by Weber and Chopra with 15 points each.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/24161954ab76977.jpg",
  "retrievedAt": "2025-08-17T21:10:42.539Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926307/arshad-nadeem-focused-on-world-championships-as-post-surgery-rehab-mars-upcoming-competitions",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T11:15:54.000Z"
}
