{
  "title": "Public Accounts Committee sees bitterness in sugar sector - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Expresses alarm over mismanagement, loan defaults, widespread irregularities\n• Secretary claims production declined despite increase in cultivation area; no buffer stock exists\n• Minister warns mills, says hoarding won’t be tolerated; crackdown underway\n\nISLAMABAD: As a nationwide crackdown on sugar hoarders is underway, the Public Accounts Committee (PAC) has raised serious concerns over mismanagement in the sugar sector, loan defaults by mills, and large-scale irregularities involving public institutions.\n\nDuring its sitting on Wedn­esday, National Food Security Secretary Amir Mohyuddin revealed that although the area under sugarcane cultivation increased this year, overall production had declined compared to the previous year.\n\nOut of 82 registered sugar mills, only 79 participated in the crushing season, which typically begins in November. The secretary admitted that Pakistan currently has no buffer stock of sugar, and a summary has been sent to import 500,000 tons, of which 300,000 tons are already planned.\n\nCommittee members, particularly Riaz Fatyana and Junaid Akbar, criticised what they descr­ibed as a “massive sugar cartel” that manipulates supply and prices.\n\nMr Fatyana asked why 7.5 million metric tons of sugar were allowed to be exported, alleging it was done to artificially inflate local prices.\n\nHe also questioned the Federal Board of Revenue (FBR) for issuing a Statutory Regulatory Order (SRO) that reduced the sales tax on sugar imports. “This export was designed for profiteering,” he claimed.\n\nPAC Chairman Junaid Akbar Khan condemned the influence of sugar barons, stating, “These mill owners are part of every government. Why is the International Monetary Fund (IMF) silent on their profiteering?”\n\nHe questioned why tax exemptions were given to sugar importers while the general public was denied relief. FBR officials responded that the tax exemption was a cabinet decision and the board acted on official instructions.\n\nMNA Naveed Qamar argued that the government should refrain from intervening in the sugar market. “Every time the government steps in, things get worse. Bureaucracy cannot run markets,” he said, adding that two main cartels — sugar and fertiliser — continue to operate without oversight.\n\nMNA Shazia Marri demanded a report detailing how much subsidy was granted to sugar mills over the past five years and identifying the top beneficiaries. The committee also expressed dissatisfaction with the composition and transparency of the Sugar Advisory Board and directed the Ministry of Industries to attend the next meeting and clarify decisions related to sugar export and import, as the Ministry of Food Security claimed it had no access to that data.\n\nBut despite the government’s best efforts, the sugar crisis persists. In this backdrop, Minister for National Food Security and Research Rana Tanveer Hussain warned all sugar mills that are not releasing their existing stocks and hoarding them, will not be tolerated under any circumstances.\n\nIn a meeting with representatives of the Pakistan Sugar Mills Association (PSMA) and other key stakeholders, he directed provincial governments to ensure the timely lifting of sugar from mills and to facilitate its smooth transportation to markets.\n\nHe stated that a nationwide crackdown is currently underway against those disrupting the sugar supply chain. Expressing serious concern over the artificial increase in sugar prices, the minister warned of strict action against hoarders.\n\nMeanwhile, a press release from the Ministry of National Food Security noted that sugar prices have started to decline significantly—from Rs200 per kilogram to Rs175 per kilogram—as a result of the government’s crackdown.\n\nAmin Ahmed also contributed to this report\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:11:59.220Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926190/public-accounts-committee-sees-bitterness-in-sugar-sector",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T02:35:50.000Z"
}
