{
  "title": "At least 11 civilians killed as Thailand F-16 jet bombs Cambodian targets after border clash escalates - World - DAWN.COM",
  "author": null,
  "content": "Thailand scrambled an F-16 fighter jet to bomb targets in Cambodia on Thursday after artillery volleys from both sides killed at least 11 civilians, as border tension boiled over into rare armed conflict between the Southeast Asian countries.\n\nBoth blamed each other for starting a morning clash at a disputed area of the border, which quickly escalated from small arms fire to heavy shelling in at least six locations 209 kilometres apart along a frontier where sovereignty has been disputed for more than a century.\n\nThailand positioned six F-16 fighter jets in an uncommon combat deployment, one of which was mobilised to strike a Cambodian military target, among measures Cambodia’s foreign ministry called “reckless and brutal military aggression”.\n\nThailand’s military said the use of air power was to strike with precision.\n\nThe worst fighting between the countries in 13 years came after Thailand on Wednesday recalled its ambassador to Phnom Penh and expelled Cambodia’s envoy, in response to a second Thai soldier losing a limb to a landmine that Bangkok alleged had been laid recently by rival troops.\n\nThe two countries have been braced for conflict since the killing of a Cambodian soldier late in May during a brief skirmish, with troops reinforced on both sides of the border amid a full-blown diplomatic crisis that brought Thailand’s fragile coalition government to the brink of collapse.\n\nThailand said there were 12 fatalities in three Thai provinces, 11 of them civilians, including an eight-year-old boy. Authorities said 31 people were injured on Thursday. The number of Cambodian casualties was unclear.\n\n“We condemn this — using heavy weapons without a clear target, outside of conflict zones … the use of force and did not adhere to international law,” Thailand’s acting Prime Minister Phumtham Wechayachai told reporters.\n\n“We remain committed to peaceful means and there should be discussions, but what happened was a provocation and we had to defend ourselves.”\n\nThailand’s Health Minister Somsak Thepsuthin told reporters a hospital was hit by shelling in Surin province, an attack he said should be considered “a war crime”.\n\nCambodian government, defence and foreign ministry officials at a press conference gave no indication of fatalities sustained or any estimate of the number of people evacuated.\n\nIn a letter to Pakistan, the current president of the United Nations Security Council, Cambodia’s Prime Minister Hun Manet urged the body to convene a meeting to stop what he called “unprovoked and premeditated military aggression” by Thailand in violation of international law.\n\nAs clashes spread to different border areas, Thai villagers, including children and the elderly, fled to concrete shelters fortified with sandbags and car tires.\n\n“How many rounds have been fired? It’s countless,” an unidentified woman in Surin province told the Thai Public Broadcasting Service while hiding in the shelter as gunfire and explosions were heard in the background.\n\nVideo footage showed a plume of thick black smoke rising from a gas station in the neighbouring Sisaket province, as firefighters rushed to extinguish the blaze.\n\nThailand has evacuated more than 40,000 people from border areas, moving many to temporary shelters, where elderly people and small children gathered on floor mats as authorities prepared meals and unloaded food and bottled water from trucks.\n\n“I’m worried about my children,” said Suphap Wongwai, an evacuee in Surin province. “My children are scared and crying.”\n\nThailand and Cambodia have bickered for decades over jurisdiction of various undemarcated points along their 817km land border, with ownership of the ancient Hindu temples Ta Moan Thom and the 11th century Preah Vihear central to the disputes.\n\nPreah Vihear was awarded to Cambodia by the International Court of Justice (ICJ) in 1962 but tension escalated in 2008 after Cambodia attempted to list it as a Unesco World Heritage site.\n\nThat led to skirmishes over several years and at least a dozen deaths.\n\nCambodia in June said it had asked the ICJ to resolve its disputes with Thailand, which says it has never recognised the court’s jurisdiction and prefers a bilateral approach.\n\nThailand’s use of a fighter jet underlines its military advantage over Cambodia in terms of size and range of defence hardware.\n\nThe clashes have caused jitters in the region, with the Philippines and Vietnam calling for restraint and China expressing willingness to play a role in promoting de-escalation.\n\nMalaysian Prime Minister Anwar Ibrahim, the chair of the Association of Southeast Asian Nations, of which Thailand and Cambodia are members, said he would speak to leaders of both countries.\n\n“The least we can expect from them is to just stand down and hopefully to try and enter into negotiations,” Anwar said.\n\nThe clashes erupted hours after a downgrade in diplomatic relations between the two countries following a series of landmine injuries to Thai soldiers patrolling border areas.\n\nThailand accused Cambodia of placing the mines recently, which Phnom Penh dismissed as baseless.\n\nDe-mining groups estimate as many as 4-6 million landmines remain in Cambodia following years of civil war.\n\nThe clashes began early on Thursday near the disputed Ta Moan Thom temple along the eastern border between Cambodia and Thailand, around 360km from the Thai capital Bangkok.\n\n“Artillery shell fell on people’s homes,” Sutthirot Charoenthanasak, district chief of Kabcheing in Surin province, told Reuters, describing the firing by the Cambodian side.\n\n“Two people have died,” he said, adding that district authorities had evacuated 40,000 civilians from 86 villages near the border to safer locations.\n\nThailand’s military said Cambodia deployed a surveillance drone before sending troops with heavy weapons to an area near the temple.\n\nCambodian troops opened fire and two Thai soldiers were wounded, a Thai army spokesperson said, adding that Cambodia had used multiple weapons, including rocket launchers.\n\nA spokesperson for Cambodia’s defence ministry, however, said there had been an unprovoked incursion by Thai troops and Cambodian forces had responded in self-defence.\n\nThailand’s acting Prime Minister Phumtham Wechayachai said the situation was delicate. “We have to be careful,” he told reporters. “We will follow international law.”\n\nAn attempt by Thai premier Paetongtarn Shinawatra to resolve the recent tensions via a call with Cambodia’s influential former prime minister Hun Sen, the contents of which were leaked, kicked off a political storm in Thailand, leading to her suspension by a court.\n\nHun Sen said in a Facebook post that two Cambodian provinces had come under shelling from the Thai military.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/24122242ca3a3da.jpg",
  "retrievedAt": "2025-08-17T21:11:08.401Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926262/at-least-11-civilians-killed-as-thailand-f-16-jet-bombs-cambodian-targets-after-border-clash-escalates",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T07:31:08.000Z"
}
