{
  "title": "Suspects’ remand extended in Quetta ‘honour killings’ case - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: An anti-terrorism court in Quetta on Wednesday extended the physical remand of Sardar Sherbaz Satakzai and Bashir Ahmed for 10 more days in a case pertaining to the brutal killing of a man and a woman in the Dagari mines area of Quetta district, in the name of ‘honour’.\n\nBano Bibi Satakzai and Ehsan Samalani were killed on June 4 on the order of a local jirga, and a video of the incident went viral over the weekend. After their arrests, the court initially remanded the suspects in police custody for two days on Monday.\n\nAfter the expiry of the remand on Wednesday, they were produced before the ATC under strict security. The Serious Crimes Inves­ti­gation Wing Quetta officer requested an extension of the physical remand for further investigation for 15 days. However, the court ordered a 10-day extension in the remand.\n\nMeanwhile, Balochistan police chief Moazzam Jah Ansari told Dawn that 15 arrests had been made in the case. The police chief said efforts were underway to arrest the primary suspect, Jalal, the brother of the slain woman. He said several raids had been conducted and the police were using technology to make further arrests.\n\nPolice chief says 15 arrests made, efforts underway to nab prime suspect\n\nVideo message\n\nOn the other hand, a viral video — which could not be independently verified by Dawn — purportedly showed the mother of the slain woman holding the Holy Quran in her hands.\n\nThe woman, speaking in Brahvi, said she was the mother of the slain woman and claimed that the deceased had five children, ranging from 6 to 18 years old. She claimed that the victim eloped with her neighbour and she was killed in line with “Baloch traditions”.\n\nShe added that her husband forgave her after her return, but the man she ran off with allegedly threatened them and “did not stop”. Addressing Chief Minister Sarfraz Bugti, she asked why their homes were being raided by the police.\n\n“Whatever we did, we did in the name of honour. We have not committed any sin,” she said in her video message.\n\nEarlier this week, police arrested at least 14 suspects for their involvement in the killing of the man and a woman shot dead on the orders of a tribal jirga ahead of Eidul Azha.\n\nThe horrific video of the incident went viral on Sunday, prompting a countrywide outcry, and the Balochistan Assembly also passed a joint resolution against the killings.\n\nPublished in Dawn, July 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/688195c212807.jpg",
  "retrievedAt": "2025-08-17T21:13:37.163Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1926173/suspects-remand-extended-in-quetta-honour-killings-case",
  "dateList": "2025-07-24",
  "date_published": "2025-07-24T02:10:12.000Z"
}
