{
  "title": "President links women’s economic participation with enabling work environment",
  "link": "https://www.app.com.pk/national/president-links-womens-economic-participation-with-enabling-work-environment/",
  "date_published": "2024-01-02T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 2 (APP): President Dr Arif Alvi on Tuesday stressed improving the status of women by providing them with an enabling work environment to increase their economic participation.\nThe president highlighted that following the rights granted by the religion Islam, it was the responsibility of the society to give them their due share and create a safer society for them.\nHe expressed these views while chairing a meeting during his visit to the Federal Ombudsman Secretariat for Protection Against Harassment at Workplace (FOSPAH) Head Office, in Islamabad. Federal Ombudsperson for Protection Against Harassment at Workplace Fauzia Viqar, Secretary FOSPAH Arif Karim, advisers and officials of FOSPAH attended the meeting.\nPresident Alvi called for taking appropriate legislative measures at the federal and provincial levels to ensure the protection of women’s property rights, besides discouraging the transfer of property by women to their family members due to pressures.\nHe said that he was conducting personal hearings of the Ombudspersons’ cases to expedite the process of justice. He stated that highlighting important decisions of FOSPAH in harassment and women’s property cases through media would help increase awareness about the role of the Ombudsman.\nThe president said that police at the local level needed to improve their response to women’s complaints in property cases, adding that police officials should be educated about the provisions of the Enforcement of Women’s Property Rights Act, 2020.\nHe urged FOSPAH to further increase its outreach and efficiency to provide speedy justice to women in harassment and property cases at their doorsteps.\nHe also advised FOSPAH to enhance its linkages with NGOs and women’s rights organizations in Pakistan to seek suggestions for improving women’s status.\nThe president said that providing a harassment-free and enabling environment to women in both the public and private sectors was essential for their economic and social empowerment.\nHe underlined the need for increased engagements with the business community, particularly the chambers of commerce and industries, to provide employment to women as well as sensitize them about the importance and provisions of the Protection against Harassment at Workplace Act, 2010.\nThe president appreciated FOSPAH for its role in providing speedy justice to women, adding that women-led institutions like FOSPAH were critical in addressing the challenges being faced by women at workplaces as well as in acquiring their due property rights.\nFOSPAH chairperson Fauzia Viqar gave a detailed presentation about the role and achievements of FOSPAH in protecting women’s rights. She informed that FOSPAH was providing speedy justice in harassment at the workplace and property cases of women who had been deprived of their ownership rights.\nShe informed that 725 harassment cases were registered with FOSPAH, during 2023, out of which 517 cases had been decided. She said that an upsurge had been witnessed in the registration of harassment and women’s property cases with FOSPAH due to the awareness campaign about its role and functions.\nShe apprised the meeting that harassment of women and denial of property rights to women were pervasive issues in Pakistan.\nAppreciating the continued support of the President Dr Arif Alvi, she told the meeting that so far 208 representations against the decisions of FOSPAH had been filed with the President, out of which only 10 were under process with the office of the President while the rest had been decided.",
  "retrievedAt": "2025-08-10T23:19:41.696Z"
}
