{
  "title": "Health camps to be established in FDE schools to ensure children well-being",
  "link": "https://www.app.com.pk/national/health-camps-to-be-established-in-fde-schools-to-ensure-children-well-being/",
  "date_published": "2024-01-02T08:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 2 (APP):Ministry of Federal Education an Professional Training, in collaboration with the Ministry of Health is initiating comprehensive health camp for students within the institutions working under the ambit of the Federal Directorate of Education (FDE) to assess their health condition and ensure the well-being of the students.\nAccording to the official sources, Federal Directorate of Education (FDE), in that regard, has directed all the Director colleges and schools and the Area Education Officers Rural area, Islamabad to arrange health camp in the educational institutions.\nFDE, in this regard, requested to direct all Head of Institutions to compile the necessary data of their students to share with the teams of Health Camp upon their arrival in the concern institution and compile the date by 05-01-2024.\nMeanwhile, commenting the arranging of health these camps, Riffat Jabeen, Director Academics, Federal Directorate of Education (FDE) while talking to APP on Tuesday said that the aim of this activity is to ensure the health and well being of the students. She said that the camps will start wok in next two weeks.\nShe said that FDE has directed the heads of educational institutions specifically to encourage students to actively participate in  health camps without compromising routine academic activities. She further informed that the doctors team from all major public and private hospitals of federal capital will be hired for the check up of schools children.\nUnder this Program, the Ministry of Federal Education and Professional Training had already distributes ‘Hygiene Kits’ among students of government educational institutions within the ICT jurisdiction tp ensure their good health. Doctors are also engaged to guide students on health and hygiene issues” Riffat Jabeen added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:20:20.529Z"
}
