{
  "title": "Human trafficking menace insurmountable sans improved economic situation: Solangi",
  "link": "https://www.app.com.pk/national/human-trafficking-menace-insurmountable-sans-improved-economic-situation-solangi/",
  "date_published": "2024-01-02T09:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 02 (APP): Caretaker Minister for Information and Broadcasting and Parliamentary Affairs Murtaza Solangi on Tuesday said that the issue of human trafficking would remain an insurmountable menace unless the overall economic situation of the country was improved benefiting the downtrodden masses who risk their lives for pursuing better future abroad through illicit means.\nThe minister was responding to various queries raised by the Senators during the fourth meeting of the 334th Session of the Senate held here under a limited presence of the members of the Upper House.\nThe questions pertaining to the government measures and their outcomes to curb the human of human trafficking were put to the floor by Senator Kamran Murtaza of Jamiaat Ulema-i-Islam Pakistan (JUI-P), Senator Mushtaq Ahmed Khan of Jamaat-e-Islami Pakistan (JIP) and independent Senator Nuzhat Sadiq.\nSolangi noted that the Senators had raised important points, whereas the solution lied in the fact that the country had to fix its economy. He said that the state as per its capacity, was taking measures but the issue demanded a holistic and national approach towards it.\n“Unless the underlying issues are resolved, things will not improve. We are going into the election process, the senators, should pay attention to the basic issues; establish a plan and consensus on the economic direction of the country so that our children do not give their lives in different seas and deserts of the world,” Murtaza Solangi said.\nIn response to Senator Mushtaq’s question seeking response pertaining to human trafficking through land routes and involvement of the authorities linked to the border areas’ management, the minister said that the complaint of human trafficking was true to a certain extent, but the issue of corruption was not of today, it was the problem of the system.\nReferring to the Jinnah’s inaugural address at the creation of the State Bank of Pakistan, the federal minister said, “Quaid-e-Azam’s speech on August 11, 1947 also drew attention to this issue.” He also added that the awareness was being raised about human trafficking as the state and media organizations were also making their efforts in this regard.\nMurtaza Solangi emphasized that in order to end human trafficking, the nation needed to fix its economic situation.\nIn response to Senator Mushtaq’s question pertaining to encroachments made by Islamabad Club on the precious land of the federal capital, Murtaza Solangi said that the Building Control Section of the Capital Development Authority (CDA) wrote a letter to the management of the Islamabad Club on February 24, 2023 to end the encroachments. However, the Islamabad Club management had requested that there were problems in shifting due to arrival of high-level personalities, he added. Murtaza Solangi said the Islamabad Club management has assured that no mature structure is being established alongside its premises.\nHe requested the Chair to send this matter to the Standing Committee concerned, on which the Chairman Senate directed to send the matter to the relevant Standing Committee.\nIn response to the questions of Senators Bahramand Khan Tangi, Mushtaq Ahmed and Dinesh Kumar on dual nationality of Pakistanis and other issues, the minister for information said a list of countries with which dual citizenship arrangements were in place was provided to the House and its members. “The list of 21 countries is given in response to the question. After 2019, the children of Pakistanis born in Germany will get German citizenship as per the latter’s new immigration laws,” Murtaza Solangi added.\nSenator Mushtaq Ahmed in supplementary query, presented the proposal of a joint resolution of South African and Pakistani parliament to facilitate Pakistani overseas and boost trade ties between the two states and the continent. The minister said that Senator Mushtaq’s proposal would be presented to the Cabinet.\nReplying to the questions of Senators Mushtaq Ahmed, Bahramand Tangi and Dr Meher Taj Roghani, Solangi said that there were water problems in different areas of the federal capital. However, there is a water facility of the Capital Development Authority (CDA) in Tiramuri and Alipur Farash, whereas the groundwater had depleted Tarlai area, he said and added that there was no ICT scheme in Chatta Bakhtawar, whereas water supply in Chak Shehzad was managed by the CDA.\nThe Minister admitted that the water supply issues were existing in the federal capital along with the crisis of water table depletion in some areas whereas tubewell scheme was not possible in those areas. He said that water was limited in its volume like minerals which was ruthlessly wasted by the elites of the country whereas the poor were not involved in water wastage. The minister called for plan for water supply in the water scarce areas along with an awareness campaign on judicious water usage to protect the precious commodity.",
  "retrievedAt": "2025-08-10T23:19:49.199Z"
}
