{
  "title": "HEC announces Jan. 3 as last date to apply for Centralised Test",
  "link": "https://www.app.com.pk/national/hec-announces-jan-3-as-last-date-to-apply-for-centralised-test/",
  "date_published": "2024-01-02T08:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 2 (APP): The Higher Education Commission (HEC) has announced January 3 as the last date to apply for the Centralised Test for the graduates of Computer Science (CS) and Information Technology (IT) to get apprenticeships at the top IT companies in the country.\nAccording to the official sources, the test is being conducted by the Higher Education Commission (HEC) in collaboration with the Special Investment Facilitation Council (SIFC), Ministry of IT & Telecom (MoITT), Pakistan Software Export Board (PSEB), Pakistan IT Industry Association (P@SHA) and National Computing Education Accreditation Council (NCEAC).\nThe Centralized Test will be taken for the students of the 7th Semester of CS and related disciplines through the Virtual University Platform.\nThis is part of an academia-industry cooperation programme to facilitate the placement of talented IT students in the IT industry to acquire hands-on experience on the latest technologies for better job opportunities in local and international markets.\nAs per HEC, the last date for registration of the test is January 03, while the test will be held on 7th January.\nHowever, as per eligibility criteria for the test, the students who are currently enrolled in the 7th Semester of BS/BE Computing or related disciplines.\nThe student application submission is through this portal.\nThe students were asked that the focus areas of the test include Operating Systems, Software Engineering, Data Structures, Networking, Programming, Databases, Problem Solving/Analytics.\nAn HEC official urged the students to not miss this chance to bag an apprenticeship at the top IT companies in\nPakistan through the HEC Centralised Test for CS & IT Graduates.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:20:12.791Z"
}
