{
  "title": "The first lady for integrated efforts to ensure child protection",
  "link": "https://www.app.com.pk/national/the-first-lady-for-integrated-efforts-to-ensure-child-protection/",
  "date_published": "2024-01-02T10:36:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 02 (APP): The First Lady Samina Arif Alvi, Tuesday, stressed the need for effective implementation of Zainab Alert Act, an integrated single helpline, and close coordination among all the relevant organizations and stakeholders for speedy recovery of missing children.\nThe first lady, while chairing a meeting during visit of Roshni Helpline- a non governmental organization working for recovery of missing children- emphasized that a universal helpline for receiving public complaints and joint and coordinated efforts through a single plate farm would result into more effective and timely outcomes.\nThere were several organizations both in public as well as private sector working separately to provide relief to citizens and they have different helplines to receive grievances, she noted adding that however it might confuse the aggrieved citizens about who should be contacted with in a certain situation.\nBegum Alvi suggested that there should be a single and integrated helpline to receive the pubic complaints and calls for emergency assistance and all the organizations working in different domains should work under one umbrella so that citizens could access the helpline easily and the matter could be referred to the most relevant organization for prompt and effective action.\nFounder of Roshni Helpline Muhammad Ali and other board members briefed the First Lady about vision, performance and initiatives of the organization for protection of children particularly recovery of missing children.\nThey informed that Roshni Helpline has close coordination with ministry of Human Rights, Sindh Police, provincial child protection agencies, Pakistan Railways, Council of Islamic Ideology and many other government and non-governmental organizations.\nThey informed that Roshni Helpline served more than 20,000 families and assisted in the recovery of over 9000 missing children since its inception while several steps were taken to enhance the awareness and outreach.\nBegum Samina Arif Alvi appreciated Roshni Helpline for its endeavor and services for the recovery of missing children.\nLater, Roshni team presented a souvenir shield and its performance report to the First Lady.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:19:43.805Z"
}
