{
  "title": "No chance of election delay, says Solangi",
  "link": "https://www.app.com.pk/national/no-chance-of-election-delay-says-solangi/",
  "date_published": "2024-01-02T18:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 02 (APP): Caretaker Minister for Information and Broadcasting and Parliamentary Affairs Murtaza Solangi on Tuesday ruled out any chance of delay in the elections scheduled for February 8, 2024.\n“There is no possibility of postponing the elections, nor is there any challenge that will affect them,” the minister said while speaking in a talk show of a private television channel.\nExpressing confidence in the ability of law enforcement agencies to deal with any challenge, he reiterated that the general elections would be held in the country on February 8, 2024.\nHe said the caretaker government would provide all-out assistance to the Election Commission of Pakistan (ECP) to hold peaceful, transparent, and impartial elections in the country.\nThe minister rejected the notion that Prime Minister Anwaar-ul-Haq Kakar had made any controversial remarks during his recent media talk. Instead, he referred to those who supported terrorist organizations.\nTo another query, he said the protestors from Balochistan sat before the Islamabad Press Club on their own will, and no force was used against them.\nHe said the committee formed by the prime minister for negotiations held talks with them in a very conducive way. They had agreed to send the committee a list of its demands, but it was still awaited, the minister added.\nAll the women and children protestors were released on the very first day of negotiations, he said, adding that 163 more people were released after a day, and subsequently, the remaining 34 people were also freed.\nAt present, none of the protestors were in police custody, he stressed, adding that they should be asked why their demands were not sent to the committee.\n“There is no restriction on politics in the country since everyone has the right to do politics,” he said while categorically highlighting the constitutional role of the caretaker government.\nHe said some people wanted to use protestors for their political advantage. The demands of the protestors were long-standing, and all-out efforts would be made to address their issues, the minister said, explaining the positive approach of the caretaker government towards the issue.\nHe recalled that in 2021, the then-prime minister did not even visit the people of the Hazara community who protested in Quetta. To another query, he said security and ambulance facilities were being provided to the protestors.\nAs regards the elections, Solangi said everybody had the right to complain, but at the same time, there were appropriate platforms available for the purpose. Solangi urged the political parties to work together to curb the political division.\nHe also recalled the politics of the 1990s and the subsequent signing of a charter of democracy between the two major political parties.\nThe minister said all the political parties were being given due coverage on the state broadcasters. Guests in current affairs talk shows on Pakistan Television were invited from all across the political parties.\nHe said all possible security for the registered political parties, including Mualana Fazl ur Rehman, would be ensured.\nTo another query, he said the Pakistan Tehreek-e-Insaf (PTI) did not raise any objection when the returning officers were appointed from the administration in the 2018 elections.",
  "retrievedAt": "2025-08-10T23:20:10.074Z"
}
