{
  "title": "No one has impunity to spread violence; State to ensure law & order: PM Kakar",
  "link": "https://www.app.com.pk/national/no-one-has-impunity-to-spread-violence-state-to-ensure-law-order-pm-kakar/",
  "date_published": "2024-01-02T14:14:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 2 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Tuesday reiterated that the State would not allow anyone to unleash violence and kill people in the name of political, ethnic and religious divides as it was its responsibility to ensure law and order.\nThe prime minister, in a lengthy interaction with the students of the Beaconhouse National University, said that no one could be given a licence to kill and eliminate others on the basis of political, ethnic and religious differences.\n“To maintain law and order is the responsibility of the State, and I assure you that such elements will never prevail on the State of Pakistan,” he asserted.\nThe prime minister, elaborating his viewpoint while responding to a question, said that the one who reverted to fighting with the State and the countrymen would get the befitting response.\nHe said that the government would not allow terrorists and militants to kill people with impunity as they had openly declared fight against the State and the civilians in the country.\n“We have accepted their challenge,” he said and expressed the resolve to fully respond to all threats with full force.\nTo another query, he said that the government functioned primarily on revenue generation system. The country had a tax collection of over Rs 9,000 billion, but there was tax evasion of more than almost Rs 10,000 billion. The lack of effective revenue system had been a persistent problem which required effective steps to rectify.\nHe said that it was a consistent story with different past political set-ups and military dictators. For strengthening of economy, it was the first and foremost requirement to develop a robust tax system, he added, citing the Scandinavian countries with the highest tax revenue figures to their GDP (Gross Domestic Product).\nThe caretaker prime minister said that if the interim set-up in the country could achieve the tax target, then why not an elected government! If they were not able to achieve such, then there was a serious flaw in the governance system, he opined.\nHe also underlined the need of improvement in the structure of bureaucracy and the governance system.\nAbout a question related to Gaza, the caretaker prime minister said that Israel was displaying a force of brutality with impunity.\nPakistan had used the forum of Organization of Islamic Cooperation (OIC) and other international fora and engaging with the European, United States and diplomats of other countries by reminding them that if such a senseless behaviour on part of Israel continued, it would be radicalizing about 1.4 billion Muslims across the world, he added.\nHe reiterated that Pakistan was continuously insisting that someone should stop the war and create a humanitarian corridor. About 9,000 children had lost their lives in Gaza so far, he lamented.\nThe prime minister said that the world was speaking about an independent Palestine with pre-June 1967 borders and with Al Quds Al Shareef as its capital.\nHe reaffirmed that Pakistan was genuinely committed with the Palestine cause and utilizing all the diplomatic circles to convey its message.\nResponding to another question regarding the protest of Baloch families in Islamabad, he said holding protests and demonstrations within the limits of laws throughout the world was a basic right but when those parameters were violated then laws were enforced by the governments.\nHe said that the use of a water cannon against the Baloch protestors was much criticized though he could cite about 200 incidents of its use in the European countries against protestors.\nThe caretaker prime minister said that the law enforcement forces retaliated when they were pelted upon with stones. All the arrested people had been released subsequently, he added.\nHe further maintained that the women were agitating before the National Press Club, Islamabad which was their right, adding they were giving media interviews and enjoyed freedom of expression.\n“What the government has done wrong! The government enforces law as it has to be enforced whether anyone like it or not,” he added.\nThe prime minister agreed to a student’s remarks that there were serious concerns over the judicial system in the country which required to be addressed.\nHe also stressed upon change in behaviour and equal application of laws on all.\nIn a veiled reference to the political history, he said that institutions were used and admired for personal benefits.\nCaretaker Prime Minister Kakar, replying to a query, said that youngsters should explore opportunities abroad as such trends should not be considered as brain drain.\n“They are the assets for the country and the people should understand the cycle as it is not a negative tendency,” he said, adding such trends were seen throughout the world.\nHe also agreed that there was a lack of good rules and regulations in the medial education. To address the mental health issue, the caretaker government could not go for legislation, but it could only draft its recommendations for the upcoming government, he added.\nThe caretaker prime minister said that in Pakistan, democracy was in the transitional phase as it was not a settled one. Non democratic forces often took advantage of non-performance of the democratic system, he added.\nHe regretted that the principles of democracy were violated by those who did not consider them in their advantage, adding that certain issues required a thorough debate and advised the youth to be genuine and try to find out genuine solutions to the country’s issues.\nThe prime minister said that non-state actors and terrorists had been killing people in Balochistan. The State had the every right to respond to violence, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:19:46.433Z"
}
