{
  "title": "Exports surge, trade deficit narrows significantly in December 2023:Dr. Gohar Ejaz",
  "link": "https://www.app.com.pk/national/exports-surge-trade-deficit-narrows-significantly-in-december-2023dr-gohar-ejaz/",
  "date_published": "2024-01-02T16:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 2 (APP): Caretaker Federal Minister of Commerce Dr Gohar Ejaz on Tuesday said that exports in December 2023 increased by 22.2% to USD 2.812 billion from USD 2.301 billion in December 2022.\nHe said that the increase is 9.3% with USD 2.573 billion exports in November 2023, said a press release issued here.\nEjaz also said that the positive trend extends to imports as well which decreased by 12.25% in December 2023 to USD 4.514 billion compared to USD 5.144 billion in December 2022.\nLooking at the broader picture, the exports in Jul-Dec 2023 witnessed continued export growth and increased by 5.2% to USD 14.981 billion from USD 14.244 billion during the same period in the preceding year, he said.\nThe minister said that notably, imports during this period saw a significant 16.28% reduction compared to the same period in 2022, falling from USD 31.209 billion to a much lower USD 26.129 billion.\nThese developments translate to a substantial narrowing of the trade deficit, he added.\nHe said in December 2023 alone, the deficit shrank by a significant 40% to USD 1.7 billion, representing a decrease of USD 1.141 billion compared to the previous year.\nEjaz said the Jul-Dec 2023 period saw an even more impressive trend, with the trade deficit shrinking by 34% to USD 11.148 billion, down from USD 16.965 billion in the same period last year (a decrease of $5.817 billion).\nCommenting on these achievements, Dr. Gohar Ejaz expressed optimism, stating, “This is the record growth in past four months. When the caretaker government took over, the last month’s exports were USD 2.07 billion.\nHe said these now stand at USD 2.81 billion. Pakistan’s exports have recovered and are on a clear upward trajectory, reaching an impressive USD 2.8 billion in December 2023.”\n“We will reach our targeted capacity of USD 3 billion per month soon. Our ultimate goal remains to achieve export-led growth to the tune of USD 8 billion per month, a target that we will pursue through the implementation of the new Industry Policy under the SIFC framework.”\n“The Ministry of Commerce remains committed to further strengthening Pakistan’s export potential and creating a conducive environment for sustainable economic growth.\nThese positive developments are a testament to the government’s ongoing efforts and the resilience of Pakistani businesses” said Dr. Gohar Ejaz.",
  "retrievedAt": "2025-08-10T23:19:10.544Z"
}
