{
  "title": "Fawad for focusing on digital media to present Pakistan’s narrative effectively",
  "link": "https://www.app.com.pk/national/fawad-for-focusing-on-digital-media-to-present-pakistans-narrative-effectively/",
  "date_published": "2021-08-10T06:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain has stressed the need for focusing on digital media to present Pakistan’s narrative at the international level more effectively.\nAddressing the participants of National Media Workshop of National Defense\nUniversity, he said that the media landscape has widened considerably during past a few years.\nوفاقی وزیر اطلاعات چوہدری فواد حسین کا نیشنل ڈیفنس یونیورسٹی کی نیشنل میڈیا ورکشاپ کے شرکاءسے خطابمیڈیا کا منظر نامہ کافی حد تک وسعت اختیار کر چکا ہےآج ڈیجیٹل میڈیا ایڈورٹائزمنٹ 25 ارب روپے تک پہنچ گئی ہے@fawadchaudhry pic.twitter.com/f5egwV6afS\n— Fawad Chaudhry (Updates) (@FawadPTIUpdates) August 10, 2021\n“Today, digital media advertising has reached Rs25 billion”, the minister said, adding that the Facebook and Google were doing Rs7.5 billion advertising business from Pakistan every year as advertising trends are changing.\nTechnology intrusion in media has resulted loss of job in some areas and creation of some new jobs.\n“In the past, wars were fought on the strength of force, now the wars are fought on the basis narratives to mould public opinion”, he remarked.\n“We sacrificed 70,000 lives in the war on terror, but no book has been written on it till date to highlight Pakistan’s sacrifices”, the minister lamented.\nThe minister said that unfortunately 1960s curriculum was being taught in 42 journalism schools in the country while people abroad have PhDs in lights and sound.\nHe said that Media Technology University was being set up for development of media, which would provide education in various fields of media including animation, visual effects, film making, camera work etc.\nHe said that 1500 internships would be given in media to the new generation.\nHe said that PTV News has been shifted to High Definition format and Radio Pakistan broadcasts have been transferred to Internet.\nDigital cable policy for cable operators has been approved and cable operators will be given loans under the Kamyab Jawan Programme provision of digital cable to customers.",
  "retrievedAt": "2025-08-11T21:04:06.825Z"
}
