{
  "title": "National Minority Day on Wednesday",
  "link": "https://www.app.com.pk/national/national-minority-day-on-wednesday/",
  "date_published": "2021-08-10T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP):The National Minority Day would be celebrated on Wednesday as the state aspires to commemorate the contribution of minorities in the progress of Pakistan besides upholding rights, recognizing services, sacrifices of minorities in the creation of Pakistan, and nation-building.\nThe day recalls the vision of Quaid-e-Azam Mohammad Ali Jinnah with reference to his speech to the legislature on Aug 11, 1947, days before Pakistan separated from India, in which he pledged to protect the rights of non-Muslims in the newly created country.\n“You are free; you are free to go to your temples, you are free to go to your mosques or to any other place of worship in this state of Pakistan. You may belong to any religion or caste or creed that has nothing to do with the business of the state”, Quaid-e-Azam had espoused in his speech.\nQuaid-e-Azam’s choice of Mandal, as the first law minister, and in his cabinet suggested that the country would not be run by the theocratic.\nTo assert this commitment, the Government of Pakistan declared August 11, as National Minority Day in 2009.\nThe day is observed to reaffirm the commitment that despite belonging to different faiths we are one nation that continues to march for a united and prosperous Pakistan.\nEvents, seminars, and social gatherings are arranged across the country on the day by members of various religious minorities.\nThe day was dedicated to the minorities, who played their constructive role in the Pakistan movement. The commendable services of religious minorities, along with their Muslim brothers, are a glorious chapter in the history of the independence movement of Pakistan.\nPakistan was the first country in the world to reassure its minorities about their future rights by specifically allocating a portion of the national flag – the white color which traditionally represents purity and innocence – and which the minorities have kept so, over many decades. They have not allowed it to be polluted or defiled by blood, or any other stain.\nThe religious minorities have given a considerable contribution in different fields of society including health, education, defense, and social welfare.\nThe nation is committed to following the vision of Quaid-e-Azam Muhammad Ali Jinnah for an enlightened, liberal, progressive, and tolerant Pakistan.",
  "retrievedAt": "2025-08-11T21:04:05.473Z"
}
