{
  "title": "Atta Tarar stresses imparting religious education on modern lines",
  "author": null,
  "content": "LAHORE, Feb 16 (APP):Federal Minister for Information and Broadcasting Attaullah Tarar has said that it is a need of the hour to impart religious education on modern lines.\nSpeaking at the annual convocation of Al-Hikmah International education centre on Sunday, he highlighted the importance of integrating research, digital media, and contemporary communication tools into religious education to make it more relevant to today’s world. He also commended Al-Hikmah International for producing an exceptional documentary about the institute, praising it as being of international standard.\nAtta Tarar congratulated students for completing their degrees and getting shields. He said that Pakistan came into being on 27th of Ramazan, adding that Allah Almighty chose blessed night of ‘Laylatul Qadr’ for giving the Muslims of Subcontinent a separate homeland. He said that there was one vision behind the Two Nation Theory that Islam was not being promoted in an efficient manner. He further said that the incumbent government had always advocated for the Kashmir issue in most effective way and highlighted sacrifices of all unarmed people of Indian Illegally Occupied Jammu and Kashmir including Burhan Wani. The minister said that Muslims living in Indian Illegally Occupied Jammu and Kashmir were facing brutal human rights violations because they raise slogan ‘Pakistan Say Rishta Kya, La Illaha Illal-Allah’.\nHe said Pakistan was created in the name of Islam, adding that migration was also a Sunnat of Holy Prophet Hazrat Muhammad (Peace Be Upon Him). He noted that during the Partition, hundreds of thousands of Muslims migrated, an event with few parallels in history. He emphasised that it was “only through the immense sacrifices of our forefathers that we are able to live in an independent country today”. He said, “You are serving religion and government will extend all possible support to you.”\nAttaullah Tarar said that working for integrity and prosperity of the country was among top priorities of the government. He said with the grace of Allah Almighty and sincere efforts of the incumbent government during the last one year, things had improved in the country. He said that world was acknowledging that Pakistan was moving towards stability and its economy was improving.\nHe said that recently Turkiye President Recep Tayyip Erdogan visited Pakistan and “whenever we visit Saudi Arabia, United Arab Emirates or China, leadership of these countries appreciate efforts made by Pakistani government to stabilise its economy”. He said, “My grandfather Muhammad Rafiq Tarar served this country a lot and made great services for ‘Khatm-i-Nabuwat’.” He said, “Our elders have taught us to give more respect to a person who has a knowledge of religion.”\nHafiz Qari Shafiq-ur-Rehman and others were also present.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:46:47.395Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/atta-tarar-stresses-imparting-religious-education-on-modern-lines/",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T18:04:00.000Z"
}
