{
  "title": "Aman-25 drills kick off with focus on regional cooperation - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The picturesque seafront of the Pakistan Navy Dockyard with windsurfers, sailboats and Navy boats painted a beautiful backdrop for the flagpoles from which fluttered the flags of 60 nations participating in the ninth Multinational Maritime Exercise ‘Aman-25’ on Friday morning.\n\nThe biennial exercise commenced with a formal flag-hoisting ceremony, followed by the cutting of a cake by senior representatives of the participating navies.\n\nA message from the Chief of Naval Staff, Admiral Naveed Ashraf, was read by Commodore Omar Farooq during the ceremony.\n\nThe naval chief welcomed the participants and highlighted that the exercise, which began in 2007, has now become a regular biennial feature, bringing together regional and ex­tra-regional navies to foster a secure and conducive maritime environment.\n\nNaval fleets of 60 nations participate in exercise; BD navy chief meets military leadership\n\nHe emphasised the Pakistan Navy’s role as a key stakeholder in the Arabian Sea and its initiatives to enhance regional maritime security, including Regional Maritime Security Patrols.\n\nHe further stated that in recognition of the international community’s trust in its efforts to promote peace and stability at sea, Pakistan Navy has introduced the Aman Dialogue this year as an adjunct to the exercise.\n\nSpeaking on the occasion, Pakistan Fleet Commander Rear Admiral Abdul Munib underscored the force’s contributions to collaborative maritime security and the exercise’s significance in enhancing interoperability among the participants.\n\nRear Admiral Munib praised the participating countries for supporting Pakistan’s commitment to peace and maritime security and expressed the hope that the friendships fostered during the exercise would continue and grow.\n\nThe ninth edition of the exercise will see the participation of some 11 to 12 naval ships, some of which have already arrived at the Karachi port while others are on their way.\n\nChina, with its Plans Baotou-133 and Plans Gaoyouhu, and the Kingdom of Saudi Arabia, with its HMS Jazan and HMS Hail ships, are the nations participating with two vessels each.\n\nThe other vessels include UAE’s Abu Dhabi (CVT) P-191, Malaysia’s KD Terengganu-174, Japan’s JS Murasame, Sri Lanka’s SLNS Vijayabahu, Indonesia’s KRI Bung Tomo-357, Iran’s Jamaran, Bangladesh’s BNS Somdura Joy, USA’s Lewis B. Puller and Oman’s RNOV Sadh. Meanwhile, Turkiye is participating with one aircraft.\n\nThere are also a number of special operation forces and observers taking part in the inaugural Aman Dialogue scheduled for Feb 9 to 10.\n\nBangladesh naval chief’s meetings\n\nBangladesh’s Chief of Naval Staff Admiral Nazmul Hassan, who arrived with his naval fleet, held meetings with Pakistan’s top military leadership on Friday in another sign of the improved bilateral ties between the two nations.\n\nAdmiral Hassan, who will also attend the inaugural Aman Dialogue on maritime security, called on the chairman of the Joint Chiefs of Staff Committee, Gen Sahir Shamshad Mirza and Chief of Army Staff Gen Asim Munir.\n\nHe also held a bilateral meeting with Admiral Ashraf at the Naval Headquarters in Islamabad.\n\nThe meetings focused on the evolving regional security landscape and mutual strategic interests, particularly in maritime collaboration.\n\nBoth militaries explored avenues to strengthen defence ties, including joint naval exercises, training programs, and exchange visits.\n\nAdm Hassan’s visit marks the second high-level engagement between the Bangladeshi Armed Forces and Pakistani military leadership in recent months.\n\nOn Jan 14, Lt Gen S.M. Kamrul Hassan, the principal staff officer of Bangladesh’s Armed Forces Division, led a military delegation to Pakistan, where both sides agreed to bolster defence cooperation and collaborate on regional peace efforts.\n\nObservers see these developments as a shift in Bangladesh-Pakistan relations after years of estrangement.\n\nBangladesh’s participation in Pakistan’s multilateral naval exercise is considered a major step forward in military cooperation.\n\nUnconfirmed reports also suggest a senior Pakistani intelligence delegation also visited Dhaka recently, highlighting deepening security and intelligence ties.\n\nThese exchanges have come amid significant political changes in Bangladesh following the ouster of former Prime Minister Sheikh Hasina Wajed in student-led protests.\n\nThe political shift has opened the door for renewed engagement between the two countries, whose ties remained strained for decades due to historical grievances linked to Bangladesh’s independence in 1971.\n\nBaqir Sajjad Syed in Islamabad also contributed to this report\n\nPublished in Dawn, February 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a692d55c922.jpg",
  "retrievedAt": "2025-08-25T19:27:01.988Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890531/aman-25-drills-kick-off-with-focus-on-regional-cooperation",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T01:00:11.000Z"
}
