{
  "title": "Zelensky offers mineral partnership to US, seeks security in return - World - DAWN.COM",
  "author": null,
  "content": "KYIV: Ukrainian Presi­dent Volodymyr Zelensky pored over a once-classified map of vast deposits of rare earths and other critical minerals during an interview on Friday, part of a push to appeal to Donald Trump’s penchant for a deal.\n\nThe US president, whose administration is pressing for a rapid end to Ukraine’s war with Russia, said on Monday he wanted Ukraine to supply the US with rare earths and other minerals in return for financially supporting its war effort.\n\n“If we are talking about a deal, then let’s do a deal, we are only for it,” Zelensky said, emphasising Ukraine’s need for security guarantees from its allies as part of any settlement.\n\nUkraine floated the idea of opening its critical minerals to investment by allies last autumn, as it presented a “victory plan” that sought to put it in the strongest position for talks and force Moscow to the table.\n\nZelensky said less than 20 per cent of Ukraine’s mineral resources, including about half its rare earth deposits, were under Russian occupation.\n\nRare earths are important in the manufacture of high-performance magnets, electric motors and consumer electronics; Zelensky said Moscow could open those resources to its allies North Korea and Iran, both sworn US enemies.\n\n“We need to stop Putin and protect what we have — a very rich Dnipro region, central Ukraine,” he said.\n\nRussian troops have been gaining ground in the east for months, throwing huge resources into an unrelenting offensive while Kyiv’s much smaller army grapples with a shortage of soldiers and frets over future weapons supplies from abroad.\n\nZelensky unfurled a map on a table in the heavily-defended president’s office in Kyiv, showing numerous mineral deposits, including a broad strip of land in the east marked as containing rare earths. Around half of it looked to be on Russia’s side of the current frontlines.\n\nHe said Ukraine had Europe’s largest reserves of titanium, essential for the aviation and space industry, and uranium, used for nuclear energy and weapons.\n\nMany of the titanium deposits were marked in northwestern Ukraine, far from the fighting.\n\nTransactional world view\n\nUkraine has rapidly retuned its foreign policy approach to align with the transactional world view set out by the new occupant of the White House, Ukraine’s most important ally.\n\nBut Zelensky emphasised that Kyiv was not proposing “giving away” its resources, but offering a mutually beneficial partnership to develop them jointly: “The Americans helped the most, and therefore the Americans should earn the most. And they should have this priority, and they will. I would also like to talk about this with President Trump.”\n\nHe said Russia knew in detail where Ukraine’s critical resources were from Soviet-era geological surveys that had been taken back to Moscow when Kyiv gained independence in 1991.\n\nIn addition, Zelensky said Kyiv and the White House were discussing the idea of using Ukra­ine’s vast underground gas storage sites to store US liquefied natural gas.\n\n“I know that the Trump administration is very interested in it … We’re ready and willing to have contracts for LNG supplies to Ukraine. And of course, we will be a hub for the whole of Europe,” he said.\n\nThe interview comes days before the Feb 14-16 Munich Security Conference, where officials from dozens of Western countries will converge at an unpredictable juncture in the nearly three-year-old war.\n\nZelensky said he planned to attend the forum, where Keith Kellogg, Trump’s special envoy for Russia and Ukraine, is also expected.\n\nThe Ukrainian leader said it was essential that he met Trump in person before the U.S. president meets Russian President Vladimir Putin, “otherwise it will look like a dialogue about Ukraine without Ukraine”.\n\nTrump said on Friday that he expected to talk to Zelensky next week. Zelensky said his own priority would be raising Ukraine’s need for security guarantees as part of any deal, to prevent Russia launching another invasion in the future.\n\nIn general though, it was vital the West determined a broad strategy before entering into talks with Moscow. He said there were al­ready regular contacts bet­ween his team and Kel­logg and Trump national security adviser Michael Waltz.\n\nNew offensive\n\nOn the battlefield, Zelensky confirmed for the first time that his troops had launched a new offensive on Thursday, advancing 2.5 km (1.5 miles) further into Russia’s Kursk region.\n\nRussia had reported a Ukrainian attack in the area that day, but said it was repelled.\n\nZelensky said thousands of North Korean troops fighting on Russia’s side had now returned to active combat against Kyiv’s forces in Kursk after a pause of several weeks.\n\nNext week, the government intends to launch lucrative recruitment contracts to entice young men aged 18-24 — below draft age — into the armed forces to help ease a manpower shortage.\n\nPublished in Dawn, February 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a6972a05b2d.gif",
  "retrievedAt": "2025-10-12T01:19:53.468Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890558/zelensky-offers-mineral-partnership-to-us-seeks-security-in-return",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T01:00:49.000Z"
}
