{
  "title": "10 more bunkers demolished in Kurram - Pakistan - DAWN.COM",
  "author": null,
  "content": "KURRAM: Ten more bunkers of rival groups were demolished in Lower and Upper Kurram areas on Friday, taking the structures razed since the recent signing of a peace agreement to 48.\n\nAlso, relief cheques were distributed by the Pakistan Disaster Management Authority among heirs of martyred people.\n\nParachinar tehsildar Nasir Abbas reported that a total of 48 bunkers have been demolished so far and work is underway for the demolition of more such bunkers.\n\nMeanwhile, the routes for transportation in Kurram tribal district have been closed for the last four and a half months, to the suffering of residents.\n\nProvincial assembly member Ali Hadi Irfani said that overseas individuals and students were stranded in the area, and due to a lack of medical treatment and hunger, the immediate opening of transportation routes was necessary to protect people from dying.\n\nHe urged the government to announce an emergency relief package for the trapped population of 500,000.\n\nMr Irfani emphasised that it was the government’s responsibility to protect the lives and property of the people.\n\nMeanwhile, PDMA Kurram district coordinator Shiraz Bacha said that the process of distributing relief cheques among people affected by terrorism incidents is going on.\n\nHe said that on November 21, 2024, relief cheques amounting to Rs37 million were distributed to the heirs of 37 people who were martyred in a convoy attack in Ochat Charkhel area of Lower Kurram area recently.\n\nDC Kurram Ashfaq Ahmed distributed relief cheques to the affected individuals at the Governor’s Cottage in Parachinar.\n\nAdditional deputy commissioner Maqsood Khan said that all affected people would receive relief after the necessary documentation.\n\nHe said that financial assistance would also be provided to those whose vehicles and goods were damaged in the convoy attack.\n\nMr Khan said that a survey of the damages suffered by people, including those from Bagan, was in progress.\n\nPublished in Dawn, February 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:26:29.186Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890478/10-more-bunkers-demolished-in-kurram",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T01:01:17.000Z"
}
