{
  "title": "75pc believe climate change deprioritised: survey - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: About 75 per cent of people in Pakistan (three out of four) consider that the issue of climate change has been deprioritised due to other concerns, whereas only 4 per cent believe it to be the “most worrying issue” due to widespread economic challenges.\n\nA survey by Ipsos titled ‘Climate Change Knowledge, Attitudes, and Practices in Pakistan’ with a sample size of over 1,500 participants launched at the Breathe Pakistan conference revealed that only 31pc Pakistanis believed the environment was at a critical stage requiring urgent action, a figure significantly lower than the global average of 46pc.\n\nAcross segments — from activists to denialists— concern for climate change steadily declined, reflecting varying levels of urgency among Pakistanis.\n\nWhen asked who should take the lead in addressing environmental issues and climate change, 77pc Pakistanis believed it was the government’s primary responsibility instead of their own responsibility to take action.\n\nAs many as 67pc Pakistanis believed companies lacked adequate efforts toward sustainability and ethical practices, said the survey, adding that sectors like food and grocery and travel (69pc each) faced higher criticism, followed by clothing (67pc), technology (65pc), and energy (64pc).\n\nAbout 53pc did not feel guilty for not adopting sustainable practices, with higher indifference among middle-aged individuals at 57pc and people in Sindh (67pc) and Khyber Pakhtunkhwa (59pc).\n\nRegarding climate concerns in Pakistan, Khyber Pakhtunkhwa showed the highest urgency with 48pc people being concerned in the province. Sindh, however, appeared to be least alarmed.\n\nAccording to the survey, men (10pc) are more sceptical than females (6pc), believing climate change was not a concern, while women showed higher urgency, with more women (32pc) believing there was still time to act.\n\nUrban respondents (35%) showed more concern than rural ones (31%), while rural respondents (10%) were more likely to dismiss climate change entirely and consider it exaggerated.\n\nPublished in Dawn, February 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/081125151b29ccb.png",
  "retrievedAt": "2025-08-25T19:26:32.861Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890457/75pc-believe-climate-change-deprioritised-survey",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T01:01:10.000Z"
}
