{
  "title": "Phillips and Santner lead New Zealand to 78-run win over Pakistan - Sport - DAWN.COM",
  "author": null,
  "content": "Glenn Phillips cracked a maiden century and Mitchell Santner grabbed three wickets to help New Zealand overpower Pakistan by 78 runs in the opening match of a tri-nations series in Lahore on Saturday.\n\nPhillips hit 106 not out from 74 balls, with seven sixes and six boundaries to help the tourists post an impressive 330-6 in 50 overs before Santner’s 3-41 helped dismiss Pakistan for 252 in 47.5 overs.\n\nSouth Africa are the third team in the series, a warm-up event for the Champions Trophy from February 19 to March 9 in Pakistan and the United Arab Emirates.\n\nPhillips also added the prized wicket of Pakistan opener Fakhar Zaman who top-scored with a 69-ball 84 including four sixes and seven boundaries.\n\nFakhar and Babar Azam, promoted to open the innings, had given Pakistan a solid start of 52 before Michael Bracewell broke through with the wicket of Azam who made just ten.\n\nSantner then exploited the slow Gaddafi Stadium pitch, dismissing Kamran Ghulam (18), skipper Mohammad Rizwan (three) and Khushdil Shah (15) to put Pakistan on the back foot.\n\nSalman Agha (40) and Tayyab Tahir (30) added 53 for the fifth wicket but that wasn’t enough in a tough chase.\n\nPacer Matt Henry took 3-53 and Bracewell 2-41.\n\nEarlier, Phillips built on the good work by Daryl Mitchell (81) and Kane Williamson (58) after New Zealand chose to bat.\n\nPhillips added a quickfire 54 off just 47 balls with Bracewell for the sixth wicket. Bracewell scored 31 from 23 balls, with three sixes.\n\nNew Zealand plundered 123 runs in the last 10 overs, including 84 from the final five.\n\nPhillips smashed a boundary and two sixes off pace bowler Shaheen Shah Afridi to reach his hundred off 72 balls, taking 25 in the 50th over.\n\nShaheen ended up with expensive figures of 3-88 from his 10 overs, although he gave Pakistan an early breakthrough by removing opener Will Young for four with the fourth ball of the match.\n\nSpinner Abrar Ahmed had opener Rachin Ravindra caught and bowled for 25 but Williamson and Mitchell then added 95 off 112 balls to rebuild the innings.\n\nWilliamson hit seven boundaries in his 46th half century, his first one-day international since November 2023, before edging Shaheen to wicketkeeper Rizwan.\n\nMitchell appeared well set for a hundred but miscued a shot off Abrar in the 38th over to be caught after hitting four sixes and two boundaries.\n\nPakistan was hit hard when pace bowler Haris Rauf walked off in the 37th over after suffering a side strain, having bowled 6.2 overs that included the wicket of Tom Latham for nought.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/081906190c48211.jpg",
  "retrievedAt": "2025-08-25T19:26:23.471Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890624/phillips-and-santner-lead-new-zealand-to-78-run-win-over-pakistan",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T09:16:04.000Z"
}
