{
  "title": "Gazans tell Trump they will rebuild own hotels, restaurants - World - DAWN.COM",
  "author": null,
  "content": "GAZA CITY: Palestinians in Gaza say they are determined to rebuild their own seafront restaurants and hotels, dismissing US President Donald Trump’s vision of creating a “Riviera of the Middle East” emptied of its population and under US control.\n\nBefore Israel’s 15-month offensive left buildings across Gaza in ruins, the densely inhabited Palestinian territory had developed a local tourism scene on its Mediterranean shore despite a long blockade.\n\n“There is nothing that cannot be repaired,” said Gaza resident Assad Abu Haseira, pledging to start serving food from the restaurant he owns even before it is rebuilt.\n\n“Trump says he wants to change the restaurants, and he wants to change Gaza and wants to create a new history for Gaza. We remain Arab and the history of Arabs will not be replaced with the history of foreigners.”\n\nOther Palestinians share his defiance. Mohammed Abu Haseira, another restaurant owner, said his eatery would become operational again “and much better than before”.\n\n“Trump has come up with a decision that he wants to establish restaurants, but the restaurants are here and the hotels are here. Why did you destroy them to establish other ones?” he said.\n\nGaza was once a popular destination for Israeli tourists and even after the takeover of the territory by Hamas in 2007, beachside restaurants and cafes lined its seafront.\n\nTrump’s vision of a Gaza Strip cleared of its Palestinian inhabitants and redeveloped into an international resort revived an idea previously floated by his son-in-law Jared Kushner.\n\nIt triggered condemnation from around the world, with critics saying it would be tantamount to ethnic cleansing and illegal under international law. Gazans were also quick to denounce the scheme, vowing never to leave the ruins of their homes.\n\nFor Palestinians, such talk recalls the “Nakba” or catastrophe after the 1948 war around the creation of the state of Israel, when 700,000 fled or were forced from their homes.\n\nPublished in Dawn, February 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:26:59.790Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890522/gazans-tell-trump-they-will-rebuild-own-hotels-restaurants",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T01:00:17.000Z"
}
