{
  "title": "KP police have lowest pay, welfare package despite sacrifices: IGP - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa police have the lowest pay and welfare package in Pakistan despite facing the most challenging security situation and offering more sacrifices than anywhere else in the country, says the newly-posted Inspector General of Police Zulfiqar Hameed.\n\nDuring his maiden interaction with media persons here Friday, he said: “Risk profile of KP is higher than Balochistan. If one compares the welfare and pay package of KP police with that of Punjab, Sindh and Balochistan, ours’ is the lowest. It is deplorable despite offering the highest number of martyrs than other provinces.”\n\n“Balochistan has the highest pay and welfare package, although the security situation in KP is much more challenging than Balochistan,” he said. “It is unfair. At least we need to give a welfare package of 50 per cent than what Punjab and Sindh pay,” Mr Hameed pleaded.\n\nHe said that he had signed and sent two summaries to Chief Minister Ali Amin Gandapur, seeking to enhance the pay and welfare package of his force to bring it on par with that of the other provinces. “The welfare of the police force is important if you want to win their confidence.”\n\nSays summaries sent to CM to bring his force on par with police of other provinces\n\nHe said that Punjab and Sindh’s welfare package was seven times higher than that of KP. He said that he had discussed the issues with the chief minister, who had tentatively agreed and assured that the provincial government would do all that it could given its budgetary situation. “At least, we should double the welfare package as a starter to give something symbolically.”\n\nThe provincial police chief said that he would be focusing on promotions to create more vacancies as well as on improving infrastructure and enhancing the capacity of his force by providing them with better weaponry and ammunition.\n\n“Situation in the surroundings has an impact on southern KP and the regional changes [referring to the fall of Kabul in August 2021], has added to the challenges,” Mr Hameed said.\n\nHe said that though KP police were equipped with modern gadgets, trained and the force’s capacity built, with all this, the challenge grew as well.\n\nIn response to a question over the worsening situation, the police chief said ‘we see what happens [referring to militant attacks] but we don’t see what the brave force prevents.’\n\nHe also said that no socio-economic growth in the southern districts was also a factor in the prevailing law and order situation.\n\nHe said that improving the infrastructure of the police involving police lines, police posts and police stations would be amongst his priority areas in the medium to long term. “We have to take every measure to protect and secure our police force,” he maintained.\n\nIGP Hameed also highlighted the need for providing better weaponry to the police force. He said that the possession of US-made high quality long-range thermal weapons by the militants had made the situation all the more challenging putting his force at a disadvantage. “We are bearing the consequences of not investing in the police force and its capacity building.”\n\nHe said that he was working on enhancing the technical resources of the police’s Counter-Terrorism Department and special teams were being formed to trace and track down the perpetrators of terrorism for meaningful impact on the ground.\n\nHe said that it had taken Punjab 15 years to establish its CTD on sound footing and that KP was in the process of building one and enhancing its detection, operational and investigative capabilities.\n\nAnswering a question, the provincial police chief made it clear that civil servants had no business participating in political activities. “Our job is to maintain law and order. We have nothing to do to be part of any political activity. Politics is for the political party, not for the civil servants.”\n\nAbout Kurram, he said that two committees had been formed and that progress was being made to collect weapons from the two sides. He said that efforts were being made to facilitate citizens’ movement on the road linking Thall with Parachinar.\n\nHe said that security challenges to the provincial capital were less but those challenges were certainly not over. He said that he had to ensure the protection of his force without compromising the safety and security of the citizens.\n\nMr Hameed said that he was looking at getting a batch of a police unit trained in the use of long-range sniper rifle at an army facility in Jhelum or Kharian in Punjab. He said that his force had obtained some thermal weapons and that efforts were being made to procure more.\n\nPaying tribute to the “valiant KP police force”, IGP Hameed said that there were only two choices. “Either we leave and flee like cowards or stand up and fight. We will stand up, stick around and fight.”\n\nPublished in Dawn, February 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:26:33.643Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890481/kp-police-have-lowest-pay-welfare-package-despite-sacrifices-igp",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T01:01:17.000Z"
}
