{
  "title": "Legal fraternity widens scope of protest to all cities in Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Members of legal fraternity boycotted proceedings of courts in several Sindh towns on Friday to express solidarity with their Hyderabad colleagues in their protest against an influential SSP’s mistreatment of a lawyer.\n\nIn the metropolis, the Karachi and Malir Bar Associations observed full-day boycott in the district courts as the leaders claimed Hyderabad DIG Tariq Razzak Dharejo had reneged on his commitment and failed to meet their core demands.\n\nThey said that the officer had earlier promised to transfer SSP Dr Farrukh Ali Lanjar over his “unlawful actions” against the lawyer Ali Raza Bozdar, and also visit the bar office to settle the issue, but he did not do so.\n\nDuring the protest, the City Courts complex and Malir Court witnessed an unusual quiet as both litigants and police personnel were not allowed to enter the courts’ premises. Even, hearings for remand and other essential judicial work remained suspended throughout the day.\n\nKarachi-Hyderabad road link blocked due to protest at Hyderabad-Jamshoro T-turning; thousands of vehicle remain stuck on both tracks of highway\n\nThe Karachi Bar Association (KBA) said in a statement that the strike would continue on Saturday as well.\n\nThe KBA’s general secretary, Rehman Korai, told Dawn that their only demand was the transfer of the SSP. Otherwise, he warned, the agitation would continue till the acceptance of the demand.\n\nHe claimed the SHO had booked the advocate on the instructions of the SSP to teach him a lesson as his car had dared to enter the police officer’s convoy.\n\nIn a video statement, Mr Korai said that an SSP had become more powerful than the IGP due to his political affiliation, which was why no police personnel were allowed to enter the city courts today in protest.\n\nCalling out Sindh Home and Law Minister Ziaul Hassan Lanjar, he said: “As a minister, you must serve people, not protect a family member.”\n\n“When he [the minister] was threatened in jail by a member of his own party, these very lawyers went on strike in his support. But today, he is forcing these lawyers to take to the streets just to save his nephew,” said Mr Korai.\n\nIn Larkana, lawyers held a sit-in and demonstration after boycotting courts’ proceedings.\n\nThey marched from the office District Bar Association (DBA) to the VIP Road where they staged a sit-in and demanded withdrawal of the FIR registered against advocate Bozdar and removal of SSP Lanjar.\n\nIn Badin, lawyers boycotted courts’ proceedings and staged a demonstration on the premises of district court to express solidarity with their Hyderabad colleagues.\n\nThe DBA leaders demanded that chief minister, home minister and IGP remove SSP Lanjar immediately and slap terrorism charges on all the police officers responsible for violence against lawyers.\n\nIn Mirpurkhas, members of DBA and High Court Bar Association (HCBA) boycotted courts’ proceedings and took out a procession from the district and sessions court to local press club where they staged a sit-in.\n\nThe protesters urged the authorities to remove SSP Lanjar immediately. Their protest would continue till the acceptance of their demands, they warned.\n\nLocal leaders and workers of Sindh United Party also joined the lawyers’ protest to express solidarity.\n\nIn Tando Allahyar, scores of lawyers blocked Hyderabad-Tando Allahyar road.\n\nIn Mithi, members of Tharparkar Bar Association took to the streets and staged a demonstration after boycotting courts’ proceedings.\n\nThe protesters accused Hyderabad DIG of reneging on his commitment with Hyderabad lawyers and warned of expanding the protest if their concerns were not addressed.\n\nIn Nawabshah and Naushahro Feroze, lawyers took out processions and held rallies. The DBA members closed the court’s doors and demanded immediate removal of SSP Lanjar.\n\nLawyers in Qazi Ahmed, Kandiaro and Mehrabpur also boycotted courts and staged demonstrations on National Highway.\n\nDBAs in Jacobabad, Khairpur and Kandhkot boycotted courts, held demonstrations and sit-ins.\n\nThe lawyers’ leaders said that they would continue the protest till SSP Lanjar had been removed.\n\nA group of lawyers in Jacobabad also staged a sit-in on the National Highway and demanded justice for the lawyers of Hyderabad.\n\nGroups of agitating lawyers held a protest at Hyderabad-Jamshoro T-turning, disconnecting the Karachi-Hyderabad road link. Thousands of vehicle remained stuck on both tracks of the highway for many hours till late Friday evening.\n\nPublished in Dawn, February 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/08111753cb14d17.jpg",
  "retrievedAt": "2025-10-12T01:19:55.118Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890509/legal-fraternity-widens-scope-of-protest-to-all-cities-in-sindh",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T01:00:56.000Z"
}
