{
  "title": "Coalition govt to last only 6 more months if situation ‘not fixed’: Punjab governor - Pakistan - DAWN.COM",
  "author": null,
  "content": "Punjab Governor Sardar Saleem Haider has sounded the alarm on the coalition government’s tenure, saying he expects it to last only six more months if the situation is “not fixed” amid tensions between the allies.\n\nThe PPP has been complaining — publicly and privately — about Punjab Chief Minister Maryam Nawaz’s attitude, most notably through Governor Haider and other provincial leaders.\n\nThough Prime Minister Shehbaz Sharif promised to resolve the power-sharing dispute, many within the PML-N doubt he could convince his niece to accommodate the PPP any more than she already has.\n\nSpeaking in an interview on DawnNewsTV show ‘Doosra Rukh’ on Friday, Haider said: “I don’t think the alliance will be able to continue because when the other side does not have the realisation and they don’t care then how much more can it continue? At most, it will continue for six months. I don’t see a coalition beyond six months if things are not fixed.”\n\nHe said the government was currently running solely due to the efforts of President Asif Ali Zardari and criticised the PML-N for a lack of consultation at the levels of the federal and Punjab governments.\n\nHaider said the PPP was having to bear the fallout of the PML-N’s decisions.\n\n“They will have to realise we are allies. Till today we haven’t felt that we are allies.”\n\nHe also alleged rigging in the seat contested in Lahore by PPP Chairman Bilawal Bhutto-Zardari in the general elections, saying that the PPP scion was securing votes in huge numbers.\n\nHaider said he had a “guarantee” that Information Minister Attaullah Tarar did not rightfully win the seat against Bilawal but had actually lost.\n\nTo a question about Tarar having won the seat based on alleged manipulation in Forms 47, as the PTI also claimed, Haider said: “Everyone is [successful based] on Forms 47. The whole country is [based] on Forms 47.”\n\nHaider claimed there was widescale rigging based on the manipulation of Forms 47. “What are we trying to achieve by hiding this,” he added.\n\nHe said that considerable machinations and management took place during the elections. “There was mismanagement. No one saw anything, people grabbed whatever they managed to get their hands on,” the governor.\n\nHe said those responsible should be reprimanded for the conduct of the elections and termed it a failure of politicians.\n\nThe governor was also asked about reports that PML-N President Nawaz Sharif was unhappy with the election results, to which he said: “Given that he is not happy with the election result, he would be more worried if the original results were to come out.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/08150040ed6d65f.jpg",
  "retrievedAt": "2025-08-25T19:26:18.337Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890625/coalition-govt-to-last-only-6-more-months-if-situation-not-fixed-punjab-governor",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T12:21:38.000Z"
}
