{
  "title": "KLF Day 1: Resignation, frustration hang heavy in the air as experts talk economy - Pakistan - DAWN.COM",
  "author": null,
  "content": "Economic experts held an air of resignation and frustration on Friday when talking about Pakistan’s financial challenges and the way forward on day one of the 16th Karachi Literature Festival (KLF).\n\nThe panel, consisting of well-known names such as former finance minister Miftah Ismail, economy journalist Khurram Husain, Adviser to the Finance Minister Khurram Schehzad and prominent industrialist Arif Habib, spoke at length at the moot about the issues plaguing the economy.\n\nHusain highlighted the plight of those earning daily wages, underscoring that their purchasing power was destroyed by 30 per cent since 2021 despite ease in inflationary pressure now.\n\n“We are no longer in the midst of a ferocious inflationary fire — that fire has been extinguished — the default cliff has been pulled back so that’s one place the economy stands but here’s where the good news ends,” he said.\n\nHe pointed out that the current period of stability was on the back of the same tools every government in the past had used, which was an International Monetary Fund (IMF) prescribed mix of high interest rates and currency devaluation.\n\n“Lot of destruction of purchasing power [has happened],” Husain stressed, adding that there was a “wrong kind of conversation taking place” where industry delegations insisted on reduction of taxes for themselves.\n\n“You cannot start unwinding the entire thing by granting sector-specific tax relief to industry groups the moment you successfully stabilise the economy,” he said.\n\nIsmail also remained sceptical about the government’s role in easing inflationary pressure. He admitted that there was ease in inflationary pressure but questioned the government’s role in economic stability.\n\n“What steps has the government taken for this? You find out that the government has not done anything, global prices went down and therefore the inflation in Pakistan went down, and, because of that, there was a reduction in the policy rate,” he stated.\n\nHe said that the economic welfare of citizens was never really an objective for the current government, “as it is for other countries”.\n\n“This government’s objective, for the most part, has been how to reduce Imran Khan’s popularity and it has failed at that,” he said.\n\n“This government, apart from Peca and the 26th amendment, has not taken any steps for economic welfare,” he said, highlighting that the govt had repeatedly asked citizens to practice austerity by increasing taxes, however, it failed to take their welfare into account.\n\nIsmail lamented the poor state of education and rampant corruption in public sector development projects.\n\nHe noted that Pakistan’s electricity prices were far more expensive than Indonesia, Malaysia, Thailand, Vietnam, South Africa and obviously also South Asia.\n\n“So when someone from the Middle East or an American thinks about investment, they think about these other countries,” he said.\n\nMeanwhile, Schehzad offered some assurances to the crowd, stating that the government was focusing on reducing expenditures.\n\n“This is the focus right now, although I’m unsure whether it’s been conveyed to the market properly,” he said, adding that rightsizing was taking place, quoting a number of $3 billion, or Rs836bn as the budget.\n\nRegarding fiscal expenditures, he listed the running of the government, pensions, state-owned entities and energy as the major expenses.\n\nOn the way forward, Ismail offered some solutions such as devolution of power to local governments, stating that they had to be empowered.\n\n“Number two: You need to decrease the federal government’s footprint and privatise, you have the world’s most expensive electricity because of rampant corruption, theft and transmission and distribution losses,” he said.\n\nIsmail also suggested directly transferring cash to those living below the poverty line rather than depending on provincial governments, citing the example of Balochistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/07232901ff939c5.jpg",
  "retrievedAt": "2025-10-12T01:19:05.490Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889902/klf-day-1-resignation-frustration-hang-heavy-in-the-air-as-experts-talk-economy",
  "dateList": "2025-02-08",
  "date_published": "2025-02-07T19:38:25.000Z"
}
