{
  "title": "US opposes inclusion of Hezbollah in Lebanese govt - World - DAWN.COM",
  "author": null,
  "content": "BEIRUT: A senior US official visiting Beirut on Friday opposed any Hezbollah presence in Lebanon’s new government.\n\nHezbollah slammed the remarks by deputy special envoy for the Middle East Morgan Ortagus as “blatant interference”.\n\nLebanon’s prime minister-designate is struggling to form a government amid political pressure from the allegedly Iran-backed group.\n\n“We have set clear red lines in the United States that they (Hezbollah) won’t be able to terrorise the Lebanese people, and that includes by being a part of the government,” Ortagus said after meeting President Joseph Aoun.\n\nMore than a year of hostilities severely weakened Hezbollah, allowing Lebanon’s divided parliament to elect Aoun — seen as Washington’s preferred candidate — as president and approve Nawaf Salam as premier after more than two years of political deadlock.\n\nOrtagus declared “the end of Hezbollah’s reign of terror in Lebanon and around the world”.\n\nAoun later distanced himself from her comments, with his office saying some of what she said “represents her own point of view and is not the concern of the presidency”.\n\nThe head of Hezbollah’s parliamentary bloc, Moham­med Raad, said Ortagus’s remarks were “full of malice and irresponsibility” and attacked a component of “Lebanese political life”, branding them “blatant interference in Lebanon’s sovereignty”.\n\n‘End corruption’\n\nOrtagus was in Lebanon for her first official visit abroad after being appointed by President Trump last week.\n\nHezbollah has played a major role in the country’s politics for decades, flexing its power in government institutions while its fighters battled Israel.\n\nPublished in Dawn, February 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/081054449fbde7b.jpg",
  "retrievedAt": "2025-10-12T01:19:05.929Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890564/us-opposes-inclusion-of-hezbollah-in-lebanese-govt",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T01:00:49.000Z"
}
