{
  "title": "Stocks remain flat in choppy trading session - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The stock market managed to end the five-session losing streak with a meagre gain on Friday in a flat performance amid a sharp contraction in trading volume, reflecting investors’ indecisiveness due to a lack of positive triggers.\n\nAli Najib, Head of Sales at Insight Securities, said PSX had a mixed day amidst the low volumes. The day started positively but couldn’t withstand the selling and went into the negative zone. During the session, the index moved in a range of 1,218 points (from the 110,905 to 109,687 levels) and eventually closed at 110,323, marking a gain of 21.78 points or 0.02pc day-on-day.\n\nThe downturn was driven by profit-taking from institutions, political uncertainty, and concerns about meeting IMF targets.\n\nAhsan Mehanti of Arif Habib Corporation said the market remained choppy amid worries over the outcome of the IMF review later this month, with tax collection shortfalls and overdue external debt as the focus.\n\nHe added an uptick of $46m in SBP foreign exchange reserves to $11.42bn after a decline in the two preceding weeks, and strong expectations of a further easing of monetary policy supported the PSX to close in the green.\n\nTopline Securities Ltd said the top positive contribution to the index came from Fauji Fertiliser, Oil and Gas Development, Lucky Cement, National Bank, and Millat Tractors, as they cumulatively contributed 344 points. Conversely, Engro Holdings, Engro Fertiliser, MCB Bank, Cherat Cement, and Service Industries cumulatively took away 245 points.\n\nThe decline in investor activity was observed as the trading volume plunged 49.96pc to 299.67 million shares while the traded value tumbled 39.03pc to Rs15.62bn day-on-day.\n\nStocks contributing significantly to the traded volume included Silkbank Ltd (119.52m shares), WorldCall Telecom (30.24m shares), Silkbank Ltd (22.23m shares), K-Electric (18.73m shares), The Bank of Punjab (15.15m shares) and Cnergyico PK (10.86m shares).\n\nThe shares registering the most significant increases in their share prices in absolute terms were Rafhan Maize (Rs148.17), Unilever Foods (Rs129.29), ZIL Ltd (Rs20.00), Nestle Pakistan (Rs18.61) and Pakistan Services (Rs17.76).\n\nThe companies registering significant decreases in their share prices in abs­o­lute terms were Service Industries (Rs27.71), Hal­eon Pakistan (Rs27.15), Abbott Laboratories (Rs18.64), Mitchells Fruit (Rs12.17) and Shahtaj Sugar (Rs11.52).\n\nPublished in Dawn, February 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a693517e9cd.gif",
  "retrievedAt": "2025-08-25T19:26:45.986Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890543/stocks-remain-flat-in-choppy-trading-session",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T01:00:31.000Z"
}
