{
  "title": "Section 144 imposed in Islamabad, Punjab, Balochistan as PTI holds rally in KP’s Swabi - Pakistan - DAWN.COM",
  "author": null,
  "content": "A ban on all gatherings was imposed across Punjab, Balochistan, and Islamabad as the PTI took out a rally on Saturday in Khyber Pakhtunkhwa’s Swabi district to mark a year since the Feb 8, 2024 general elections.\n\nThe PTI is marking February 8 (today) as a “black day” on the first anniversary of last year’s elections, the results of which were marred by debates on inconsistencies.\n\nWhile the party had also approached the Lahore deputy commissioner and later the Lahore High Court (LHC) for permission to hold a power show at the city’s Minar-i-Pakistan, the court had denied its request. Nevertheless, PTI’s Punjab chief organiser, Aliya Hamza Malik, has instructed party leaders to hold protest demonstrations.\n\nAccording to state-run Radio Pakistan, Section 144 has been imposed “in Islamabad, Punjab and Balochistan”.\n\nSection 144 is a legal provision of the Code of Criminal Procedure (CrPC) that empowers district administrations to prohibit an assembly of four or more people in an area for a limited period.\n\n“According to the notification, all gatherings, processions, rallies and sit-ins have been prohibited for maintenance of law and order and protection of lives and properties of the people,” Radio Pakistan reported.\n\nIt, however, did not specify the reason or the duration for which the ban has been imposed.\n\nAddressing the Swabi rally, PTI Information Secretary Sheikh Waqas Akram alleged that the election “mandate was stolen” by the government so that it could pass the 26th amendment.\n\n“ [It was done] so the judges could be exploited. So they could appoint judges by themselves and get the decisions they want,“ he said while quoting party founder Imran Khan.\n\nPTI Chairman Gohar Khan said that numerous cases were filed against Imran, however, the public never lost their faith in the part founder.\n\n“God willing, Imran will also be out in front of you,” Gohar said.\n\nKP Chief Minister Ali Amin Gandapur said that the green part of the PTI’s flag represented peace, according to which they had led their party so far.\n\n“Along with the colour of peace, we have the colour of blood as well, the colour of revolution,” he said.\n\n“If we grab this side [of the flag] then you won’t be able to bear it,” Gandapur said.\n\nWhile riling up the PTI workers in the rally, CM Gandapur then started chanting: “’Khoon ka badla khoon’ (blood for blood).”\n\nCM Gandpaur — while quoting Imran — said that the part was ready for negotiations, however, if the government was not, “then remember that we also know how to respond”.\n\nEarlier, PTI caravans from various cities of KP have set out for Swabi, with senior PTI leader Taimur Saleem Khan Jhagra among them. In a post on X, he said: “I have two demands: release of Imran, [and] reparations for the injustice done to the public mandate.”\n\nThe former KP minister asserted that he was neither interested in a designation nor any role, adding that he would not be a party to a politician who “plays both sides”.\n\nThe PTI also has a live broadcast airing on its X account, purportedly showing supporters gathering at the venue for its Swabi power show.\n\nSeparately, Defence Minister Khawaja Asif said that “permission cannot be given to attack the state like May 9 or November 26”.\n\nSpeaking at a press conference in Sialkot, he said, “While the state is facing terrorism in two of our provinces, this party (PTI), even if not involved in the same acts of terrorism, is still amplifying them.”\n\nReferring to the upcoming Champions Trophy tournament, Asif said that all of PTI’s rallies or protests “coincide with an event which is supposed to increase Pakistan’s respectability, so they [protest] to reduce the importance of that event”.\n\n“The resources of the KP government are being used, government employees are being told to attend. A question arises as to why such gatherings do not happen in other provinces?” he added.\n\n“You won’t see any PTI leadership from the rest of the three provinces,” he said, adding, “We do not have an objection if a peaceful gathering is done but in the past, all of them have started with violence.”\n\n“KP’s chief minister says that 99 per cent of our demands have been met then that should be a cause for celebration, not protests,” Asif said.\n\nThe defence minister continued: “As a political party they cannot negotiate a political solution, it is a fruitless exercise when there is no sincerity and negotiations are used as a smoke screen.\n\n“Behind closed doors, PTI is negotiating with the establishment,” he claimed.\n\nSpeaking about possible pressure from the US to release PTI founder Imran Khan, he said, “They thought Trump would come and release Imran Khan but that didn’t happen.\n\n“One of the members of the American delegation that came here said that they (PTI) are spending $3-4 million per month there [for lobbying].”\n\nA day ago, the Punjab government issued a notification imposing Section 144 across the province.\n\nThe notification said it had been reported that a political party had “announced protests/demonstrations across Punjab on Feb 8 and there is an apprehension that miscreants/mischief-mongers can take advantage of the said protest to carry out subversive/anti-state activities to fulfil their nefarious designs”.\n\nThe notification also stated that the Provincial Intelligence Committee, in its Feb 3 meeting, in the backdrop of the present wave of incidents of terrorism, had recommended imposing restrictions on all kinds of political assemblies, sit-ins, rallies and demonstrations to ensure the security of the people and installations/buildings.\n\nIn Islamabad, the last time Section 144 was in place was till January 19 at least, after an already existing ban had been extended for another two months on November 18 ahead of the PTI’s “Final Call” protest.\n\nSimilarly, a ban on protests was imposed in Punjab at the same time, which had been extended till Nov 28, 2024 at least.\n\nIn Balochistan, Section 144 was recently in effect during a gathering organised by the Baloch Yekjehti Committee (BYC) in Chaghi district’s Dalbandin. The ban had previously been imposed on December 30 as well.\n\nSeparately, a sit-in staged to protest the abduction of a 17-year-old girl in Khuzdar continued yesterday, leaving the Quetta-Karachi National High­way blocked for a second consecutive day.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/0818174505f82f1.jpg",
  "retrievedAt": "2025-08-25T19:26:18.616Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890631/section-144-imposed-in-islamabad-punjab-balochistan-as-pti-holds-rally-in-kps-swabi",
  "dateList": "2025-02-08",
  "date_published": "2025-02-08T11:09:26.000Z"
}
