{
  "article_id": "2025-09-29_d41581b15ef5daf3175e9b6669271d15",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/isnet-suparco-launches-intl-training-course-on-space-based-disaster-management/",
    "retrieved_at": "2025-10-11T23:37:36.365Z"
  },
  "metadata": {
    "title": "ISNET-SUPARCO launches int’l training course on Space-Based Disaster Management",
    "author": null,
    "date_published": "2025-09-29T16:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 538,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 29 (APP):The Inter-Islamic Network on Space Sciences and Technology (ISNET), in collaboration with the Pakistan Space and Upper Atmosphere Research Commission (SUPARCO), has inaugurated a five-day international training course on \"Space-Based Disaster Management - Moving from Response to Proactive Preparedness\" at SUPARCO Headquarters. The program runs from September 29 to October 03 and is part of ISNET-SUPARCO's Annual Program of Special Short Courses. The course brings together disaster management professionals, researchers, and policymakers from OIC member states, including Tunisia, Libya, Senegal, and Iraq, to strengthen regional capacity in disaster risk management through the use of space science applications. The training is designed to shift the traditional focus from reactive disaster response to proactive preparedness. Participants will be trained in Geographic Information Systems (GIS), satellite remote sensing, disaster monitoring, and rapid damage assessment techniques. Special sessions include the use of Google Earth Engine, Disaster Watch, and advanced flood modeling through HEC-RAS 2D software, enabling experts to identify high-risk flood zones and strengthen early warning systems. Administrator ISNET, Ms. Sadaf Sajjad, highlighted the growing need to integrate space-based technologies into disaster preparedness frameworks. She said that space science is no longer optional-it is an essential part of modern disaster management. The ability to predict, monitor, and mitigate the effects of floods, droughts, and other climate-induced disasters, she added, can save countless lives. Dr. Muhammad Farooq of SUPARCO elaborated on the practical benefits of using satellite imagery, remote sensing, and GIS tools. He stressed that such technologies not only improve situational awareness but also provide governments with actionable data to design long-term mitigation strategies. International delegates also underlined the importance of cross-border cooperation. Dr. Jalal Al-Anatwi from Libya remarked that disasters transcend national boundaries and therefore require a collective approach. \"Shared learning and regional collaboration are no longer optional-they are the need of the hour,\" he said. Speaking as the chief guest, Mr. Zafar Iqbal drew attention to the reality of climate change and its disproportionate impact on countries like Pakistan. He emphasized that although Pakistan contributes minimally to global carbon emissions, it is among the most climate-vulnerable countries in the world. \"Disasters do not recognize borders, which is why regional cooperation and timely data sharing are crucial,\" he said. The course has placed special focus on climate-induced disasters such as floods and droughts, which have increasingly impacted the OIC region. By equipping participants with technical knowledge and practical skills, ISNET and SUPARCO aim to foster a shift from short-term disaster response toward proactive preparedness and resilience-building. Participants will not only attend lectures but also engage in group exercises, case studies, and hands-on applications to strengthen their ability to implement strategies in their home countries. The practical sessions are expected to enhance the operational capacity of national disaster management authorities and related organizations. This initiative reflects Pakistan's commitment, as an OIC member state, to strengthen regional cooperation in science and technology for disaster management. It also aligns with global calls for using advanced technology to build resilience against climate change. By the end of the training, participants are expected to return to their respective countries with enhanced knowledge of space-based disaster management tools and strategies, enabling them to improve early warning systems, reduce disaster risks, and protect vulnerable communities.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}