{
  "article_id": "2025-09-29_7b74cf61cbebf77eb54f7c512c4b179d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/two-new-polio-cases-confirmed-from-sindh/",
    "retrieved_at": "2025-10-11T23:38:28.912Z"
  },
  "metadata": {
    "title": "Two new Polio cases confirmed from Sindh",
    "author": null,
    "date_published": "2025-09-29T12:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 300,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 29 (APP):The Regional Reference Laboratory for Polio Eradication at the National Institute of Health (NIH) has confirmed two new cases of poliovirus from Sindh, raising Pakistan's total polio count for 2025 to 29. According to the NIH, the new cases were detected in District Badin and District Thatta, with both patients being young girls. With this confirmation, Sindh's tally for the year has reached nine cases, while the national breakdown now stands at 18 cases from Khyber Pakhtunkhwa, nine from Sindh, and one each from Punjab and Gilgit-Baltistan. Polio is a highly infectious and incurable disease that can cause lifelong paralysis. Health experts emphasize that the only effective protection is repeated doses of the Oral Polio Vaccine (OPV) for every child under the age of five, along with timely completion of routine immunizations. In September 2025, the National Emergency Operations Centre for Polio Eradication carried out a Sub-National Immunization Campaign across 88 districts, including Badin and Thatta, successfully reaching nearly 21 million children under five. The next nationwide polio vaccination drive will take place from October 13 to 19, 2025, targeting 45.4 million children under five years of age. Alongside OPV, Vitamin A supplements will also be administered to strengthen children's immunity. Over 400,000 trained and dedicated frontline workers will go door-to-door to ensure every eligible child receives protection. Officials stressed that polio eradication requires collective responsibility. While frontline workers play a critical role in delivering vaccines, parents and caregivers must ensure their children receive every dose during campaigns, they said. They urged communities, teachers, religious leaders, and the media to support vaccination efforts, dispel misinformation, and encourage families to vaccinate their children. Health authorities reaffirmed Pakistan's commitment to eradicating polio, stressing that united efforts are essential to secure a polio-free future for every child in the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}