{
  "article_id": "2025-09-29_41293fa8c0727b632140b3c0c03e0375",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senator-rubina-khalid-leads-bisp-relief-mission-in-flood-hit-buner-assures-full-support/",
    "retrieved_at": "2025-10-11T23:36:49.809Z"
  },
  "metadata": {
    "title": "Senator Rubina Khalid leads BISP relief mission in flood-hit Buner; assures full support",
    "author": null,
    "date_published": "2025-09-29T19:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 298,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 29 (APP):In a powerful show of solidarity with flood survivors, Chairperson Benazir Income Support Programme (BISP), Senator Rubina Khalid, personally visited the flood-ravaged areas of District Buner on Monday, distributing relief goods, assuring full rehabilitation support, and dispatching a mobile registration van to enroll disaster-hit families into BISP's social protection network. Accompanied by Member of the National Assembly Nafisa Shah, Senator Rubina Khalid reached the worst-hit localities of Buner, where torrential rains, flash floods, and landslides have caused widespread damage to homes, livelihoods, and infrastructure. During her visit, the BISP Chairperson handed over essential relief items to the flood-affected families, reiterating that the government and her institution would stand firmly by the people until their complete rehabilitation. She emphasized that the newly deployed BISP Mobile Registration Van would ensure that affected households are registered on priority and included in BISP programmes without delay. Reviewing the situation on the ground, Senator Rubina Khalid held meetings with PPP Khyber Pakhtunkhwa President Syed Muhammad Ali Shah Bacha, local leaders, and district authorities to discuss urgent measures needed for relief and long-term recovery. Deputy Commissioner Buner, Kashif Qayum Khan, briefed her in detail on the extent of the disaster, the pace of relief operations, and the strategies being adopted for rehabilitation. Senator Rubina Khalid also underscored that a part of the relief activities was arranged in her personal capacity, reflecting her commitment to easing the sufferings of the people. Later, speaking to media representatives in Ambela, Buner, she stressed that she has been closely monitoring the evolving situation and frequently visiting the district to ensure that timely and transparent assistance reaches the victims. She assured that BISP will not only continue relief efforts but will also provide long-term support for rehabilitation, enabling affected families to rebuild their lives with dignity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}