{
  "article_id": "2025-09-29_24fa1bdb3a518a27074ba2945967d17c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sarfraz-bugti-sets-january-deadline-for-project-completion-prioritizes-public-welfare/",
    "retrieved_at": "2025-10-11T23:38:12.281Z"
  },
  "metadata": {
    "title": "Sarfraz Bugti sets January deadline for project completion, prioritizes public welfare",
    "author": null,
    "date_published": "2025-09-29T13:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 312,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "QUETTA, Sep 29 (APP):Chief Minister of Balochistan, Mir Sarfaraz Bugti, has issued a firm directive to all provincial departments to complete approved development schemes by January 2026, ensuring timely delivery of public welfare initiatives. The announcement came during a high-level meeting at the Chief Minister's Secretariat focused on the implementation of the Public Sector Development Program (PSDP). The meeting was attended by key provincial leaders including Planning and Development Minister Mir Zahoor Ahmed Buledi, Communication and Works Minister Mir Saleem Khan Khosa, Education Minister Raheela Hameed Khan Durrani, Chief Secretary Shakeel Qadir Khan, and administrative secretaries from all departments. Additional Chief Secretary Zahid Saleem provided a detailed briefing on the status of ongoing projects. CM Bugti commended departments that demonstrated swift progress but expressed dissatisfaction with those lagging behind. He emphasized that the Chief Minister's Inspection Team will oversee the prompt execution and quality assurance of all development schemes. \"Reducing the difficulties faced by the common person in Balochistan is the government's top priority,\" said CM Bugti. \"All departments must adopt public service as their mission and play an active and responsible role.\" CM Sarfraz Bugti directed that both projects be completed by October. New buses for the Green Bus scheme have already been procured and are expected to arrive at Karachi Port in the second week of October. The Green Bus fleet will be expanded to improve urban mobility, while the Pink Bus Service will be launched to provide safe and dedicated transport for women. In a move to promote economic independence, CM Sarfraz Bugti announced a plan to provide electric bikes to working women on easy installment terms. \"We want women to be self-reliant and actively contribute to the social and economic sectors,\" he added. The CM instructed that all proposed schemes for the upcoming fiscal year must secure technical approval by May, ensuring their timely inclusion in the budget.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}