{
  "article_id": "2025-09-29_ec008f85d9cf7707e5510489d8ab9b9a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sc-suspends-ihc-order-restraining-justice-tariq-jahangiri-from-judicial-work/",
    "retrieved_at": "2025-10-11T23:38:11.344Z"
  },
  "metadata": {
    "title": "SC suspends IHC order restraining Justice Tariq Jahangiri from judicial work",
    "author": null,
    "date_published": "2025-09-29T13:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 265,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 29 (APP):The Supreme Court on Monday suspended the Islamabad High Court's (IHC) order barring Justice Tariq Mehmood Jahangiri from performing judicial functions over a degree controversy. A constitutional bench of the apex court granted interim relief to Justice Jahangiri, allowing him to resume judicial work. The court also issued notices to all parties, including the Attorney General's Office and the original petitioner in the IHC. During the proceedings, Justice Jamal Khan Mandokhail observed that the Supreme Court had previously ruled that no judge could be restrained from judicial work, adding that the Supreme Judicial Council has already convened a meeting for October 18 to review the matter. Justice Shahid Bilal questioned how the petition against Justice Jahangiri was numbered in the IHC despite pending objections by the Registrar's Office. He directed both sides' counsel to come prepared to address this issue. Counsel for Justice Jahangiri, senior lawyer Muneer A. Malik, contended that the order ignored settled law and failed to meet the requirements of due process. Malik further highlighted that the petition against his client was filed in July 2024, but objections raised by the Registrar's Office still remained unresolved. He also informed the bench that the same IHC judges who were transferred and later challenged those transfers under Article 184(3) of the Constitution were part of the bench that stopped Justice Jahangiri from work on September 16, without hearing the other side. Representatives of the Islamabad Bar Council and District Bar Association also sought to become parties in the case. After hearing preliminary arguments, the Supreme Court adjourned the hearing until Tuesday.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}