{
  "title": "Exports of services rise to $5.46bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s export of services grew 6.04 per cent to $5.46 billion in the first eight months of FY25 compared to $5.15bn in the corresponding months of last year.\n\nTelecommunication, computer and information services contributed to the growth in the current fiscal year. Services exports have seen positive growth since February 2024. However, there was a 6.50pc decline in August 2024.\n\nIn rupee terms, the exports improved by 3.50pc to Rs1.519 trillion in 8MFY25 against Rs1.468tr in 8MFY24, according to statistics issued by the Pakistan Bureau of Statistics on Friday.\n\nIn February, services exports recorded a growth of 5pc to $709.96 million as against $676.17m over the corresponding month of last year.\n\nAccording to the data compiled by the State Bank of Pakistan, the exports of telecommunications, computer, and information services reached $2.482bn in July-February of FY25 against $1.978bn a year ago, indicating a growth of 25.48pc.\n\nThe export of other business services grew 1.42pc to $1.073bn in 8MFY25 against $1.058bn over the corresponding months of last year. However, the export of transport services dipped by 6.50pc to $618m in 8MFY25 against $661m a year ago.\n\nSimilarly, the export of travel services recorded a negative growth of 2.74pc to $496m compared to $510m a year ago.\n\nThe government has an export target of $15bn for IT exports in the next five years.\n\nAt the same time, the import of services increased by 32.70pc to $1.013bn in February from $763.42m over the corresponding month of last year. In July to February FY25, the import of services recorded an increase of 12.03pc to $7.709bn as against $6.881bn over the corresponding months of last year.\n\nThe increase in imports is mainly attributed to transport and travel services. The surge in transport payments is attributed to increased fares for air passengers.\n\nThe import of transport services reached $3.386bn in 8MFY25 against $3.096bn in the corresponding period last year, an increase of 9.36pc. Similarly, the import of travel services rose 14.77pc to $1.662bn against $1.448bn a year ago.\n\nThe import of services increased by 17.14pc to $10.119bn in FY24 against $8.638bn in the corresponding period last year.\n\nThe trade deficit in services increased by 29.85pc to $2.250bn in July-February FY25 compared to $1.732bn in the corresponding months last year.\n\nIn February, the trade deficit in services increased by 247.37pc to $303.06m against $87.25m over the corresponding months last year.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:00:07.122Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902190/exports-of-services-rise-to-546bn",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:09:33.000Z"
}
