{
  "title": "Leading garment producer Bangladesh holds crisis talks on US tariffs - World - DAWN.COM",
  "author": null,
  "content": "Bangladesh’s interim leader called an emergency meeting on Saturday after textile leaders in the world’s second-largest garment manufacturing nation said US tariffs were a “massive blow” to the key industry.\n\nTextile and garment production accounts for about 80 per cent of exports in the South Asian country, and the industry has been rebuilding after it was hard hit in a revolution that toppled the government last year.\n\nUS President Donald Trump on Wednesday slapped punishing new tariffs of 37pc on Bangladesh, hiking duties from the previous 16pc on cotton and 32pc on polyester products.\n\nBangladesh exports $8.4 billion of garments annually to the United States, according to data from the Bangladesh Garment Manufacturers and Exporters Association (BGMEA), the national trade body.\n\nThat totals around 20pc of Bangladesh’s total ready-made garments exports.\n\n“Chief Adviser Professor Muhammad Yunus has convened an emergency meeting … to discuss the US tariff issue,” a government statement read, with the meeting to take place late on Saturday in the capital Dhaka. Top experts, advisers and officials will attend, it added.\n\nBangladesh’s tax authority, the National Board of Revenue, is also expected to meet to review the fallout from the tariffs.\n\nRakibul Alam Chowdhury, chairman of RDM Group, a major manufacturer with an estimated $25 million turnover, said on Thursday that the industry would lose trade.\n\n“Buyers will go to other cost-competitive markets — this is going to be a massive blow for our industry,” he said.\n\nSeveral garment factories produce clothing for the US market alone.\n\nAnwar Hossain, administrator of the BGMEA, has told AFP that the industry was “not ready” for the tariff impact.\n\nBangladesh, the second-largest producer after China, manufactures garments for global brands — including for US firms such as Gap Inc, Tommy Hilfiger and Levi Strauss.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/05192055d8e4607.jpg",
  "retrievedAt": "2025-08-25T13:59:32.696Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902293/leading-garment-producer-bangladesh-holds-crisis-talks-on-us-tariffs",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T14:35:08.000Z"
}
