{
  "title": "Situationer: How more imports from US can help weather tariff storm - Newspaper - DAWN.COM",
  "author": null,
  "content": "• US is still Pakistan’s ‘number one export destination’; govt constitutes committee to formulate policy response\n• Massive volumes put India in better negotiating position, but across-the-board inflation in US may help Pakistan’s low-price exports\n\n“I WOULDN’T want to be the last country that tries to negotiate a trade deal with @realDonaldTrump. The first to negotiate will win — the last will absolutely lose. I have seen this movie my entire life,” US President Donald Trump’s son, Eric Trump, posted on X on Thursday.\n\nRecently, President Trump anno­unced reciprocal tariffs on many countries, including 29 per cent on Pakistan. While Pakistan is not even among the top 50 trading partners for the US, America is Pakistan’s number one destination in terms of exports, with $5.4 billion worth of goods sold there in 2024.\n\nAt $3.33bn, Pakistan’s highest trade surplus stems from Washington.\n\n“If Bangladesh can get their reciprocal tariffs removed or reduced, some of the business from Pakistan might shift to Bangladesh. But at the same time, Pakistani companies will face a lot of pressure to absorb these tariffs so they can continue to operate in the US market,” says Musadaq Zulqarnain, CEO and Chairman of Interloop, one of the country’s biggest exporters.\n\nWith the increases in production costs in recent years, margins have reduced from 15-20 per cent to about 5pc on average. Some stronger companies’ profitability margins can be as high as 10pc but the room to absorb high tariffs and remain profitable and viable is limited, he explains.\n\nGiven the sweeping tariffs imposed on over 60 countries, Pakistan is slightly better off than most competitors except India. Even there, the difference is slim.\n\nIn the fact sheet issued by the White House, India is mentioned seven times. “India imposes their own uniquely burdensome and/or duplicative testing and certification requirements… If these barriers were removed, it is estimated that US exports would increase by at least $5.3 billion annually,” the fact sheet says.\n\nThis allows India to negotiate better with the US, offering improved access to its 1.3bn population in exchange for lower tariffs. India’s Department of Commerce said on Thursday it is “carefully examining the implications of the various measures” and that it was “studying the opportunities that may arise due to this new development”.\n\n“If India can negotiate better than us, then we might be at a great disadvantage,” said Mr Zulqar­nain. Bigger players, such as Interloop, which are part of supply chains of giants such as Adidas and Target, might fare better because of their long-standing relationships, at least in the short term.\n\nSmaller players working with wholesalers or unbranded stores will be in an extremely weak position, with their buyers willing to switch to another country for as little as 2 cents per piece.\n\nInflation or no?\n\nThe US Federal Reserve expects at least a temporary rise in inflation, though the effects may be more persistent. Tariffs can also induce a recession if the unemployment rate spikes and job losses occur. However, March’s job report was encouraging, with 228,000 jobs added last month.\n\nHouseholds in the lowest 40 percentile of the US economy are below an annual threshold of $50,000. Their average spend on clothing is less than $2,000 per year. In the case of recession, people who were buying Nike socks will switch to unbranded socks, and those buying unbranded socks will make do with wearing them with holes, explains Mr Zulqarnain.\n\nMany of Pakistan’s low-price, low-quality exports aim at the bottom of the pyramid and thus may get a boost. However, if inflation persists, there may be cannibalisation, and the size of the pie will be smaller for all players.\n\nAnother way to increase US exports might be to reconfigure the export offerings, says Ehsan Malik, CEO of the Pakistan Business Council (PBC). Demand for man-made fibre apparel is higher than demand for cotton-based products, though Pakistan tends to focus on the latter.\n\nInstead of focusing on the bottom of the pyramid, improving mid-level offerings might make a positive difference in the long term. For that shift to be made, the government needs to provide support and technical assistance from countries like Sri Lanka and the Philippines to train our labour.\n\nHowever, given the lynching of the Sri Lankan Priyantha Kumara and security concerns for the Chinese, foreigners are less inclined to come.\n\nAs things stand, Pakistan may lose out on up to $1-1.5bn of textile exports over the next year, Mr Malik estimates.\n\nIncreasing imports from the US\n\nTrump’s tariffs are a tactic to bring its trading partners to the negotiation table. Moving swiftly, the government has already constituted a committee to decide on a policy response.\n\nHowever, reciprocal tariffs on a player as big as the US is hardly feasible, nor does the country have any geopolitical leverage. So the only move forward would be to import more from the US. That poses a whole string of challenges.\n\nCotton, the US’s main export to Pakistan, already has zero duty. Pakistan imported $772 million worth of cotton from the US in 2024. Since the new tariffs do not apply to goods with more than 20pc of US-originating material, textile companies may opt to import more from America.\n\nHowever, US cotton is about 10-12 cents a pound more expensive than Brazilian cotton, according to the Pakistan Business Council. Factoring shipping costs, increasing American cotton component into Pakistan’s textile to protect exports might not be economically viable.\n\nThis is applicable to all possible imports from the US. In a note provided by the PBC, only soya beans are identified as having the potential for a placating gesture within agriculture. A 3pc duty is imposed on American imports, which can be used for negotiations, especially since Trump focuses on boosting agriculture.\n\nFor most other imports, the US would find it very hard to compete with China even if the Free Trade Agreement with Beijing was ignored and a duty parity offered. China has a lower cost of production and is next door.\n\nTruth be told, developing countries tend to exploit labour to keep costs down and be competitive, a tactic that the US cannot follow. Thus, for the most part, re-directing imports from China to the US might not be economically viable for us, leaving us with little to offer.\n\nThe impact on Pakistan’s exports seems more dependent on how its competitors negotiate than on its own actions.\n\nThere is a silver lining if one looks for it with a mic­roscope. The electricity rate cuts might help rejuvenate large-scale manufacturing. If inflation inc­r­eases demand for Pakis­tan’s lower-priced apparel, then together, these two factors may give exports a much-needed boost.\n\nPublished in Dawn, April 5th, 2025\n\nA container is loaded on to the Cosco Wellington, the first container ship to depart after the inauguration of the China-Pakistan Economic Corridor port in Gwadar, Pakistan on Nov 13, 2016. — Reuters/Caren Firouz/File",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/05114952b2eb21b.jpg",
  "retrievedAt": "2025-08-25T13:59:39.514Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902148",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:09:15.000Z"
}
