{
  "title": "Power minister concedes no cut in base tariff yet - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Confirming no reduction in base electricity tariff so far, the government on Friday conceded that Rs1.90 per unit negative quarterly adjustment would fluctuate in line with the movement in interest and exchange rates while Rs1.71 per unit relief against higher petroleum levy may continue into the next fiscal year.\n\nSpeaking at a news conference, Power Minister Awais Ahmad Khan Leghari said all the independent power producers (IPPs) set up under the China-Pakistan Economic Corridor (CPEC) had the protection of the government framework, but discussions were “on track” for their debt reprofiling and conversion of imported coal-based plants to local coal.\n\n“Whatever advantage becomes available through this process will be passed on to the consumers in future,” he said.\n\nThe minister said the International Monetary Fund and other development partners would have never supported price reductions had this been limited to renegotiations with IPPs. They were convinced through repeated consultations over power sector reforms that gave them confidence about the sustainability of the power sector and downward pressure on prices over the next 3-4 years.\n\nBreakup of relief\n\nSeparately, a Power Division team told a public hearing called by National Electric Power Regulatory Authority (Nepra) that Rs1.71 per unit reduction against Rs10 per litre increase in petroleum levy would be in place for three months from April to June while another Rs1.90 per unit negative QTA for the second quarter of FY25 would also be applicable for the same three months.\n\nRs7.41 relief is for April-June thru routine QTAs, diversion of levy, lower tax impact\n\nOut of another Rs1.36 per unit negative monthly fuel adjustment, 46 paise per unit would be applicable for one mo­­nth (April), while the remaining 90 paise would stay for April to June, making the total relief at Rs4.97 per unit. The government also expected another Re1 per unit cut in for the third quarter. This results in a total reduction of Rs5.98 per unit, as confirmed by Secretary Power Dr Fakhre Alam during Mr Leghari’s presser.\n\nThe remaining Rs1.42 per unit or so is being claimed on account of lower sales tax arising out of this Rs5.98 per unit cut, taking the total to Rs7.41 per unit anno­unced by the prime minister. Mr Leghari said the sustainability of this reduction would depend on immediate reforms.\n\nThe power minister agreed that QTAs would be subject to fluctuations in exchange and interest rates, among other things, and asserted that a Rs10 per litre increase in petroleum levy would remain intact into the next year to ensure its sustainable impact on power tariffs. He said the Re1 movement in exchange rate against the dollar meant Rs8-10bn and a 1pc change in interest rate had a Rs6bn impact on tariff.\n\nAsked as to why reduction was not being made in national base tariff increased by Rs7.91 per unit in July last year if reforms were showing actual results and inefficiencies going down in power companies, the minister said he could not predict base rate adjustments pending with the regulator and due for revision early next fiscal year.\n\nThe minister said a total of Rs3.696tr savings had been secured through renegotiations with 30 IPPs and revision in terms of six government-owned power plants (GPPs). The bulk of savings worth Rs2.661tr came from revision in terms of six GPPs), accounting for 33pc of all GPPs.\n\nThe remaining Rs1.034tr worth of savings had been achieved through tariff renegotiations with 30 IPPs over their remaining lifespan ranging between three and 25 years. This included about Rs297bn savings in future payables to five IPPs whose contracts have been terminated followed by Rs502bn from 16 IPPs of 1994 and 2002 power policies and Rs235bn from nine bagasse-based IPPs.\n\nTalking about reforms, the minister said the Indicative Generation Capacity Expansion Plan (IGCEP), currently in the final stages, would guarantee that future electricity procurement would be on the least cost principle through a competitive process and even the strategic plants would be partly financed through Public Sector Development Programme (PSDP) or direct government funding and its higher cost would not be passed to consumers.\n\nAlso, the procurements would be allowed along the transmission line capacity and the central power purchasing agency (CPPA) would not purchase electricity in future to move towards an end to the single buyer model to competitive market.\n\nThe minister said the cheaper local coal-based electricity in the southern part of the country could not be currently provided to load centres in the north due to transmission line constraints. Other­wise, the national tariff could be cheaper by up to Rs2 per unit. These constraints would be removed through public-private partnerships, he said.\n\nCircular debt strategy\n\nThe minister said the circular debt was projected at Rs2.429tr for FY25. He said it was estimated to increase by Rs300bn, but actually, it was reduced by Rs9bn during the July-December period, registering an Rs339bn improvement. The Discos were anticipated to have Rs303bn worth of inefficiencies, which actually stood at Rs158bn, showing an improvement of Rs145bn.\n\nHowever, he lamented that two Discos of Hyderabad and Sukkur exceeded their loss and inefficiency targets by around Rs20bn because of bad governance as these were the only entities where the independent board of directors could not be appointed.\n\nHe said an existing debt servicing surcharge of Rs3.23 per unit (due for expiry later this year) would continue in electricity tariff to finance the restructuring of Rs1.2tr worth of circular debt that would eliminate the total Rs2.4tr circular debt in six years. Only Rs300bn worth of late payment surcharge out of this circular debt would then be left, and that would be serviced through improvement in Discos’ inefficiencies and other arran­gements by the Ministry of Finance.\n\nPromising speedy privatisation based on market appetite, the minister said Discos from Islamabad, Faisalabad and Gujranwala would be given to the private sector in the first phase, followed by Lahore, Multan and Hazara-based Discos.\n\nIn the second phase, Hyderabad, Sukkur and Peshawar-based Discos would be given on long-term concession agreements while Tribal and Quetta-based companies would be retained in the public sector for improvement followed by transfer of management control to the private sector.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:00:06.975Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902192/power-minister-concedes-no-cut-in-base-tariff-yet",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:09:33.000Z"
}
