{
  "title": "Russian missile strike kills 16 in Zelensky’s home city - World - DAWN.COM",
  "author": null,
  "content": "KYIV: A Russian ballistic missile strike on Volodymyr Zelensky’s home city of Kryvyi Rig killed 16 people on Friday, including six children, the Ukrainian leader said.\n\nThe missile struck a residential area near a children’s playground and wounded more than 50 people, according to the head of the city’s military administration.\n\nUnverified videos on social media appeared to show bodies lying on a street, while another showed a plume of smoke rising into the evening sky.\n\n“It was preliminarily a ballistic missile attack. As of now, 16 people have been killed, including six children,” Zelensky said on Telegram.\n\nThe rescue operation was ongoing, he added.\n\n“There is only one reason why this continues — Russia does not want a ceasefire and we see it. The whole world sees it,” he said.\n\n“And only the world’s pressure on Russia, all efforts to strengthen Ukraine, our air defence, our forces — only this will determine when the war will end.” The Ukrainian leader was born in Kryvyi Rig, which had a pre-war population of around 600,000 people.\n\nUS President Donald Trump’s administration has been pushing for a speedy end to the more than three-year war, holding talks with both Russia and Ukraine.\n\nRussian President Vladimir Putin rejected a joint US-Ukrainian proposal for an unconditional and full ceasefire, while Ukraine has accused Moscow of dragging out talks with no intention of halting its offensive.\n\nUS Secretary of State Marco Rubio said earlier on Friday that Trump was not “going to fall into the trap of endless negotiations” with Russia over its three-year invasion.\n\n“We will know soon enough, in a matter of weeks, not months, whether Russia is serious about peace or not,” he said.\n\n‘War crime’\n\nKryvyi Rig, in Ukraine’s central Dnipropetrovsk region, is about 60 kilometres from the front line, but has regularly been targeted by Russian drones and missiles.\n\nA previous Russian ballistic attack on the city on Wednesday killed at least four people and wounded more than a dozen others.\n\nOleksandr Vilkul, the head of the city’s military administration, said the missile landed near a children’s playground.\n\nZelensky said the attack showed diplomacy was an “empty word” for Russia.\n\n“A ceasefire could have been reached by now and it is Putin who rejects it,” he said in his evening address.\n\nFive apartment buildings were damaged, interior minister Igor Klymenko said.\n\nHe said police had blocked off the area to maintain order.\n\n“The police are documenting the consequences of Russia’s war crime and accepting statements from the victims,” Klymenko added.\n\nSocial media video from the scene showed a car in flames, while people could be heard shouting.\n\nAndriy Kovalenko, a Ukrainian official tasked with countering disinformation, described the missile involved in the attack as an “Iskander”.\n\nThe Iskander is a Russian ballistic missile system that can have a range of up to 500 kilometres.\n\n“This is a deliberate strike to kill a large number of people,” Kovalenko said.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/050907561d4760a.jpg",
  "retrievedAt": "2025-08-25T13:59:53.251Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902196/russian-missile-strike-kills-16-in-zelenskys-home-city",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:09:44.000Z"
}
