{
  "title": "PSL 10 to completely integrate Match Officials’ Technology - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: The HBL Pakistan Super League (PSL) on Friday announced the complete integration of Match Officials’ Technology (MOT), powered by Hawk-Eye Innovations, for its upcoming edition.\n\nThis marks a significant milestone for the league, bringing it in line with global standards of officiating, transparency, and viewer engagement.\n\nWhile elements of MOT were used in previous seasons, this edition will feature a fully tech-supported ecosystem, according to a Pakistan Cricket Board press release.\n\nThe six-team tournament is scheduled to take place across four cities—Lahore, Karachi, Multan, and Rawalpindi—from April 11 to May 18.\n\nThe MOT system will include auto no-ball detection, live umpire communication, Decision Review System (DRS), innings timers, match logging, and real-time multi-angle replays.\n\nA dedicated Hawk-Eye technician will be present at each match to assist umpires and ensure smooth operations, said the PCB.\n\nFor the first time, over-rate calculations will be tracked ball-by-ball and made accessible to teams and fans, with umpires equipped with handheld tablets for real-time logging and instant DRS activation.\n\nFans will also benefit from enhanced engagement, with DRS updates and innings timers displayed on big screens and broadcast graphics in real time. The technology will further enable broadcasters to deliver richer, data-driven coverage throughout the tournament.\n\n“This step will ensure fairness in decision-making and provide greater clarity for officials, players, and spectators,” PSL chief Salman Naseer said in a statement.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f05f9a663ee.gif",
  "retrievedAt": "2025-10-12T02:22:30.242Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902175/psl-10-to-completely-integrate-match-officials-technology",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:09:39.000Z"
}
