{
  "title": "Over 50 rounded up as drive against Afghan nationals intensified in Pindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: After the federal government expressed concern and asked the Punjab government to make ‘genuine efforts’ to achieve the desired results regarding repatriation of Afghan Citizen Card (ACC) holders, the Rawalpindi police swung into action on Friday and rounded up more than 50 Afghan nationals and shifted them to the refugee camp near Golra Mor.\n\nIn this regard, the Punjab Home Department has directed the police and the district administrations across the province, citing directives from the interior ministry issued on April 1, to launch an effective drive against the ACC holders.\n\nAccording to sources, the district police chief and deputy commissioner have been directed to implement the Punjab government’s directives regarding detention of the ACC holders and intimate the home department about it.\n\nThe deputy commissioners have been directed to obtain lists of ACC holders from the Special Branch. The local police will detain the ACC holders and immediately transfer them to the transit area where their particulars shall be verified from Nadra and through the immigration verification and audit system (IVAS).\n\nl Tight security put in place at Golra Mor holding centre l Over 273 shifted to centres in Jhelum l Police told not to detain those holding Proof of Registration (PoR) cards\n\nBesides, biometric authentication and database cross-checking shall be conducted to confirm their identity and status.\n\nIt further said the district police shall ensure appropriate security for holding areas to avoid any untoward incidents.\n\nTransportation logistics shall be arranged by the district administration to facilitate the movement of ACC holders towards the Torkham border in Khyber Pakhtunkhwa.\n\nAfter approval of the home department, vehicles carrying the ACC holders shall be escorted by the district police till Swabi interchange which falls in the limits of Attock district.\n\nThe home department has directed that the additional deputy commissioner (revenue) Attock will conduct a district-wise counting of ACC holders as per the manifest report, and the Afghan nationals will be handed over to KP police at Swabi interchange.\n\nTwo police officials from the district shall accompany the convoy up to the Torkham border while details of vehicles, names of drivers, officials of district administration and police officials shall be shared with the home department prior to the movement of the convoy.\n\nA focal person (additional secretary) from the home department has also been appointed. The FIA director general and divisional and district police chiefs, the additional IG Special Branch and Nadra director general had also been intimated by the Punjab home department about directives.\n\nOn the other hand, the city police officer Rawalpindi has expressed concern over the ‘disappointing’ performance of the SHOs regarding the detention of illegal Afghan nationals and directed them to report to him after every four hours about the progress.\n\nThe CPO directed the SHOs to appear before him on Saturday (today) to explain why their performance was not satisfactory.\n\nThe CPO categorised the Afghan nationals who were to be detained as ACC card holders, visa overstay and those having no legal proof of stay. However, police have been directed not to detain those holding Proof of Registration (PoR) cards.\n\nThe government had officially set the deadline of March 31 for the ACC holders to leave Pakistan voluntarily. However, the process of detaining the Afghan nationals residing in Rawalpindi and Islamabad without documentation is underway.\n\nAccording to sources, more than 40 Afghan nationals were housed at the detention centre on Friday night.\n\nGujar Khan\n\nOver 273 Afghan refugees possessing their national citizenship and cards have been shifted to the temporary holding centres in the Jhelum district before their transportation to Hazro camp and then to Swabi and Landikotal.\n\nThis was stated by district police officer (DPO) Jhelum Tariq Aziz Sindhu while talking to Dawn on Friday evening.\n\nHe said the Afghan nationals were being located in the light of data provided by Nadra.\n\nLocal police prior to April 1 clearance work did reconnaissance of the place where ACC holders were residing.\n\nThe DPO said a good number of Afghan nationals residing in the jurisdiction of Jhelum district had reportedly volunteered to return to their homeland after restoration of peace there while those staying here were being convinced to return to their country.\n\nHe said two centres in colleges had been established where the availability of medical care, food and other facilities had been ensured. — Hamid Asghar in Gujar Khan also contributed to the story\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f047d56defc.jpg",
  "retrievedAt": "2025-10-12T02:22:35.964Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902141/over-50-rounded-up-as-drive-against-afghan-nationals-intensified-in-pindi",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:10:03.000Z"
}
