{
  "title": "40 more leave for Afghanistan via Torkham - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Voluntary repatriation of the Afghan refugees continues as a total of 511 Afghan nationals including 193 Afghan Citizen Card (ACC) holders have left for Afghanistan since April 2, officials said.\n\nThey said that 153 ACC holders had left for Afghanistan on Wednesday while 40 more left on Thursday night, adding that illegal Afghan refugees were also shifted to KP from other provinces to be deported to Afghanistan following their registration with National Database and Registration Authority (Nadra).\n\nThey said 184 Afghan nationals were shifted from Sargodha to KP while 134 were transported to KP from Gujrat, adding that they were all deported to Afghanistan via Torkham border crossing.\n\n“The voluntary repatriation of the ACC holders is under way and so far, over 193 persons have left for Afghanistan,” a senior official said, adding that besides the registered Afghan refugees carrying ACC, repatriation of illegal and unregistered Afghan nationals was also under way.\n\nEarlier, Chief Commissioner for Afghan Refugees Asmatullah Shah along with officials from the commissionerate for Afghan refugees from KP visited transit points for the second phase of sending back Afghan refugees. An official statement issued here said that Mr Shah met representatives from PDMA, Nadra, FIA, and other key stakeholders to review and monitor the arrangements and services being provided at the transit centres.\n\nHe also carried out an on-site inspection to evaluate the facilities and overall setup at the transit points and identified some issues and offered suggestions to improve the infrastructure and operations.\n\nIn accordance with the federal government’s decision regarding the Illegal Foreigners Repatriation Plan Phase-II, the KP government has established two transit centres, one at Nasir Bagh Road (Juma Khan Kaley), Peshawar, and another at Landi Kotal, Khyber district. These centres aim to facilitate the repatriation of illegal Afghan nationals to their home country.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f04230472f9.jpg",
  "retrievedAt": "2025-10-12T02:22:20.162Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902110/40-more-leave-for-afghanistan-via-torkham",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:10:08.000Z"
}
