{
  "title": "PCB slams incident involving Khushdil Shah and spectators in New Zealand - Sport - DAWN.COM",
  "author": null,
  "content": "The Pakistan Cricket Board (PCB) on Saturday condemned the incident where “abusive language was directed at national players by foreign spectators” during the match against New Zealand.\n\nIn the final one-day international (ODI) of the series against New Zealand in Mount Maunganui, Pakistan’s brittle batting was exposed again as a Ben Sears-inspired New Zealand won the third ODI by 43 runs on Saturday to sweep the series 3-0.\n\nDuring the match, there was an incident where Pakistani cricketer Khushdil Shah had to be held back by security staff after reacting to “inappropriate remarks” from the crowd.\n\n“The Pakistan cricket team management has strongly condemned the abusive language directed at national players by foreign spectators,” the statement issued by the PCB read.\n\nIt added that during the match today, foreign spectators had hurled inappropriate remarks at Pakistani cricketers present on the field.\n\n“When anti-Pakistan slogans emerged, cricketer Khushdil stepped in and urged the spectators to refrain,” the statement said, adding that “In response, Afghan spectators escalated the situation by using further inappropriate language in Pashto.”\n\nThe PCB added that following the Pakistani team’s complaint, stadium officials intervened and ejected the two disruptive spectators.\n\nOn Thursday, in a similar incident involving spectators in Australia, officials said they would tighten security at the Melbourne Cricket Ground (MCG) after a “disappointing” breach that allowed two men to bring guns into the stadium at an Australian Rules football match.\n\nPolice said they had found weapons on a 21-year-old man and a 27-year-old man after the pair refused to leave the MCG over their behaviour while in the crowd of 82,058 for the match between Collingwood and Carlton.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/05175416b30d543.jpg",
  "retrievedAt": "2025-08-25T13:59:33.703Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902286/pcb-slams-incident-involving-khushdil-shah-and-spectators-in-new-zealand",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T13:22:51.000Z"
}
