{
  "title": "Lahore High Court rules in favour of woman denied property share by brother for 27 years - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court (LHC) has ruled that a beneficiary of an oral gift/transfer of immovable property(s) bears heavy onus to prove the transaction.\n\nJustice Khalid Ishaq issued the ruling allowing a civil suit of a widow who was denied her share in the inherited property by her brother on the pretext that their deceased father had orally gifted him the property during his life.\n\nSadiqan Begum, a resident of district Toba Tek Singh, challenged the gift mutation before a local civil court but her suit was dismissed. Her subsequent appeal was also rejected by an appellate court.\n\nAfter going through facts of the case, Justice Ishaq declared it a simple but similar to usual cases where a helpless female strives for her right of inheritance, having challenged the transaction of transfer of immovable property in favour of her male sibling.\n\nRejects man’s claim that father had orally gifted him property months before death\n\nThe judge regretted the ongoing trend of unfair schemes to deprive daughters, sisters, mothers, widows, and orphans—especially the misuse of ‘oral gifts’ by dishonest male family members.\n\nDiscussing the principles to deal with such cases, the judge noted that the beneficiary of the transaction of gift/transfer of immovable property bears a heavy onus to prove the transaction.\n\n“The beneficiary of a gift has to plead and prove three mandatory ingredients of gift, i.e. declaration/offer by the donor, acceptance of gift by the donee, and delivery of possession under the gift,” he added.\n\nThe judge explained that where a gift, which excluded a legal heir, irrespective of whether such transaction is evidenced by registered deed, the donee is required to prove original transaction and must justify the disinheritance of a legal heir from the estate.\n\nThe judge observed that both the lower courts acted illegally and with material irregularity while exercising their jurisdiction.\n\nJustice Ishaq noted that the respondent (Muhammad Siddique) claimed that property was not available for inheritance as it was purportedly gifted to him by his old age father some four months prior to his death. Therefore, the judge said, the respondent was the witness who had to take the witness stand to prove necessary ingredients of the gift but he did not appear before the lower courts with no plausible explanation and instead banked upon the testimony of his son.\n\nThe judge maintained that the nonappearance of the respondent is an incurable defect in his quest to prove the gift.\n\nThe petitioner woman deposed that her deceased father never gifted the property to the respondent and the same was an outcome of fraud. She specifically stated that she was never aware of any such transaction.\n\nThe judge held that the statement of the petitioner clearly shifted the onus of proof to respondent being the beneficiary of oral gift, which he failed to discharge by shying away from appearance as a witness.\n\nJustice Ishaq said the lower courts failed to appreciate that in absence of proof of a valid gift, the continuous possession of the respondent being the only male surviving member of the family was constructive possession on behalf of his sister, an uneducated villager lady.\n\nHe said merely because the respondent brother was in possession of the land does not mean, let alone established, that the land was gifted to him.\n\n“However, it itself confirms that he took advantage of his gender and position and made the best out of the vulnerability of a dependent female,” the judge added.\n\nHe lamented that rather than supporting his widow sister in the hour of need, the respondent turned into a predator to deprive his sibling of her rightful inheritance and successfully managed to do so for 27 long years.\n\nThe judge observed that concurrent findings of the fact recorded by the trial court and upheld by the appellate court fall well within the exceptions of interference for exercising revisional jurisdiction of the LHC.\n\nThe judge set aside the impugned decisions by the lower courts and decreed the suit filed by the woman.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:59:51.856Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902129/lahore-high-court-rules-in-favour-of-woman-denied-property-share-by-brother-for-27-years",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:09:57.000Z"
}
