{
  "title": "Verified no more - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE air in the room was thick. Zelensky and Trump sat side by side, their discomfort barely hidden. It was their first meeting since Trump’s return, with Ukraine still deep in war.\n\n“Why don’t you wear a suit?” a reporter asked. “A lot of Americans have a problem with you disrespecting the dignity of this office.” The question wasn’t just absurd, it seemed to be a dog-whistle dressed as decorum. Seconds later, as if the cue had been given, Vice President J.D. Vance launched into a tirade about arrogance and ingratitude.\n\nBut more striking than the question was the man who asked it: Brian Glenn, a conservative media figure and chief White House correspondent for Real America’s Voice, a platform that thrives on conspiracy theories, partisan spin, and uncritical loyalty to Donald Trump. Glenn is also the partner of Congresswoman Marjorie Taylor Greene, a Republican from Georgia who is known for promoting a wide range of conspiracy theories, from QAnon to Pizzagate, the latter a dangerous lie that led to a public shooting.\n\nSo the real question is not about Zelensky’s attire. It is about how a fringe media figure like Brian Glenn found himself in the Oval Office during one of the most critical press briefings in recent memory.\n\nThe answer stretches back to Trump’s first term, when his then adviser Kellyanne Conway defended a series of falsehoods from the White House podium by calling them “alternative facts”, hinting at laying the foundation of a media landscape where loyalty matters more than accuracy.\n\nIt also explains why the Associated Press, one of the world’s most respected news agencies, was kept out of this rather critical presser, reportedly as punishment for refusing to adopt the administration’s preferred terminology for the Gulf of Mexico.\n\nAcross governments and tech platforms, we are witnessing a reordering of who gets to define truth.\n\nThe sidelining of the Associated Press isn’t just an editorial choice, it seems to be part of a deeper, more deliberate shift. Across both governments and tech platforms, we are witnessing a steady reordering of who gets to define truth. Traditional journalism is being pushed out of the room, and in its place, a new ecosystem is being built, one that is far more comfortable with partisan spin, ideological loyalty, and outright misinformation.\n\n‘Big Tech’ seems to be at the centre of this transformation. Just days before the Zelensky-Trump presser, Meta announced it was ending key parts of its third-party fact-checking programme and rolling out community moderation tools that mimic the model introduced by X. Branded as ‘Community Notes’, the strategy seemingly hand over the task of verifying information to platform users, allowing them to annotate or challenge posts based on majority consensus.\n\nBut consensus is not the same as truth. In politically polarised environments, these systems are easily manipulated by coordinated campaigns, allowing disinformation to be reframed as opinion, and opinion to be passed off as fact. These systems claim to democratise information, but in practice they do the opposite. They strip away the professional guardrails and hand control to crowds that are often unaccountable and easy to manipulate.\n\nInterestingly, Meta justifies the termination of fact-checking by saying it doesn’t want to be the arbiter of truth. But it’s not neutrality, it’s abandonment. For years, Meta partnered with professional fact-checkers, acknowledged its role in slowing the spread of falsehoods, and presented itself as a responsible actor in the fight against disinformation. To now claim it has no business determining what’s true is not a change in principle, it’s a convenient retreat from responsibility.\n\nThe truth is, Meta has always been an arbiter of information. Its algorithms decide what billions of people see, share, and believe. Replacing trained fact-checkers with vague community moderation tools does not remove the power to shape truth; it simply hands it to the loudest, most organised, and most resource-packed voices. In doing so, Meta avoids liability, escapes political scrutiny, and continues to profit from a system where misinformation travels faster and earns more. The move, thus, feels less like a refusal to pick sides, and more like a business model dressed up as moral distance.\n\nThis shift is not occurring in isolation, it’s being orchestrated from the highest levels of power. For instance, in the US, President Donald Trump has spent years attempting to dismantle the credibility of mainstream journalism, frequently labelling outlets like CNN and MSNBC as “fake news” and “the enemy of the people”. In a recent address at the Department of Justice, he escalated these attacks, accusing major news organisations of engaging in “illegal” activities.\n\nThis relentless vilification serves a clear purpose: to erode public trust in traditional media and promote alternative sources that are more sympathetic to his narrative. The result is a dangerous convergence where political figures gain unchecked control over information, alternative media outlets receive undue legitimacy, and technology platforms profit as sensational falsehoods outperform verified facts in reach, speed, and emotional impact.\n\nNone of this is random. The exclusion of legacy media from seats of power, the rise of partisan content factories in their place, and the dismantling of fact-checking infrastructure across digital platforms are deeply connected. They signal a calculated retreat from truth as a civic value. That retreat is even starker when seen alongside US government cuts to thousands of global initiatives once built to support journalism, fact-checking, and local resilience against disinformation. Just as falsehood becomes more organised and aggressive, the systems built to resist it are being quietly dismantled.\n\nThis collapse is convenient for everyone involved. For political demagogues across the globe, it removes the friction of scrutiny. For alt-media, it creates space to masquerade partisanship as news. And for Big Tech, it is simply good business. Professional fact-checking is being replaced by community moderation tools that are opaque, vulnerable to manipulation, and impossible to hold accountable. Platforms like Meta and X can now claim neutrality while profiting from content designed to provoke and polarise.\n\nWhat we are witnessing is not a breakdown of the system. It is a strategic redesign, one where journalism is not only undermined, but intentionally made irrelevant.\n\nThe writer is the founder of Media Matters for Democracy.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f06b4dd979d.jpg",
  "retrievedAt": "2025-10-12T02:22:25.736Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902224",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:10:14.000Z"
}
