{
  "title": "Hosts New Zealand beat Pakistan by 43 runs to sweep ODI series 3-0 - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan’s brittle batting was exposed again as a Ben Sears-inspired New Zealand won the third and final one-day international by 43 runs on Saturday to sweep the series 3-0.\n\nThe tourists were dismissed for 221 off 40 overs in response to New Zealand’s 264-8, in a match shortened to 42 overs after a delayed start at Mount Maunganui.\n\nIt followed the pattern of the first two games, with the hosts winning the opener in Napier by 73 runs, followed by an 84-run victory in Hamilton.\n\nNew Zealand also dominated the preceding T20 series, winning 4-1.\n\nPakistan struggled throughout the tour to adjust to the sustained bounce and movement of New Zealand’s seam attack and their batters were again guilty of rash shots at Bay Oval.\n\nAggressive pace bowler Sears claimed 5-34 to follow his five-wicket bag in Hamilton, with four of his victims falling to short-pitched deliveries.\n\nFellow seamer Jacob Duffy, who was a handful in both series, took 2-40, including the wicket of Mohammad Rizwan for 37 in the 33rd over to effectively end the tourists’ hopes of victory.\n\nBabar Azam top-scored with 50 off 58 balls while opener Abdullah Shafique ground out a sluggish 33 off 56.\n\nPakistan’s innings began badly when opener Imam-ul-Haq was forced to retire hurt for one, having been struck on the jaw by a fielder’s throw when attempting a quick single.\n\nEarlier, Rhys Mariu scored a maiden half-century after New Zealand were asked to bat first, with the start of the match delayed for two hours because of a wet outfield.\n\nOpener Mariu, playing just his second international match, scored a composed 58 off 61 balls, featuring six fours and two sixes.\n\nA number of New Zealand middle-order batters made starts but didn’t press on for big scores until captain Michael Bracewell produced a flashy 59 at the death.\n\nBracewell struck six sixes in his 40-ball knock before being caught off the last ball of the innings bowled by Akif Javed.\n\nSeamer Javed took 4-62 off his eight overs although Naseem Shah was arguably the best of the Pakistan bowlers, taking 2-54 and bowling with good pace and movement.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/051219016e4086b.jpg",
  "retrievedAt": "2025-08-25T13:59:39.076Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902248/hosts-new-zealand-beat-pakistan-by-43-runs-to-sweep-odi-series-3-0",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T05:03:57.000Z"
}
