{
  "title": "Minister Moeen Wattoo terms hydel ‘top priority’ as LHC calls for water emergency - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Several schemes underway to boost water storage and green energy, Wapda officials tell minister for water resources\n• High court asks LDA to impose Rs0.5m fine on housing schemes wasting water\n\nLAHORE: As Pakistan faces drought due to below-average rainfall, a cabinet minister has assured Wapda of full support in the completion of ongoing hydropower and water storage projects on time.\n\nOn the other hand, the Lahore High Court has expressed concerns over water wastage, while calling for the imposition of a water emergency in rural areas, besides stringent penalties to discourage the practice.\n\nDuring a visit to Wapda House in Lahore, Federal Minister for Water Resources Muhammad Moeen Wattoo said the federal government accorded top priority to increasing water storage and green energy, and it wanted the timely completion of such projects.\n\n“The federal government accords highest priority to increasing water storage and adding clean, green, and economically affordable hydel electricity to the national grid for providing cheaper electricity to the consumers and stabilising the national economy,” the minister said while speaking to senior officials.\n\nOn this occasion, the officers concerned briefed the minister about the scope of Wapda’s work and completed, under-construction and future hydropower and water storage projects.\n\nThey informed the minister that Wapda has been implementing the largest development portfolio, comprising eight mega projects in water and hydropower sectors. These projects are destined to “revolutionise” the economic landscape of Pakistan with much-needed water and low-cost hydel electricity.\n\nThese under-construction projects include Diamer-Basha Dam, Mohmand Dam, Dasu Hydropower Project, Tarbela 5th Extension, Kurram Tangi Dam Stage 1, Nai Gaj Dam, Kachhi Canal Extension and Greater Karachi Bulk Water Supply Scheme (K-IV).\n\nScheduled for completion in a phased manner from 2026 to 2029-30, these projects will double the hydel generation from 9,500MW to 19,500MW with the addition of about 10,000MW clean, green and low-cost hydel electricity to the national grid.\n\nBesides, these projects will also add 9.7 million acre-feet (MAF) to the gross water storage of the country, sufficient to irrigate another 3.9 million acres of land and provide 950 million gallons per day for drinking purposes to Karachi and Peshawar. These projects have also been providing about 35,000 job opportunities throughout Pakistan.\n\nThe minister expressed pleasure over the progress on various projects and directed the authorities to ensure their completion on time. “In view of significance for the country, it is good that these projects are being pursued vigorously for their completion,” he said, adding that the ministry would provide full support to Wapda for the timely completion of these projects.\n\nLHC seeks water emergency\n\nSeparately, the Lahore High Court on Friday reiterated its concerns over water wastage and observed that a water emergency should be declared in the rural areas as well.\n\nJustice Shahid Karim was hearing petitions related to environmental issues and smog control.\n\nHe stressed the need for a crackdown to prevent water wastage and directed the authorities to take effective measures. He ordered that offices of housing societies involved in wasting water should be sealed, and cases should be registered against them.\n\nHe directed the Lahore Development Authority (LDA) to impose fines of up to Rs500,000 on such societies.\n\n“Any society where people are seen washing cars with hoses should be sealed immediately,” he added.\n\nJustice Karim restrained the LDA from approving building plans without water recycling systems.\n\nExpressing concern at the declining underground water levels in Lahore, the judge emphasised that a water emergency should be declared in rural areas as well. He remarked that there was also a water crisis in Cholistan, underlining the need for significant measures to prevent water wastage and address shortages.\n\nThe judge directed that water recycling plants be installed in buildings and instructed the Parks and Horticulture Authority (PHA) to approach the court if it faced difficulties.\n\nThe judge noted that Lahore’s groundwater levels were rapidly declining, but due to extensive efforts, the decline had been halted, and such efforts must not go in vain.\n\nJustice Karim observed that the weather was changing after a long time and if Pakistan did not have monsoon rains, it would be facing drought.\n\nThe judge directed the Provincial Disaster Manage­ment Authority (PDMA) to issue notices to the institutions regarding water wastage and report on those that continue to waste water.\n\nDuring the hearing, the judge also proposed that the authorities concerned could impose heavy fines for traffic violations instead of lodging FIRs. The hearing was adjourned until next week.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:00:18.855Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902152/minister-moeen-wattoo-terms-hydel-top-priority-as-lhc-calls-for-water-emergency",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:09:15.000Z"
}
