{
  "title": "Trump administration sent erroneous email ordering Ukrainians to leave - World - DAWN.COM",
  "author": null,
  "content": "Multiple Ukrainians legally in the United States under a humanitarian programme received an email this week telling them their status had been revoked and they had seven days to leave the country or the “federal government will find you”.\n\nA Department of Homeland Security spokesperson said on Friday the email had been sent in error and that the Ukrainian parole programme created after the 2022 Russian invasion of that country had not been terminated. It was not clear how many Ukrainians received the email.\n\nReuters reported last month that the Trump administration was planning to revoke temporary legal status for some 240,000 Ukrainians who fled the conflict with Russia. Such a move would be a reversal of the welcome Ukrainians received under President Joe Biden’s administration.\n\n“If you do not depart the United States immediately you will be subject to potential law enforcement actions that will result in your removal from the United States,” the Thursday email read.\n\n“Again, DHS is terminating your parole. Do not attempt to remain in the United States.”\n\nThe Department of Homeland Security sent a follow-up note on Friday, informing them that the order was in error and that “the terms of your parole as originally issued remain unchanged at this time”.\n\nOne Ukrainian parolee, who asked that her name not be used for fear of retribution from the US government, said she “couldn’t breathe normally and was uncontrollably crying” upon receiving the email.\n\nThe woman said she had renewed her immigration status last August and had been told that it was valid for another two years, and she racked her brain trying to figure out what she had done wrong to be booted from the US.\n\nShe could think of no reason, saying, “I don’t have as much as a parking ticket, don’t post on social media.” Angela Boelens, president of IA NICE, a non-profit in Iowa that has sponsored dozens of Ukrainians, said she knows of at least two women who received the letter, one of whom is pregnant.\n\n“It’s a very scary email. All of my families are in complete panic,” Boelens said.\n\n“I’d been telling people they would have time after a revocation notice. But this letter is very different.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T13:59:36.705Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902268/trump-administration-sent-erroneous-email-ordering-ukrainians-to-leave",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T09:24:08.000Z"
}
