{
  "title": "Israel kills Hamas commander in Lebanon attack - World - DAWN.COM",
  "author": null,
  "content": "SIDON: Israel killed a Hamas commander on Friday in a pre-dawn strike in the Lebanese port city of Sidon that also killed his son and daughter.\n\nLebanese Prime Minister Nawaf Salam condemned the strike as a “flagrant attack on Lebanese sovereignty” and a breach of the Nov 27 ceasefire with Israel.\n\n“Overnight, the (army and the domestic security agency Shin Bet) conducted a targeted strike in the Sidon area, eliminating the commander of Hamas’s western arena in Lebanon,” the Israeli military said in a statement.\n\nHamas’s military wing, the Ezzedine Al Qassam Brigades, confirmed in a statement released in Gaza that Farhat had been killed in the strike along with his son Hamza, who was also a member, and his daughter Jenan.\n\nAn eyewitness saw the fourth-floor flat still on fire after the strike, which caused heavy damage to the apartment block and neighbouring buildings, sparking panic in the densely populated neighbourhood.\n\nLebanese state media had reported the 3.45am (05:45am PKT) strike on Sidon, saying at least three people were killed.\n\n“A hostile drone raided a residential apartment… causing two successive explosions that led to a fire and extensive damage,” the state-run National News Agency reported.\n\nEmergency workers rushed to the scene where they recovered “the bodies of three martyrs”, NNA said.\n\nThe Lebanese prime minister called for “maximum pressure on Israel to force it to halt these continual attacks which target various districts, many of them residential areas”.\n\nIsrael struck south Beirut earlier this week, killing a Hezbollah Palestinian liaison officer in only the second raid on the capital since the November ceasefire between Israel and the Lebanese militant group.\n\nThe Lebanese health ministry reported four dead in that strike, including a woman.\n\nLebanese leaders condemned the attack, but Israel said it was in response to recent unclaimed rocket fire that Hezbollah says it had no hand in.\n\nHostilities between Israel and Hezbollah spiralled into all-out conflict last September, and the group remains a target of Israeli air strikes despite the November ceasefire.\n\nUnder the truce, Hezbollah is supposed to redeploy its forces north of the Litani River, about 30 kilometres from the Israeli border, and dismantle any remaining military infrastructure in the south.\n\nIsrael is supposed to withdraw its forces across the UN-demarcated Blue Line, the de facto border, but has missed two deadlines to do so and continues to hold five positions it deems “strategic”.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f0641c58739.gif",
  "retrievedAt": "2025-08-25T13:59:52.913Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902200/israel-kills-hamas-commander-in-lebanon-attack",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:09:44.000Z"
}
