{
  "title": "Mehmood Achakzai suggests five-nation moot on regional peace - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Pashtoonkhwa Milli Awami Party (PkMAP) chairman Mehmood Khan Achakzai has expressed serious concern over instability in the region and highlighted the need for a five-nation summit to ensure the area doesn’t become ‘a battleground for the big powers’.\n\n“The neighboring countries inc­luding China, Afghanistan, Iran and India should be invited to the conference to adopt a joint strategy for ensuring this region does not become a battleground in the future.”\n\nHe expressed these views while speaking at a large public gathering in Pishin’s football stadium.\n\nPTI general secretary Salman Akram Raja, Sunni Ittehad Council leader Sahibzada Hamid Raza, Pash­toonkhwa Milli Awami Party central secretary Nawab Muhammad Ayaz Khan Jogezai, ex-governor Sardar Latif Khosa, and Majlis Wahdat-i-Muslimeen leader Allama Raja Nasir also spoke at the public meeting.\n\nReferring to the issue of Afghan refugees, Mr Achakzai said they should be granted legal status rather than being forcibly expelled. He said many Pakistanis hold dual citizenship in countries like the UK, Germany, and Turkiye. He questioned why Afghans born and raised in Pakistan were being denied citizenship.\n\nHe said that the country, which is a federation of five different nations, is plunging deeper into crises. He said it should be clear to everyone that neither any nation was master nor slave of another.\n\n“Every general, citizen, woman, scholar, and even the world at large is aware of what transpired in the last elections. It is evident that PTI won the elections across the country, but shamelessly and brazenly, people in uniform altered the election results through sheer force, with the support of certain political parties,” he alleged.\n\nHe stated some generals compla­ined that members of Tehreek Taha­fuz-i-Ayeen Pakistan spoke harshly about them. He said they had no personal enmity with any general, scho­lar or individual. He said incarcerated PTI founder Imran Khan had committed neither any murder nor robbery.\n\nWhile acknowledging the necessity of the country’s military, generals, and intelligence agencies as its ‘eyes and ears,’ Mr Achakzai condemned their collusion with what he called “corrupt individuals, smugglers, and criminals”.\n\nHe called upon “honest police offi­cers and security personnel to refuse orders” to shoot their fellow countrymen on behalf of “corrupt rulers”.\n\nMr Achakzai stated that if law enforcement agencies failed to control lawlessness, people would have to take matters into their own hands. He urged every household to “contribute one person to fight” against alleged looters and criminals.\n\nReferring to the 2024 polls, the PkMAP leader claimed that PTI had won the general elections, but their mandate was stolen.\n\nHe asked Balochistan’s Chief Min­ister Sarfraz Bugti to order release of all political prisoners, including missing persons, as a goodwill gesture.\n\nHe said his movement stood with the oppressed, regardless of their political affiliations.\n\nMovement for justice\n\nCalling on PTI supporters, Mr Ach­a­kzai suggested that if necessary, he would step in as Mr Khan’s deputy to lead the movement for justice.\n\nHe urged PkMAP workers to prepare for a larger struggle and asked military, bureaucratic, and political leadership to admit past mistakes and commit to running the country under constitutional rule.\n\nHe asserted that the only path forward is for all institutions — military, judiciary, and media — to operate within constitutional boundaries, with parliament as the supreme authority.\n\nPublished in Dawn, April 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:00:06.701Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902208/mehmood-achakzai-suggests-five-nation-moot-on-regional-peace",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T00:09:27.000Z"
}
