{
  "title": "‘No one to return to’: Afghans fear Pakistan deportation - Pakistan - DAWN.COM",
  "author": null,
  "content": "Islamabad announced at the start of March that 800,000 Afghan Citizen Cards (ACC) would be cancelled — the second phase of a deportation programme which has already forced 800,000 undocumented Afghans across the border.\n\nBenazir Raufi stands alone in her restaurant, her staff and customers too afraid to visit after Pakistan’s government announced it was cancelling the residence permits of hundreds of thousands of Afghans.\n\n“If I’m deported, it will destroy me. Either my heart will stop, or I’ll take my own life,” 45-year-old Raufi, who was 13 years old when her family fled civil war in Afghanistan in the 1990s, told AFP.\n\n“Pakistan gave us our smile and now those smiles are being taken away.”\n\nTen Afghan women who worked for her have refused to leave home after the restaurant in Rawalpindi was raided by police — facing deportation to a country where women are banned from studying, certain jobs and visiting some public places like parks.\n\n“I have no one to return to. The Taliban won’t accept us,” Raufi added, her voice cracking.\n\nThe government’s deadline for ACC holders to leave voluntarily has been pushed back to April, but harassment by authorities has been underway for months, according to activists.\n\nThose born in Pakistan, married to Pakistanis, or living for decades in the country are among those to have their government residence permits cancelled.\n\nThe deportation campaign comes as political ties between the neighbouring governments have soured over Pakistan’s rapidly deteriorating security situation along the border.\n\n“Pakistan gave us our smile and now those smiles are being taken away.”\n\nLast year was the deadliest year in almost a decade in Pakistan, with more than 1,600 people killed in attacks — nearly half of them security forces personnel — according to the Islamabad-based Center for Research and Security Studies.\n\nPakistan accuses the Taliban government of failing to root out militants sheltering on Afghan soil, a charge the Taliban government denies.\n\nThe Taliban government has repeatedly called for the “dignified” return of Afghans to their country, with Prime Minister Hassan Akhund urging countries hosting Afghans not to force them out.\n\n“I have freedom (in Pakistan) — I can visit the park, and my daughter can go to school,” Dua Safay, who fled when the Taliban government returned to power in 2021.\n\n“There’s no future for me or my daughter in Afghanistan,” added Safay, whose real name has been changed.\n\nSome 600,000 Afghans have crossed the border into Pakistan since the Taliban government implemented their austere version of Islamic law.\n\n“They will be sent back to a country where conditions are extremely harsh, especially for women and children,” according to Moniza Kakar, a Pakistan-based human rights lawyer.\n\n“These people fled to escape persecution. Forcing them back into that fire is a violation of international law.”\n\nMillions of Afghans have travelled to Pakistan over the past four decades, fleeing successive conflicts including the Soviet invasion, a civil war and the post-9/11 US-led occupation.\n\nThe ethnic Pashtun belt of Khyber Pakhtunkhwa which borders Afghanistan shares close cultural and linguistic ties with Afghan Pashtuns.\n\nAround 1.3 million Afghans with resident cards issued by the UN Refugee Agency (UNHCR) are allowed to remain in the country but have been banned from the cities of Islamabad and Rawalpindi.\n\n“Over 1,000 people have been moved to detention centres in the past three to four days, while thousands are leaving voluntarily all over Pakistan,” Kakar added.\n\nMany families fear being mistreated or extorted for money by the authorities if they are detained, or of being separated from relatives.\n\n“If I have to go, I’ll go in tears, with a broken heart,” said 43-year-old Naimatullah, who was born in Pakistan and has never been to Afghanistan.\n\n“They [people] won’t even see me as an Afghan — they’ll call me Pakistani. I am a nobody.”\n\nAfter the deadline, Samiullah, who was born in an Afghan refugee camp in Pakistan and is married to a Pakistani woman, will be considered an illegal foreigner.\n\n“My wife will not be able to go with me, my daughters are from here. It is a constant struggle. I can’t get caught,” the 29-year-old told AFP.\n\nTens of thousands of Afghans living in Pakistan who are waiting to be relocated to Western nations also fear being deported.\n\nMost are advised by Western nations to cross into Pakistan where their asylum claims take months to be processed.\n\nAmong them is Samia Hamza, a 31-year-old women’s rights activist and mother of four, currently in the northwestern city of Peshawar.\n\n“They gave us a support letter but the Pakistani police does not recognise it,” she told AFP.\n\n“We need to stay one more month in Pakistan, then we will receive our visa to Brazil and leave. “",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/0511592330f0077.jpg",
  "retrievedAt": "2025-08-25T13:59:36.428Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902260/no-one-to-return-to-afghans-fear-pakistan-deportation",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T08:09:23.000Z"
}
