{
  "title": "President Zardari to be discharged from hospital within 48 hours: physician - Pakistan - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari’s personal physician and close aide Dr Asim Hussain on Saturday told reporters that the president is “medically fit” and will be discharged from hospital either tomorrow or the day after.\n\nAccording to a statement from the presidency on Wednesday, Zardari tested positive for coronavirus and was put in isolation. He has since been receiving treatment in Karachi.\n\nAddressing reporters in Karachi today, Dr Asim said that last Saturday, he received a call from the president saying he was ill.\n\n“He was going to attend Eid prayers,” Dr Asim said. “He described weakness and shivering. Based on his symptoms, I thought it was an infection in his urine, so I prescribed him medication.\n\n“On the evening of Eid day, I received a call that the president was very sick; he was very cold and had a fever, so I travelled to Nawabshah,” the physician continued. “I travelled to Nawabshah that night, but due to a lack of health facilities there, the president had to be moved to Karachi.”\n\nAccording to Dr Asim, Zardari was brought to Karachi early on Monday morning and he was subjected to multiple tests.\n\n“The results showed that he had corona (coronavirus), the markers were pointing that way,” the doctor said, adding that the treatment immediately started and that certain drugs were ordered from overseas.\n\n“There are some antiviral drugs that are not available in Pakistan, so they were ordered from abroad and administered to the president,” the physician said. “Gradually, his markers and condition improved and he is feeling better.\n\n“He will definitely be discharged within the next 48 hours,” Dr Asim stated, adding that he is “medically fit” and being examined by specialists. “This speculation should come to an end.”\n\nWhen asked about the virus that infected the president, Dr Asim said that it is another variant of the illness which “is not as hard” as Covid-19 and can be treated with antiviral medication.\n\n“Coronavirus is still in Pakistan,” he added. “It is not in its lethal form but it is still here.”\n\nResponding to a question about the president’s perceived physical weakness, the physician did not reveal details but mentioned that the president still deals with blood pressure issues and diabetes.\n\nWhen asked about rumours of the president’s death, Dr Asim quickly dismissed them as “AI-created” and “fake”, urging to “stay away from these people [who spread them]”.\n\nAt 69 years of age, President Zardari has had multiple health issues in recent years.\n\nHe tested positive for Covid-19 in July 2022 but only experienced “mild symptoms”, according to his son and PPP Chairman Bilawal Bhutto-Zardari.\n\nThe president had fractured his foot while deboarding an aeroplane in October 2024. Following the fall, he was immediately taken to a hospital for treatment. After a check-up, the doctor placed his foot in a cast.\n\nIn March 2023, he underwent an eye surgery in the United Arab Emirates.\n\nIn 2022, Zardari was admitted to Karachi’s Dr Ziauddin Hospital for one week for treatment of a chest infection. Amid rumours of ill health, his personal physician Dr Asim had confirmed that he was “in good health”.\n\nA year prior to that, Zardari was admitted to a private hospital in Karachi due to “exertion and exhaustion” caused by his frequent travelling.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/05163415f94b9c8.jpg",
  "retrievedAt": "2025-08-25T13:59:37.815Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902282/president-zardari-to-be-discharged-from-hospital-within-48-hours-physician",
  "dateList": "2025-04-05",
  "date_published": "2025-04-05T12:13:19.000Z"
}
