{
  "title": "Governor GB calls on IT Minister, discusses matters relating to broadband services, spectrum auction",
  "link": "https://www.app.com.pk/national/governor-gb-calls-on-it-minister-discusses-matters-relating-to-broadband-services-spectrum-auction/",
  "date_published": "2021-08-04T15:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): Governor Gilgit Baltistan Raja Jalal Hussain Maqpoon Wednesday called on Federal Minister for IT and Telecommunication Syed Amin Ul Haque and discussed matters relating to broadband services, connectivity and spectrum auction.\nThe Minister welcomed Governor Gilgit Baltistan and said that under the Digital Pakistan vision, no region including Gilgit Baltistan would remain deprive of digitalization.\nMinister IT Gilgit Baltistan Hussain Shah was also present on the occasion.\nThe Federal Minister said that all the provinces including Gilgit Baltistan and Azad Jammu Kashmir had been incorporated in the projects of the Ministry of IT and Telecom. He said that it was for the first time that the spectrum auction gets approved for Gilgit Baltistan and Azad Jammu Kashmir. Broadband and mobile services will improve in GB and AJK due to additional spectrum auction, he added.\nSyed Amin Ul Haque said that the Universal Service Fund (USF) outreach would be extended to Gilgit Baltistan by fulfilling all the legal requirements and added, the broadband services projects will be started on tourist points soon.\nHe noted that Gilgit IT Park played important role in very short time. Software technology parks will be inaugurated at Sakurdu, Baltistan and Hunza, he added.\nThe Federal Minister said that the process for provision of telephone, internet and cable under triple bundle services in GB was in final phase. A smart policing project has been extended to Gilgit Baltistan and 60 percent work has been completed on it, he added.\nSpeaking on the occasion, Governor Gilgit Baltistan Raja Jalal Hussain Maqpoon said that the steps being taken by Ministry of IT for fulfilling Digital Pakistan vision were laudable.\nHe said that the GB government wanted furthering of the role of IT and telecommunication in Gilgit Baltistan. He hoped that the projects of the Ministry of IT would bring technology revolution in GB.",
  "retrievedAt": "2025-08-11T21:02:16.155Z"
}
