{
  "title": "Today marks two years of India’s illegal actions in IIOJK",
  "link": "https://www.app.com.pk/national/today-marks-two-years-of-indias-illegal-actions-in-iiojk/",
  "date_published": "2021-08-04T17:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): Federal Minister for Kashmir Affairs and Gilgit Baltistan Ali Amin Khan Gandapur said that today marked two years of India’s illegal and unilateral actions of August 5, 2019 in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), which were in violation of several UNSC resolutions and the international law.\nIn a massage regarding, ‘Youm-e- Istehsaal’ he said that neither Kashmiris nor Pakistan or the international community would accept these actions as India concomitantly unleashed an unprecedented campaign of repression against Kashmiris causing enormous human suffering.\nIndia’s military siege of IIOJK- with more than 900,000 troops – has lasted for two years now. Since then, hundreds of Kashmiris have been killed, most often in fake ‘encounters’. The only crime of the innocent Kashmiri youth summarily executed by Indian occupation forces is their demand for freedom from Indian yoke.\nIndia must know that Kashmiris have a glorious history of standing up for their rights and not bowing down before the Indian occupation forces. Kashmiris have resisted Indian occupation for more than seven decades and will continue to stand their ground no matter what.\nKashmiri leadership remains incarcerated under trumped-up charges. Extra- judicial killings, arbitrary detentions, staged cordon- and- search operations and custodial torture by Indian Occupation Forces continue with impunity in IIOJK. The weak, the elderly and sick as well as women and children have suffered the most in the past two years.\nSince December 1989, when the present phase of Kashmiri struggle commenced, around 100,000 Kashmiris have been martyred, more than 22,000 women widowed, and 108,000 children orphaned. Over 12,000 Kashmiri women have been robbed of their honour.\nThe Jammu and Kashmir dispute between Pakistan and India is an internationally recognized dispute which has been on the agenda of the United Nations Security Council since January 1948.\nIn the past two years, the government of Prime Minister Imran Khan has undertaken enormous efforts to firmly oppose the unilateral and illegal Indian actions of August 2019 in IIOJK and unequivocally support the rights of oppressed Kashmiris at all forums. Pakistan has raised the Kashmir issue at every forum including the UN and bilaterally in important world Capitals.\nThrough our Government’s determined efforts and diplomacy, the Jammu and Kashmir dispute was deliberated by the UN Security Council thrice. Such consultations on Kashmir dispute had not happened in the past 55 years. Indian mantra of Kashmir being “internal” matter of India has been repudiated decisively.\nWe have witnessed increased awareness in the world community of the festering dispute and India’s evident atrocities in IIOJK. International human rights and humanitarian organizations, world parliaments as well as international media of repute, have highlighted the issue of Jammu and Kashmir and the dire human rights situation in IIOJK.\nThe United Nations Office of High Commissioner for Human Rights (OHCHR), the OIC,  UN Secretary General, and many world leaders have expressed support for Kashmiris.\nWe call upon India to immediately lift the ongoing siege of Kashmiri population in IIOJK and stop all human rights violations as well as release all political prisoners, especially the leadership of All Parties Hurriyat Conference (APHC), the true representatives of Kashmiris.\nPakistan firmly believes that a just and peaceful settlement of the Jammu and Kashmir dispute, in accordance with relevant UN Security Council resolutions and the wishes of the Kashmiri people, will ensure durable peace and stability in South Asia.\n“As the Minister for Kashmir Affairs and as a worker of Prime Minister Imran Khan’s party dedicated to the Kashmir cause, I reassure my Kashmiri brothers and sisters that Pakistan remain unwavering in its support to Kashmiris in their just struggle for their right to self-determination,” he added.",
  "retrievedAt": "2025-08-11T21:02:13.651Z"
}
