{
  "title": "‘Punjab Privileges (Amendment) Bill merits objections’; says Governor",
  "link": "https://www.app.com.pk/national/punjab-privileges-amendment-bill-merits-objections-says-governor/",
  "date_published": "2021-08-03T19:34:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 04 (APP):Governor Punjab Chaudhry Mohammad Sarwar has said his objections to the Punjab Assembly Privilege (Amendment) Bill 2021 were neither to please anyone nor does he take dictation from anyone.\nTalking to the media persons on the sidelines of First Digital Health Conference at a local hotel here on Wednesday, he said the government was making all decisions in national interest rather than in the interest of some other country, adding that the power of prosecution should be vested in the judges only and not the parliamentarians.\nGovernor Punjab Chaudhry Mohammad Sarwar said Speaker Punjab Assembly Chaudhry Parvaiz Elahi was a reliable ally of the Pakistan Tehreek-e-Insaaf (PTI) and there were two more years of the alliance ahead.\nTo a question, he said Pakistan had been playing historic role in the Afghan peace process since day one and wars were not solution to any problem, adding that the world witnessed that the United States (US) failed in Afghanistan despite the 18-year war and negotiations were the only solution.\nRegarding the Punjab Privileges (Amendment) Bill passed by the Punjab Assembly, he stated the Punjab Assembly had re-passed the Privilege Bill so he could not object to it. He further said no one should have the powers except the courts to punish someone and reservations of Speaker Chaudhry Pervaiz Elahi will be worked out.\n“I would not further comment on it as he doesn’t not want to say anything that would make matters worse with the allies”, he said.\nHe said the future of digital health was very bright and Pakistan’s Digital Health Conference in Lahore was a welcome step. He said that this conference would also help in health policy and reforms.\nHe said that the government was taking practical steps to develop the health sector, adding that free health facilities were being provided to the deserving people through Health Insaf Cards in the whole country including Punjab. Stressing the benefits of modern technology, he said that during COVID-19, the helpline provided health care to millions of people at home and the present government was taking practical steps to provide health facilities to the people, adding that relief will be given to the people in every sector.\nIn his message on Police Martyrs’ Day, the Governor of Punjab paid homage to the everlasting sacrifices of the police officers and personnel and said that the police had played an exemplary role for peace and security of the people. He said the nation was indebted to those heroes who laid down their lives to protect the country, adding that the security agencies including police had played vital role to counter terrorism and police had proved that this was a strong professional force to play full role in counter-terrorism along with other security agencies.\nGovernor Punjab Chaudhry Mohammad Sarwar said the police officers sacrificed their lives for the peace in the country, adding that the police martyrs had created a history of bravery and courage with their blood.",
  "retrievedAt": "2025-08-11T21:02:26.609Z"
}
