{
  "title": "Shibli for making Environment Regulatory Authority to ensure environmental governance",
  "link": "https://www.app.com.pk/national/shibli-for-making-environment-regulatory-authority-to-ensure-environmental-governance/",
  "date_published": "2021-08-04T10:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): Federal Minister for Science and Technology, Senator Shibli Faraz Wednesday called for creating an Environment Regulatory Authority to ensure effective environmental governance and adoption of effective safety standards in use of plastic made commodities.\nThe regulatory authority can keep check on the effects of low quality plastic bags, toys, bottles, second hand equipments which are not good for health and environment and take strict measures for restraining production of such items at industrial level.\nThe federal minister was speaking to media after attending the first seminar on the “Challenges and Strategies for Effective Plastic Waste Management to Improve Human Health” here organized by Pakistan Science Foundation (PSF), UNESCO, UNDP and other partners.\nHe said that the seminar was aimed at gathering the experts and having a brainstorming session to envisage strategies for environment protection through plastic waste management.\nHe said the way Prime Minister, Imran Khan and the relevant ministry were taking forward the environment sector with a strong commitment; no one did in the past.\nEarlier, addressing the event, the federal minister said that improper plastic waste disposal create significant adverse affects on the environment.\nHe said that young scientists, UNESCO and PSF must join hands to make conscious efforts for the betterment of the environment.\nHe stated that applied research holds great potential and importance for effective waste management in Pakistan making it an environmentally responsible country.\nHe said plastic waste poses a serious threat to human life and causes hepatitis, cancer, lung and kidney diseases. “The issue is not the use of plastic but destroying it after use”, he added.\nThe federal minister said that he wants a public awareness campaign to be run on plastic waste and his ministry will extend full support to the awareness campaign.\nHe said that that Ministry of Science and technology would provide support for waste management through new technology.\nShibli Faraz said that the Prime Minister Imran Khan himself was taking steps for preserving environment on priority and launched the Billion Tree Project as a part of such endeavours.\nSpeaking on the occasion, Country Director, UNESCO, Patricia McPhillips said the use of plastics has increased due to vast production on earth while the lack of awareness regarding disastrous effects of plastic pollution is a one of the main reasons of increased pollution.\nShe said that UNESCO and UNDP have set up a plastic waste management plant in Islamabad while UNESCO is also working for disseminating awareness on plastic waste management among students.\nThe PSF arranged an inter-university competition to develop low cost recycling machinery. The federal minister presented awards to the winner, Institute of Space Technology, and the runners up, Pakistan Institute of Engineering and Applied Sciences.",
  "retrievedAt": "2025-08-11T21:02:23.761Z"
}
