{
  "title": "Sadiq Sanjrani, Bagher Ghalibaf call for further expanding economic, commercial ties",
  "link": "https://www.app.com.pk/national/sadiq-sanjrani-bagher-ghalibaf-call-for-further-expanding-economic-commercial-ties/",
  "date_published": "2021-08-04T17:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): Chairman Senate of Pakistan Muhammad Sadiq Sanjrani and Speaker of Islamic Consultative Assembly Muhammad Bagher Ghalibaf in a meeting on Wednesday stressed upon the need to strengthen cooperation between two countries in diverse fields with emphasis on expanding economic and commercial ties.\nMembers of the Parliament and Pakistan-Iran Friendship Group were also present during the meeting said a news release received here from Tehran.\nThe Speaker emphasized on close historical, religious and cultural ties between Pakistan and Iran.\nBoth sides emphasized the need to promote Parliamentary exchanges to deepen common understanding on various issues.\nChairman Senate appreciated collaboration between the Parliamentary Friendship Groups of the two countries. He reiterated the invitation to Speaker Ghalibaf to visit Pakistan at his earliest convenience.\nChairman Senate held a detailed discussion with Speaker Ghalibaf on a wide range of regional and international issues, including Afghanistan, Middle East and JCPOA.\nFormation of border markets to facilitate trade between the two countries was appreciated during the meeting. Concerns were expressed over disruption of power supply from Iran to Gwadar, Turbat, and Panjgoor since 6th July 2021 and lately to Makran division. The two sides also reaffirmed their commitment to make joint efforts to combat the increasing trend of Islamophobia and promote regional and international peace and stability.\nDuring the meeting, the Chairman Senate highlighted two critical issues pertaining to power outages on the border areas and the opening of border routes for border trade.\nThe Chairman Senate underscored that power outage on the border areas was a problem of great concern.\nThe Iranian officials expressed readiness to resolve the power issue on the border area at the earliest.\nIt was also agreed to open six border routes for border trade in which three routes will be opened at once while the remaining three trade routes will be opened later in appropriate time.\nTaking note of the commemoration of Youm-e-Istehsaal on August 5, Speaker Ghalibaf reiterated Iran’s commitment to support the Kashmiris in their just struggle against oppression and for their inalienable right to self-determination.\nChairman Senate appreciated the consistent support extended by Iranian leadership to the people of Kashmir. The Senate Chairman thanked the Iranian Speaker for assuring a solution to the problem correlating to power outages.",
  "retrievedAt": "2025-08-11T21:02:15.460Z"
}
