{
  "title": "ICT admin conducts anti-encroachment operation in Blue Area; holds 8 violators",
  "author": null,
  "content": "ISLAMABAD, Jun 18 (APP):The Islamabad Capital Territory (ICT) administration on Wednesday conducted operation against illegal encroachments in the city’s busy Blue Area with several arrests were made and illegal setups dismantled.\nAssistant Commissioner City, Maheen Hassan, led a joint operation with the Directorate of Municipal Administration (DMA) in Blue Area. The team removed encroachments established outside commercial plazas and inside public corridors.\nDuring the operation, four shopkeepers were arrested for setting up stalls and placing goods in pedestrian corridors, disrupting public access and violating regulations.\nIn a separate move, four individuals providing unauthorized car wash services on public property were also detained and shifted to the local police station for further legal action.\nAccording to the district administration, these actions are part of a broader plan to reclaim public spaces and ensure smooth pedestrian movement in the city’s commercial zones.\nOfficials said that the presence of makeshift stalls, items placed on pavements, and illegal setups outside shops not only cause inconvenience but also violate municipal laws.\nIn this regard, Deputy Commissioner Islamabad, Irfan Nawaz Memon, has directed that the anti-encroachment campaign be extended to all sectors and markets of the capital. He instructed all assistant commissioners to conduct regular inspections and ensure their areas are free from unlawful occupation of public spaces.\nThe administration has reiterated that operations against such violations will continue and that no one will be allowed to obstruct public pathways or misuse government land for private gain. Shopkeepers and vendors have been warned to confine their businesses within their allotted premises or face legal consequences.\nOfficials from the DMA stated that similar joint operations are planned in other commercial centers of the city, including G-9 Markaz, F-10 Markaz, and Aabpara Market. The aim is to restore the original structure and utility of footpaths, public spaces, and corridors in the capital.\nThe district administration has also called on citizens to cooperate by reporting illegal encroachments and helping maintain an organized and accessible urban environment.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:12:03.633Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ict-admin-conducts-anti-encroachment-operation-in-blue-area-holds-8-violators/",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T12:24:00.000Z"
}
