{
  "title": "Religious affairs ministry set to launch early registration for Hajj 2026 pilgrims",
  "author": null,
  "content": "ISLAMABAD, June 18 (APP): The Ministry of Religious Affairs and Interfaith Harmony is finalizing preparations to begin early registration for Hajj 2026 within the next few days, official sources confirmed on Wednesday.\nIn a move for streamlining the pilgrimage process, the ministry has made advance registration mandatory for all intending pilgrims under both the government and private Hajj schemes.\nAccording to sources, applicants will be required to submit a specific amount as a token money along with their registration forms. This amount will be adjusted against the total cost of the Hajj package at a later stage. Only those who complete the registration process will be considered eligible for Hajj 2026, sources added. Registration will be facilitated through designated banks across the country.\nAfter completing registration, pilgrims will have the option to choose between the government-run or private Hajj schemes.\nSources also revealed that individuals who missed out on Hajj 2025 under the private scheme will also be required to register afresh to be eligible for the Hajj 2026.\nThe initiative comes in response to a directive from Saudi Arabia’s Ministry of Hajj and Umrah, which has signaled the commencement of preparations for Hajj 2026. “The registration data will be shared with the Saudi authorities, who will use it to allocate Pakistan’s official Hajj quota,” an official said.\nA formal advertisement outlining the registration process and requirements is expected to be issued within the next a couple of days, marking the beginning of the nationwide campaign.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:10:51.620Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/religious-affairs-ministry-set-to-launch-early-registration-for-hajj-2026-pilgrims/",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T16:26:00.000Z"
}
