{
  "title": "IHC judges transfer case enters into significant phase",
  "author": null,
  "content": "ISLAMABAD, Jun 18 (APP):Hearing of the petitions regarding transfer of judges to Islamabad High Court entered into a significant phase as Advocate General Punjab concluded his arguments and the parties expressed to conclude their rebuttal in a short while. The Court then adjourned further hearing for tomorrow.\nThe five member Constitutional Bench of the Supreme Court of Pakistan, headed by Justice Muhammad Ali Mazhar, was hearing the petitions against transfer of judges to Islamabad High Court.\nAdvocate General Punjab Amjad Pervez, Attorney General Mansoor Usman Awan, and Pakistan Tehreek-e-Insaf (PTI) founder’s counsel Idrees Ashraf appeared before the court.\nAdvocate General Amjad Pervez presented a historical and constitutional background on the issue of judicial transfers and seniority. He cited the 1955 One Unit formation under the Governor General’s order, where multiple high courts were merged into a single court while retaining judges’ previous service records and determining their seniority based on appointment dates.\nHe further explained that after the dissolution of the One Unit in 1970, judges were reassigned to various high courts while preserving their past service. Similarly, when Sindh and Balochistan high courts were separated in 1976, judges’ seniority was again maintained during the transition.\nHowever, Justice Naeem Akhtar Afghan remarked that the present case differs significantly as no new court was created nor was any high court dissolved. He said the IHC judge transfers do not involve such fundamental institutional changes, making past precedents less directly applicable.\nJustice Naeem Akhtar Afghan asked whether a judge’s transfer under Article 200 of the Constitution is considered permanent or temporary. The Attorney General responded that such transfers are permanent.\nAmjad Pervez elaborated the duration of transfers and the constitutional authority of the President in such matters.\nJustice Shakeel Ahmed also noted that the transfer summary lacked any mention of “public interest.” Pervez responded that the term “public interest” is not mentioned in Article 200 either.\nAfter the Advocate General concluded his arguments, PTI counsel Idrees Ashraf began his submissions. Toward the end of the hearing, the court asked how much more time the parties would require. Ashraf requested 15 minutes, as did the Attorney General.\nJustice Afghan recalled the Zulfiqar Ali Bhutto case, noting that prolonged arguments in that matter led to significant delays, even resulting in judges retiring and the bench composition changing.\nThe court then adjourned the case until Thursday, June 19. Idrees Ashraf will continue his arguments, followed by the Attorney General concluding his submissions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:12:24.031Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ihc-judges-transfer-case-enters-into-significant-phase/",
  "dateList": "2025-06-18",
  "date_published": "2025-06-18T11:17:00.000Z"
}
