{
  "article_id": "2025-06-09_e82aca3aacba9df68c0bda4681ad085d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/hec-launches-major-reforms-and-development-projects-to-strengthen-higher-education-in-pakistan/",
    "retrieved_at": "2025-08-27T10:56:44.283Z"
  },
  "metadata": {
    "title": "HEC launches major reforms and development projects to strengthen higher education in Pakistan",
    "author": null,
    "date_published": "2025-06-09T15:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 341,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 9 (APP):The Higher Education Commission (HEC) has continued its pivotal role in shaping the future of higher education in Pakistan through strategic reforms and targeted investments in the sector. Since its inception in 2002, the HEC has aimed to expand access, improve quality and align higher education with the countryas developmental needs. According to the Economic Survey 2024-25 released on Monday, despite progress in increasing enrollment, Pakistan still trails behind global standards, prompting renewed efforts during FY 2025 to bridge the gap. Between July and March of FY 2025, the HEC spearheaded a wide range of initiatives under the Public Sector Development Programme (PSDP) 2024a25, backed by a federal allocation of Rs 61.12 billion. This funding supports 159 development projects, including 138 ongoing and 21 new initiatives across public sector universities. Notably, Rs 12 billion has been dedicated to Phase-IV of the Prime Ministeras Youth Laptop Scheme, while Rs 9 billion has been retained specifically for this program. Key projects include the establishment of five National Centers in cutting-edge fields such as Nanotechnology, Quantum Computing, Advanced Manufacturing, Brand Development, and a Growth Center. Other major efforts comprise the launch of the PMas National Volunteer Corps, the creation of the National Institute of Intelligence and Security Studies (NIISS), and the National Cyber Security Academy (NCSA). Aligned with the national vision aURAAN Pakistan,a the HEC is focusing on accelerating the development of human capital and modernizing IT infrastructure within the higher education system. This includes provisioning of 100,000 laptops to students, and deploying high-tech solutions like Centralized Data Centers, High Performance Computing (HPC), Enterprise Resource Planning (ERP) for universities, Learning Management Systems (LMS), and Smart Campuses and Classrooms. Moreover, under the aEquity and Empowermenta theme, HEC has prioritized expanding access and improving quality in underserved regions such as Balochistan, Southern Punjab, Interior Sindh, Merged Areas of Khyber Pakhtunkhwa, AJK, and Gilgit Baltistan. As of April 2025, Rs 32.6 billion has already been disbursed for university development projects, with 26 projects scheduled for completion this fiscal year and 18 already fully funded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}