{
  "article_id": "2025-06-09_39f6986cb3fceb790ee4bfbe1633c43e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ppib-to-reduce-dependence-on-imported-fuels/",
    "retrieved_at": "2025-08-27T10:56:18.518Z"
  },
  "metadata": {
    "title": "PPIB to reduce dependence on imported fuels",
    "author": null,
    "date_published": "2025-06-09T16:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 411,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 9 (APP):Pakistan is steering its power sector towards more secure and sustainable future by scaling up the use of local and renewable energy sources. Tasked with attracting private investment in power generation and transmission, the Private Power and Infrastructure Board (PPIB) is working to reduce dependence on imported fuels while expanding the use of local and renewable energy sources. According to Pakistan Economic Survey 2024-25 unveiled by the Finance Minister, Senator Muhammad Aurangzeb here Monday, the PPIB has played a central role in establishing 101 Independent Power Producers (IPPs), delivering 25,841 MW to the national grid and drawing over US $35 billion in foreign investment. More than 4,700 MW of this capacity comes from renewable sources including hydropower, solar, wind, and bagasse. The successful launch of the Matiari-Lahore high-voltage transmission line also marked a major milestone, financed entirely by the private sector. Currently, 88 IPPs under PPIB's guidance are operational, producing over 20,000 MW-nearly 60 percent of the country's total grid capacity. A transition is underway, with a shift from imported fuel to local resources. This includes a portfolio of 19 new multiple fuels/technologies based IPPs totaling 6,536 MW, of which 84 percent are renewable. One of the major achievements is the commissioning of the 884 MW Suki Kinari hydropower project, now operational since September 2024. It is expected to contribute over 3 billion units of electricity each year. Similarly, a 32 MW bagasse-based plant is nearing completion, promising to add clean energy to the grid. Certification of solar installers has also ramped up, PPIB certified 149 new solar PV installers during FY 2025 (July-February) and reached 689, enabling over 143,000 new installations with a total capacity above 2,113 MW. Competitive bidding for private solar projects is underway. Feasibility and environmental studies have been completed for 1x600MW solar PV project in Kot Addu/Muzaffargarh and 1600 MW solar PV project at Jhang. In Gilgit-Baltistan, PPIB is supporting integration into the national energy network, with major hydropower projects under development. PPIB is also driving solar deployment through a government-approved framework. It includes projects to replace expensive imported fuels, solarize 11 kV feeders, and equip public buildings with solar systems. Over 400 public buildings are already in process under lease or self-financed models. Pakistan is also tapping into its 175 billion-ton Thar coal reserves. So far, five Thar coal-based IPP's projects producing 3,300 MW have come online. The government has took the initiative to substitute imported coal based IPP's with Thar coal.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}