{
  "article_id": "2025-06-09_333359a161da3459e8a2017e8c6ca4c1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/navttc-drives-youth-empowerment-through-landmark-skill-development-initiatives/",
    "retrieved_at": "2025-08-27T10:57:07.461Z"
  },
  "metadata": {
    "title": "NAVTTC drives youth empowerment through landmark skill development initiatives",
    "author": null,
    "date_published": "2025-06-09T15:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 267,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 9 (APP):The National Vocational and Technical Training Commission (NAVTTC) with a mandate to enhance national productivity and expand workforce exports, is playing a critical role in equipping youth with globally competitive skills aligned with international market demands. According to Economic Survey 2024-25 released on Monday, Pakistan's demographic advantage-with a significant portion of the population under 30-has prompted the government to launch and scale up national skill development programs. Among the key accomplishments in fiscal year 2024, 51,833 youth completed the Prime Minister's Youth Skill Development Program (PMYSDP) Batch 1. Special training initiatives in Azad Jammu and Kashmir and Gilgit-Baltistan trained a combined 3,007 individuals across two batches. The \"Summer of Code\" trained 4,780 students, while 338 completed High Impact IT Training in 16 federal colleges. In a major step toward inclusivity, 2,580 madrassa students received vocational training, and 650 women were empowered under the \"She Fixes\" initiative. Foreign language courses trained 825 individuals in partnership with NUML and FDE, and advanced training in chip design and high-tech skills was completed by students from GIKI and NUST. A total of 600 youth from the Newly Merged Districts (NMDs) also received technical training. Under the Takamol Skill Verification initiative, 54,479 individuals were certified in 75 trades across 32 centers nationwide. Additionally, 1,196 youth graduated from the End-to-End Skill Program, further contributing to the development of a skilled and adaptable workforce. To support these efforts, the government allocated Rs 15,000 million for PMYSDP (2023-26), Rs 4,700 million for NAVTTC's Skill Development Program, and Rs 9,877 million under the \"Skill for All\" initiative through the Public Sector Development Program.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}