{
  "article_id": "2025-06-09_6ed38112dc5d4726f6834cc4b0f1129d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/over-860000-women-and-children-benefit-from-benazir-nashonuma-programme-during-fy-2025/",
    "retrieved_at": "2025-08-27T10:57:33.049Z"
  },
  "metadata": {
    "title": "Over 860,000 women and children benefit from Benazir Nashonuma Programme during FY 2025",
    "author": null,
    "date_published": "2025-06-09T14:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 317,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 9 (APP):As part of the government's broader strategy to combat malnutrition and strengthen human capital, the Benazir Nashonuma Programme has enrolled a total of 860,615 beneficiaries across the country during the FY 2025 (July-March). As per Pakistan Economic Survey 2024-25 presented by the Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb on Monday, these beneficiaries include 480,290 children and 380,325 pregnant women (PW). Launched in 2020 under the Benazir Income Support Programme (BISP), the initiative has become a vital lifeline for vulnerable populations, particularly pregnant and lactating women (PLW) and children under the age of two. The programme is currently operational in 158 districts through 559 facilitation centres, providing Conditional Cash Transfers (CCTs) linked to health checkups, immunization, and nutrition awareness. The disbursements include Rs 3,000 per boy and Rs 3,500 per girl per quarter, with specialized nutritious food such as Maamta for mothers and Wawamum for children also being provided. According to the breakdown, Sindh recorded the highest number of beneficiaries at 305,841, including 174,041children and 131,800 pregnant women. Khyber Pakhtunkhwa (KP) followed with 222,901 beneficiaries, including 123,987 children and 98,914 pregnant women. Punjab reported 165,521 beneficiaries, while Balochistan accounted for 142,179, and Gilgit-Baltistan and Azad Jammu and Kashmir saw 13,167 and 9,544 beneficiaries, respectively. A total of 1,462 individuals were enrolled in the federal capital. The programme also aims to improve adolescent girls' health (ages 15-19) in vulnerable Kafalat households across six districts. It provides iron and folic acid supplements, nutrition education, and a quarterly stipend of Rs 1,500. This expanded intervention focuses on the full 8,000-day window of life, recognizing the foundational impact of early health and nutrition on long-term economic outcomes. As the burden of child malnutrition remains alarmingly high in Pakistan-with stunting at 40.2%, underweight at 28.9%, and wasting at 17.7%-the Benazir Nashonuma Programme stands as a critical national investment in the country's future human capital and economic productivity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}