{
  "article_id": "2025-06-09_ac0a6c6584dea82817f974308470593e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/over-186000-households-registered-through-bisp-mobile-vans-in-remote-areas/",
    "retrieved_at": "2025-08-27T10:56:42.707Z"
  },
  "metadata": {
    "title": "Over 186,000 households registered through BISP mobile vans in remote areas",
    "author": null,
    "date_published": "2025-06-09T15:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 196,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 9 (APP):A total of 186,262 households have been registered through Mobile Registration Vans (MRVs) introduced by the Benazir Income Support Programme (BISP) in underserved and remote regions of Pakistan during the FY 2025, significantly improving access to social protection services for vulnerable communities. According to the Pakistan Economic Survey 2024-25 unveiled by the Finance Minister, Senator Muhammad Aurangzeb here Monday, the BISP has deployed 25 MRVs across the country, including 18 in Balochistan, five in Sindh, one in Khyber Pakhtunkhwa and one in Islamabad Capital Territory. These specially equipped mobile units enable on-site registration of deserving families, especially in areas with limited or no access to traditional BISP registration centers. The initiative reflects the BISP's commitment to inclusive and responsive service delivery, ensuring that communities in far-flung and geographically challenging areas are not excluded from essential government support systems. The deployment of MRVs has proven particularly effective in Balochistan and Sindh, where the majority of new registrations have taken place. By leveraging mobile infrastructure, the BISP continues to bridge gaps in accessibility and empower marginalized populations, aligning with the government's broader goal of extending the reach and impact of social safety nets across Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}