{
  "title": "NCOC to launch National TTQ Strategy for containing COVID-19",
  "link": "https://www.app.com.pk/national/ncoc-to-launch-national-ttq-strategy-for-containing-covid-19/",
  "date_published": "2020-04-23T00:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP):The National Command and Operation Centre (NCOC) on Thursday decided to launch the National Test, Track and Quarantine (TTQ) Strategy devised for effective diagnosis of the COVID-19 patients to contain the pandemic.\nThe NCOC, which met with Minister for Planning, Development, and Special Initiatives Asad Umar in the chair, resolved to implement the national strategy during the ongoing week whereas the provincial leadership would brief the Centre on TTQ pilot project outcomes and implementation plan on Friday.\nThe National TTQ Strategy is aimed at collecting blood samples of people in bulk whereas the persons, who have come in contact with the coronavirus positive patients will be tracked and quarantined.\nThe meeting was informed that the provinces, including the Azad Jammu and Kashmir (AJK) and Gilgit Baltistan (GB), had agreed on the National TTQ Strategy and they would ensure its implementation.\nThe Ministry of Health and experts pointed out in the meeting that keeping in view the increasing trend of COVID-19 positive cases, there was need to focus on ensuring critical medical equipment to cope with the patients load.\nAsad Umar directed to improve the mechanism of incorporating the details of suspected patients into the database of COVID-19 patients.\nHe said all the provincial chief ministers, health ministers and chief secretaries had been taken into confidence on the National TTQ Strategy. The provinces had implemented the TTQ pilot project and the provincial leadership had been asked to apprise the Centre on its outcomes and present their implementation plan.\nPrime Minister’s Focal Person on COVID-19 Dr Faisal Sultan said the provinces were briefed on the TTQ strategy, which had made no objection on it.\nHe said the provincial leadership maintained that the recent reported deaths due to COVID-19 were not mainly due to the epidemic. In order to clear the doubts, chest X-rays and radio images of the dead patients should be reviewed, he added.\nAsad Umar said at present only reactive and symptomatic patients’ tests were being conducted which was due to the reason that implementation of the TTQ strategy was in its pilot phase and its complete implementation would boost the testing capacity to 20,000 per day.\nNCOC Chief Coordinator Lieutenant General Hamood Uz Zaman said the provincial apex committees might take the lead role for the better implementation of National TTQ Strategy.\nNational Institute of Health (NIH) Executive Director Major Aamir Ikram said under the pilot project of TTQ strategy, NIH teams had collected blood samples of people in Bara Kahu through door to door campaign for conducting tests. There was a total capacity of 6,500 tests per day at the moment which would increase to 20,000 after implementation of the TTQ strategy.\nMinister for Interior Brig (R) Ejaz Ahmad Shah, Minister for Economic Affairs Khusro Bakhtiar, Minister for Industries and Production Hammad Azhar, Minister for National Food Security Fakhar Imam, Special Assistant to the Prime Minister on Health (SAPM) Dr Zafar Mirza, SAPM on Commerce and Investment Abdul Razak Dawood, NDMA deputy chairman and other officials also attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:08:22.037Z"
}
