{
  "title": "Alachisoft increases workforce despite phase of COVID-19",
  "link": "https://www.app.com.pk/national/alachisoft-increases-workforce-despite-phase-of-covid-19/",
  "date_published": "2020-04-22T22:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP):A tech company Alachisoft is increasing its workforce while implementing successful virtualization and work from home polices during the current phase of COVID-19\nThe current effects of the Covid-19 on most global economy includes a subsequent combination of closed businesses, companies downsizing and mass layoffs but Alachisoft has focused on hiring and training employees instead of letting them go.\nThe shift in hiring for the company seems to focus on utilizing the full package of a candidate’s skills and encouraging training and learning in more than one area of business. It is because the company has a focus on training candidates based on their full skill set rather than just the ones needed for a specific role, that their employee contribution and productivity is so high\nAlachisoft is an international corporation with an offshore partner office in Islamabad which provides solutions for .NET/.NET Core software applications.\nThe multitude of roles it offers range from software development, sales, QA, technical solutions, customer support, marketing and business operations. Alachisoft values skills that can overlap across different areas along with dedication to detail and learning and candidates have been able to choose more than one job role or gain experience in more than one business area of expertise once hired.\nMany technical employees have the opportunity to go through training for customer facing roles like technical support roles. Analysts with business experience with a desire to learn can get trained and transitioned in digital marketing roles. Communication and presentation skills are often taught and revised for partnerships and sales roles. Many employees in the company end up with experience with more than one department of business during their time there.",
  "retrievedAt": "2025-08-11T19:08:24.012Z"
}
