{
  "title": "Jazz decides to match its customer contributions to PM COVID relief fund",
  "link": "https://www.app.com.pk/national/jazz-decides-to-match-its-customer-contributions-to-pm-covid-relief-fund/",
  "date_published": "2020-04-22T22:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP):Jazz, Pakistan’s largest digital company will be matching donations by its customers to the Prime Minister’s COVID-19 Relief Fund.\nIn the interest of a robust and timely response to the looming health and economic challenges, Jazz has stepped up to offer its support to the country.\nAs part of Jazz’s recently pledged Rs. 1.2 billion supports towards Covid-19 relief, this decision to match customer contributions came at a time when the number of COVID confirmed cases has increased – according to government figures. The matching contribution applies not just to the 61 million subscribers, but also to Jazz employees who have voluntarily contributed up to 3 days of their salary to the Fund.\nCEO Jazz Aamir Ibrahim, said: “At this point, every rupee counts, and both urgency and strategy are needed to outdo the ghastly pandemic. We will match every rupee contributed by customers and employees. On the strategic end, we are structurally aligning our digital services so the crisis can be monitored and contained with minimal business and economic disruption.”\nSubscribers willing to contribute can easily send an SMS to 6677, use their JazzCash accounts to donate through the App or USSD (dial *786#) or make the payment via the COVID relief website portal on Jazz.com.pk/PMFund.\nThis program is expected to raise a substantial amount in contributions and will serve the health and food relief needs for those who have been left destitute by COVID-19 related lockdown via the PMs National COVID Relief Fund.\nIn this time of need, Jazz – the company, its generous customers, and passionate employees – stand with Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:08:23.742Z"
}
