{
  "title": "Tele-school best way to impart education to students amid COVID-19: President",
  "link": "https://www.app.com.pk/national/tele-school-best-way-to-impart-education-to-students-amid-covid-19-president/",
  "date_published": "2020-04-23T04:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP):President Dr Arif Alvi on Thursday said that the tele-school was the best and easiest way to impart education to the students in the critical time of COVID-19.\nSpeaking during a visit to a tele-school project here at Islamabad College for Girls F-6, he said the provision of distance education through tele-school would help the children to save their precious time and continue their studies regularly.\nDuring the visit, the president, who was accompanied by First Lady Begum Samina Alvi, was given a briefing about the functioning of the tele-school, curriculum and other matters.\nDr Alvi observed that the tele-school project was an important project, which would enable the students to get education from home in the current lockdown situation. Through the online education, the students could fully grasp the lectures, which was not possible for them in the classroom.\nHe said in the present lockdown situation, the world had gone ahead of the distance education. It was also necessary to gauge as to how much the children were learning from the online education, and how it would help them save their time, he stressed.\nPresident Alvi appreciated the steps taken by the government to bring improvement in the education sector. It was a matter of satisfaction that the provinces had also been taken on board on the matter.\nHe said the Ministry of Federal Education and Professional Training was striving to provide tele-education to the children in the critical situation, which was need of the hour. He appreciated the officials of ministry, and the teachers and other staff of Allama Iqbal Open University (AIOU) in provision of distance education in the country.\nThe AIOU, he said, had already been providing distance education, however, a new era had started in the country with the provision of education through tele-school. All cloud computing had been at hand for the children under the system from where they could download their lectures while the parents could also assist them in the study.\nThe president said according to survey conducted in California, the children learnt better from distance education than schools. He desired for a system of distance education in Pakistan as it was an important way to educate the children, he added.\nEarlier, Minister for Education and Professional Training Shafqat Mahmood briefed the president about the tele-school project. He said the project would be further improved as a mechanism was being developed to get the feedback of teachers and students.\nHe said the entire nation was united against the COVID-19 . He appreciated the determination of the ministry’s officials and teachers to provide education through the teleschool as it was the best way to promote distance education in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:08:18.359Z"
}
