{
  "title": "Firdous asks all stakeholders to join hands in fight against coronavirus",
  "link": "https://www.app.com.pk/national/firdous-asks-all-stakeholders-to-join-hands-in-fight-against-coronavirus/",
  "date_published": "2020-04-23T04:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan said on Thursday that all stakeholders including the opposition ,civil society and religious scholars would have to join hands with the government to defeat the coronavirus pandemic.\nIn a video message, the SAPM said at this critical juncture, the nation needed a national narrative against coronavirus pandemic and all should join hands with the government to fight this war. The government would welcome constructive criticism of the opposition to improve the strategy in fight against the outbreak of coronavirus in the country, she remarked.\nThe SAPM urged the opposition not to spread despair among the people by criticism for the sake of criticism as this was not the time of politics.\nShe said that besides coronavirus, Pakistan was also facing the challenge of poverty and hunger. Keeping in mind the problems of daily-wage employees, the government cold not enforce a lockdown on the pattern of advanced countries, which do not have population below poverty line.\nShe said that it was responsibility of the government to try to prevent deaths both from coronavirus and, hunger and starvation.\nShe paid rich tributes to the doctors, nurses and paramedical staff who are in the forefront of war against coronavirus.\nShe said that during Ramazan-ul Mubarak, SOPs would have to be followed to prevent spread of coronavirus. She said that PTV would telecast live Taraweeh prayers from Faisal mosque. She said that capacity for testing coronavirus was being increased and several more quarantine centres and isolation wards were being set up.\nDr Firdous thanked the people who donated in Corona Relief Fund of the Prime Minister in Ehsaas Telethon. She also thanked the management of the television channels and the anchor persons for their cooperation in the telethon and building a national narrative on the issue.",
  "retrievedAt": "2025-08-11T19:08:18.332Z"
}
