{
  "title": "Govt to ease registration, support modern education at seminaries: PM",
  "link": "https://www.app.com.pk/national/govt-to-ease-registration-support-modern-education-at-seminaries-pm/",
  "date_published": "2023-01-04T06:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP): Prime Minister Shehbaz Sharif on Wednesday said that the government would extend its maximum support to the seminaries to help them impart education in accordance with modern-day needs.\nThe prime minister, in a meeting with a delegation of Ittehad-e-Tanzeemat-e-Madaris, also assured them for providing maximum administrative autonomy to the seminaries and easing their registration process.\nLauding the services of the seminaries for religious education, he said that around five million students were studying there free of charge. The seminaries also teach the students to memorise the Holy Quran besides playing their active role to protect Pakistan’s interests.\nHe said half of the students enrolled in seminaries were girls and thousands of them were orphans. The students were also getting free books and education at the seminaries.\nCalling the seminaries Islamic or Pakistani NGOs, the prime minister said the government desired to extend its support to them in their social services.\nHe also expressed condolence over the death of renowned religious scholar Mufti Rafi Usmani and said that not only Pakistan, but the whole Muslim world recognised his services to the religion.\nThe meeting was attended by President of Jamiat Ulema Islam-F Maulana Fazlur Rehman, Maulana Mufti Taqi Usmani, Maulana Muhamamd Hanif Jalandhri, Mufti Munibur Rehman, Sahibzada Abdul Mustafa Hazarvi, Senator Professor Sajid Mir, Maulana Abdul Malik, Maulana Afzal Haidri, Maulana Abdul Kabir Azad and Maulana Fazal Rahim.\nFederal Ministers Rana Tanvir Hussain, Marriyum Aurangzeb, Rana Sanaullah Khan, Mufti Abdul Shakoor, Special Assistant to PM Syed Fahad Hussain and senior officers were also present.",
  "retrievedAt": "2025-08-11T05:40:58.906Z"
}
