{
  "title": "PTI’s White Paper, just hue & cry of a ‘plunderer’: Sherry Rehman",
  "link": "https://www.app.com.pk/national/ptis-white-paper-just-hue-cry-of-a-plunderer-sherry-rehman/",
  "date_published": "2023-01-04T11:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP):Federal Minister for Climate Change, Senator Sherry Rehman on Wednesday called the White paper issued by the Pakistan Tehreek-e-Insaf (PTI) on the coalition government’s eight-month performance as nothing more than hue and cries of a ‘plunderer’.\nIn a series of tweets, the federal minister said the the PTI had released a White Paper on the performance of the current government for eight months.\nتحریک انصاف نے موجودہ حکومت کی 8 ماہ کی کارکردگی پر وائیٹ پیپر جاری کیا ہے۔ ملکی معیشت تباہ کرنے کی جرم میں جن کے خلاف ریڈ وارنٹ جاری ہونے چاہیے تھے انہوں نے حکومت کے خلاف وائیٹ پیپر جاری کیا ہے۔ یہ وہ لوگ ہیں جو اپنے چار سالے کے بدترین دور اقتدار کا حساب دینے کو تیار نہیں۔ 1/3\nSenator Rehman said the White Paper had been issued by those against the government whom red warrants should have been issued for the crime of destroying the country’s economy.\nThe Minister said: “These are the people who are not ready to give an account of their worst four years in power. These are the people who ruled the country for four years and then say we had no authority (and) someone else was running the government.”\nShe queried that under what legitimate right did the PTI issue its White Paper as they were responsible for paralyzing the country and indebting the government. It would take many years, not eight months, to pull out the country from the crisis orchestrated by the PTI.\n“Who got 10 million jobs and 5 million houses? Why did those (PTI Leadership) who claimed not to take loans, increased the country’s debts by 70%? Why did those who make the narrative of corruption themselves become disqualified on corruption? He (Imran Khan) plundered the country’s economy like Tosha Khana,” the Minister said.",
  "retrievedAt": "2025-08-11T05:40:53.115Z"
}
