{
  "title": "Pakistan’s trade with UAE to surpass US$10.6 b in 2023: envoy",
  "link": "https://www.app.com.pk/national/pakistans-trade-with-uae-to-surpass-us10-6-b-in-2023-envoy/",
  "date_published": "2023-01-04T09:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 04 (APP):The bilateral trade between Pakistan and United Arab Emirates is expected to grow up to double from the US$10.6 billion volume achieved in 2021-2022, Pakistan’s top diplomat in the UAE said on Wednesday.\nThe last calendar year recorded a US$10.6 billion in trade “the highest volume Pakistan had in the Middle East and North Africa (MENA) region,” he added.\n“The potential is much more. I have been tasked by the political leadership of my country to increase trade, promote business opportunities, investment and elevate cultural interaction between Pakistan and the UAE,” Pakistan Ambassador to the UAE Faisal Niaz Tirmizi said in an interview with Emirates News Agency.\nThe Ambassador said that the UAE and Pakistan were enjoying historic relations. “Pakistan was the first country to send its ambassador six months before the formation of the UAE.“We sent our economic, agriculture, and defence advisors way before that,” Tirmizi said.\n“Pakistanis consider the UAE their second home and vice versa. The close geographical proximity between the two countries gives a great opportunity to work together,” he further stated.\nAround 1.6 million Pakistanis are residing in the UAE and during 2020-2021, they sent $6.11 billion in remittances.\nThe Ambassador confirmed that Pakistan has started negotiations on the Comprehensive Economic Partnership Agreement (CEPA) with the UAE and hoped to have significant progress by the year’s end.\n“Yes, we are working on this, it is very important. The Ministry of Commerce of Pakistan is in touch with the relevant authorities in the UAE and hopefully, we will make some significant progress on this agreement before 2023.”\nThe UAE is the biggest trading partner of Pakistan in the MENA region, he said, adding that CEPA would provide an opportunity for the two countries to increase their bilateral trade many folds.\nThe Ambassador highlighted three sectors namely Fintech, IT, and Startups, where Pakistan and the UAE can further collaborate.\n“Last year, our exports increased to US$3 billion in these sectors. We have skilled manpower and new startups. I will be focusing very closely on this, because I think there are immense opportunities between the UAE and Pakistan to further collaborate.”\nAmbassador Tirmizi said that the UAE was the most generous country that provided humanitarian relief to flood-affected areas in Pakistan, thanking President Sheikh Mohamed bin Zayed Al Nahyan, for his noble gestures.\nThe UAE established an air bridge to transport humanitarian aid to the people affected by the unprecedented floods. “They have sent over 70 flights carrying relief items,” he said. “This was critical for those people affected by the floods.”\nThe ambassador said that the UAE has taken a lead in climate change as it is hosting COP28 in November 2023, and has the headquarters of IRENA, which is an intergovernmental organisation supporting countries in their transition to sustainable energy.\n“Climate change is something that is really impacting the lives and livelihood of so many people,” he noted, adding that Pakistan is only contributing less than 1 percent to global greenhouse gas emissions and is one of the most vulnerable countries to the impacts of climate change.\n“We have one flood in 10 – 20 years and in 2010 and 2011 we had two floods and now the latest flood. Glaciers in the north of the country are disappearing,” he said, stressing that climate change should be addressed “as climate and environment are the common heritage of our planet”.\nHe said that as chair of Group 77, Pakistan negotiated the establishment of loss and damage fund at the Sharm el-Sheikh Climate Change Conference (COP 27). “We will be carrying forward the same thing that those countries who have been badly impacted by the effect of climate change, their issues have to be addressed.”\nThe Ambassador said that the UAE has taken a lead in clean energy. “They are investing both in technology and in projects like solar, wind or any other renewables.”\n“Pakistan will be working closely with the UAE, and you will see very soon the fruition of these negotiations that have already started between the two countries,” he added. “Hopefully, we will see a big project in renewables in Pakistan.”\nThe ambassador identified some sectors where the two countries can increase their cooperation, saying that Pakistan’s Indus valley civilisation has contributed richly to the world heritage.\nWe have Gandhara civilisation, a rich Islamic heritage, and a Sikh heritage that we would like to promote in the UAE. Pakistan pavilion at the Expo 2020 Dubai depicted the strong culture and civilisation of Pakistan, he said and added, We want to promote culture, music, and art footprint in the UAE and vice versa.\n“We will encourage Emiratis as well as other nationalities to visit Pakistan and enjoy the rich diversity, the natural beauty of the country, and most importantly the warmth of the people,” the Ambassador said.",
  "retrievedAt": "2025-08-11T05:40:55.400Z"
}
