{
  "title": "President for info availability in audio, Braille to facilitate visually-impaired persons",
  "link": "https://www.app.com.pk/national/president-for-info-availability-in-audio-braille-to-facilitate-visually-impaired-persons/",
  "date_published": "2023-01-04T11:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP): As the world observed World Braille Day on Wednesday, President Dr Arif Alvi called for a pledge to provide important information in accessible formats in audio and Braille format to all visually-impaired persons to make them enjoy their lives.\nThe president, in a message, said the Day was aimed at raising public awareness about Braille as a writing system for blind and partially sighted persons.\nHe said the availability of important information in audio and Braille would help the visually-impaired people remain safe while navigating public places, and provide necessary information to them about diseases and disasters.\nHe said the United Nations General Assembly declared the 4th of January as the International Day to commemorate Braille and to mark the birthday of Louis Braille, creator of this writing system which later became a prime tool for acquiring education, knowledge, and information for the visually impaired persons around the globe.\nThe president also called for affirming the resolve to ensure the permeation of Braille in all of the systems to enable the visually impaired persons to enjoy hassle-free access to health care, education, and employment opportunities, enjoy the freedom of expression and opinion and social inclusion, as reflected in Article 2 of the Convention on the Rights of Persons with Disabilities to which Pakistan is a signatory.\nPresident Alvi said the Day also reminded the world to use Braille for imparting education, knowledge and information to visually-impaired persons.\nThis would ensure their economic and financial empowerment, create resilience in them against poverty, marginalization, violence, neglect and abuse and give them the access to water, sanitation and hygiene, health care, mental health and psycho-social support and an inclusive workplace, he added.\nThe president also emphasised labeling all products in markets with Braille and ensure the reach of visually impaired persons to resources like Web Pages, social media sites, emails and other means of electronic communication, education and entertainment by integrating text-to-speech and audiobook technology into smartphones and computers.\n“Let us also ensure the spread of knowledge and information and sensitize the general public on preventive means and ways to avoid visual impairment as according to WHO half of the incidents of blindness can be reduced by taking necessary precautionary measures. Let us make our country more inclusive and accessible and let us pledge to leave no one behind,” he remarked.",
  "retrievedAt": "2025-08-11T05:40:50.465Z"
}
