{
  "title": "United States celebrates 75 years of Pakistan-U.S.  bilateral relations",
  "link": "https://www.app.com.pk/national/united-states-celebrates-75-years-of-pakistan-u-s-bilateral-relations/",
  "date_published": "2023-01-04T10:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP):The United States Embassy in Islamabad is marking 75 years of bilateral partnership with Pakistan by illuminating the building at One Constitution Avenue in the capital.\nThe illumination starts the evening of January 3rd and will continue through January 11th, said a press release issued here by the U.S. Embassy in Islamabad on Wednesday.\nUsing innovative technology pioneered by partner organization 3D Illumination, the three-dimensional, moving projection highlights key themes and images of Pakistan-U.S. relations from the past 75 years. Previously used with famous landmarks such as the Washington Monument and Eiffel tower, this type of projection has rarely been seen before in Pakistan.\nOn the occasion, U.S. Mission Chargé d’Affaires Andrew Schofer said, “Through 75 years of diplomatic relations, the United States has worked with Pakistan to support energy, agriculture, public health, education, infrastructure, and people-to-people connections.\nWe are proud to use this unique technology to show the Pakistani people the breadth and depth of our longstanding bilateral partnership and look forward to exploring opportunities for future collaboration and partnership, including through the U.S.-Pakistan Green Alliance framework.”\nOver the past 75 years, the United States and Pakistan have created a relationship based on mutual respect and shared values, building a partnership that has been advantageous to both countries, he added.\nHe said that over the decades, the United States has invested more than $32 billion to improve the lives of the Pakistani people, strengthen our bilateral collaboration, and advance our shared interests.",
  "retrievedAt": "2025-08-11T05:40:55.706Z"
}
