{
  "title": "APHC leaders demand Kashmir settlement under UN resolutions",
  "link": "https://www.app.com.pk/national/aphc-leaders-demand-kashmir-settlement-under-un-resolutions/",
  "date_published": "2023-01-04T08:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP): All Parties Hurriyat Conference (APHC) leaders including Ghulam Ahmad Gulzar and Nayeem Ahmed Khan have demanded the UN to fulfill its obligations regarding the settlement of the Kashmir dispute under its resolutions including the one passed on January 05, 1949.\nThe leaders made the demand on the eve of the adoption of the January 5, 1949, UN resolution that guaranteed the Kashmiris’ Right to Self-Determination, said a press release.\nSenior APHC leader, Ghulam Ahmad Gulzar, in a statement in Srinagar, said, January 05, 1949 resolution is clear proof that Kashmir is not India’s internal matter or integral part but an internationally-recognized disputed territory. He deplored that despite the passing of over seven decades, the promise made with the Kashmiris remained unfulfilled.\n“Many nations of the world were liberated and referendums under UN supervision were held in many places which include Kosovo, East Timor and Southern Sudan but the unfortunate people of Kashmir were forgotten again and again which shows the duplicity, hypocrisy and double standard of the international community,” he said.\nGulzar said that big powers, who claim to believe in the supremacy of human rights, preferred commercial and material benefits and ignored humanity in Kashmir.\nHe said the hypocrisy of the world and Indian expansionist designs have caused unimaginable destruction in Kashmir and have made peace in South Asia hostage. He called upon the UN to implement its January 05 resolution and restore its damaged reputation.\nIllegally detained senior APHC leader, Nayeem Ahmed Khan, in a message from New Delhi’s infamous Tihar Jail urged the UN to make serious efforts to implement its January 5, 1949 resolution on Kashmir. He said India’s denial to implement the historic resolution has pushed the region into a quagmire of uncertainty.\nThe APHC leader pointed out that India’s intransigence and policy of deceit and deception have been a stumbling block in the way of a peaceful settlement of the Kashmir dispute that hangs over for the last more than seven decades.\nHe said, it is high time that the UN Security Council must take effective cognizance of India’s dilly-dallying tactics and impress upon it to ensure early implementation of the January 5, 1949 resolution that provides a comprehensive road map to resolve the Kashmir dispute peacefully.\nAnother incarcerated APHC leader, Abdul Samad Inqilabi, in his message sent from an Indian jail, maintained that Kashmiri people will not rest till they are given their right to self-determination promised to them by the UN through its several resolutions. He said India must know that despite using all cruel tactics it will not succeed to subdue the Kashmiris’ resolve for freedom and they will continue their struggle till complete success.\nThe Jammu and Kashmir Pir Panjal Freedom Movement in a statement issued in Jammu said the UN’s failure to implement its resolutions on Kashmir has resulted in the continued suffering of the Kashmiri people. It said the miseries of the people of IIOJK increased manifold since the abrogation of the special status of the territory by Narendra Modi-led fascist Indian government on August 05, 2019.\nMeanwhile, APHC-AJK leaders including Convener, Mahmood Ahmad Saghar, Sheikh Abdul Mateen, Muhammad Sultan Butt and Zahid Ashraf in their statements in Islamabad said the Kashmiris have rendered unprecedented sacrifices in their struggle for securing their right to self-determination.\nThey said peace will continue to elude the region till the Kashmir dispute was resolved according to UN resolutions and the aspirations of the Kashmiri people. They urged the UN to fulfill its responsibilities towards the Kashmiris for restoring its own credibility.",
  "retrievedAt": "2025-08-11T05:40:58.956Z"
}
