{
  "article_id": "2025-03-09_5326449e9f7de34e340606b872c38ded",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-youth-program-successfully-achieves-targets/",
    "retrieved_at": "2025-08-27T13:29:37.449Z"
  },
  "metadata": {
    "title": "PM Youth Program successfully achieves targets",
    "author": null,
    "date_published": "2025-03-09T09:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 627,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 09 (APP): The Prime Minister's Youth Program has successfully implemented initiatives to empower the country's youth, achieving all set targets. According to available official document, the focus of the program was to empowering young individuals through its comprehensive 4E framework, which encompassed four pivotal pillars,Education, Employment, Engagement, and Environment. The document claimed this holistic approach was designed to foster a well-rounded and skilled youth population, equipped to drive positive change and progress. These initiatives included the Youth Laptop Scheme, which connects the youth with technology and provides support for education to the Pakistan Education Endowment Fund (PEEF) talented students. The PMYP Laptop Scheme helped the youth start freelancing and set up a digital Skills Institute. Prime Minister Youth Skills Development Program benefited 56,000 young people. The number of members of the Prime Minister National Youth Council is 113, 71,422. Youths were loaned from PM Youth Business and Agriculture Loan Scheme while 70 startups from PM National besides Innovation Award. The Youth Skills Development Program provided training in various businesses and technologies, while the Youth Business and Agriculture Loan Scheme offered free loans to businessmen. The National Innovation Award promoted startups, and supports the development in the IT Startups and Venture Capital Project IT sector. The Youth Internship Program provided job opportunities to young people in Academia and the labor market, while the National Youth Council advised policy making. The National Volunteer Corps voluntarily encouraged positive change, and digital Youth Hubs connected young people with digital skills and opportunities. In addition, Talent Hunt Sports League and Sports Academies played a vital role in the development of sports and the Green Youth Movement trains young people with environmental protection. As of February 2024, the Prime Minister's Youth Program has made significant progress in empowering Pakistan's youth through education, skilled, entrepreneurship and leadership. Thousands of young people were benefiting from important programs like the Youth Laptop Scheme, Skills Development Program, Youth Business and Agriculture Loan Scheme, and the National Innovation Award. In addition, the Green Youth Movement and the National Youth Council promoted the youth's participation and policy influence. Many operational programs were provided such as Youth Internship Program and National Volunteer Core Skills construction and public service opportunities. The proposed digital Youth Hub program will further enhance access to digital resources, support PMYP's efforts to promote socio -economic development and leadership. The Prime Minister's Youth Business and Agriculture Loan Scheme has benefited 171,000 youths from January 2025, with a total of 71 billion rupees. The new measures included \"laptops for everyone\" for students and tech entrepreneurs and loans for potential workers abroad. The Pakistan Education Endowment Fund has given 861 scholarships worth Rs 250 million. During the visit of the Commonwealth Secretary General in 2024, several steps were initiated on the youth, including the Commonwealth Asia Youth Alliance and the National Youth Corps. As many as 104,000 players participated in the Prime Minister's Youth Sports League, and the National Youth Council was formally established. Under the Prime Minister's Youth Program, Rs 29.404 billion were provided for PM Youth Laptop Scheme, for Pakistan Education Endowment Fund Rs 14 billion has been allocated besides Prime Minister Youth Skills Development Program Rs 15 billion, PM Youth Business and Agriculture Loan Scheme Rs 105 billion and allocation for PM National Innovation Award, Prime Minister Volunteer Corps Rs 1.8 billion, Prime Minister Digital Youth Hub Rs 447 million, PMs Talent Hunt Youth Sports League Rs 240 million, PM Sports Academies Rs 998 million and Prime Minister Green Youth Movement of Rs 1.94 billion. Under the Prime Minister's Youth Program, the National Advanced and Youth Policy, UNICEF and Generation were being developed with the technical support of the Limited, which aims to meet the needs and wishes of the youth in Pakistan. 395",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}