{
  "article_id": "2025-03-09_aefa9b71a49c9241b0b5d1c6172626c5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fuel-cost-component-of-cppa-g-kes-rlng-power-plants-comparable-for-december-2024-ke-spokesperson/",
    "retrieved_at": "2025-08-27T13:29:04.806Z"
  },
  "metadata": {
    "title": "Fuel cost component of CPPA-G & KE’s RLNG power plants comparable for December 2024: KE Spokesperson",
    "author": null,
    "date_published": "2025-03-09T18:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 442,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 9 (APP):During December 2024, 21 percent of the electricity procured by CPPA-G (i.e. 2,171 MW) came from RLNG plants within the national grid as compared to 19 percent produced by KE (i.e. 252 MW) from RLNG, with fuel costs comparable to those power plants operated by KE during the same period. According to K-Electric spokesperson further clarifies reports regarding its generation cost during December 2024 and the power utility's drawl from the national grid, said a press release. \"Demand during the month had become low due to the winter season, and KE managed its supply from the NTDC appropriately. KE matched the low demand with a balanced supply from the NTDC network, using plants where the cost is comparable to other plants run by the NTDC network. \"It is pertinent to highlight that if KE could have received its quota of natural gas as was committed, the cost of fuel could have fallen to Rs8/kWh, a mere 40 percent of what it was during December 2024. \"Delving into details, at this instant, it is pertinent to highlight that comparing only fuel costs - as done in the report - may not provide a holistic view. A comprehensive analysis, including capacity payments, shows that the total power purchase cost of the national grid is approximately Rs 27/kWh.In comparison, the power purchase cost of KE would be similar. \"In terms of fuel cost of electricity, the KE system, when compared with CPPA-G, is higher because unlike CPPA-G, KE does not have availability of Nuclear- or Hydro-based power plants in its fleet, nor is KE provided sufficient supply of Indigenous or Low Btu gas to operate its own plants. When it comes to operating RLNG plants, KE's procurement of electricity is similar to that of the national grid. \"As rightly highlighted by the esteemed member of NEPRA, KE remains committed in procuring cheaper power from NTDC and the same has been demonstrated by completion of KKI and Dhabeji Grid by virtue of which the drawl from NTDC can be increased to around 2,000 MW, the confirmation of which is awaited from NTDC. \"At the same time, KE is actively engaging with NTDC and seeking its valuable cooperation to ensure a more seamless and efficient power supply. Through mutual collaboration and ongoing dialogue, KE aims to enhance the reliability and stability of the system for the benefit of all stakeholders. \"Additionally, KE is actively working to rationalize its energy costs for which the company has already issued 640 MW of renewable RFPs. Competitive Bidding Process has been concluded, and the Bid Evaluation Reports for these projects have been submitted as per directions of NEPRA.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}