{
  "title": "CAEXPO to keep playing role for penetration of Pakistani products in China, ASEAN nations",
  "link": "https://www.app.com.pk/national/caexpo-to-keep-playing-role-for-penetration-of-pakistani-products-in-china-asean-nations/",
  "date_published": "2021-10-11T11:27:00.000Z",
  "source": "APP",
  "content": "BEIJING, Oct 11 (APP): Secretary General of CAEXPO, Wang Lei held a meeting with Pakistan Ambassador to China, Moin ul Haque here and reiterated that China-ASEAN Expo (CAEXPO) would keep playing its role for penetration of Pakistani products to China and ASEAN countries.\nDuring the meeting, both sides discussed several ideas to deepen bilateral trade and economic ties between Pakistan and China.\nAmbassador Moin ul Haque thanked the CAEXPO for Pakistan’s participation as the Special Partner Country in its 8th annual session held earlier this year in Nanning.\nHe appreciated the role of CAEXPO for enhancing trade and commerce ties between China, Pakistan and ASEAN region. Ambassador said that Pakistan’s participation and establishment of permanent pavilion at CAEXPO would further strengthen trade and business ties between Pakistan and China.\nHe emphasized that Pakistan attaches immense importance to expanding business ties with China and would continue efforts for deepening two-way trade and investment between the two countries.\nThanking Ambassador Haque for his remarks, Secretary General Wang said that Pakistan-China business ties have witnessed rapid growth especially after the operationalization of 2nd Phase of China-Pakistan Free Trade Agreement.\nPakistan participated as special partner country second time in a row in the 18th CAEXPO held from September 10-13 at Nanning, China’s Guanxi Zhuang Autonomous Region.\nPresident, Dr. Arif Alvi addressed the Expo through video message screened at the opening ceremony while Pakistan Ambassador to China, Moin ul Haque attended the Expo and addressed the China-Pakistan Investment and Business Forum on the sidelines of the expo.\nHe invited the Chinese businessmen to take benefit from the present government’s investment-friendly policies and the conducive atmosphere.\nPakistani traders and businessmen showcased marble, wood handicrafts, carpets, leather garments and other products at the expo.\nWith an exhibition area of 81 square meters, Pakistan set up a pavilion as well as 14 booths to showcase its national image and display its products to further promote its exchange and cooperation with China and ASEAN countries.",
  "retrievedAt": "2025-08-11T21:26:39.185Z"
}
