{
  "title": "Govt places women and girls at centre of all Ehsaas programs: Dr. Sania",
  "link": "https://www.app.com.pk/national/govt-places-women-and-girls-at-centre-of-all-ehsaas-programs-dr-sania/",
  "date_published": "2021-10-11T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar Monday said the present government is striving towards a healthier, educated and more resilient country by placing women and girls at the centre of all Ehsaas programs and initiatives.\nIn a statement on the “International Day of the Girl Child” being commemorated under the theme, “Digital generation”, Dr. Sania congratulated all women and girls in Pakistan and those around the world.\nDr. Sania highlighted that women contribute nearly half the population of our country and development is simply not possible without their active participation.”This principle sits at the core of Ehsaas”, she said.\n“We, therefore, have Ehsaas 50%+ benefits for women and girls’ policy. Any policy and programme under this framework must accrue at least half of the benefits to women; as a result, more than three quarters of Ehsaas’ entire program’s benefits are dedicated to women and girls”, the SAPM said.\nAccording to Ehsaas’ weighted-in-favour-of-girls stipends policy for all conditional cash transfer programs, girls get a higher stipend across all age groups.  She said that promoting education for all is a top priority of Ehsaas, especially education of girls.\nRolled out in all districts of the country, Ehsaas Education Stipends programme has been structured to give a higher amount of stipend to girls as compared to boys.\nStipends are given from primary to the higher secondary level stipends to children aged 4-22 years of Ehsaas eligible families.\nThe programme incentivizes parents to send their children, particularly girls to schools. We have also introduced, “Ehsaas graduation stipend” for girls completing the 5th grade to address the issue of girls dropping out of school.\nIn addition to the education CCT, Dr. Sania elaborated that Ehsaas Nashonuma, which provides specialized nutrition food and cash transfers to children under two and their mothers in the most stunted districts of the country also offers a higher stipend amount for the girl child.\nCompleting higher education, however, still remains a major barrier for women to ultimately graduate out of poverty. With half of scholarships reserved for girls, Ehsaas Undergraduate Scholarship program provides 200,000 need and merit-based scholarships over 4 years, she explained.\nEhsaas cash transfer programme, Kafaalat puts cash exclusively in the hands of 8 million women. They receive cash outs and are given savings wallets and will soon transition to full bank accounts as per the Ehsaas One Woman One Account Policy so that they can reap maximum benefits of financial inclusion, she said.\nThrough Ehsaas Interest Free Loans programme in the National Poverty Graduation Initiative, 45% women beneficiaries have been provided opportunities to build microenterprises.\nAlso, enabling 200,000 households and 1.4 million individuals to graduate out of poverty, under the 4-year Ehsaas Amdan program, 60% of small income generating assets have been allocated for women.\nPart of the design, the delivery of the 50%+ benefits for women and girls’ metric is rigorously followed up in Ehsaas, Dr. Sania added.",
  "retrievedAt": "2025-08-11T21:26:37.251Z"
}
