{
  "title": "Additional tickets for ICC T20 World Cup to go on sale",
  "link": "https://www.app.com.pk/national/additional-tickets-for-icc-t20-world-cup-to-go-on-sale/",
  "date_published": "2021-10-11T13:22:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 11 (APP): The International Cricket Council (ICC) said on Monday that in a welcome boost for cricket and sports fans in Oman and the United Arab Emirates (UAE), more tickets have been made available for all games at the ICC Men’s T20 World Cup 2021.\nThe tickets will go on sale via www.t20worldcup.com/tickets at 1900 GST on Monday 11 October, said the information made available here by the ICC.\nThe International Cricket Council (ICC) and event hosts the Board of Control for Cricket in India (BCCI) have worked closely with host country authorities to ensure fans can be welcomed in a safe environment and COVID-19 protocols will apply at all venues.\nChris Tetley, Head of Events, ICC said said : “We know Oman and the UAE are packed with sports fans from all 16 nations competing at the event, so we’re delighted to be able to release more tickets for all games. We’ve worked closely with our hosts, the venues and our partners to ensure as many fans as possible can be part of what is going to be such a fantastic event.\n“The expat community in the region means every team can enjoy home support and with tickets from just 10 OMR and 30 AED, we hope to see stands full of passionate cricket fans cheering their team on. Demand is always incredibly high for tickets to ICC events, so I’d urge fans to be patient and we look forward to welcoming them to the ICC Men’s T20 World Cup 2021.\n“It is important that fans only buy tickets through the official channels at www.t20worldcup.com/tickets We cannot guarantee that any ticket bought on secondary sites will provide access to the match as the unique barcode may have been copied or compromised. We will cancel tickets we identify as being resold, meaning fans would have wasted their money on an invalid ticket that won’t get them into the game.”\nTickets went on sale last week, with thousands being snapped up in record time, however there are now tickets available for games across all four venues; Abu Dhabi, Dubai, Sharjah and Muscat.\nThe ICC Men’s T20 World Cup, the pinnacle of the shortest format of cricket, is back after five years. The matches offer explosive cricket and entertainment for everyone and the event will be the largest sporting event ever to be held in the region.\nTickets are available for fans to watch the top 16 T20 teams of the world vying for the ultimate prize in the shortest format, the ICC Men’s T20 World Cup, which starts in Muscat on 17 October and concluds in Dubai on 14 November.\nWith prices starting at just 10 OMR and 30 AED in Oman and the UAE respectively, the event is accessible to all cricket fans. Tickets are available to purchase on https://www.t20worldcup.com/tickets .\nThe schedule offers a host of key rivalry fixtures and mouth-watering match ups. The tournament kicks off with a Round 1 match between Oman and Papua New Guinea in Muscat.\nAustralia and South Africa play the first match of the Super 12s on 23 October in Abu Dhabi, followed by the replay of the 2016 final between England and the West Indies the same day in Dubai. One of cricket’s biggest rivalries, between India and Pakistan, will take place on 24 October in Dubai.\nIn addition to the top quality cricket, fans will also get to enjoy a host of entertainment choices, including DJs, fan zones and various other exciting activations around each venue, offering families and the young plenty of fun.Apart from full member nations, Bangladesh,\nIreland and 2014 winners Sri Lanka, there are also Namibia, the Netherlands, Oman, Papua New Guinea, and Scotland, battling to advance. There are four available places to join Afghanistan, Australia, England, India, New Zealand, Pakistan, South Africa, and the West Indies in the Super 12 stage.\nFans wishing to attend matches must follow all COVID-19 protocols laid out on the www.t20worldcup.com/tickets website and note the different stadium entry guidelines which will be updated realtime as per the latest government mandates.\nThose unable to travel to the UAE and Oman, can also ‘Live The Game’ by watching the tournament live on TV and by engaging across all of ICC’s digital channels. An announcement regarding the tournament’s global broadcast coverage will follow soon.",
  "retrievedAt": "2025-08-11T21:26:35.492Z"
}
