{
  "article_id": "2025-09-13_d919cc4054d69be6c7ba1702e6d7e832",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-committed-to-enhance-ties-with-africa-amb-hamid-asghar/",
    "retrieved_at": "2025-09-19T16:51:57.031Z"
  },
  "metadata": {
    "title": "Pakistan committed to enhance ties with Africa: Amb Hamid Asghar",
    "author": null,
    "date_published": "2025-09-13T20:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 205,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 13 (APP): Pakistan valued its partnership with Africa, a region of immense potential and opportunity and will make further efforts to enhance ties with the continent, Ambassador Hamid Ali Asghar, Additional Foreign Secretary for Africa said at a grand diplomatic reception hosted at his residence here. He said, \"Through the Engage Africa Policy, we are committed to expanding cooperation in trade, investment, education, and technology.\" The dinner brought together the ambassadors of Sri Lanka, Kazakhstan, Myanmar, Kenya, Sudan, Rwanda, Somalia, Zimbabwe, and Ethiopia, along with senior civil and military officials, Honorary Consuls, parliamentarians, business leaders, and media professionals. Notable participants included MNA Isphanyar M. Bhandara, former federal minister Daniyal Aziz, Federal Secretary Joudat Ayaz, former Secretary Arif Azim, former PTV MD Mubasher Tauqir, Shabaz Zaheer, Director PEL, Major General Zia, Adnan Cheema, Parvez Khan, UD Afridi, Tariq Saleem, Senator Walid Iqbal, AJK Minister Faisal Rathor, Honorary Consul General of Ghana Omar Shahid Butt and senior journalist Faisal Zahid Malik and Malik Manzoor Ahmed among others. The event was hosted in a warm, friendly manner and was a unique diplomatic occasion, symbolizing Pakistan's deep-rooted relations with Africa and its commitment to building stronger ties of people to people friendship and cooperation around the globe.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}