{
  "title": "Kabul Situation; Pakistan opens visa facility to foreign diplomats on arrival: Sheikh Rasheed",
  "link": "https://www.app.com.pk/national/kabul-situation-pakistan-opens-visa-facility-to-foreign-diplomats-on-arrival-sheikh-rasheed/",
  "date_published": "2021-08-18T09:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Minister for Interior and Narcotics Control, Sheikh Rasheed Ahmed on Wednesday said that on the directives of Prime Minister Imran Khan, Pakistan has offered a special package of transit visa to Afghan diplomats and high officials on their arrival at Islamabad.\nAddressing a press conference here at the ministry, he said that the government has decided to remain open all Pakistani airports round-the-clock for foreign diplomats, journalists, and high officials of IMF, World Bank etc who are coming from Kabul.\nImmigration department, Federal Investigation Agency (FIA) and other concerned staff were available on airports to facilitate them, he said.\nLIVE #APPNews : Minister for Interior Sheikh Rashid Ahmad addressing news conference #Islamabad  @ShkhRasheed  https://t.co/b2bhN802Bz\n— APP  (@appcsocialmedia) August 18, 2021\nRejecting the false propaganda of Indian media regarding the situation on Torkham and Chaman borders, he made it clear that there were no Afghan immigrants present over there.\n“The situation on these two borders reportedly remained peaceful. The route was clear for trade and transit,” the minister maintained.\nSheikh Rasheed, however, said the personnel of civil armed forces, law enforcement agencies and the government officials were on high alert. However, everything was under control on borders.\nSince the mid of August, he said that at least 900 diplomats and other embassies’ staff had been evacuated from Afghanistan.\nSimilarly, three buses carrying Pakistani nationals had reached back the country via torkham border after the outset of Ghani’s government, he said.\nA total of 613 Pakistani nationals had arrived so far, he informed.\nThe minister said that currently around 100-120 Pakistani nationals were still stranded in Afghanistan, however, the mission to evacuate them would be completed within a couple of days.\nResponding to a question, the minister said that due to diplomatic efforts of the Pakistan, United States of America and Afghan Taliban sat on a negotiation table.\nPakistan’s efforts for peace process in Afghanistan would be remembered long, he remarked.\nThe interior minister further said that lasting peace in Afghanistan was in the best interest of Pakistan.\n“We will not allow anyone to use our soil against any country. We will also not tolerate if any other country’s land to be used against Pakistan,” he added.\nHe said that Prime Minister Imran Khan had attempted to convince Ashraf Ghani to hold talks with Taliban but the former Afghan President was not clear about that.",
  "retrievedAt": "2025-08-11T21:06:02.262Z"
}
