{
  "title": "Pakistan embassy at Kabul facilitating people leave Afghanistan",
  "link": "https://www.app.com.pk/features/pakistan-embassy-at-kabul-facilitating-people-leave-afghanistan/",
  "date_published": "2021-08-18T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): While most of the western countries are frantically evacuating staff from Afghanistan and have shut down their missions, the Pakistan Embassy in Kabul continues to extend consular services for Pakistanis, Afghans and nationals of other countries and help them leave the country.\nPakistan’s ambassador to Kabul Mansoor Ahmed Khan in a message said the visas and consular services were operational, and full cooperation was being extended to all international missions, diplomats, organisations and media by assisting them in temporary relocation and repatriation.\nSo far around 400 visas have been issued to the foreign media in Afghanistan, besides around 800 visas were issued yesterday to Afghan and other nationals.\nPakistan Embassy Kabul continues to provide humanitarian assistance to Pakistanis, Afghans and other nationals. Due to closure of airport for civilian flights Pakistanis being sent back by road through Torkham @SMQureshiPTI @fawadchaudhry @ForeignOfficePk @PakinAfg pic.twitter.com/DXQqQPxkc2\n— Mansoor Ahmad Khan (@ambmansoorkhan) August 18, 2021\nKabul fell to the Taliban on Sunday, without any bloodshed, and several countries opted to shut down their missions and ordered immediate evacuations, causing panic. The chaotic scenes at the Kabul international airport further exacerbated the situation.\nPakistan however extended its support to the people and offered full assistance to the foreign media, diplomats and ordinary Afghans, wishing to relocate to Pakistan or use it for transit.\nAmbassador Mansoor Ahmed Khan said the Pakistan Embassy Kabul would continue to provide humanitarian assistance to Pakistanis, Afghans and other nationals.  He said due to closure of airport for civilian flights Pakistanis were being sent back by road through Torkham.\nForeign Minister Shah Mehmood Qureshi commended the diplomats in Afghanistan, “standing strong & working above & beyond call of duty in line with Pakistan’s commitment to peace & values of humanity.”\nI want to commend our diplomats in #Afghanistan, standing strong & working above & beyond call of duty in line w/ Pakistan’s commitment to peace & values of humanity. @PakinAfg is extending full consular services to all incl missions, orgs, media & families. #PakistanZindabad pic.twitter.com/pTFmYLaUhG\n— Shah Mahmood Qureshi (@SMQureshiPTI) August 17, 2021\nThe Ambassador also assured Pakistanis working or living in Kabul and adjoining areas that the Embassy was engaged with PIA to accommodate Pakistanis on regular and additional flights.\n“We are also assisting those who have issue of affordability. Contact the Embassy,” he said in a tweet.\nWe are specially facilitating visas for Afghan journalists & families in this period of uncertainty. Media people needing visas may contact Press Counsellor at WhatsApp 00923222807683 and they will be facilitated. @SMQureshiPTI @fawadchaudhry @TOLOnews @Bbcpushto @DaRadioAzadi\n— Mansoor Ahmad Khan (@ambmansoorkhan) August 15, 2021\n“We are specially facilitating visas for Afghan journalists & families in this period of uncertainty. Media people needing visas may contact Press Counsellor at WhatsApp 00923222807683 and they will be facilitated,” he added.\nPress Counsellor Tahir Nawaz told APP from Kabul that so far around 400 visas have been issued to the media personnel. These, he said, included visas for both the Afghans and foreign nationals working for foreign and local news media.\nGiving a breakdown he said visas have been issued for around 74 people from Reuters, 40 from AP and 30 from AFP. Besides he said over 200 visas have been issued for the Afghan journalists from Tolo News, 1 TV, Ariana, Khurshid TV, Shamshad TV, Khamaa Press and others.\nAmbassador Mansoor Khan who is personally supervising Embassy’s efforts with the support of all officers and staff members in difficult conditions assured the people that Pakistan was making every efforts for safe exit of the people. He expressed the hope that the flights would be operational in a few days and it would help those who cannot travel by road to go to Pakistan.\nThe Afghan nationals at the embassy in Kabul were all praise for Pakistan in assisting them at a time of uncertainty and confusion. The people who hailed from different parts of Afghanistan said they were glad that they were being taken care of by the embassy staff, who were working beyond the regular hours to help them get visa and other services.\nThe people said they were hoping to get away from Afghanistan as they were unsure of the situation and wanted to take their families to Pakistan for safety.\nThe Afghans at the Pakistan embassy also made a frantic appeal to the government of Pakistan for opening up of the border at Torkham to facilitate the people, particularly the patients who require urgent medical treatment and the students who have to resume their studies.\nHowever owing to the closure of the airport for all flights, except the ones being operated by the US and Nato for evacuation of their citizens, the ordinary Afghans and other foreign nationals cannot get a flight out from the city.\nThe Public Diplomacy wing of the Foreign office also shared the telephone numbers of the staff who may contacted for any assistance; Visa officer – 0093700728627, Visa asstt- 0093786324769, Ambassador 0093707300900.",
  "retrievedAt": "2025-08-11T21:06:05.527Z"
}
