{
  "title": "COVID-19 national tally of active cases continues to surge",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-of-active-cases-continues-to-surge-3/",
  "date_published": "2021-08-18T16:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):The national tally of total active COVID-19 cases was recorded 88,209 one of the highest during fourth wave of pandemic on Wednesday with 3,974 more people testing positive for the deadly virus and 3,122 people recovering from the disease during the last 24 hours.\nSixty-six corona patients have died during past 24 hours, 58 of whom were under treatment in the hospitals and six of them perished in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nMost of the deaths occurred in Punjab followed by Sindh.\nOut of the total 66 deaths occurred, 21 of them died were under treatment on ventilators.\nThere were 4,885 Covid infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 6.91 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 50%, Bahawalpur 48%, Peshawar 40% and Multan 45%.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Abbottabad 73%, Swat 60%, Gujranwala 56%, and Karachi 55%.\nAround 491 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan and Gilgit Baltistan (GB).\nSome 57,460 tests were conducted across the country on Tuesday, including 17,822 in Sindh, 20,766 in Punjab, 10,084 in Khyber Pakhtunkhwa (KP), 5,300 in Islamabad Capital Territory (ICT), 1,685 in Balochistan, 724 in GB, and 1,079 in AJK.\nAround 996,426 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,109,274 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 29,790, Balochistan 31,686, GB 9,482, ICT 94,714, KP 153,836, Punjab 374,916 and Sindh 414,850.\nAbout 24,639 deaths were recorded in country since the eruption of the contagion. Around 6,497 people perished in Sindh, 18 of them died in the hospitals and two out of the hospital on Tuesday.\n11,434 people died in Punjab died with 22 deaths occurred in past 24 hours. Some 18 individuals died in the hospitals and four out of the hospitals.\nAs many as 4,696 people expired in KP, 17 of them died in hospitals on Tuesday, 837 individuals died in ICT, 335 people died in Balochistan, 168 infected people perished in GB, two of them died in the hospital on Tuesday and 672 people died in AJK, three of them succumbed to the deadly virus in the hospital on Tuesday.\nA total of 17,007,656 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 5,364 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:05:59.891Z"
}
