{
  "title": "No compromise on women’s protection: Governor",
  "link": "https://www.app.com.pk/national/no-compromise-on-womens-protection-governor/",
  "date_published": "2021-08-18T16:57:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 18 (APP):Punjab Governor Chaudhry Mohammad Sarwar Wednesday termed the incident of violence against  a woman in Greater Iqbal Park as heinous and reprehensible and said that there shall be no compromise  on ensuring the protection and safety of women.\nIn his message on Twitter, he said that every Pakistani must fulfill his responsibility towards the protection of women.\nThe incidents like Greater Iqbal Park would not be tolerated under any circumstances, he said,  adding that a case had been registered against the culprits and they would be dealt with an iron hand.\nLater, in his message on Ashura Day, the Governor said that the day reminds us of the great sacrifices  of the martyrs of Karbala and inspire that one should not spare any sacrifice for achieving higher goals  and truth. He said that the need to promote the spirit of self-sacrifice was greater than ever.\nHe further said that whenever there would be any mention of patience, self-sacrifice, and raising the word  of truth in the face of falsehood, the history of humanity would always remember and honour the unparalleled courage, bravery and eternal sacrifices of Hazrat Imam Hussain (RA) and the martyrs of Karbala.\nThe Punjab Governor said that martyrs of Karbala gave the lesson to stand firm against oppression  and tyranny.\nThe purpose of remembering the events of Karbala is to awaken the same spirit of  self-sacrifice and solidarity in ourselves that Hazrat Imam Hussain (RA) and his companions had  demonstrated in Karbala.\nChaudhry Mohammad Sarwar said the best way to commemorate the event of Karbala and to pay  homage to the great sacrifices of Hazrat Imam Hussain (RA) and his companions was by promoting  unity amongst the Ummah and strive together for the progress and prosperity of the country whilst  facing the enemies with valour and courage.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T21:06:18.543Z"
}
