{
  "title": "Pakistan re-elected in United Nations’ CPC for next three years",
  "link": "https://www.app.com.pk/national/pakistan-re-elected-in-united-nations-cpc-for-next-three-years/",
  "date_published": "2020-09-17T10:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 17 (APP): Pakistan on Thursday was elected to the Committee for Programme and Coordination (CPC) by securing 52 votes from the 54-member United Nations Economic and Social Council (ECOSOC).\n“This overwhelming support constitutes 96 percent of the total tally. Pakistan’s reelection to the CPC is a resounding validation of Pakistan’s meaningful engagement within the UN as well as its contributions in the areas of international economic cooperation and Sustainable Development Goals (SDGs),” the Foreign Office said.\nThe Committee functions as the main subsidiary organ of ECOSOC and the UN General Assembly for Planning, Programming and Coordination of the work of the United Nations.\nThe CPC is also charged with reviewing UN programmes and making recommendations to the UN Secretary General on translating legislative mandates into programmatic activities.\nThe Foreign Office said, “Pakistan’s presence at the Committee will help us contribute to the effective formulation of the programmes and budget planning of the United Nations”.\nPakistan has been a member of this 34-member Committee since 1973, and with its latest reelection, would serve on it from 2021 to 2023 for another three-year term.\nThe Foreign Office said, “Pakistan is also presently serving as the President of ECOSOC at the United Nations which is one of the principal organs of the UN and the central platform for economic and social development, forging consensus and coordinating efforts to achieve internationally agreed development goals.”\n“We are hopeful that with our reelection to the CPC, Pakistan will continue to work hand-in-hand with the international community for promoting the shared goals of international cooperation and economic and social development, as enshrined in the UN Charter,” it said.",
  "retrievedAt": "2025-08-11T19:48:49.078Z"
}
