{
  "title": "Capital reports 564 new COVID-19 cases in last 24 hours: NCOC",
  "link": "https://www.app.com.pk/national/capital-reports-564-new-covid-19-cases-in-last-24-hours-ncoc/",
  "date_published": "2021-04-07T16:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 07 (APP): COVID-19 cases continued to surge in the federal capital as 564 new coronavirus cases were reported during the last 24 hours, National Command and Operation Center (NCOC) said on Wednesday.\nAccording to an official of NCOC, as many as 659 cases were reported on Tuesday while 641 cases were reported on Monday.\nHe said so far 62,775 cases were reported from the federal capital while 588 deaths were reported from Islamabad Capital Territory (ICT).\nHe said 50,064 patients had been recovered completely.\nMeanwhile, on the direction of the Ministry of National Health Services, the district administration of Islamabad had continued surveillance of different streets of the capital to reduce transmission of the infection in the selected streets and other sectors.\nThey also started taking action on violation of standard operating procedures (SOPs) related to the coronavirus while visiting marriage halls, markets, and petrol pumps by its inspection teams.\nThe administration has been asked to seal shops, workshops, and restaurants on violation of SOPs.\nThe inspection teams have been directed to impose fines on owners of different shops in case of violation of SOPs.\nCommenting on the situation, an official of the Ministry of National Health Services said several local-level administrative decisions were made to control the disease.\nHe advised the citizens to continue following the social distancing, use of mask and other precautionary measures to stop increasing local transmission of COVID-19 in the city.\nHe said the government had adopted an effective strategy to combat COVID-19 that resulted in a reduction in corona cases in the country.\nHe said a strategy was made to control coronavirus keeping in view the global information, focusing on data with integration of local data in a scientific way.",
  "retrievedAt": "2025-08-11T20:35:50.909Z"
}
