{
  "title": "PM committed to bring railways on track to success: Azam Khan Swati",
  "link": "https://www.app.com.pk/national/pm-committed-to-bring-railways-on-track-to-success-azam-khan-swati/",
  "date_published": "2021-04-07T11:29:00.000Z",
  "source": "APP",
  "content": "HYDERABAD, Apr 07 (APP):Minister for Railways Azam Khan Swati Wednesday said Prime Minister Imran Khan was fully committed to bring railways on track of development adding that with launch of ML-1 project and rehabilitation of railways a new era of progress would begin in the country.\nHe said this while talking to media persons after holding inspection of different sections of Hyderabad Railway Station here.\nThe divisional superintendent railways Karachi Muhammad Hanif Gul and divisional engineer Kamran Ahmed Ghouri also accompanied the minister.\nAzam Khan Swati said that due to wrong policies in the previous governments, the system of railways came at the verge of destruction and during last 50 years, the railways had suffered losses of Rs. 1.2 trillion. It because of appointments on political basis in railways like PIA, OGDCL and Pakistan Steel, he said.\nHowever, the minister said that the Prime Minister Imran Khan has decided to make railways a profitable organization with elimination of corruption, irregularities and malpractices. Under the policy framed by the Prime Minister, the railways will soon become a profitable organizations and move towards development, he added.\nThe minister informed that the World Bank had approved loan of Rs. 4.8 billion for launching freight and passengers trains of railways from Peshawar to Kabul and Uzbekistan. An agreement had been made in this regard, he informed and added that action had already been initiated against those who involved in negligence in respect of launching of train service from Pakistan, Iran and Turkey.\nThe minister said that ML-1 Project would begin new era of progress and economic uplift in the country. The work is in full swing in this regard, he said and added that prior to launching this project the work of launching freight trains is being completed with objectives to restore the confidence of the business community with availability of maximum freight trains for their goods and manufacturing.\nHe said that the ministry was fully committed to provide maximum facilities to business community so that railways could earn maximum profit through operation of freight trains in the country. A feasibility has been prepared in this regard and hopefully, railways would become profitable organization within next six to nine months, he said.\nResponding to a query about increasing incidents in Sukkur Division, the minister informed that railway tracks in this jurisdiction was being improved on self help basis and deployment of around four thousand workers who were engaged round the clock to accomplish the task.\nThe team were engaged to eliminate corruption, irregularities and malpractices from railways, he said and added that a comprehensive strategy would be prepared for removal of encroachments from railways land.",
  "retrievedAt": "2025-08-11T20:36:02.523Z"
}
