{
  "title": "Imran failed to prove single allegation against political opponents: Marriyum",
  "link": "https://www.app.com.pk/national/imran-failed-to-prove-single-allegation-against-political-opponents-marriyum/",
  "date_published": "2022-07-04T16:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 4 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Monday said fabricated cases were lodged against political opponents during the Imran-led government, which, however, failed to prove even a single allegation in courts.\nImran Khan was now trying to build a false narrative that the coalition government was amending the NAB laws to end their cases, she said addressing a news conference after the Federal Cabinet meeting.\nFlanked by Minister for Energy Khurram Dastgir Khan, Minister of State for Petroleum Dr Musadik Malik, PM’s Advisor on Kashmir Affairs Qamar Zaman Kaira and Minister for Board of Investment Chaudhry Salik Hussain, Marriyum said the law minister would give a threadbare briefing to the media persons on the National Accountability Bureau (Amendment) Bill, 2022 on Tuesday.\nShe said the cabinet was given a detailed briefing over matters related to the Power Division, including loadshedding, and existing electricity generation capacity, its demand and consumption.\nAround 23,900 megawatt electricity was generated in the month of June, while its demand touched 30,000 MW, which was “historic” and “unprecedented”, she added.\nThe minister said it was noted that half of the total electricity generation capacity was installed during the previous tenure of Pakistan Muslim League-Nawaz (PML-N) government (2013-2018).\nIronically, it was the last Pakistan Tehreek-e-Insaf (PTI) regime, which accused the PML-N government of setting up additional power plants, but not a single project was initiated during its four years to further increase the generation capacity to meet the ever growing demand, she stressed.\nMarriyum said the cabinet, on the recommendation of the Finance Division, okayed appointment of the “Crowe Hussain and Co” as the external auditors of Securities and Exchange Commission of Pakistan for the fiscal year 2021-22.\nShe said it also ratified the decisions taken by the Cabinet Committee on Legislative Cases (CCLC) in its meeting on June 29. The decisions included approval of the Intellectual Property Organization of Pakistan’s financial and services, the Publication of Laws of Pakistan (Amendment) Bill 2022 and the National Accountability (Amendment) Bill 2022.\nThe minister said the cabinet also accorded approval to the decisions taken in the Cabinet Committee on Privatization’s meeting, held on June 24.\nShe said a task force, headed by Defence Minister Khawaja Muhammad Asif, was formed for devising a legal framework of government-to-government commercial transactions.\nThe task force would also discuss the revival of Pakistan Steels Mill and review the privatization of a hotel and projects related to the power sectors, she added.\nShe said the presentation of the task force on solar energy would be presented in the cabinet’s next meeting. Similarly, the task force on agriculture would also present its proposals before the next cabinet meeting for implementation of the incentives given to the sector in the current financial budget, she added.\nThe minister said the cabinet, after due deliberation, approved the recommendations of the Interior Ministry for removal of five persons’ names from the Exit Control List.",
  "retrievedAt": "2025-08-11T15:11:56.892Z"
}
