{
  "title": "IHC again orders Gov’t to produce missing people by Sep 9",
  "link": "https://www.app.com.pk/national/ihc-again-orders-govt-to-produce-missing-people-by-sep-9/",
  "date_published": "2022-07-04T15:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 04 (APP): The Islamabad High Court (IHC) on Monday giving final opportunity to the federation for taking measures to recover the missing persons said that the chief executive would appear on September 9, if no concrete steps were taken.\nChief Justice Athar Minallah heard the cases regarding the recovery of missing persons including journalist Muddasir Naro.\nDeputy Attorney General Arshad Mehmood Kayani said that the interior minister couldn’t appear due to the cabinet meeting.\nHe sought adjournment due to unavailability of attorney general of Pakistan due to sickness.\nAt this, the chief justice said that the court wouldn’t adjourn the case. Justice Minallah said that the two forums had declared that it was a case of forced disappearance but then what happened. It was clear that the current and previous governments had no active role in the matter, he remarked.\nThe court remarked that it would move forward only in accordance of the constitution.\nFederal government and chief executive were responsible to protect the basic human rights, it added.\nThe DAG said a committee had been formed on the subject and it would also hold a meeting tomorrow.\nThe chief justice asked what the court should do now when the all institutions included in the JIT had declared it the matter of forced disappearance.\nThe DAG said he assure the court that the cabinet committee would view the matter.\nThe DAG further said that the interior ministry had written to the federal cabinet to seek affidavits from former chief executives.\nHe prayed the court to grant sometime to the incumbent government as it was aware of the feeling of petitioners and viewing the matter seriously.\nThe attorney general wanted to give arguments by himself in it, he said.\nThe chief justice asked the DAG to tell AGP for arguments through video link as the court wanted to hold someone accountable.\nThe DAG said most of the cases were of previous regimes and requested the court to directly summon the former chief executives for answering.\nFarhatullah Baber said that chairman Commission of Inquiry on Enforced Disappearance (CoIED) had told the senate body in 2018 that 153 persons of an institution were involved in the incidents of missing people.\nThe 111 people who released from Adyala Jail were listed from the gate, he said. At this, the chief justice asked that what the parliament had done on it.\nFarhatullah Baber said the house had introduced a law to bring the institution in order. The chief justice remarked that the said institution come under Prime Minister in accordance of the Constitution.\nAmna Janjua said that the commission had been issuing the production orders against the missing persons for years.\nThe commission should hold in camera session so they may at least know whether their family members were alive or not, she said.\nThe court remarked that the top court had given judgment in 2013 but it was never implemented. Abid Nazeer Advocate adopted the stance that the Prime Minister should be summoned before passing any order.\nTo a query regarding appearance of former interior minister Sheikh Rasheed, the DAG said that he was not in their control. He said 600 people were still missing out of 8,400, adding that many people were playing double role in this case.\nTo a question by the court, the deputy secretary interior ministry said FIA, FC KPK and Balochistan come under the control of the ministry while the IB and ISI were under the Prime Minister.\nThe court appointed Farhatullah Baber and member Islamabad Bar Abdi NazirAdvocate as amicus curiae, and once again ordered the government to recover the missing people. The court said that if concrete measures were not taken then the\nChief Executive would appear on September 9, for clarification.Meanwhile, in a written order the court asked the Prime Minister to ensure appearance of the missing persons on next hearing otherwise he would appear to answer on the matter. The order said the chief executive would appear at 10:30am on September 9. It further said the AGP was also being given last chance for arguments.",
  "retrievedAt": "2025-08-11T15:11:56.987Z"
}
