{
  "title": "Kaira blames PTI government’s negligence for power outages",
  "link": "https://www.app.com.pk/national/kaira-blames-pti-governments-negligence-for-power-outages/",
  "date_published": "2022-07-04T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 4 (APP): Prime Minister’s Advisor on Kashmir Affairs and Gilgit-Baltistan Chaudhry Qamar Zaman Kaira on Monday said that the people were enduring power outages due to the sheer negligence of Pakistan Tehreek-e-Insaf (PTI) led government, which had failed to commission several power generation plants as per schedule.\nSpeaking in media news conference flanked by minister for Information and Broadcasting Marriyum Aurangzeb, Minister of State for Petroleum Dr Musadik Malik, Minister for Energy Khurram Dastigeer, Advisor to the Prime Minister on Kashmir Affairs and Gilgit-Baltistan Qamar Zaman Kaira said the PTI government had delayed projects of about 4,000 megawatts which had to be completed by 2020 or 2021.\nAnd the prevalent situation of power outages could have been avoided, if those projects were timely completed. Difficult decisions were taken to save the country from default.\nHe said Prime Minister has directed to minimize the power outages to three hours as the coalition government was quite well versed in the problems being faced by the people due to inflation.\nThe power supply situation would improve within next four to five days as about 2,000 mw cheap power would be added in the system due to increased in inflows and enhanced hydel production from Tarbela dam.\nThe lackadaisical approach of PTI government has multiplied the miseries of the people and incumbent government was trying utmost to minimize the impacts of inflation on masses, he said.\nThe demand of power has jumped to 30,000 mw as comparing to production of nearly 24,000 mw. Despite paying Rs 1072 billion subsidy on power this year, the circular debt was increased by Rs 283 billion.",
  "retrievedAt": "2025-08-11T15:11:57.041Z"
}
