{
  "title": "Indian aggressive posture against AJK, Pakistan cannot be overlooked: AJK President",
  "link": "https://www.app.com.pk/national/indian-aggressive-posture-against-ajk-pakistan-cannot-be-overlooked-ajk-president/",
  "date_published": "2020-10-31T06:40:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Oct 31 (APP): Azad Jammu Kashmir (AJK) President Sardar Masood Khan while warning of the increased Indian aggressive posture in the region said that the latest threat from the Indian rulers to fight a war inside Pakistan and Azad Kashmir should serve as an alarm bell as they have come from not any layman but the Indian prime minister, defence minister and the national security adviser.\nAddressing Kashmir conference organized by Markazi Jamiat Ahle Hadith Pakistan in Punjab province metropolis on Friday, he said that India had been acquiring weapons and war arsenal from all over the world, and the stockpiling of these weapons warrant us to remain alive to India’s nefarious designs and prepare ourselves to respond to the looming dangers, AJK President office said late Friday.\nThe State President said that the existing global order which had been siding with the powerful instead of the weak had become ineffective as the big powers are either silent over brutalities as well as crimes against humanity being perpetrated in occupied Kashmir or they are supporting India. In this situation, we ourselves would have to awaken and would also have to awaken the whole Muslim community.\nHe warned that on the one hand, the enemy intended to crush us through its military might and on the other hand, creating a wedge in our rank and file to weaken our strength. “The small conferences and the lip service would never resolve the Kashmir issue,” he said adding that we would have to launch an effective campaign across the world to capture the attention of the United Nations, and to compel the influential world powers to break their silence.\nSardar Masood Khan stressed the need for mobilizing over ten million Pakistani and Kashmiri expatriates to further accelerate our efforts around the world in the changed situation. Kashmir has now become a humanitarian issue, and the big powers can be persuaded to play their role in resolving this human crisis.\n“Spread the voice of the oppressed people of Occupied Kashmir to nook and corner of the world and its echo should be heard in Paris, New York, London, Brussels, Geneva, Vienna, Dhaka and Kuala Lumpur,” Khan emphasized.\nHe maintained that we have a model of the Vietnam War and the anti-racism movement in South Africa, where pressure from the people forced the United States to end the war in Vietnam and the pro-apartheid regime to abolish racism in South Africa.\nAbout Eid Miladun Nabi, the state president said that the Great Prophet Hazrat Mohammad ? is the most sacred personality in this world, and we could not tolerate His insult.\nHe was the benefactor of not only the Muslims but the whole of mankind. The blasphemy in France had hurt our sentiments. However, it is a matter of great satisfaction that the whole Muslim world had shown strong reaction over it, He said a forceful campaign to boycott French products is going on from Tokyo to Washington.\nSimilar campaign is required against India also because India is killing Kashmiri Muslims for being followers of the Great Prophet. The conference was also addressed among others by the Chief of Markazi Jamiat Ahle Hadith Prof. Sajid Mir, Allama Ibtisam Ilahi Zaheer, Allama Moatasim Alahi Zaheer and Syed Attiqur Rehamn Shah besides Secretary-General Jamiat Ahle Hadith Azad Kashmir Daniyal Shahab Madni and Hafiz Farooq Rahimi.",
  "retrievedAt": "2025-08-11T19:57:48.495Z"
}
