{
  "title": "Professional competence hallmark of successful military leadership: COAS",
  "link": "https://www.app.com.pk/national/professional-competence-hallmark-of-successful-military-leadership-coas/",
  "date_published": "2022-08-12T13:08:00.000Z",
  "source": "APP",
  "content": "SANDHURST, Aug 12 (APP): Chief of Army Staff (COAS), General Qamar Javed Bajwa on Friday said no one was born with professional knowledge, it had to be acquired through constant pursuit as without it, one could not achieve professional competence, which in turn was the hallmark of successful military leadership.\nThe Army Chief was addressing at the sovereign’s parade for commissioning course 213 (CC213) of the Royal Military Academy Sandhurst (RMAS) as the first ever Pakistani chief guest to be the representative of the Queen during the sovereign’s parade at the Military Academy Sandhurst.\nThe Army Chief said, “As a leader today, you need to have courage and ability to take difficult decisions and then accept full responsibility. Correct decision-making requires competence and confidence, which can only be acquired through high class military education, rigorous training and continuous study of military history.”\nHe further said, “In the words of Sir Basil Liddle Hart and I quote ‘An officer who has not studied military history as science, is of little use beyond the rank of a captain.’ You must also understand that persona of a just and impartial commander, who exhibits merit in dispensation of reward and punishment, is the one who will earn unconditional loyalty and obedience of their under command.”\nThe COAS said Sandhurst, for over 200 years had groomed young boys and girls from United Kingdom, Common Wealth Countries and Royalty from across the globe, adding, “Your alma mater is without a doubt, one of the finest military institutions in the world which has produced some of the greatest military leaders that this world has seen.”\n“Graduating from Sandhurst is of course a matter of great honor and pride. Today, I see that pride on your beaming faces, just as I see it reflected on the faces of your loved ones sitting across the square. You all deserve this moment of fulfillment – you, for the remarkable hard work and dedication, and your families, for all the patience and support that was lent to you by them. Two Pakistani cadets would also be graduating with you today. Let me say that I am as proud of you all, as I am proud of them.”\nHe underlined that his presence at this occasion bore testimony to the deep-rooted relationship that existed between Pakistan and the United Kingdom, based on mutual respect and shared values which were carefully nurtured by both nations over many decades.\n“Our huge Pakistani diaspora in United Kingdom displays the strength of our historic relationship. I am sure that this relationship will scale greater heights in times to come.Similarly, the bondage between the two armed forces is uniquely special as well, forged on the battlefields of Great Wars and kept alive over the years through exclusive regimental affiliations and close professional contact in training and a myriad of other military activities.”\nAddressing the Officer Cadets, he said, “The journey that awaits you is challenging as well as exciting. The demands of professional military service will be much high as you grow in service. You need to equip yourselves with lofty attributes of leadership, with clear sense of purpose, to gain respect and trust of your subordinates.”\nHe added that it was only through development of unwavering trust and confidence that you could instill Esprit-de-Corps ( the common spirit existing in the members of a group and inspiring enthusiasm, devotion, and strong regard for the honor of the group) in your under command, which would hold you together in times of crisis.\nHe underlined that as a direct consequence of the onset of fourth industrial revolution, dual use technologies and niche capabilities led by artificial intelligence were fundamentally altering the character of future war. The battlefield of tomorrow would be characterized by extreme precision, lethality and transparency which would be particularly challenging for military leaders, especially young officers in the battle, both mentally and physically, he added.\n“This future is inevitable, and each one of you would have to adapt to new realities in the technological domain to ensure successful outcome in the battle. While it is important to understand this change in the character of war, let me tell you about some realities in battlefield that are immune to the ebb and flow of technological advancements and WOULD NEVER CHANGE, let me enumerate a few. First! The value of keeping up a brave face in front of your troops, when you are as shattered and frightened inside as all of them. The contagious energy that you will instill in your troops, when you would lead them by example and not merely by words.”\nHe emphasized, “Remember, when lot of lead was flying in the air in the battlefield, an officer never says advance, rather always says follow me. The importance of keeping the wellbeing of your troops ahead of your own, is the hallmark of a successful military leader. The essence of the last point cannot be better articulated than what was said by Field Marshal Philip Walhouse Chetwode, who said and I quote:‘The safety, honor and welfare of your country come first, always and every time. The honor, welfare and comfort of the men you command come next. Your own ease, comfort and safety come last, always and every time.”\nHe mentioned that these eternal words were boldly etched even today on the walls of Brig Francis Ingall Memorial Hall, in Pakistan Military Academy to remind every officer cadet of the importance of these essential tenets of military leadership.\nThe COAS said the primary reason for armed forces to exist today, should not be to prosecute wars, but to ensure that they do not take place. “Mankind’s destiny, more than ever before, hinges on our collective capacity to come together and take the route of peace and cooperation instead of conflict, communication instead of clash and multilateralism instead of self-preservation.”\nHe concluded with his best wishes and prayers for the officer cadets, “I wish and pray for your rewarding careers ahead. May you serve your countries with honor, dignity and pride.”\nHe also applauded the efforts of Commandant RMAS and his team for this impressive parade, adding, “I would like to pay my rich tribute to Major General Duncan Capps, Commandant Royal Military Academy who is retiring today. Be rest assured General, that your 37 years of meritorious services will always be remembered and acknowledged. I wish you all the best and God speed for your future endeavors.”",
  "retrievedAt": "2025-08-11T15:23:21.816Z"
}
