{
  "title": "Convention pledges to protect women’s rights",
  "link": "https://www.app.com.pk/national/convention-pledges-to-protect-womens-rights/",
  "date_published": "2022-08-12T13:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP):Women convention on Friday unanimously pledged protecting, upholding women’s rights as enshrined in the Constitution besides ensuring social, political and economic empowerment of women as their respective party manifestos provide a central focus to women.\nIn a resolution adopted by the convention, organized by National Assembly’s Women Parliamentary Caucus (WPC) here at National Assembly Hall, in connection with Diamond Jubilee celebrations of first Constituent Assembly, the resolution said that the representation of women and men in health, education, economy, and politics validates the foundations of democracy and renders legitimacy to it.\nThe resolution said the women convention was committed to practice gender-sensitive budgeting and uplifting institutions working on women specific issues.\nThe resolution said the participants were committed to eradicate all forms of social, economic and political discrimination against women.\nThe women participants including legislators, pledged to utilize their legislative authority in improving lots of womenfolk. It committed providing opportunities for education of girls.\nIt said the members of Women’s Parliamentary Caucus and representatives of political parties, participating in the Diamond Jubilee Convention appreciate women’s illustrious contributions in the creation of Pakistan and its freedom struggle.\nThe resolution recalled that the Constitution of Pakistan which recognizes Quran and Sunnah as the basic source of governance, provides women full rights, rejects all forms of discrimination, and promotes their full participation in public life under Articles 25, 34, 35 and 37 of the Constitution.\nThe resolution noted that the National and International commitments of Government of Pakistan including the National Policy for the Development and Empowerment of Women (NPDEW) 2002, underscore attainment for women in the public and political spheres.All the women leaders of Pakistan particularly Mohtarma Fatima Jinnah, Begum Ra’na Liaqat Ali and Shaheed Mohtarma Benazir Bhutto whose courage and exemplary contributions in public and political life have greatly inspired, built a sense of confidence and empowered the Pakistani women.\nThe resolution recognized that Pakistan ranks 145 out of 146 countries at recent Global Gender Gap Report covering the four critical areas: health and survival, education attainment, economic participation and opportunity, and political empowerment.",
  "retrievedAt": "2025-08-11T15:23:20.588Z"
}
