{
  "title": "PM to unveil newly recorded National Anthem on August 14",
  "link": "https://www.app.com.pk/national/pm-to-unveil-newly-recorded-national-anthem-on-august-14/",
  "date_published": "2022-08-12T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP): Shehbaz Sharif will become the second prime minister after the first elected prime minister of Pakistan Liaquat Ali Khan, who will unveil the newly recorded National Anthem on August 14.\nAfter the establishment of Pakistan, for the first time in December 1948, a Government of Pakistan committee led by Sardar Abdur Rab Nishtar began working on creating the National Anthem.\nThe music composed by Ahmad Chagla for the National Anthem was presented before Prime Minister Liaquat Ali Khan and other members of the committee, and it was approved on August 10, 1950.\nThe anthem written by Hafeez Jalandhri was formally approved in August 1954.\nThe Pakistan Muslim League-Nawaz government started the process for the second recording of the National Anthem in August 2017. In this connection, all prominent newspapers published advertisements.\nA steering committee headed by Senator ® Javed Jabbar with audio and visual sub- committees were formed for re-recording of the anthem.\nAfter Marriyum Aurangzeb assumed the office of Minister of Information and Broadcasting in April this year, work on the project was sped up.\nThe Ministry of Information and Broadcasting along with other institutions, departments and a large number of artists worked together to complete the national effort. The armed forces, including the Inter-Services Public Relations (ISPR) and their bands also collaborated.\nAbout 155 singers, 48 composers and six band masters participated in the preparation of the anthem. The noteworthy fact is that it was recorded with a new orchestra and cinematography.\nThe new recording of the National Anthem is a rainbow of cultural, civilizational and regional colours, which gives a message of unity, brotherhood and regional identity.",
  "retrievedAt": "2025-08-11T15:23:09.572Z"
}
