{
  "title": "British High Commission staff plants 75 trees to mark 75 years of UK-Pakistan relations",
  "link": "https://www.app.com.pk/national/british-high-commission-staff-plants-75-trees-to-mark-75-years-of-uk-pakistan-relations/",
  "date_published": "2022-08-12T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 12 (APP):To commemorate 75 years of UK-Pakistan relations, British High Commission staff joined by Chevening alumni and personnel from the Islamabad Capital Development Authority on Friday planted 75 trees native to Pakistan, in the Shakarparian National Park.\nThis activity complements a vast year-long tree planting program carried out in the UK by the British Pakistan Foundation and Pakistan High Commission.\nNamed ‘The Legacy Project’, this was launched to celebrate the achievements of British Pakistanis over the last 75 years. A total of 7,500 trees are set to be planted, said a press release issued here by the British High Commission.\nThe UK – Pakistan relationship has gone from strength to strength this year, with major events such as the independence anniversary and the Birmingham Commonwealth Games revitalizing deep people-to-people ties.\nOn the occasion, the Acting British High Commissioner Andrew Dalgleish said: “Right now the UK and Pakistan are collaborating to tackle some of the world’s most pressing challenges from driving forward action on climate change to improving gender equality.\nI know that we will continue to do so over the next seventy-five years. Happy Birthday, Happy Independence Day, Azm-e-aali Shaan, Shaad rahe Pakistan!” It is pertinent to mention here that in celebration of the achievements of British Pakistanis during the last 75 years in the UK, ‘The Legacy Project was launched at the Pakistan High Commission London on 18 July 2022.\nThe Project is a collaborative effort by the British Pakistan Foundation (BPF) in partnership with the National Trust, World Congress of Overseas Pakistanis (WCOP), The Pakistan Society, and a host of other British Pakistani organizations.",
  "retrievedAt": "2025-08-11T15:23:20.039Z"
}
