{
  "title": "KIIR hosts webinar paying tribute to July 13 martyrs",
  "link": "https://www.app.com.pk/national/kiir-hosts-webinar-paying-tribute-to-july-13-martyrs/",
  "date_published": "2022-07-14T07:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP):Kashmir Institute of International Relations (KIIR) has hosted a webinar titled “Kashmir Martyrs Day: Remember the martyrs of July 13, 1931”.\nThe webinar was attended and addressed by noted human rights activists, academicians, writers and political leaders hailing from both sides of the Line of Control including Shah Ghulam Qadir President Pakistan Muslim League AJK chapter, Ch. Latif Akbar Opposition Leader AJK Assembly,Ab. Rasheed Turabi former Ameer Jammat Islami AJK, Ghulam Muhammad Safi, Muhammad Farooq Rehmani, Sardar Hassan Ibrahim, Syed Ali Raza, Raja Najabat, Zaffar Qureshi, Ershad Mahmud, Syed Arif Bahar, Raja Sajad Latief  and others.  Whereas the event was moderated by the KIIR Chairman Altaf Hussain Wani.\n“The current struggle in Kashmir is an extension of the movement, which was launched against despotic Maharaja. From 1931 till date more than half a million Kashmiris have offered sacrifices to achieve the cherished goal”, they said.\nTerming right to self-determination as the only acceptable solution the speakers made it clear that no piece of legislation by the Indian parliament can change the disputed status of Jammu and Kashmir.\nRejecting the actions Modi government had taken on Kashmir since 5th August 2019, they said, “Kashmir is an internationally recognised disputed territory that needs to be settled in accordance with the universally accepted principle of right to self-determination”.\nRenewing their pledge to uphold the martyrs’ mission they said the struggle for right to self-determination would continue unless and until Kashmiris get their cherished goal. Drawing parallels between the ongoing struggle and the movement against Maharaja’s autocratic rule, they said, “Kashmiris were still struggling for their basic rights.”\nHighlighting the dangerous dimensions of the dispute, they said international community should come forward in a big way to help Kashmiris in shaping up their political destiny through universally accepted principle of right to self-determination.\nThey urged the United Nations to impress upon India to implement the relevant UN resolutions on Kashmir to settle dispute peacefully.\n“The world community must take effective cognizance of the fast deteriorating political and human rights situation in the Indian occupied territory”, they said. Voicing their grave concerns over the continued bloodshed and violence in the restive region, the panelists said, “It is high time that the UNSC and OIC must call an emergency session to help stop widespread killings of civilians in Kashmir”.\nReferring to uptick in the incidents of state terrorism in Kashmir they said, “The Modi government is following a vicious game-plan, on one hand it keeps harping on the so-called normalcy narrative to befool international community while on the other it has let loose its troops who continue to kill Kashmiris day in and day out”.",
  "retrievedAt": "2025-08-11T15:14:47.240Z"
}
