{
  "title": "Govt to provide Rs 1m compensation to families of torrential rains, flood victims: PM",
  "link": "https://www.app.com.pk/national/govt-to-provide-rs-1m-compensation-to-families-of-torrential-rains-flood-victims-pm/",
  "date_published": "2022-07-14T13:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP): Prime Minister Shehbaz Sharif on Thursday announced that the government would provide compensation of Rs 1 million each to the families of those who lost their lives during the floods and torrential rains across the country including Balochistan and Khyber Pakhtunkhwa.\nThe prime minister, chairing a high-level meeting held to discuss the flood situation in both the provinces, said the compensation would be given after a joint survey of the National Disaster Management Authority (NDMA) and the provincial disaster management authorities.\nThe prime minister directed the acting NDMA chairman to immediately reach Quetta and work with the Balochistan government for the relief and rehabilitation of the flood-affected people.\nCalling for coordinated efforts between the federal and provincial governments, he said there was no room for complacency.\nThe prime minister asked the NDMA to increase its presence in flood-affected areas of Balochistan and KP.\nHe said due to Allah Almighty’s blessings, all of the country’s dams were safe and secure and that the situation was being monitored round the clock.\nHe told the meeting that he would soon visit Balochistan to assess the extent of the damage and express solidarity with the flood-affected population.\nThe prime minister instructed all federal and provincial government departments to be on high alert in view of the more monsoon rains in the coming days.\nHe said that the whole nation was deeply grieved over the loss of precious lives as a result of the torrential rains and floods.\n“We are with the bereaved families in this hour of grief,” he assured.\nThe prime minister observed that Balochistan and KP governments had done well so far but more needed to be done.\nHowever, he assured them that the federal government would provide all possible support.",
  "retrievedAt": "2025-08-11T15:14:42.647Z"
}
