{
  "title": "PR to renovate railway stations to facilitate passengers",
  "link": "https://www.app.com.pk/national/pr-to-renovate-railway-stations-to-facilitate-passengers/",
  "date_published": "2020-12-31T14:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 31 (APP): The government has allocated around Rs 50 million in the Public Sector Development Programme (PSDP), 2020-21 for the up-gradation and renovation of railway stations across the country.\nThe renovation of the railway stations had been approved by the Central Development Working Party (CDWP) in 2018 and the department had already upgraded six railway stations in different parts of the country, said an official in the Ministry of Railways told APP.\nHe said the names of the upgraded railway stations were Bahawalpur, Raiwind, Narowal, Okara, Sahiwal and Gujranwala.\nThe upgradation works of the five railway stations including Hassan Abdal, Nakana Sahib, Peshawar Cantonment, Karachi Cantonment and Lahore were in progress and would completed soon.\nThe official said the basic aim of the upgradation was to facilitate the passengers and improve the outlook and modernize the railway stations.\nPakistan Railways had upgraded the passenger waiting halls, prayer area, operation offices, water filtration plant, toilets, passenger shelter, platforms, ticket counters, parking area and external development work.\nAbout the two major railway stations of Rawalpindi and Rohri, he said the tenders had been floated and under process of final approval The present government was encouraging the private partners and builders for renovation and up-gradation of the railway stations.\nPakistan Railways was also planning to reconstruct 11 bridges and repair another 55 across the country to ensure smooth operation of trains and safety of the passengers.\nThe department would reconstruct three bridges in Sukkur Division, six in Multan and two in Lahore.\nAbout the repair of bridges in different divisions, Pakistan Railways had planned to repair 34 bridges in Karachi, 11 in Sukkur, two in Multan, five in Rawalpindi, two in Peshawar and one in Quetta.\nAround 86 percent of bridges were more than 100 years old but all of them were safe for train operation due to regular maintenance, rehabilitation and strengthening of the bridges.\nPakistan Railways has 13,959 major and minor bridges over the system and their design life varies for different years.\nThe standard operating procedure calls for inspection of bridges in accordance with the different schedules like monthly, quarterly, biannually and annually.",
  "retrievedAt": "2025-08-11T20:12:17.362Z"
}
