{
  "title": "Sardar Masood condemns unprovoked Indian attack on civilian population along LOC",
  "link": "https://www.app.com.pk/national/sardar-masood-condemns-unprovoked-indian-attack-on-civilian-population-along-loc/",
  "date_published": "2020-12-31T14:26:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Dec 31 (APP): Azad Jammu and Kashmir President Sardar Masood Khan Thursday strongly condemned ceasefire violation by Indian occupation forces in different sectors of the Line of Control in Kotli district of Azad Kashmir, which resulted in the martyrdom of a Pak Army soldiers and injuries to a civilian.\n“The deliberate targeting of the civilian population and the civilian infrastructure by Indian troops in Khoiratta sector of AJK is highly reprehensible,” the President said and expressed his deep grief and sorrow on the martyrdom of a soldier, Fazal Elahi in Khoiratta sector and indiscriminate fire in Phalni Bazar in Kotkotera Sector, which left a civilian critically wounded.\nTerming the Indian act of targeting civilians as unwarranted and contrary to the principles of law and humanity, President Khan said by raising tensions along the Line of Control (LoC) and the Working Boundary, India wants to divert attention from the grave human rights situation in the Indian Occupied Jammu and Kashmir (IIOJK).\nCiting a report prepared and released by Kashmir Media Service on the human rights situation in Indian Illegally Occupied Jammu and Kashmir which covers the period from January 1 to December 30, 2020, the AJK President said Indian occupying forces conducted 312 cordons and search operations (CASOs) and martyred 232 people during the year besides destroying 657 residential houses during such so-called operations.\nThe martyrs included 65 civilians, 232 freedom fighters while 177 Indian forces were also killed, the report said and added that the Indian forces launched broad-day inhuman attacks on Kashmir’s civil society, raiding residencies and offices of human rights defenders, journalists and civil society organizations.\nPresident Masood also strongly condemned the killing of three students by Indian troops in Lawaypora area of Srinagar city and destruction of several residential houses in their fresh act of state terrorism in a fake encounter on Wednesday.\nExpressing grave concern over the fast-growing human rights violations by Indian troops in the occupied territory, Masood Khan warned the Indian government to refrain from such tactics and bear in mind that the brutal use of force cannot deter people of Kashmir to abandon their struggle.\nThe Kashmiris, he maintained are determined to continue their struggle for securing their right to self-determination till complete success despite inhuman atrocities being committed by occupying forces in the illegally occupied territory.",
  "retrievedAt": "2025-08-11T20:12:15.914Z"
}
