{
  "title": "KP CM directs acceleration of land record digitalization",
  "link": "https://www.app.com.pk/national/kp-cm-directs-acceleration-of-land-record-digitalization/",
  "date_published": "2020-12-31T14:46:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 31 (APP): Khyber Pakhtunkhwa Chief Minister Mahmood Khan Thursday directed the Revenue Department to speed up the digitization of land record and take immediate steps to functionalize all the service delivery centers in the province.\nHe directed physical progress on the implementation of all the reforms initiatives as per the given timelines.\nThe chief minister issued these directives while presiding over a progress review meeting on reform initiatives being introduced in Revenue Department.\nProvincial Minister Qalander Khan Lodhi, Senior Member Board of Revenue Syed Zafar Ali Shah, Principal Secretary to CM Shahab Ali Shah and others attended the meeting.\nThe meeting was told that major reforms are underway in Revenue department Khyber Pakhtunkhwa to change the entire Patwar culture whereas various Information Technology interventions are being introduced in land record, mutation, registration, tax collection and all other matters of the department to ensure maximum transparency and efficiency.\nMehmood Khan directed the department to ensure issuance of Fard of lands to the applicants within two days after applying and also directed that a comprehensive strategy should also be devised to make the land acquisition process for government departments fast and easier.\nThe meeting was briefed in details about the performance of revenue department, and was informed that the department, through tax reforms had done away with duplication of various taxes and has reduced its tax ratio by 4.5% in order to give maximum relief to the general public and added that this step has increased the overall tax collection ratio of the department.\nThe meeting was further informed that Rs 4904 million were collected during the last fiscal year which was the 87% of target. Similarly, during the first five months of current financial year Rs 2877 million have been collected which is the 65% of total target.\nIt was further told that 1500 Kanal state land has been retrieved so far having the total cost of Rs 2 billion adding that under the Revenue Court Disposal System 24,524 cases have also been addressed so far whereas 19 Service Delivery Centers have been established in the different districts of the province.\nAll facilities including E-Challan for issuance of Fard and land mutation through biometric verification etc would be available for people under the one roof.\nThe forum was told that, digitization process of land record of 58 tehsils of different districts would be completed by June 2022 whereas a project for the digitization of land record in newly merged districts would be launched soon.\nWhile appraising the forum about reforms initiatives undertaken by the department, it was briefed that selection of Patwar training would be made through ETEA adding that female quota had been introduced in Patwar for the first time in history of the country.\nFurthermore, new Patwar course had been approved which include the syllabus based on Geographic Information System and computer training.\nMoreover, centralization of software system, establishment of land record complex and re-structuring of Board of Revenue was also in progress.\nTouching upon the legislative reforms, the forum was told that in July last year Land Acquisition Rules 2020 had been framed with special provisions regarding land acquisition in merged areas adding that framing of E-stamping rules 2020 was also in progress.",
  "retrievedAt": "2025-08-11T20:12:14.393Z"
}
