{
  "title": "Govt ready to hold talks with opposition except NRO, early elections: Shafqat",
  "link": "https://www.app.com.pk/national/govt-ready-to-hold-talks-with-opposition-except-nro-early-elections-shafqat/",
  "date_published": "2020-12-31T17:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 31 (APP): Federal Minister for Education and Professional Training Shafqat Mehmood on Thursday said the government was ready to hold talks with opposition on every national issue except holding early elections and National Reconciliation Ordinance.\nTalking to a private news channel, he said the opposition should come in the parliament and discuss the national issues including institutional reforms,improving national economy, electoral reforms and agriculture as well but they were using different tactics to get relief in corruption cases which were registered against their leaderships, he added.\nThe minister said the government would not make any compromise over the matter of accountability of the corrupts at any cost.He said Opposition parties had entered in blind alley now.\nShafqat Mehmood said the opposition parties were failed to get support of the people against the government during their political gatherings, adding Pakistan Democratic Movement was a flopped show and it was divided by itself now.\nReplying to a question, he said coronavirus was not the reason of PDM’s failure but their narrative which they had adopted against the national institutions, he said adding people were well aware about the massive corruption of PDM’s leaderships.\nHe said opposition was the group of power hungry people as they were trying to topple the Democratically elected government but they would not succeed in their objectives.\nHe said Nawaz Sharif and his daughter Maryam Nawaz were trying to malign the national security institutions for protecting their personal interests.\nOpposition was not serious to tender their resignations but they were using it as political stunt nothing else, he added.",
  "retrievedAt": "2025-08-11T20:12:11.327Z"
}
