{
  "title": "Shehryar Afridi urges media to expose Indian proxies targeting Pakistan",
  "link": "https://www.app.com.pk/national/shehryar-afridi-urges-media-to-expose-indian-proxies-targeting-pakistan/",
  "date_published": "2020-12-31T02:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 31 (APP):Chairman Kashmir Committee Shehryar Khan Afridi Thursday urged the media to expose indian proxies targeting Pakistan with fabricated facts and blatant lies in violation of international norms and freedom of speech and expression.\nPakistani media should raise awareness among our youth that how Indian proxies spread lies through fake NGOs, media houses and intelligentsia and academia to mislead the world.\nHe expressed these views while talking to a delegation of the EU-Pak Friendship Federation here.\nAfridi said that the EU Disinfo Lab report, titled as ‘Indian Chronicles’ has uncovered a massive operation targeting international institutions and serving Indian interests.\nHe said the report resurrected dead media, dead think-tanks and NGOs working to target Pakistani and Kashmiris’ interests.\n“It even resurrected dead people. This network is active in Brussels and Geneva in producing and amplifying content to undermine – primarily – Pakistan,” said the Chairman of the Committee, adding that this operation by EU Disinfo Lab has busted the world’s biggest fake media network.\n“Despite the fact the EU Disinfo Lab has unearthed a massive vicious network consisting of Indian proxies targeting a sovereign nation with fabricated facts and blatant lies, it is unfortunate to note that Pakistani media has not been able to fully project this issue globally,” he said.\nShehryar Khan Afridi said that the Pakistani diaspora is our real power and Pakistan takes pride in them as they are fighting for Pakistan’s cause abroad.\n“You are unsung heroes of Pakistan. Indian forces are carrying out worst genocide of Kashmiri people in Indian Illegally Occupied Jammu and Kashmir. Kashmir Committee has been working days in and days out to project and promote the cause of Kashmir freedom struggle and expose Indian ploys against the Kashmiri people,” he concluded.\nThe delegation was led by the federation’s president Chaudhry Perveiz Iqbal Losar.\nSyed Majid Abbas, Syed Khalid Abbas, Mohammad Asif Arshad, Khurram Riaz and Mudassir Hussain were also a part of the delegation.",
  "retrievedAt": "2025-08-11T20:12:11.365Z"
}
