{
  "title": "Punjab opposition rubbishes budget as ‘anti-people’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Opposition Pakistan Tehreek-i-Insaf (PTI) on Monday termed the provincial budget 2025-26 an anti-people document and lodged a protest against it in the Punjab Assembly.\n\nThe opposition members tore down the budget copies and continued shouting slogans during the speech of Finance Minister Mujtaba Shujaur Rehman. The treasury members matched the opposition’s sloganeering by chanting “Maryam, Maryam.”\n\nPunjab Assembly Opposition Leader Malik Ahmad Khan Bhachar said the farmers are dying and this budget had nothing for them. Agriculture in Punjab had been destroyed, he said and deplored that the government didn’t purchase the farmers’ wheat. “How would it make flour cheaper?” he asked.\n\nPointing out that Chief Minister Maryam Nawaz has appeared in the House after one year, the opposition leader jibed at her, saying she might have been “selected” for the office, but she should attend the assembly proceedings regularly.\n\nBhachar said, “This is the worst budget in Punjab’s history as no relief is given to the poor.” He announced the opposition would present a ‘shadow budget’. He claimed the PTI members were ready to spend their salaries on public welfare.\n\nHe said the PML-N government imposed a 20 percent tax and increased salaries of government employees by 10pc only.\n\nOn the other hand, speaking to journalists after the presentation of the budget, CM Maryam said, “It is the largest annual development programme in Punjab’s history. May Allah grant us success in implementing it. We want to serve the people of Punjab with sincerity and dedication.”\n\nPPP MPA Nargis Faiz regretted that MPAs’ salaries have been increased by 500pc without holding any debate on the issue in the House. “We do not support this budget morally and will protest against it,” she said.\n\nPublished in Dawn, June 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:08:49.093Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917575/punjab-opposition-rubbishes-budget-as-anti-people",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T00:26:50.000Z"
}
