{
  "title": "Karachi once again ranks among least liveable cities in global survey - Pakistan - DAWN.COM",
  "author": null,
  "content": "Karachi once again ranked in the bottom five of the world’s “least liveable cities” in a global survey by The Economist.\n\nAccording to the Economist Intelligence Unit, the metropolis ranked 170 on a list of 173 countries — just above Dhaka, Tripoli and Damascus — and had a score of 42.7 on the index score, with a score of 100 being “most liveable”.\n\nIt was the only Pakistani city to feature on the list, albeit poorly.\n\nTopping the list was Copenhagen, with a score of 98. Vienna and Zurich tied for second place at 97.1, followed by Melbourne at 97.0, and Geneva with a score of 96.8.\n\nThe annual survey, designed to help companies calculate hardship allowances when they relocate staff, rates 173 cities across five categories: health care, culture and environment, education, infrastructure and stability, according to The Economist.\n\nIn last year’s ranking, Karachi compared with Lagos, Tripoli, Algiers and Damascus. The year before, Karachi was ranked 169 out of 173 countries\n\nLast October, the Asian Deve­lopment Bank said the livability of cities in Pakistan is decreasing, and urban centres in the country are becoming increasingly inefficient, scoring low on multiple competitiveness indexes, with congestion, unattractiveness and pollution.\n\nThe ADB report assessed that class division was a major problem in Karachi since most of the elite live in cantonment areas or private housing societies, while those on low incomes have been pushed to the city’s largest district, Karachi East.\n\nThe city is further divided along religious and ethnic lines, which has led to several outbreaks of violence in the past. Karachi is the only city in Pakistan that, to some degree, is expanding vertically due to limited land and urgent housing needs, the report said.\n\nIn July, Karachi was ranked as the second riskiest city for tourists with a rating of 93.12 out of 100 according to a Forbes Adviser list.\n\nPer the ranking, Karachi had the highest personal security risk, reflecting risk from crime, violence, terrorist threats, natural disasters, and economic vulnerabilities.\n\nThe list said Karachi had the second-worst (level 3, reconsider travel) travel safety rating from the US State Department. It further said that the metropolis had the fourth-highest infrastructure security risk, reflecting the availability and quality of city infrastructure.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/17135642b11422d.png",
  "retrievedAt": "2025-08-20T04:08:44.260Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917680/karachi-once-again-ranks-among-least-liveable-cities-in-global-survey",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T09:42:05.000Z"
}
