{
  "title": "Punjab presents infrastructure-focused Rs5.33tr budget - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Health, education get major allocations\n• Govt employees’ salaries up by 10pc\n• Minimum pay raised to Rs40,000\n• 50,000 families to get house loans\n• Lahore remains priority for development schemes\n• Credible plan to boost tax revenues missing\n\nLAHORE: The PML-N government in Punjab on Monday proposed a Rs5.33 trillion annual budget for the fiscal year 2025-26, focusing primarily on large infrastructure schemes and freebies for the urban middle classes, especially the youth, as well as small industries and farmers to regain the political ground it had lost in its stronghold in the 2024 election.\n\nThe budget features a record Rs1.24tr Annual Dev­elop­ment Programme (ADP), which is Rs240 billion or 25pc greater than the federal Public Sector Development Progr­amme (PSDP), and commits to produce Rs740bn in estimated provincial surplus to meet a key IMF goal to hold down consolidated federal budget deficit.\n\nThe Provincial Consoli­dated Fund also includes a one-time income of Rs160bn under the head of ‘supernume­rary resource’ from an undisclosed source. This kind of irregular income is normally used to bridge the budget deficit. In this case, it is speculated to have been added to meet the provincial surplus condition of the IMF programme.\n\nFinance Minister Mian Mujtaba Shujaur Rehman presented the budget in Punjab Assembly.\n\nThe budget focuses the social sector with whopping allocations for health, education, infrastructure, local government, public safety and agriculture. Cumulatively, Rs2.61tr has been allocated, including Rs630.5bn, Rs811.8bn and Rs129.8bn for health, education and agriculture, respectively.\n\nThe budget, however, does not lay out a credible plan to boost tax revenues, except an incremental increase of 11.4pc to Rs525bn. The budget documents show the government had failed to collect the targeted tax of Rs471bn for the outgoing year as the collection is estimated to face a shortfall of around 10pc due to lower collection of GST on services and immovable urban property tax.\n\nOn the other hand, it reveals allocation of a considerable subsidy amounting to Rs165bn in total for various sectors, including Rs10bn, Rs40.8bn, Rs79.5bn and Rs35bn for agriculture, transport, free medicines and Ram­azan Package, respectively.\n\nDevelopment plan\n\nThe total layout of the budget includes ADP of Rs1.24tr—Rs398bn or 47pc more than the ongoing ADP and Rs240bn more than the PSDP for 2025-26.\n\nPunjab has proposed a 10pc raise in the salary of all government employees (BPS 1-22) and 5pc incre­ase in the pension of the retired employees, which is 2pc less than 7pc incre­ase in pensions as annou­nced in the federal budget. The budget also proposes an increase in the minimum wage from Rs37,000 to Rs40,000 per month.\n\n“We have allocated Rs148bn for education in the wake of development and Rs661bn for the non-development expenditures, which are 127pc and 24.4pc higher than the FY 2024-25,” the finance minister told the lawmakers in the House.\n\n“I am feeling proud to say that, like FY 2024-25, the health sector would also be our priority. For next fiscal year, we have allocated a record Rs128bn, which is 131pc higher than the FY 2024-25. For non-development expenditures, Rs450bn have been allocated, 16pc higher than the FY 2024-25,” he said.\n\nThe province expects to receive Rs4tr under the Federal Divisible Pool (FDP). It estimates to collect own-source taxes amounting to Rs524bn, and own-source non-tax receipts of Rs303bn, Rs102bn in capital receipts and recovery of loans, and Rs128bn in foreign project assistance.\n\nOn expenditure side, Punjab estimates to spend Rs2.03tr (current expenditures), Rs679bn on service delivery, Rs590bn as capital expenditures, Rs58bn (Food A/C-II), Rs1.2tr (ADP) and Rs740bn as estimated surplus.\n\nInitiatives\n\nThe government plans to introduce various initiatives, including continuation of laptop scheme for which over Rs15bn have been allocated.\n\nThe major initiatives to be launched in FY 2025-26 in various sectors include Rs101bn in education sector, over Rs72bn for health sector, Rs44.2bn for Social Welfare & PESSI, Rs4.8bn for irrigation, Rs84.5bn for transport and roads, over Rs43bn for agriculture, Rs13bn for forest; wildlife & fisheries and over Rs12bn for energy.\n\n“In 2025-26 FY, Rs15bn will be provided as scholarships to deserving students under the Honhaar Scholarship Programme. Similarly, Rs15bn have been allocated for provision of laptops to the eligible students under CM Punjab laptop scheme during FY 2024-25,” the minister explained.\n\nTalking about the surplus budget amounting to Rs740bn, the minister said: “To maintain the financial discipline under the agreement between the IMF and the federal government, Rs740bn EPS (estimated provincial surplus) has also been included in the budget. However, the provincial surplus’ implementation is subject to the achieving the federal revenue target by the FBR.”\n\nDuring FY 2025-26, the government plans to continue the “Apni Chat Apna Ghar Programme” under which it has provided houses to 50,000 families by providing Rs48bn interest-free loans payable in 15 years. For next fiscal year, the government has proposed to earmark Rs150bn for this scheme in a bid to provide loans to 50,000 more families for construction of houses.\n\nAnother scheme titled “Apni Zameen Apna Ghar” is also under consideration to be launched in the FY 2025-26 to provide plots to deserving people free of cost in 19 districts through balloting.\n\nThe government has also increased budget for the solid waste management under Suthra Punjab Programme from Rs120bn to Rs150bn while Rs10bn have been earmarked for the parks and horticulture authorities and ex­­­pansion of water and sa­­nitation agencies to more districts.\n\nLahore, like the last year, would remain on priority as it would have Rs85bn for several development schemes under Lahore Development Pro­gramme. Following the LDP model, a Rs25bn special programme namely CM Punjab Development Programme has been proposed to be initiated in other cities.\n\nPublished in Dawn, June 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6850a20cc3cbf.jpg",
  "retrievedAt": "2025-08-20T04:08:44.702Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917559",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T00:26:09.000Z"
}
