{
  "title": "PM Shehbaz reiterates commitment to defending Pakistan’s right to water - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif reiterated Pakistan’s commitment towards defending its right to water, terming the Indus River as the “lifeline” of the people of Pakistan, in his message on “World Day to Combat Desertification and Drought”.\n\nObserved on June 17 every year, the annual day highlights global urgency against drought. Climate Risk Index 2025 ranks Pakistan 1st among top 10 countries most affected by extreme weather events in 2022, with over 68 per cent of its land area now classified as arid or semi-arid. Prolonged droughts in Balochistan, Sindh and South Punjab continue to push vulnerable communities deeper into poverty.\n\nIn a statement released by the PM’s office, PM Shehbaz raised alarm over India’s unilateral action to hold the Indus Water Treaty in abeyance, calling it a “serious concern”.\n\n“There is no provision for such actions under the Treaty, and the waters of the Indus are the lifeline of the 240 million people of Pakistan,” he added, vowing to defend Pakistan’s right to water.\n\nHe reaffirmed Pakistan’s commitment to international obligations, “particularly those agreements that are vital to regional peace.” PM Shehbaz also promised to accelerate efforts to enhance the country’s domestic water storage capacity.\n\nOn the issue of land, PM noted that “nearly 50pc of our land area is affected by various forms of degradation driven by deforestation, overgrazing, salinity, waterlogging, and unplanned urbanisation”.\n\nThese issues are made worse by climate change, which has “intensified the frequency and severity of droughts, wildfires, and floods,” the statement added, citing the 2022 floods and recurring dry spells to highlight the scale of the problem.\n\nHe underscored the importance of land as an asset for Pakistan’s food security, water availability, biodiversity conservation, and rural livelihoods.\n\nOver one million km of productive land — about 113pc of Pakistan’s total land area — is lost worldwide to degradation every year, requiring $1 billion in daily investments for restoration between 2025 and 2030, according to the United Nations Convention to Combat Desertification (UNCCD).\n\nPM lauded this year’s theme, “Restore the land. Unlock the opportunities,” as a “timely call” for the restoration of degraded land. He stressed that restoration is “essential not only for climate resilience but also for unlocking social, economic, and environmental benefits”.\n\nDetailing the government’s efforts towards climate resilience, he stated that sustainable land management and ecosystem restoration remain “key pillars” of the government’s climate resilience agenda.\n\nLandmark initiatives like the upscaling of the Green Pakistan Programme have resulted in the plantation of over 2.2 billion plants, he observed.\n\nThe statement further quoted him as saying: “We are also implementing the National Climate Change Policy and National Adaptation Plan to guide integrated land use and enhance ecological integrity.\n\n“These policy frameworks align with our commitments under the United Nations Convention to Combat Desertification (UNCCD), to which Pakistan has been a Party since 1997.”\n\nPM Shehbaz urged all stakeholders to join hands in restoring degraded land and securing a climate-resilient future for future generations.\n\nIn March, Paki­stan Meteorological Depar­tment (PMD) issued a drought alert for Sindh, Balochistan and Punjab due to scant rainfall.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:08:42.446Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917678/pm-shehbaz-reiterates-commitment-to-defending-pakistans-right-to-water",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T09:11:51.000Z"
}
