{
  "title": "Blue whale found dead in Balochistan’s Gwater Bay - Pakistan - DAWN.COM",
  "author": null,
  "content": "• WWF-P adviser suggests the marine mammal may have died after becoming entangled in gillnets\n• The most recent sighting of the world’s largest mammal was off the coast of Gadani in April last year\n\nKARACHI: A 35-foot-long blue whale was found dead in the Arabian sea, in a remote area called Gwater Bay, between Pakistan and Iran, on Monday.\n\nAccording to officials representing the World Wide Fund for Nature-Pakistan (WWF-Pakistan), local fisherman Ahmad Baloch spotted the dead whale floating near Kuntani, Balochistan.\n\n“It is likely that the whale may have died a few days back in the open sea between Pakistan and Iran and drifted towards the Gwater Bay by rough sea and strong currents,” said Muhammad Moazzam Khan, technical adviser at the WWF-Pakistan.\n\nHe added that while the exact cause of the death could not be ascertained, the marine mammal might have gotten entangled in gillnets, commonly used in the coastal and offshore waters in the area for fishing.\n\nClassified as an endangered species, blue whales, scientifically called Balaenoptera musculus, are described as the largest animals ever known to have existed.\n\nIt’s one of three baleen whales reported from Pakistan’s waters. The other two whales are the Bryde’s whale and the Arabian humpback whale.\n\nThere are four subspecies of blue whales, of which two include the pygmy blue whale (Balaenoptera musculus brevicauda) and the Indian Ocean blue whale (Balaenoptera musculus indica) found in the Northern Indian Ocean.\n\n“Considering its small size, this dead blue whale sighted at Kuntani might be a pygmy blue whale,” Mr Khan shared, while expressing concern over the endangered species’ mortality.\n\nHe emphasised the need for urgent steps for its conservation. “Now all cetaceans, including whales and dolphins, are protected under the wildlife and fisheries legislations of Sindh and Balochistan. We also need to enact the federal legislation for the protection of cetaceans, including whales, in the Exclusive Economic Zone of Pakistan.”\n\nAccording to the organisation, blue whale is known to be distributed in tropical and subtropical waters of the Indian Ocean. There are many records of the occurrence of blue whales in Pakistan; the last blue whale was spotted off Gadani, Balochistan, on April 8, 2024.\n\nBlue whales can reach a maximum length of about 100 feet and weigh up to 200 tonnes.\n\nPublished in Dawn, June 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6850aa5699756.gif",
  "retrievedAt": "2025-08-20T04:08:51.575Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917594/blue-whale-found-dead-in-balochistans-gwater-bay",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T00:26:44.000Z"
}
