{
  "title": "KP budget 2025-26: Opposition rejects budget as anti-people - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Opposition members in the Khyber Pakhtunkhwa Assembly on Monday rejected the budget for the upcoming fiscal year, declaring it anti-people.\n\n“In its current form, the 2025-26 budget is unacceptable to us [opposition parties] because it has nothing to benefit our people. However, if the government makes appropriate changes, we can think about it,” Leader of the Opposition Dr Ibadullah told the assembly’s budget session chaired by Speaker Babar Saleem Swati.\n\nDr Ibadullah complained that the ruling PTI had presented its 12th budget in the province but it had consistently failed to fully utilise development funds.\n\nHe said that the 2013 budget’s outlay was Rs319 billion and it went to Rs1.6 trillion the next year, but despite that hike of around Rs1.28 tr, people wondered where the money was spent because there was “no development on the ground.”\n\nInsists successive PTI govts failed to fully utilise uplift funds\n\nThe opposition leader complained that the province hadn’t seen any tangible developmental work but even then, its debt surged from Rs150bn in 2013 to Rs800bn in the current year.\n\nHe regretted that 35 per cent of the last development budget lapsed and that not even once in the last 12 years, the PTI government could fully spend the development budget.\n\n“They [ruling PTI] still claim that the federal government isn’t clearing its dues. Why should it give you funds when you don’t have the capacity to spend them,” he said.\n\nDr Ibadullah said the provincial government’s expenditure surged by 12pc and no development was seen, so how it declared the next budget surplus.\n\nHe complained that 40pc of the students from government schools in the province couldn’t read Urdu, while 60pc didn’t understand mathematics.\n\n“Around 60pc of the basic health units in our province are closed due to a lack of basic facilities and staff, while the tertiary care hospitals stand destroyed,” he said.\n\nThe opposition leader claimed that after irregularities surfaced and a probe was launched, over Rs31bn from the amount allegedly embezzled from the government’s account in Kohistan district was recovered.\n\nTreasury MPA Muneer Hussain Lughmani said that the PTI government took important steps for the development of health and education sectors.\n\nHe said that “issues” in the Health Card were being addressed but there was no denying the fact that the health insurance system, introduced by the government, benefited people.\n\nMr Lughmani said that if there was nothing to embezzle, then it was the real change the PTI had always talked about.\n\nHe also requested the government to develop tourism, especially in his Mansehra constituency, to increase revenue.\n\nMember of the opposition JUI-F Adnan Khan said that the proposed federal transfer receipt totaled Rs1.1tr in 2024-25 but the provincial government received Rs1.18tr, showing Rs82bn more receipts than the proposed ones.\n\nTreasury lawmaker Malik Adeel Iqbal said that though the provincial government had presented the budget in the assembly, its approval from the assembly would come only after incarcerated PTI founder Imran Khan accorded his nod.\n\nHe said that the federal government allocated Rs80 per person in its health budget but the PTI government in KP earmarked Rs1 million per person in the form of the Health Card entitlement.\n\nMember of the opposition ANP Mohammad Nisar Baaz complained that when tribal areas were merged with KP, both federal and provincial governments did not own the region.\n\nHe said that the centre promised Rs100bn annual funding to bring merged districts on a par with the settled areas but the promise wasn’t fulfilled, leaving the situation on the ground unchanged.\n\nThe opposition lawmaker said that the tribal districts depended on the federal government for their current and development budget, but both the federal and provincial governments “mistreated” the region.\n\nHe complained that there was not a single university and medical or engineering college in any merged district and the next budget had no plans to develop such educational institutions in the next fiscal.\n\nMr Baaz said that the federal government wanted to tax KP’s areas, which had destroyed markets and no industry.\n\nHe offered support to the treasury for demonstrating outside the National Assembly in Islamabad in favour of the constitutional rights of KP.\n\nPublished in Dawn, June 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:08:48.628Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917539/kp-budget-2025-26-opposition-rejects-budget-as-anti-people",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T00:27:01.000Z"
}
