{
  "title": "PCB’s Aaqib vows improvements through academies - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Newly-appointed Pakistan Cricket Board’s (PCB) Director High Performance Aaqib Javed said a comprehensive plan has been implemented to run cricket academies across the country, with tangible results expected within six months.\n\nSpeaking to reporters here at the LCCA Ground on Monday — the opening day of a skill development programme for the senior men’s national team, Aaqib said the National Cricket Academy’s revival had started, with different programmes planned for not only the men’s side but the women’s team and the age-group outfits, promising that the step would start bearing fruit within the next six months.\n\nFifteen players have been called up to the programme, including former Pakistan captains Babar Azam and Mohammad Rizwan.\n\nWhen asked whether experienced players like Babar and Rizwan still needed to attend such a programme, Aaqib said the demands of modern cricket necessitate regular technical reviews, even for senior professionals.\n\n“Players nowadays move from one competition to another, but they don’t get personal time in the off-season to work on skills or fitness. In this programme, they will get the opportunity to work on their game,” he said, adding that the doors of selection were open for both Babar and Rizwan.\n\n“No player, including Babar, has been ruled out of white-ball cricket,” he said. “The game is open. Anyone who performs has the right to play, whether it’s Babar or someone else.”\n\nAddressing the state of club cricket, Aaqib acknowledged its decline over the years and stressed the need to support functioning institutions.\n\n“In our era, club, school and college cricket were very strong. But now, club cricket has almost vanished due to reduced grounds and logistical issues. The PCB must support clubs that are still working and producing players for national teams,” he said.\n\nAaqib recalled that the National Cricket Academy, when initially launched in the early 2000s, was a vital platform to groom regional and district talent. However, he lamented that it remained largely inactive for over a decade, contributing to the national team’s decline.\n\n“The role of academies is to prepare players in the domestic system. There are many things they need to learn, such as communication skills, awareness about diet, training, and fielding basics like sliding and diving,” he noted. “Unless you upgrade facilities with science and technology, you can’t compete with the world.”\n\nHe also outlined year-round plans for the NCA, which will feature continuous training across formats and age levels.\n\n“Specialised camps for spinners, wicket-keepers, fast bowlers, and openers will be organised. The system has started today, and I can see results in six months, whether in women’s cricket, Under-19, or the national men’s team,” he said.\n\nHe further elaborated on the structure of academies: Karachi will host women’s cricket camps, Sialkot has been designated for Under-15, Faisalabad for Under-17, and Multan for Under-19 players. The NCA will cater to emerging talent, Pakistan ‘A’, and the national squad.\n\nWhen asked about a reported rift with Rizwan over authority in team matters, Aaqib dismissed such claims.\n\n“Whether it’s Rizwan or any captain, we’ve never had a disagreement, “ he said. “Decis­ions are made together. I don’t recall any instance where we weren’t on the same page.”\n\nAaqib stressed the need for process continuity to ensure long-term development.\n\n“If you prepare 30 Under-15 players today, in three to four years they’ll be in Under-19, then Pakistan Shaheens or the national team. If this system keeps running, Pakistan will be in a strong position for the next World Test Championship,” he concluded.\n\nPublished in Dawn, June 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:08:46.626Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917625/pcbs-aaqib-vows-improvements-through-academies",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T00:51:26.000Z"
}
