{
  "title": "PM Shehbaz for linking Reko Diq with railway network by 2028 - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Tuesday directed relevant authorities to link the Reko Diq project in Balochistan with the Pakistan Railway’s line network by 2028 to meet the requirements of future transportation and cargo services.\n\nIn January, Saudi Arabian mining fund Manara Minerals said it was set to buy a 10-20 per cent stake in the Reko Diq copper and gold project in Pakistan for proceeds of about $500 million to $1 billion.\n\nIn April, the Reko Diq Joint Venture shareholders approved the project’s updated feasibility study and conditionally approved the associated Phase-1 development capital, subject to securing up to $3bn in project financing.\n\nWhile chairing a meeting today, PM Shehbaz issued orders for the formation of an inter-ministerial committee to look after financing matters for upgrading and developing Pakistan Railways.\n\nThe committee will present recommendations regarding to financing required for Pakistan Railways’ development and its extension to Reko Diq.\n\nDuring the meeting, the prime minister was briefed on the upgradation of ML-1 and ML-3 railway as well as the overall development of Pakistan Railways to meet the requirements of future transportation and cargo services.\n\nThe premier noted that Pakistan Railways served as a backbone for the country’s economy and communication.\n\n“Pakistan Railways is a cheap, fast and environment-friendly source of transportation,” PM Shehbaz said.\n\nHe added that the mines and mineral sector of Balochistan will develop, and new employment opportunities will be created for the people of the area after linking railways with Reko Diq.\n\nThe meeting was attended by Deputy Prime Minister and Foreign Minister Ishaq Dar, Defence Minister Khawaja Asif, Minister for Economic Affairs Ahad Khan Cheema, Minister for Maritime Affairs Junaid Anwar Chaudhry, Minister of State for Railways Bilal Azhar Kayani, Special Assistant to the Prime Minister Tariq Fatemi, and senior government officials.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/17133040d183145.png",
  "retrievedAt": "2025-08-20T04:08:42.391Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917677/pm-shehbaz-for-linking-reko-diq-with-railway-network-by-2028",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T08:41:55.000Z"
}
