{
  "title": "Budget 2025-26: Guardrails sought to stop misuse of FBR arrest powers - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government is reevaluating the powers granted to Fed­eral Board of Revenue (FBR) officers to arrest suspected tax evaders and add­ing guardrails to prev­ent arbitrary detentions after concerns expressed by businesspeople and lawmakers over the blanket authority and its potential misuse.\n\nPrime Minister Shehbaz Sharif on Monday formed a committee to reexamine the matter and recommend stringent safeguards to prevent the misuse of powers by tax officers.\n\nFBR Chairman Mah­mood Langrial told Dawn that the provisions could be revised to mandate the permission of multiple senior officers before any arrest.\n\nIn the Finance Bill introduced last week, the government proposed amendments to the Sales Tax Act, 1990, to allow FBR officers to investigate tax fraud and make arrests.\n\nAs per the proposed amendments, assistant or deputy commissioners could arrest tax defaulters after seeking approval from the commissioner.\n\nThe proposed Section 37AA reads: “The officer of Inland Revenue, during the investigation, having reason to believe on the basis of evidence that actions of any person may have caused or attempted to cause tax fraud or any other offence warranting prosecution under this Act, may cause arrest of such person with prior approval of the Commissioner.”\n\nThe provision made the business community apprehensive about the potential abuse of power.\n\nPakistan Business Council CEO Ehsan Malik, in a letter to Finance Minister Muhammad Aurangzeb, said the powers were “draconian” and “will most likely be misused to harass” taxpayers.\n\nBut FBR Chairman Rashid Mahmood Langrial told Dawn that the authority to arrest would remain intact.\n\nHowever, the committee headed by the finance minister will examine various options to introduce additional safeguards to prevent potential misuse of the power.\n\nAccording to Mr Langrial, existing laws empower low-ranking officers to lodge FIRs against tax defaulters.\n\nHe noted that the proposed amendments mandate prior approval from the income tax commissioner before an arrest.\n\nFurther safeguards be­ing considered include a provision for approval from three senior officers inst­ead of just the commissioner.\n\nAccording to the FBR chairman, this provision would significantly reduce the potential for misuse of powers. Moreover, the officers would be empowered to arrest individuals for a limited set of violations and not for every offence of fraud, Mr Langrial explained.\n\nHe added the powers could be exercised in three circumstances: when a tax defaulter fails to appear before authorities thrice, when there is a risk of evidence being tampered with, or when there is a possibility that the suspect may flee the country.\n\nPM’s directives\n\nAn official announcement issued by the Prime Minister Secretariat said PM Shehbaz formed the committee following a meeting to review the FBR’s performance.\n\nAccording to the state-run news agency, APP, the prime minister took notice of media reports and warned the proposed powers must not be used to harass the business community or taxpayers.\n\nMr Langrial informed the prime minister that the authority to arrest tax defaulters has been embedded in taxation law since the 1990s.\n\nHowever, in light of rec­ent rulings by superior courts, amendments are being introduced to further streamline the process.\n\nThe prime minister ordered officials to devise an effective external review system regarding the arrest matter and arrests should only be made in cases where the quantum of fraud was “exceptionally high”.\n\nThe premier said provisions for protection against misuse of these laws should be made part of the Finance Act. He called for consultations with all coalition parties on this issue.\n\nNA committee\n\nOn Monday, the National Assembly Standing Committee on Finance and Revenue also raised alarm over the proposed amendments.\n\nThe meeting, chaired by MNA Naveed Qamar, was also attended by Finance Minister Aurangzeb, who assured members that the matter would be reviewed in line with the prime minister’s directives.\n\nThe finance minister informed the committee that Senator Farooq H. Naik had proposed amendments aimed at safeguarding against the misuse of powers. He described Mr Naik’s suggestions as highly appropriate.\n\nThe prime minister has been briefed on the matter and the committee will be updated on any progress in this matter, Mr Aurangzeb said.\n\nHe assured the members that appropriate changes would be introduced following due consultation.\n\nPublished in Dawn, June 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:09:05.197Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917564/budget-2025-26-guardrails-sought-to-stop-misuse-of-fbr-arrest-powers",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T00:26:09.000Z"
}
