{
  "title": "Pakistan, US agree to advance talks on reciprocal tariffs: Aurangzeb - Pakistan - DAWN.COM",
  "author": null,
  "content": "Finance Minister Muhammad Aurangzeb on Tuesday said that Pakistan and the US will continue to strengthen their economic partnership as both sides agreed to advance negotiations on reciprocal tariffs through constructive engagement, state-run Radio Pakistan reported.\n\nPakistan faces a potential 29 per cent tariff on its exports to the US due to a $3 billion trade surplus with the world’s biggest economy, under tariffs announced by Washington in April on countries around the world.\n\nWhile speaking at an event in Islamabad today, Aurangzeb said he had a constructive and positive conversation with the US Commerce Secretary, Howard Lutnick, last night. He said that both countries are moving in the right direction.\n\n“The government will stay the course of reforms in taxation, energy and other sectors,” he said. “We have also carried out tariff reforms to move towards competitive economy.”\n\nAurangzeb continued that both sides agreed to advance negotiations on reciprocal tariffs through constructive engagement, aiming to finalise the trade deal at the earliest.\n\nThe discussions focused on meaningful engagement in trade, investment, and strengthening mutually beneficial economic ties, he said.\n\n“Both sides also agreed that further technical-level discussions would take place in the coming days, following a mutually agreed roadmap,” the finance minister added.\n\nAs regards pension reforms, the finance minister said the Defined Contribution Pension Scheme is a “win-win” for both the government and the employees.\n\nIn June last year, the Economic Coordination Committee (ECC) of the Cabinet approved major changes to the federal government’s pension system. The finance ministry said federal government employees would contribute 10pc of their basic pay while the government would contribute 20pc.\n\nAt today’s event, Aurangzeb said the government has increased the pension of retired employees by 7pc in line with inflationary trends.\n\n“We have also proposed a 5pc tax on pensions above Rs10 million while protecting low and middle income pensioners,” he said.\n\nTwo important visits from Pakistan to the United States — one by Deputy Prime Minister and Foreign Minister Ishaq Dar and the other by a trade delegation — due this week were postponed due to the ongoing conflict in the Middle East, official sources told Dawn earlier this week.\n\nThe three-day visit would be the latest in a series of high-level exchanges between Islamabad and Washington amid a fragile regional security climate following last month’s military standoff between India and Pakistan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/17123320a776bf8.png",
  "retrievedAt": "2025-08-20T04:08:42.776Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917668/pakistan-us-agree-to-advance-talks-on-reciprocal-tariffs-aurangzeb",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T07:43:31.000Z"
}
