{
  "title": "40 killed trying to reach food in Gaza - World - DAWN.COM",
  "author": null,
  "content": "• UN denounces Israeli-backed aid system\n• Says Tel Aviv has ‘weaponised’ food in besieged enclave\n\nCAIRO: Israeli fire killed at least 40 people, half of them near an aid distribution site operated by the US-backed Gaza Humanitarian Foundation on Monday, the territory’s health ministry said, as UN officials denounced Israeli-backed aid delivery methods.\n\nMedics said at least 20 people were killed and 200 others wounded near an aid distribution site in Rafah, the latest in daily mass shootings that have killed hundreds of Palestinians trying to reach food since Israel imposed a new distribution system after partly lifting a near three-month total blockade.\n\nIsrael has put responsibility for distributing much of the aid it allows into Gaza into the hands of a new US-backed group, the Gaza Humanitarian Foundation, which operates three sites in areas guarded by Israeli troops.\n\nThe United Nations has rejected the plan, saying GHF distribution is inadequate, dangerous and violates humanitarian impartiality principles.\n\nThere was no immediate comment from the Israeli military about Monday’s reports of shootings. In previous incidents it has occasionally acknowledged troops opening fire near aid sites, while blaming fighters for provoking the violence.\n\nRelatives arrived at Nasser Hospital to mourn the dead. Women and children wept beside bodies wrapped in white shrouds.\n\n“We went there thinking we would get aid to feed our children, but it turned out to be a trap, a killing. I advise everyone: don’t go there,” said Ahmed Fayad, one of those who tried to reach aid on Monday.\n\n‘Lethal distribution system’\n\nPhilippe Lazzarini, the head of the United Nations Palestinian refugees’ agency UNRWA, said in a post on X: “Scores of people have been killed & injured in the past days, including of starving people trying to get some food from a lethal distribution system.”\n\nBefore the new system was set up, aid had been distributed to Gaza’s 2.3 million residents mainly by UN agencies such as UNRWA, which employ thousands of staff inside Gaza and operate hundreds of sites across the breadth of the enclave.\n\nIsrael says it has had to crack down on distribution because Hamas fighters were diverting food aid. The fighters deny this and say Israel is using hunger as a weapon.\n\nLazzarini said Israel had not lifted restrictions on UN agencies including UNRWA bringing in aid, despite an abundance of assistance ready to be moved into the enclave.\n\nOn Sunday, COGAT, the Israeli military aid coordination agency, said that this week it had facilitated the entry of 292 trucks with humanitarian aid from the United Nations and the international community, including food and flour, into Gaza.\n\nIt said the Israeli military would continue to permit the entry of humanitarian aid while ensuring it did not reach Hamas.\n\nBefore Monday’s incident, the health ministry in Hamas-run Gaza said that at least 300 people had so far been killed, and more than 2,600 wounded, near aid distribution sites since the GHF began operations.\n\nIn Geneva, Volker Turk, UN rights chief, told the UN Human Rights Council on Monday that Israel had “weaponised” food in Gaza. He repeated a call for investigations into deadly attacks near the GHF distribution sites.\n\n“Israel’s means and methods of warfare are inflicting horrifying, unconscionable suffering on Palestinians in Gaza,” said Turk.\n\n“Disturbing, dehumanising rhetoric from senior Israeli government officials is reminiscent of the gravest of crimes,” he added.\n\nOn Sunday, at least five people were killed as thousands of Palestinians approached two GHF distribution sites in the central and southern the enclave.\n\nThe GHF said in a statement that it resumed food deliveries on Sunday, distributing more than two million meals from its three distribution sites without incident.\n\nIsrael’s military campaign since October 7, 2023 has killed nearly 55,000 Palestinians, most of them civilians, according to health authorities in Gaza, and flattened much of the densely populated strip. Most of the population is displaced, and widespread malnutrition is a significant concern.\n\nPublished in Dawn, June 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68509f5690e5b.jpg",
  "retrievedAt": "2025-08-20T04:09:04.046Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917557/40-killed-trying-to-reach-food-in-gaza",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T00:26:16.000Z"
}
