{
  "title": "Won’t issue verdict that may be construed as ‘amending Constitution’: CB judge Justice Mazhar - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Justice Muhammad Ali Mazhar on Monday observed that the Constitutional Bench (CB) will never hand out a decision in the Islamabad High Court (IHC) judge’s seniority dispute that may invite criticism that the top court had amended the Constitution on its own.\n\nThe observation came when senior counsel Barrister Salahuddin Ahmed, on behalf of five IHC judges, highlighted changes in the IHC Administrative Committee. At this, Attorney General of Pakistan (AGP) Mansoor Usman Awan raised an objection, stating that the issue raised by the counsel was not challenged by anyone before the CB, nor can it be discussed in rebuttal arguments.\n\nHeaded by Justice Mazhar, a five-judge CB had taken up a joint petition filed by five IHC judges — Justices Mohsin Akhtar Kayani, Tariq Mehmood Jahangiri, Babar Sattar, Sardar Ejaz Ishaq Khan and Saman Rafat Imtiaz – pleading that three transferred judges should not be treated as IHC judges until they take a fresh oath under Article 194, read in conjunction with Schedule III of the Constitution.\n\nDuring the hearing, Barrister Ahmed on a rebuttal argued that Article 200 applies only to sub section 3 of the Constitution, stating that when a judge was transferred to another high court, he loses his seniority, similar to the process in the civil service.\n\nNo concept of ‘deputation’ in the judiciary, Justice Mazhar observes while hearing IHC judges’ seniority case\n\nJustice Mazhar observed that there was no principle of deputation or merging a judge in another court in the judiciary, as was done in the civil service, where an employee can be absorbed to another department on deputation.\n\nThe counsel explained that if the question of service was examined, it would be found that if the cadre was the same, the seniority may not be affected. But if the cadre was different, seniority will be affected.\n\nJustice Salahuddin Panhwar asked the Punjab government’s lawyer whether the Advocate General of Punjab had filed any application in this regard. In response, Advocate Amjad Pervez said he had presented a complete history of judges’ transfers from 1947 to 1976, adding that the Punjab government was not a party to the present case.\n\nJustice Mazhar, however, observed that Punjab’s lawyer should have given arguments after AGP. “Don’t you know how important a 27A notice is,” Justice Mazhar observed, adding that when the Lahore High Court registrar had submitted his comments, he became the main party in this case.\n\nJustice Panhwar observed that the court would like to hear him after Barrister Ahmed completes his arguments.\n\nBarrister Ahmed recalled that it had been declared in the Justice Qazi Faez Isa reference that the president should always apply his independent mind before taking any important decision.\n\nJustice Mazhar, however, observed we should keep in mind the difference between Article 200 and Article 209, adding that at the time of transfer of judges, the judiciary was consulted in four stages, but no such procedure was adopted before filing a reference against a judge under Article 209 of the Constitution.\n\nWhen the Supreme Judicial Council (SJC) recommends removal of a judge, could the President then apply his independent mind, Justice Mazhar observed, adding that in the judges transfer case, if the chief justice of the high court refuses to release the judge, the transfer can be stopped.\n\nPublished in Dawn, June 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:08:55.111Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917614/wont-issue-verdict-that-may-be-construed-as-amending-constitution-cb-judge-justice-mazhar",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T00:26:22.000Z"
}
