{
  "title": "G7 leaders seek common approach on Ukraine, Middle East wars - World - DAWN.COM",
  "author": null,
  "content": "• Trump says removing Russia from group was a mistake\n• Macron dismisses Putin as mediator between Israel and Iran\n\nKANANASKIS: Group of Seven leaders met on Monday seeking a common approach on wars in Ukraine and the Middle East but before their summit formally began, US President Donald Trump said removing Russia from the former Group of Eight over a decade ago had been a mistake.\n\nTrump’s overt statement of support for Russian President Vladimir Putin was an early challenge for a once tight-knit grouping that has struggled to find unity as Washington retreats from multilateralism.\n\nG7 leaders from Britain, Canada, France, Germany, Italy, Japan, and the US, along with the European Union, are convening in the resort area of Kananaskis in the Canadian Rockies until Tuesday.\n\nSpeaking alongside Canadian Prime Minister Mark Carney, Trump said the former Group of Eight had been wrong to kick out Russia in 2014 after it annexed Crimea.\n\n“This was a big mistake,” Trump said, adding he believed Russia would not have invaded Ukraine in 2022 had Putin not been ejected.\n\n“Putin speaks to me. He doesn’t speak to anybody else … he’s not a happy person about it. I can tell you that he basically doesn’t even speak to the people that threw him out, and I agree with him,” Trump said.\n\nHis comments raise doubts about how much Ukrainian President Volodymyr Zelensky can achieve when he meets the leaders on Tuesday. European nations say they want to persuade Trump to back tougher sanctions on Moscow.\n\nZelensky said he planned to discuss new weapons purchases for Ukraine with Trump.\n\nTrump spoke on Saturday with Putin and suggested the Russian leader could play a mediation role between Israel and Iran.\n\nFrench President Emmanuel Macron dismissed the idea, arguing that Moscow could not be a negotiator because it had started an illegal war against Ukraine.\n\nA European diplomat said Trump’s suggestion showed that Russia was very much on US minds.\n\nEuropean officials said they hoped to use Tuesday’s meeting with Zelensky and Nato Secretary General Mark Rutte and next week’s Nato summit to convince Trump to toughen his stance.\n\n“The G7 should have the objective for us to converge again, for Ukraine to get a ceasefire to lead to a robust and lasting peace, and in my view it’s a question of seeing whether President Trump is ready to put forward much tougher sanctions on Russia,” Macron said.\n\nWith an escalating Israel-Iran conflict, the summit in Canada is seen as a vital moment to try to restore a semblance of unity among democratic powerhouses.\n\nIn another early sign the group may struggle to reach agreement on key issues, a US official said Trump would not sign a draft statement calling for de-escalation of the Israel-Iran conflict.\n\nA Canadian official, though, said the conflict would come up in bilateral meetings throughout the day and it was too early to speculate on the outcome of those conversations. A senior European diplomat echoed those comments, saying Trump had yet to make a decision.\n\nDraft documents\n\nCanada has abandoned any effort to adopt a comprehensive communique to avert a repeat of the 2018 summit in Quebec, when Trump instructed the US delegation to withdraw its approval of the final communique after leaving.\n\nLeaders have prepared several draft documents seen by Reuters, including on migration, artificial intelligence, and critical mineral supply chains. None of them have been approved by the United States, however, according to sources briefed on the documents.\n\nEuropeans are on the same page on most issues, a European diplomat said. But without Trump, it is unclear if there will be any declarations, the diplomat said. The first five months of Trump’s second term upended foreign policy on Ukraine, raised anxiety over his closer ties to Russia, and resulted in tariffs on US allies.\n\nTalks on Monday centered around the economy, advancing trade deals, and China. Efforts to reach an agreement to lower the G7 price cap on Russian oil, even if Trump decided to opt out, were complicated by a temporary surge in oil prices since Israel launched strikes on Iran on June 12, two diplomatic sources said.\n\nThe escalation between the two regional foes is high on the agenda, with diplomatic sources saying they hope to urge restraint and a return to diplomacy and would encourage Trump to sign a declaration.\n\n“I do think there’s a consensus for de-escalation. Obviously, what we need to do today is to bring that together and to be clear about how it is to be brought about,” British Prime Minister Keir Starmer told reporters.\n\nPublished in Dawn, June 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6850aae00cff5.gif",
  "retrievedAt": "2025-08-20T04:08:52.084Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917596/g7-leaders-seek-common-approach-on-ukraine-middle-east-wars",
  "dateList": "2025-06-17",
  "date_published": "2025-06-17T00:26:38.000Z"
}
