{
  "title": "Second phase of mandatory training for Hajj pilgrims to be conducted after Eid-ul-Fitr",
  "link": "https://www.app.com.pk/national/second-phase-of-mandatory-training-for-hajj-pilgrims-to-be-conducted-after-eid-ul-fitr-2/",
  "date_published": "2024-03-24T17:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):Ministry of Religious Affairs and Interfaith Harmony’s Chief Hajj Trainer Ahmed Nadeem Khan announced that the commencement of second phase of mandatory training for Hajj pilgrims is scheduled to take place after Eid-ul-Fitr.\nLeading the recent Steering Committee for Hajj Training, he emphasized the significance of these workshops during the session. Deputy Secretaries Nasir Aziz and Jan Bahadur, alongside other ministry officials, convened while heads of Haji Camps joined virtually via Zoom.\nThey underscored the crucial role of training workshops in ensuring pilgrims’ comprehensive understanding of administrative procedures, rituals, and challenges inherent in the Hajj journey.\nThe chief Hajj trainer outlined the forthcoming training schedule, revealing plans for ministry personnel and experts to offer guidance and instruction to pilgrims. The second phase, slated to commence post Eid-ul-Fitr, would feature training sessions across major cities nationwide, and it would be facilitated by multimedia presentations and modeled Mina camps at Hajj training centers, he added.\nEmphasizing the mandatory nature of these workshops, Ahmed Nadeem Khan specified that attendance at a minimum of two sessions is compulsory for all pilgrims, while overseas Pakistanis would receive training at their respective Haji camps before departure.\nAdditionally, he said it was also proposed to conduct oral or written exams on Hajj rituals prior to the intending pilgrims’ flights. They also decided to delay flights for those who fail in the exams and conduct a third session to properly train them regarding religious rituals, social ethics and administrative affairs during sacred journey.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:32:30.547Z"
}
