{
  "title": "Miss Pakistan demands increased awareness on Rare White Tiger cubs domestication",
  "link": "https://www.app.com.pk/national/miss-pakistan-demands-increased-awareness-on-rare-white-tiger-cubs-domestication/",
  "date_published": "2024-03-24T16:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):Renowned Model and Actress, Miss Pakistan, Areej Chaudhry on Sunday urged the government to enhance efforts to create public awareness on proper upbringing standard operating procedures (SOPs) for Rare White Tiger cub commonly kept as pet in luxurious houses.\nThe Miss Pakistan and her brother Shah Hassan Chaudhry, well-known Skin Aesthetician had recently lost the life of their Beloved Rare White Tiger Cub in the federal capital’s pet hospital.\n“Despite the best care, feed and living conditions, Khalifa (the Tiger cub) suffered from genetic disease and died. Which left us deep in grief and shock. The government must establish a dedicated wildlife rehabilitation and veterinarian center where the wild animals could be given proper treatment and care. So that no one else can face the tragic fate and trauma that we went through,” Areej Chaudhry told APP while sharing her serious concern over the tragic demise of her pet.\nShe said white tiger was a very rare species of the Bengal Tiger that had a peculiar white fur making it distinctive from the orange colour tigers. Tiger cubs, she said were mostly rude in behaviour by Khalifa was an exception due to his docile and human friendly nature as she used watch movies with the cub sitting close to her and remaining most of the time with her without creating any trouble.\nAreej Chaudhry said she was also an animal rights activists and strongly condemned animal cruelty in all its forms. “Lack of proper knowledge to handle a wild animal also leads to violence against the poor soul that rests on the disposal of its possessor during its incarceration,” she added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:32:31.390Z"
}
