{
  "title": "Govt. cognizant of addressing TB as a public health priority: PM",
  "link": "https://www.app.com.pk/national/govt-cognizant-of-addressing-tb-as-a-public-health-priority-pm/",
  "date_published": "2024-03-24T06:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday said that provision of universal access to quality essential health services was the constitutional responsibility of the Government that recognized the importance of addressing Tuberculosis (TB) as a public health priority.\nThe government has implemented various programmes and policies to combat this disease, the prime minister said in a message on World TB Day.\n“On this World TB Day 2024, I applaud the services of everyone committed to the fight against tuberculosis and reiterate our Government’s resolve towards supporting the initiatives aimed at eradicating TB and improving the health and well-being of our citizens,” PM Office Media Wing, in a press release, quoted the prime minister as saying.\nThe prime minister said Tuberculosis remained a significant global health challenge, causing immense suffering and claiming far too many lives every year.\n“It is crucial that we prioritize TB elimination in our global health agenda and allocate resources accordingly. Together, we can harness innovation, research, and technology to accelerate progress towards a TB-free world,” he added.\nThe prime minister said that while they strived to provide equitable health services to their citizens, they deeply appreciated the role of the private sector and our global partners.\n“I call upon all partners, organisations, healthcare professionals, and individuals to unite in our efforts to end TB. We must work collaboratively to strengthen healthcare systems, increase access to quality diagnosis and treatment, and raise awareness about the importance of TB prevention and control measures,” he stressed.\nThe prime minister further pledged to work together, leaving no room for complacency, in their mission to eliminate TB from Pakistan.",
  "retrievedAt": "2025-08-11T01:32:51.674Z"
}
