{
  "title": "Minorities demand protection of inheritance rights by amending Succession Act 1925",
  "link": "https://www.app.com.pk/national/minorities-demand-protection-of-inheritance-rights-by-amending-succession-act-1925/",
  "date_published": "2024-03-24T17:00:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 24 (APP):The minority communities while highlighting challenges they face in fulfilment of religious obligation of equal distribution of assets among family members of deceased due to lack of inheritance laws for Non-Muslim citizens, have demanded protection of their basic rights through enactment of Succession Act 1925 with amendments.\nThe demand was made during a media briefing by office bearers of National Lobbying Delegation (NLD) for Minority Rights, a group of writers, members of civil society organizations, rights activists, journalists and lawyers who promote rights of non-Muslim Pakistani citizens guaranteed in the Constitution.\nNLD office bearers including its focal person, Haroon Sarab Diyal, Romana Bashir, Dr Kalyan Singh, Shezad Francis and Habqooq were present in the briefing.\n“The Succession Act, 1925 provides rules for both intestate and testate succession, ensuring a fair and equitable distribution of property among the legal heirs of a deceased person,” said Haroon Sarab Diyal.\nHowever, the implementation of the Succession Act, 1925 faces several challenges such as cultural factors, lack of awareness and lengthy legal processes that hinder the realization of the rights of heirs especially women and minorities, he added.\n“A well-functioning and updated Succession Act, 1925 is essential for promoting justice, certainty and the protection of rights in matters of inheritance and succession in Pakistan,” suggests Romana Bashir, a seasoned peace activist.\nFurther strengthening of the legal system is also required to address the specific needs and issues of the Christian and Hindu communities who constitute the largest religious minorities in the country, she continued.\nNational Lobbying Delegation (NLD) for Minority Rights members also made some suggestions to improve the legal system for inheritance and succession matters.\n“An awareness campaign is required to sensitize the members of Christian community, clergy and revenue officers about the laws and framework available for distribution of inheritance of the Christian community,” they suggested.\nAdding that the section 29 to 49 of the Succession Act, 1925 provide a comprehensive framework for distribution of inheritance of persons belonging to Christian community and discuss in detail the respective shares of all the legal heirs, while the community members, clergy and other representatives have very little knowledge about the laws and framework.\nThe also submitted that for Hindu community, the existing law does not provide any uniform mechanism for the distribution of inheritance among the heirs.\nA special law regulating the inheritance and succession matters of persons belonging to Hindu community be drafted, keeping in view the examples of neighboring countries where Hindus are residing in large population and their Succession Act, 1956 is amended and in implementation phase.\nThe proposed law should be drafted after consultation with jurists, clergy and community representatives in Pakistan to ensure that if reflects the needs and aspirations of the Hindu community, they added.\nNLD members urged the government to resolve these issues accordingly as because of lack of Inheritance Laws for Non-Muslim citizens.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:32:30.547Z"
}
