{
  "title": "PM directs for foolproof security of Reko Diq project personnel, logistics",
  "link": "https://www.app.com.pk/national/pm-directs-for-foolproof-security-of-reko-diq-project-personnel-logistics/",
  "date_published": "2024-03-24T14:39:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 24 (APP): Prime Minister Shehbaz Sharif Sunday directed that security should be ensured for those working on the Reko Diq mining project and for the logistics and transport from Reko Diq to the Gwadar seaport.\nHe was chairing an important meeting regarding the Reko Diq mining project. A delegation of Barrick Gold company led by its Chief Executive Officer Mark Bristow took part in the meeting through video link.\nThe PM said consultations should be held with all stakeholders regarding the project at the official level and all the obstacles should be removed. He said planning should be initiated for improvement in the communication infrastructure especially railway lines for utilising the minerals of Balochistan, adding work for the upgradation of the road network to link Reko Diq project with Gwadar port by road, should be completed at the earliest.\nWherever new roads were being constructed, the pace of construction should be increased, he remarked. The PM said a strategy should be formed for the feasibility of a rail and road network from Reko Diq to Gwadar port. He said the railway line project from Reko Diq to Gwadar would make access to the port short and easy and as compared to Bin Qasim port the distance would also be less.\nThe new railway line would be beneficial for the mineral-rich district of Chaghi and the mining industry would expand, he added. He sought a detailed briefing next week on the Reko Diq road and rail connectivity project. He also instructed that all hurdles should be removed at the official level for early completion of the environment and social impact assessment regarding the Reko Diq project.\nDuring the meeting, it was told that the feasibility of the Reko Diq project would be completed by December 2024. Every month, 6000 containers would be transported from the Reko Diq project to the port. The concentrate pipeline of the project would be the second-longest slurry pipeline in the world. The mining company would construct the link road from Reko Diq to the national highway 40.\nIt was further told that the 103-kilometer Nokandi to Mashkhel road, which would connect Reko Diq to the Gwadar port, was 58 percent complete.\nMinister for Finance and Revenue Muhammad Aurangzeb, Minister for Petroleum Musadiq Malik, Deputy Chairman Planning Commission Muhammad Jehanzeb and high-level officials attended the meeting.",
  "retrievedAt": "2025-08-11T01:32:10.186Z"
}
