{
  "title": "Pakistan needs to redefine National Water Laws, upgrade policies to ensure water security: Experts",
  "link": "https://www.app.com.pk/national/pakistan-needs-to-redefine-national-water-laws-upgrade-policies-to-ensure-water-security-experts/",
  "date_published": "2024-03-24T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):The experts at a critical policy dialogue on water have underscored the need for the country to redefine its National Water Laws identifying the drivers of the crisis and upgrade policies to ensure water security.\nThe Tabadlab under its series of roundtables organized the 63rd dialogue titled “Water Conflict: Trends and Trajectories for 2024 and Beyond” that showcased a review of numerous studies done on water issues that served as an evidence to growing water scarcity of the country and ways to overcome those challenges.\nIn her opening remarks, Development Director, British High Commission, Foreign Commonwealth and Development Office (FCDO), Jo Moir said the FCDO had initiated the journey to understand water and national security challenges of Pakistan and the solutions to resolve it.\nShe added that the programme was relatively new and the FCDO was working out to comprehend Pakistan’s situation which was one of the most water stressed country in the world.\n“We are looking to explore gaps and knowledge resources to fix the issue as in Pakistan water crisis has become a pressing issue and the country’s bulging population is over 240 million with five million people added every year. 70% of the total population lacked access to clean water, whereas the exports, and growth of industry is to be supported by water,” she added.\nDirector, Centre for Regional and Global Connectivity, Tabadlab, Zeeshan Salahuddin while moderating the roundtable informed that the Centre had identified some 26 studies on water related issues and conducted survey interviews to unearth the facts for detailed discourse.\nThe issue of water conflicts was divided into three different categories of transnational, interprovincial and local, he added.\nThe first transnational study on Kabul River was presented by Policy Analyst, Tabadlab, Memoona Mohsin. She noted that despite the fact that Kabul River was shared between Pakistan and Afghanistan, there was lack of comprehensive water sharing treaty.\nMoreover, out of the nine rivers that flow across the border none have formal agreement and treatment between the two countries, she added.\nShe noted that lack of any treaty could trigger any conflict on water in the future.On the Interprovincial: Kala Bagh Dam, Haleema Abbasi said the environmental concerns associated with Kala Bagh Dam were irreversible for Indus River ecosystems with a plethora of climate change impacts that would create provincial tensions like arbitrary water allocations by Punjab, mistrust of the government and inadequate advocacy efforts.\nShe added that there was a need to clearly define the National Water Law and upgrade the national water policy and water charter 2018.\nOn the local study on Ghazi Barotha by Maheen said it was the only project where the local communities affected by this run of river project were successfully managed and the key element was Ghazi Barotha Tarqiati Idara which was a dedicated project NGO that developed benefit sharing focus and advocated among the communities on the project.\nIn the second part, during the panel discussion, Climate Change and Communications Consultant, Afia Salam said Pakistan’s geographical locations moved it towards solutions and way forward despite its disaster prone terrain and vulnerability due to climate change.\nShe said amid rapid rate of urbanization in the country, there was a need for relocation of water resources to the provinces with more migration to its urban areas.\n“Population is not discussed in many contexts and the social fabric unraveling because of it as everything revolves around population like increase in it will lead to deterioration of other ecosystems,” she added.\nWater Resource Specialist, World Bank, Basharat Saeed said the disputes and disagreements on water leading to protracted conflicts were archaic, whereas the agreement, terms of engagement, use of vernacular, respect for data and outcomes was crucial to implement decisive policies.\n“We need to build consensus on the drivers of our water crisis and have a common definition of the crisis. The countries like Singapore, Israel and all Gulf states are water scarce but there is water security for people in all these states which is not enjoyed by any in Pakistan despite having far more water resources than all of them,” he said. He suggested to build national consensus on water scarcity or other issues, robust data with easy access and credibility.\nClimate Change and Water Resource Governance Specialist, FAO, Fazilda Nabeel said the architecture to tackle the issues was in place but the daunting task was the implementation of policy frameworks.\nShe mentioned that the Water Acts were legislated by the provinces but had no proper implementation, whereas no effective implementation of Water Policy 2018 and Senate body on Water further aggravated poor implementation of laws.\nDirector to Chairman, WAPDA, Husnain Afzal said war in the prevailing times was not an option but resorting to water diplomacy was imperative to resolve the crisis.\nHe added that it was much needed to sensitize masses on the projects like Kala Bagh Dam alongwith building a national character to have judicious water usage as water security was all about accessibility, availability and quality of water.\nIftikhar Ahmed, first Secretary British High Commission delivered the vote of thanks.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:32:30.410Z"
}
