{
  "title": "Ustad Rahat Fateh Ali Khan honored with ‘Hilal-e-Imtiaz’ for musical excellence",
  "link": "https://www.app.com.pk/national/ustad-rahat-fateh-ali-khan-honored-with-hilal-e-imtiaz-for-musical-excellence/",
  "date_published": "2024-03-24T05:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP): Ustad Rahat Fateh Ali Khan was conferred Pakistan’s second highest civilian award ‘Hilal-e-Imtiaz’ by President Asif Ali Zardari at Aiwan-e-Sadr on Pakistan Day for his services to the Pakistani and South Asian music industry.\nKhan, the star of Pakistan and music icon, was honored with the ‘Hilal-e-Imtiaz’ for his contributions to the fields of arts, Qawwali, and singing, as well as for elevating Pakistani arts to an international platform with his captivating performances of Qawwali and contemporary music.\nRahat Fateh Ali Khan said he was grateful for the honour.\nThe singer said: “It is with profound gratitude that I accept the prestigious Hilal-e-Imtiaz & Sitara-I-Imtiaz awards bestowed upon me by the esteemed President. I extend my heartfelt appreciation to my cherished family, friends, and devoted fans whose unwavering support has been my guiding light on this remarkable journey. Together, we stand in humble reverence, inspired to continue our pursuit of excellence.”\nRahat Fateh Ali Khan expressed immense gratitude for being honored with the Sitara-i-Imtiaz in 2018 and now the Hilal-e-Imtiaz in 2024, considering it a significant privilege. He pledged to continue showcasing the softer aspects of Pakistan to the international community. Recognizing these awards as the highest civilian honors, he felt obliged to uphold the legacy of his uncle and mentor, Ustad Nusrat Fateh Ali Khan, through modern interpretations of Qawwali. He extended his heartfelt thanks to the nation and his global fans for their unwavering support throughout his journey.\nThe Federal Investigation Agency (FIA) announced two weeks ago that it found no evidence linking renowned singer Ustad Rahat Fateh Ali Khan to money laundering, tax evasion, or any other illegal activities. The country’s top investigation agency stated that it has concluded its probe into an alleged case of money laundering and tax evasion involving the acclaimed singer, citing a lack of evidence to support any wrongdoing.\nThe additional director of FIA’s Lahore Zone confirmed that the competent authority has approved the closure of the investigation against Rabat Fateh Ali Khan and others, based on the recommendations made by the field inquiry unit. “Upon review of the available records, no evidence has been found to implicate Khan in any illegal currency smuggling activities,” stated the senior FIA officer.\nAccording to details provided by FIA Lahore, an inquiry was initiated in January against the singer and 182 other frequent commuters who have travelled abroad for work from Lahore International Airport.\nThe money laundering and tax evasion investigation was based on data concerning frequent travellers, with a specific focus on identifying any individuals involved in currency smuggling or money laundering, the report stated.\n“The data of 182 travelers was furnished by the deputy director of Immigration at Allama Iqbal International Airport, Lahore. Subsequently, measures were taken to identify any regular traveler engaged in currency smuggling or money laundering. Khan’s name was also listed among the frequent travelers. However, upon review of the available records, no evidence has surfaced against the singer linking him to the illicit activities of currency smuggling.”",
  "retrievedAt": "2025-08-11T01:32:52.851Z"
}
