{
  "title": "Senate body seeks detailed briefing on judges appointment",
  "link": "https://www.app.com.pk/national/senate-body-seeks-detailed-briefing-on-judges-appointment/",
  "date_published": "2021-07-01T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 1 (APP): Senate Standing Committee on Law and Justice Thursday directed the Ministry of Law and Justice to brief the members about the procedure of judges appointment in the judiciary.\nThe Senate body met here under the chairmanship of Syed Ali Zafar and reviewed the performance of special courts and administrative tribunals. The meeting was attended by the Minister for Law and Justice Farogh Naseem and other officials of the ministry.\nAt the beginning of the meeting, Secretary Law and Justice Raja Naeem Akbar briefed the committee on the performance and functioning of the Ministry of Law and Justice. The committee reviewed the performance of special courts and administrative tribunals.\nMinister for Law and Justice Farogh Naseem apprised the committee that the experiment of appointing judges through Federal Public Service Commission had failed.\nHe informed the committee that the procedure for the appointment of judges had been changed.\nThe committee chairman said the procedure for the appointment of judges was an important issue.\nHe said the procedure for the appointment of judges needed to be reviewed.\nSenator Azam Nazir Tarar underlined that all judges ‘appointments were null and void unless the chief justice was consulted.\nThe committee chairman also sought a detailed briefing from the ministry on the issue of the appointment of judges.\nWhile secretary law and justice was mentioning the courts managed by the External Administrative Wing of the Ministry, Senator Farooq H Naik questioned the non-presence of the accountability court on the list.\nOn the non-presence of the accountability court on the list which was tabled by the secretary law and justice, the secretary said it was omitted mistakenly.\nThe committee chairman rectified the list and directed the ministry to give a detailed briefing in this regard at the next meeting.\nThe committee also reviewed “The Enforcement of Women’s Property Rights (Amendment) Bill, 2021 and after a detailed discussion passed the bill by a majority vote while Senator Mian Raza Rabbani opposed the bill.\nThe committee discussed and deferred the Muslim Family Laws (Amendment) Bill 2021 (Amendment of Section 4) and the Muslim Family Laws (Amendment) Bill 2021 (Amendment of Section 7) for further consideration.\nThe discussion on Muslim Family Laws (Amendment) Bill 2021 lasted for almost seventy-five minutes.\nThe chairman of the committee said for the first time in 60 years, he was seeing a bill brought for a particular sect.\nHe informed the committee participants that the Muslim Family Law Ordinance 1962 had decided that legislation would not be made for a particular sect, but the Muslims of Pakistan.\nHe said the people have already declared the bill as wrong and controversial. The chairman also pointed out the errors in the draft of the bill. He also recommended inviting and hearing Ulema’s point of view on the matter.\nConceding with the chairman’s view on the bill, Senator Mian Raza Rabbani said the issue should be discussed in detail.\nRegarding the bill, Senator Azam Nazir Tarar also agreed with the chairman of the committee.\nSenator Farooq H Naik declared the proposed amendments (Section 4 and Section 7) contrary to Muslim laws.\nHe said the bill should either be sent to Islamic Ideology Council (IIC) or consult the Ulema on the matter.\nSenator Shibli Faraz said the bill would create more problems.\nSenator Musaddiq Malik emphasized that the committee could only move and decide forward on the bill after reading the laid bill and proposed amendments thoroughly.\nThe chairman adjourned the matter till the next meeting by issuing orders to the Ministry of Law and Justice to give a detailed briefing along with data and charts at the next meeting regarding the amendment in Section 4 and Section 7 of the Muslim Family Laws Amendment Bill 2021.\nThe committee meeting was attended by Syed Shibli Faraz, Azam Nazir Tarar, Mian Raza Rabbani, Farooq Hamid Naik, Musaddiq Malik, Walid Iqbal, and Muhammad Humayun Mohmand.\nMinister for Law and Justice Farogh Naseem, Parliamentary Secretary for Law and Justice Malika Bukhari, Secretary for Law and Justice, and other officials of the ministry also attended the committee meeting.",
  "retrievedAt": "2025-08-11T20:54:51.154Z"
}
