{
  "title": "PSF invites proposals for inter-university competition to develop low-cost plastic waste recycling machine",
  "link": "https://www.app.com.pk/national/psf-invites-proposals-for-inter-university-competition-to-develop-low-cost-plastic-waste-recycling-machine/",
  "date_published": "2021-07-01T10:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 1 (APP): Pakistan Science Foundation (PSF) has invited proposals for inter-university competition to develop low-cost, small scale and easily replicable plastic waste recycling machine for universities present in Islamabad Capital Territory (ICT).\nThe proposals have been invited by PSF in collaboration with the United Nations Educational, Scientific and Cultural Organization (UNESCO). The award for this competition will be provided by UNESCO.\nTalking to APP, Principal Scientific Officer, Science Popularization Wing, PSF, Syeda Rehana Batool informed that the funding will be provided to the selected five proposals only for two months time period ending by August 31. The selected teams would submit their final products till August 31.\nHighlighting the importance of the initiative, Rehana Batool said that the goal of this inter university competition is to engage youth to promote indigenous low-cost plastic reuse methods to pave the way for a sustained approach towards plastic waste management.\nAbout the funding, she said the funding sponsor will be paying for selected five proposals after evaluation by an independent panel of experts.\nFunds will be transferred to head of the department concerned in the selected universities.\nThe fund will only be used for developing low-cost plastic waste recycling machine, she added.\nShe said that a faculty member (mentor) must be involved with the project to support the students in their research activities.\nExplaining the procedure for submitting the proposals, Rehana Batool informed that the proposals along with student details including name, father name, class or semester, enrollment number, contact number, e-mail etc. will be accepted from students (individual or group not more than 05 students) studying in ICT based universities dully signed and stamped by the head of department or dean or vice chancellor.\nShe continued that all proposals (Technical and Financial) must be submitted on the provided formats in English and should include information or details including Introduction and background, objectives, methodology, expected outcomes, work plan and budget with maximum possible breakdown which is necessary for the experts to understand the research ideas and anticipated outcomes.\nThe award funds are intended to finance the students’ research work and may be used only to cover those expenses which will serve for the said purpose. The deadline for submission of proposals is July 07 (Monday till 05:00 pm), she added.",
  "retrievedAt": "2025-08-11T20:54:58.100Z"
}
