{
  "title": "Beneficiaries under Ehsaas to get subsidize Ration at USC from July 31: MD USC",
  "link": "https://www.app.com.pk/national/beneficiaries-under-ehsaas-to-get-subsidize-ration-at-usc-from-july-31-md-usc/",
  "date_published": "2021-07-01T17:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 1 (APP): Managing Director Utility Stores Corporation (USC, Umer Lodhi Thursday announced that subsidy at Utility stores would continue and beneficiaries registered under Ehsaas program would now get ‘targeted subsidies’ on essential Kitchen items at all Utility stores from the end of July, 2021.\nFederal government has initially completed its trail for targeted subsidies program for Ehsaas beneficiaries through IT integration between Ehsaas and Utility Stores Corporation of Pakistan (USC) which would be functional soon, he said while speaking to a Private news channel.\nThe Ehsaas cards will enable the holders to purchase basic consumer items like wheat flour, pulses, rice, sugar, ghee/edible oil on subsidized rates, he added.\nUSC with the collaboration of Ehsaas emergency program was identifying all genuine and deserving people for targeted subsidy program, MD said.\nHe said Ehsaas has been working with USC to integrate their IT systems with those of state-run USC so that they can identify Ehsaas beneficiaries, deserving people along with Ehsaas card would visit USC stores and get subsidize rate kitchen items.\nHe said with the installation of hardware at across the country at USC stores would be complete soon, adding, targeted subsidies will be given on selected essential commodities.\nTargeted subsidization is more beneficial for pro-poor economic welfare.\nUsing the Ehsaas data, this new system will improve the efficiency of subsidy delivery mechanism for better results, he added.\nThe government under the vision of PM Imran Khan has taken a fundamental decision that subsidies should be targeted to benefit the poor rather than being untargeted, he mentioned.\nHe said targeted subsidy programmes would be prove more effective, as the benefit of subsidies flows exclusively to those in need.\nReplying a Query, he said price for previous kitchen items would not be changed in USC stores as government has taken strict measures to curtail prices of essential commodities to provide relief to the common people.",
  "retrievedAt": "2025-08-11T20:54:49.508Z"
}
