{
  "title": "Food security to become national security issue if not handled timely: PM",
  "link": "https://www.app.com.pk/national/food-security-to-become-national-security-issue-if-not-handled-timely-pm/",
  "date_published": "2021-07-01T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 1 (APP): Prime Minister Imran Khan Thursday said that food security was a great challenge for Pakistan which could even become a national security issue if timely measures were not taken.\n“The country is faced with new challenges…The population size is growing fast. We need to prepare in advance as how to grow food during next 10 to 15 years,” the prime minister said addressing the Kisan Convention here which marked the launch of Agriculture Transformation Plan.\nMinister for National Food Security Syed Fakhar Imam, Minister for Aviation Ghulam Sarwar Khan, Special Assistant on Food Security Jamshed Iqbal Cheema also attended the event besides hundreds of farmers from across the country.\nHe said the timely measures were inevitable to ensure the survival of the future generation.\nHe said the nation which failed to grow food to suffice needs of its people could not excel rather it should be punished for this slackness.\nHe said Pakistan imported four million tons of wheat last year which had to be paid for in foreign exchange amidst already existing shortage of dollars.\nLIVE #APPNews : Prime Minister Imran Khan addressing National Kisan Convention #Islamabad @PakPMO @Jamshediqbalch @mnfsr https://t.co/TBNEzGtYsh\n— APP  (@appcsocialmedia) July 1, 2021\nThe prime minister also shared the alarming figures of 40 percent stunted growth of children due to malnutrition and that such children could never progress due to limited growth of brain and body.\nThe prime minister said the country was faced with shortage of pure milk mainly because of the milk production of animals in Pakistan was far lower than the developed countries.\nHe said the import of sperm could have resolved the issue but the farmers neither had the awareness nor the resources.\nHe said the elite capture was the real issue which had grabbed the resources and facilities meant for all the people.\nImran Khan said after the creation of Pakistan, the rulers could have ensured inclusive growth but instead they created divide by promoting class-based education, health and other facilities.\nSimilarly, he said the farmers also faced dearth of resources to import quality seeds, build cold storages which led to their exploitation by the middle man.\nHe said ideally, the government should first focus the uplift of common man like Madina State and also opted by China which had steered around 700 million people out of poverty mainly by supporting the small famers.\n“We have decided to take those steps from today. Instead of letting it to become a national security issues, we should become the (food) exporter,” he remarked.\nThe prime minister said the previous rulers had made the country addicted to foreign aid which deprived any nation of power.\nHighlighting the use of modern agriculture technology, the prime minister exemplified Israel which had even turned the desert cultivable. He said though Pakistan did not recognize it owing to its oppression against Palestine, Israel achieved progress in agriculture using the modern techniques.\nReferring to the 12 climatic zones of Pakistan, the prime minister said the government had decided to promote the cultivation of all kinds of crops and fruits as per the countrywide mapping of land and research.\nThe government would also give special focus on research and seed development, the prime minister said and informed the audience that the inclusion of agriculture in CPEC would also enable Pakistan benefit from Chinese agriculture technology.\nHe said in order to support the small farmers, the government had introduced loans under Kamyab Jawan Program.\nMoreover, through Kisan Card, the government would provide direct subsidy to the farmers with little land holdings. The farmers would also be trained on modern trends and techniques in agriculture, he added.\nImran Khan said an olive revolution was in the making in Pakistan and the country would emerge as an olive exporter within next few years.\nHe assured the farmers that the government would put in all its efforts on agriculture research besides frequent interaction with the farmers to know their issues and ensure resolution.\nHe said it was unfortunate that around 30 percent of produce like fruit and vegetables were wasted owing to the absence of storage and proper transport facilities.\nThe prime minister said that taking advantage of technology, China had developed virtual market to enable the farmers directly sell their products in the market.\nThe prime minister said the government would strive for farmers’ prosperity who would resultantly spend more money on their land and thus receive increased crop.\nHe said as the farmers had got Rs 1100 billion against their crops of wheat, sugarcane and rice which ultimately led to the record bumper crop as the farmers put in extra money to enhance their yield.\nThe prime minister assured the audience that Pakistan would earn fame among comity of nations as head been dreamt by its forefathers as a nation with justice, humanity and self-esteem.\nEarlier, Minister for Food Security Syed Fakhar Imam said consequent to government’s policies, the farmers got six bumper crops.\nHe said seed technology was a major issue for Pakistan and also called for overhaul of curriculum of agriculture education and promotion or organic farming.\nThe minister said the government had allocated Rs 160 billion which would be spent on agriculture policy and research in coordination with the provinces.\nIn his presentation, SAPM Jamshed Iqbal Cheema highlighted the potential of land in different provinces like lentils, soy, cotton and olive in Balochistan, jujube and 10,000 tons honey production in Margalla hills.\nHe said the agriculture transformation plan featured establishment of six to seven Kisan Malls at every tehsil, olive plantation over a million acres, soy beans over two million acres and increase of maize by three times.",
  "retrievedAt": "2025-08-11T20:54:55.275Z"
}
