{
  "title": "Parliament gets briefing on national security issues, regional challenges",
  "link": "https://www.app.com.pk/national/parliament-gets-briefing-on-national-security-issues-regional-challenges/",
  "date_published": "2021-07-01T17:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 1 (APP): An in-camera session of the parliament was held Thursday wherein Inter-Services Intelligence (ISI) Director General Lieutenant General Faiz Hameed briefed the political leadership on external and internal security issues and regional challenges.\nThe briefing especially focused on the situation in Indian Illegally Occupied Jammu and Kashmir as well as Afghanistan.\nChaired by National Assembly Security Committee Chairman and Speaker Asad Qaiser, the briefing was attended by parliamentary leadership, members of the National Assembly as well as senators, said a press release issued after the first culmination of first session.\nIn the first session, the legislators were told that Pakistan had played a very sincere, positive and responsible role in Afghan peace process.\nPakistan’s concerted efforts had not only paved the way for dialogue between the confronting Afghan groups but also facilitated the meaningful negotiations between the United States and Taliban.\nPakistan firmly believed that peace and stability in Afghanistan would lead towards lasting peace in South Asia.\nThe meeting was informed that Pakistan would welcome a government which would be a real representative of Afghan people at all levels, and would continue playing its responsible role for Afghan peace.\nThe meeting was further informed that Pakistan’s land was not being used against Afghanistan and hoped that Afghanistan would also not allow using its soil against Pakistan.\nThe house was told that around 90 percent Pak-Afghan border had been fenced while an effective system of customs and border control was also being enforced.\nThe political and parliamentary leadership expressed satisfaction over the briefing and exhibited their desire for peace, development and prosperity in Afghanistan.\nThey viewed that such meetings not only played an important role in evolving national consensus on important national issues but also created harmony on various national issues.\nThe briefing also featured a question and answer session wherein the members also put forwarded their suggestions. The recommendations would be considered as an important part of security policy.\nLeader of Opposition in the National Assembly Shehbaz Sharif, Foreign Minister Shah Mehmood Qureshi, Minister for Information and Broadcasting Chaudhary Fawad Hussain, Minister for Railways Azam Khan Swati, Minister for Housing and Works Chaudhry Tariq Bashir Cheema, Interior Minister Sheikh Rashid Ahmed, Defense Minister Pervez Khattak, Minister for Planning, Development and Special Incentives  Asad Umar, Federal Minister for Education Shafqat Mahmood, Federal Minister for Human Rights Dr Shireen M Mazari, Prime Minister’s Advisor on Parliamentary Affairs Dr Babar Awan and Minister of State for Parliamentary Affairs Ali Muhammad Khan,\nMembers of the National Assembly Bilawal Bhutto Zardari, Asad Mehmood, Dr Khalid Maqbool Siddiqui, Khalid Hussain Magsi, Muhammad Akhtar Mengal, Ghous Bakhsh Khan Mehr, Amir Haider Azam Khan, Nawabzada  Shahzain Bugti were also present.\nSenate Chairman Muhammad Sadiq Sanjarani, National Assembly Deputy Speaker Muhammad Qasim Khan Suri, Chief Whip in the National Assembly Malik Muhammad Amir Dogar, Members of the National Assembly Shahid Khaqan Abbasi, Khawaja Muhammad Asif, Rana Tanveer Hussain, Ahsan Iqbal Chaudhry, Raja Pervez Ashraf and Hina Rabbani Khar were among the special invitees.\nLeader of House in the Senate Dr Shehzad Wasim, leader of opposition in the Senate, Senator Yousuf Raza Gillani also attended the meeting.\nMembers of the Senate Sherry Rehman, Azam Nazir Tarar, Anwar-ul-Haq Kakar, Maulana Abdul Ghafoor Haideri, Syed Faisal Sabzwari, Muhammad Tahir Bizenjo, Hidayatullah Khan, Muhammad Shafiq Tareen, Kamil Ali Agha, Mushtaq Ahmed, Syed Muzaffar Hussain Shah, Muhammad Qasim and Dilawar Khan also attended the briefing.\nThe meeting was also attended by the chief ministers of the four provinces.\nChief of Army Staff General Qamar Javed Bajwa, Inter-Services Public Relations (ISPR) Director General Major General Babar Iftikhar and other heads of national security agencies also attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T20:55:02.674Z"
}
