{
  "title": "Maritime Affairs to launch int’l standards ferry service terminal at KPT: Senate body told",
  "link": "https://www.app.com.pk/national/maritime-affairs-to-launch-intl-standards-ferry-service-terminal-at-kpt-senate-body-told/",
  "date_published": "2021-07-01T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 1 (APP): Minister for Maritime Affairs Ali Haider Zaidi on Thursday informed Senate Standing Committee on Maritime Affairs that his ministry was launching an international standards ferry services terminal at Karachi Port Trust (KPT).\nThe committee met here at Parliament House in the chairmanship of Senator Rubina Khalid.\nThe Committee was also briefed in detail by the Minister, Ali Haider Zaidi, on the organization, functions and performance of the Ministry of Maritime Affairs and its attached departments.\nThe Minister apprised the committee that 405 million dollar exports has been generated this year.\nThe chairman Pakistan National Shipping Corporation (PNSC) informed the committee that a profit of 2.4 billion last year and 1.6 Billion this year has been generated.\nThe committee was also apprised that Pakistan pays freight bill of 5.5 -6 billion US dollars on imports annually.\nThe committee also discussed a point of public Importance raised by Senator Muhammad Tahir Bizinjo with regards to fishing by foreign trawlers in the territorial waters of Baluchistan.\nMover Senator Tahir Bizinjo said that fishing was the only source of income for the people of coastal areas. The local fishermen were facing hardships currently, due to the fishing by the trawlers of foreign countries. He called for searching out an amicable solution to address the issue at the earliest.\nChairperson Committee, emphasized that this issue may be resolved at the earliest possible. Minister for Maritime Affairs informed that bad weather forced the trawlers to come near Gwadar port area and no permission has been granted by the concerned authorities for fishing in the area.\nThe minister assured the committee to take up the matter at the appropriate level for resolution of the complaint as early as possible.\nChairperson Committee further directed the Ministry to coordinate with all responsible departments related to this issue and submit a report in the next meeting.\nShe also asked for the copy of the new fishing policy in the next meeting so that the committee can view and give its output.\nThe committee was attended by members of the committee Senators including Nuzhat Sadiq, Fida Muhamad, Abdul Qadir, Danesh Kumar, Dost Muhamad Khan, Muhammad Akram, Naseema Ehsan and Senator Muhammad Tahir Bizinjo, Minister Maritime Affairs, Ali Haider Zaidi and other senior officials of the Ministry and attached departments.",
  "retrievedAt": "2025-08-11T20:54:54.425Z"
}
