{
  "title": "COVID-19 national tally of active cases below 32,000 for second consecutive day",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-of-active-cases-below-32000-for-second-consecutive-day/",
  "date_published": "2021-07-01T09:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 1 (APP): The national tally on Thursday of total active COVID-19 cases was recorded 31,767 with 1,037 more people tested positive for the deadly virus and 836 people recovered from the disease during the last 24 hours.\nForty corona patients have died during past 24 hours, 36 of whom were under treatment in the hospitals and four of them perished in their respective homes or quarantine facilities, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Sindh and followed by Punjab. Out of the total 40 deaths occurred, 20 of them died were under treatment on ventilators.\nThere were 1,844 Covid infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 2.2 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 22 percent, Bahawalpur 20 percent, Peshawar 21 percent and Multan 23 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Gilgit 48 percent, Rawalpindi 18 percent, Karachi 24 percent and Multan21 percent.\nAround 239 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan, and Gilgit Baltistan (GB).\nSome 46,145 tests were conducted across the country on Wednesday, including 14,520 in Sindh, 17,107 in Punjab, 10,066 in Khyber Pakhtunkhwa (KP), 2,808 in Islamabad Capital Territory (ICT), 637 in Balochistan, 455 in GB, and 552 in AJK.\nAround 904,320 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nA total of 958,408 cases detected so far (AJK 20343, Balochistan 27178, GB 6138, ICT 82706, KP 138068, Punjab 346301, Sindh 337674)\n22321 deaths Sindh: 5464 (21 died in hospital and 3 died out of hospital on 30 Jun) Punjab: 10755 (7 died in hospital and 1 died out of hospital on 30 Jun) KP: 4320 (4 died in hospital on 30 Jun) ICT: 779 (2 died in hospital on 30 Jun) Balochistan: 309 (1 died in hospital on 30 Jun) GB: 111 (-) AJK: 583 (1 died in hospital on 30 Jun) 14,590,230 tests conducted 639 hospitals with covid facilities with 2102 patients admitted across the country.\nSince the pandemic broke out, a total of 958,408 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 20,343, Balochistan 27,178, GB 6,138, ICT 82,706, KP 138,068, Punjab 346,301 and Sindh 337,674.\nAbout 22,321 deaths were recorded in country since the eruption of the contagion. Around 5,464 people perished in Sindh, 21 of them died in hospitals and three out of the hospitals on Wednesday.\nSome 10,755 people died in Punjab with seven deaths occurred in the hospitals and one out of the hospitals in the past 24 hours.\nAs many as 4,320 people expired in KP, four of them died in hospitals, 779 individuals died in ICT, two of them perished in the hospital, 309 people died in Balochistan, one of them expired in the hospital, 111 infected people perished in GB and 583 people in AJK succumbed to the deadly virus, one of them expired in the hospital.\nA total of 14,590,230 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country. Some 2,102 corona patients were admitted in hospitals.",
  "retrievedAt": "2025-08-11T20:54:58.501Z"
}
