{
  "title": "Pakistan envoy thanks compatriots on completion of stint in Canada",
  "link": "https://www.app.com.pk/national/pakistan-envoy-thanks-compatriots-on-completion-of-stint-in-canada/",
  "date_published": "2021-07-01T16:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 1 (APP): Pakistan High Commissioner to Canada Raza Bashir Tarar Thursday said that he had completed a rewarding tour of duty in Canada and was returning to Pakistan with loads of love and affection of Canadian Pakistanis.\nAddressing an online monthly public forum-cum-ekatchehry, the high commissioner said the Pakistani expatriates  stood by him and his team and helped in improvement of bilateral relations, trade, cultural links and enhancement of Pakistan’s image abroad.\nThe event was arranged by Pakistan High Commission Canada and its consulates in Toronto, Vancouver and Montreal to receive and address queries and concerns of members of the Pakistani diaspora in Canada.\nDuring the online forum, members of the community asked various questions which were addressed in detail by Consul General of Pakistan Toronto Abdul Hameed, Consul General of Pakistan Vancouver Janbaz Khan and Consul General of Pakistan Montreal Ishtiaq Ahmed Akil.\nThe issues discussed during the hour-long session included shifting of Nadra related services to online mode following instruction of Supreme Court of Pakistan; difficulties experienced by Pakistani expatriates in opening Roshan Digital Accounts; procedure for withdrawal of pensions through ATMs and without going to Pakistan by retired government employees residing in Canada and execution of power of attorney through Canadian rather than Pakistani documents.\nThe expatriates also highlighted the issues including need for vaccination for Canadian Pakistanis visiting Pakistan and wanting to return to Canada, procedures for obtaining family registration or child registration certificates through NADRA; grant of voting rights; role of Canadian Pakistanis in promotion of bilateral trade; promotion of exports and need for visiting Consulates by community members for the purpose of finger-printing for renewal of passports.\nIn his remarks, High Commissioner Raza Bashir Tarar paid glowing tributes to the Pakistani diaspora in Canada for a sterling role they had played in improving bilateral ties and playing active part in the welfare and socio-economic development of both Canada and Pakistan.\nHe said he had heard first-hand various accounts of how the Canadian leadership recognised and appreciated the role of Canadian Pakistanis for their services to the Canadian society and country.\nHe noted that the Government of Pakistan under the leadership of Prime Minister Imran Khan was committed to serving the overseas Pakistan by ensuring their welfare and remaining connected with them on 24/7 basis for resolution of their routine issues and concerns.\nHe said the Pakistan missions abroad were constantly being guided and monitored by Foreign Minister Shah Mahmood Qureshi to translate the vision of the prime minister about the overseas Pakistanis in reality.",
  "retrievedAt": "2025-08-11T20:54:51.410Z"
}
