{
  "title": "Int’l community should help go after backers, financers of terrorism in Pakistan: Bilawal",
  "link": "https://www.app.com.pk/national/intl-community-should-help-pakistan-go-after-backers-financers-of-terrorism-bilawal/",
  "date_published": "2022-12-15T19:26:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Dec 15 (APP): Foreign Minister Bilawal Bhutto Zardari on Thursday urged the international community to help Pakistan combatting and go after those who backed, supported, financed and facilitated terrorism in Pakistan.\nThe foreign minister, in a press briefing, after he hosted the Ministerial Conference of G-77 Plus China here, apprised the media of a dossier issued by Pakistan containing the pieces of evidence of Indian involvement in a terror attack in Johar Town area of Lahore in 2021.\nHe said Pakistan had also sought the United Nations to list four individuals associated with the attack in Pakistan which was aimed at targeting Pakistan’s economic engagement with China under One Belt and One Road Initiative.\nHe said a former Indian National Security Advisor was also on record to have confessed the Indian backing of terrorism in Pakistan.\nCalling upon the Indian government to end such tactics, the foreign minister said the terrorists would not be content to attack only Pakistan rather one day they would hit India too.\nTo a question, he said “Osama Bin Laden is dead but the Butcher of Gujarat is alive and the prime minister of India. This the prime minister and foreign minister of RSS which derives inspiration from Hitler.”\nHe said the RSS did not believe in the ideology of Gandhi but instead treated his killer as a hero.\n“We should finally work together to put an end to this longstanding point of irritation between the two countries… Let us look to the future and ensure to going forward,” he remarked.\nHe told the media that in an open debate held on Wednesday, Pakistan had sought reforms and emphasised that permanent members had been unable to address the host of issues at the UN which necessitated the further democratisation of the world body.\nRegarding the UNSC’s meeting on counter-terrorism, he said it could have been more “inclusive and transparent” if it was held as an open debate allowing all countries, particularly like Pakistan to share its experiences and strategy to defeat terrorism.\nHe said Pakistan was proud to have fulfilled two action plans of the FATF simultaneously and owing to the very achievement, Pakistan aspired to become the FATF member to share its experiences with other countries.\nHe called for the world to move away from the Islamophobic narrative and framing of terrorism as terrorism knew no religion or boundaries.\nHe said instead of knowing Muslims as a victim of terrorism, they were defined by those who carried out the attaks because the perpetrators were Muslims.\nHe said as per statistics, more Muslims were killed in terrorist attacks from 2001 to 2022.\nAbout the flood-caused devastation in Pakistan, the foreign minister told the media that many parts of Sindh and Balochistan were yet under water.\nHe said the flood-hit areas were faced with climate, health and education emergency with malaria spreading and 47% of schools infrastructure partly or completely damaged.\nHe thanked the UN Secretary-General, who would co-host a conference in Geneva on January 9, for building climate resilience of Pakistan.\nComing to Afghanistan, the foreign minister called for the international community to engage with the Afghan government and also emphasised the measures to address the challenging economic situation of the war-torn country deteriorated by the frozen assets and closed banking channels.\nHowever, he also urged the Afghan government to fulfill its commitment with the international community for the rights of women and girls’ education.\nAsked about the attack on Imran Khan, the foreign minister emphasised the Punjab government to carry out a thorough investigation into an attack on the former prime minister. For the federal government’s part, the prime minister has written a letter to the superior judiciary for a judicial commission, he added.\nHe opposed the notion of the popularity of Imran Khan saying that he had lost his own party’s seats in the by-election and that he failed to gather an impressive crowd for his Rawalpindi procession.\nRegarding an attack on Pakistan’s head of Mission in Kabul, he said the country had raised security concerns with the Afghan government which had also assured to apprehend the culprits.\nHe said the envoy was in Pakistan for consultations and would be back to his office once the security concerns were addressed.\nRegarding the improvement in the Pak-US ties, he said after 2001, 90% of the discussions marked terrorism and extremism but currently it was replaced by talks on cooperation in health, climate change and economic opportunities.\nAsked about Pakistan’s engagement with Russia for the purchase of oil at a discounted price, the foreign minister said Pakistan’s infrastructure was not made for Russian oil, though the country could engage with the country in the future.",
  "retrievedAt": "2025-08-11T16:01:43.747Z"
}
