{
  "title": "Pakistan, AJK worst victims of climate change: AJK President",
  "link": "https://www.app.com.pk/national/pakistan-ajk-worst-victims-of-climate-change-ajk-president/",
  "date_published": "2022-12-16T14:22:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) Dec 16 (APP): Azad Jammu and Kashmir President Barrister Sultan Mahmood Chaudhry, while terming climate change as a global problem, said on Friday that developing countries including Pakistan were the worst victims of the climatic change.\nAddressing a seminar organized by Azad Kashmir Red Cross and German Red Cross in the State metropolis, the AJK President while referring to the devastating floods that wreaked havoc in northern and southern parts of the country said that Pakistan and Azad Kashmir suffered immense losses due to the large-scale floods caused by the climate change this year.\nHighlighting the dreadful challenges the people of Pakistan and AJK have been facing, the president said, “We need greater cooperation of the international community, especially global disaster management to tackle these challenges”.Being an important member of global disaster management, the International Red Cross can be helpful in dealing with natural disasters”, he said.\nReferring to the cloudburst that hit the Neelum valley, he said Azad Kashmir has also been affected due to climate change. He said that there was a dire need to intensify our efforts to deal with natural calamities in a timely manner so that the damage caused by natural calamities can be minimized.\nBarrister Chaudhry further said that developed countries suffer less from climate change because they have better infrastructure and resources. He appreciated the International Red Cross, for providing full support to the victims of the earthquake in 2005. “I assure the officials of the Red Cross on behalf of the Government of Azad Kashmir that we will provide them all facilities and support”, the President said.\nThe seminar was also attended and addressed by AJK Senior Minister Khawaja Farooq Ahmed, Chairman Pakistan Red Crescent Society Sardar Shahid Khan Laghari, Head of German Red Cross Asif Rehman and others.APP / AHR.",
  "retrievedAt": "2025-08-11T16:01:35.192Z"
}
