{
  "title": "Gross human rights violation in IIOJK, Palestine trial of conscience of modern world: Ayaz Sadiq",
  "link": "https://www.app.com.pk/national/gross-human-rights-violation-in-iiojk-palestine-trial-of-conscience-of-modern-world-ayaz-sadiq/",
  "date_published": "2024-08-21T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP):Speaker NA Sardar Ayaz Sadiq Wednesday said that gross human rights violations in Indian illegally occupied Jammu and Kashmir (IIOJK)) and Palestine is the trial of the conscience of the modern world. “Severe Human Rights violations in IIOJK and Palestine warrant immediate attention of the civilized world” he expressed these views during his meeting with the President of the Republic of Belarus Alexander Lukashenko in Minsk, Belarus today.\nHe said that resolving the Kashmir issue as per resolutions of the United Nations Security Council is pivotal for regional peace and stability, and an immediate ceasefire in Gaza is also essential for ending the Palestinian Genocide, according to a news release received here.\nHe said that Pakistan is the least contributor to climate change but the most severely affected Nation due to the devastating impact of climate change.\nHe added, “The issue of global climate change requires global efforts.” While highlighting the friendly ties between both nations, he said that Pakistan and Belarus enjoy cordial ties based on shared interests.\nHe expressed his resolve to strengthen relations between both nations further. The Speaker added, “Pakistan is blessed with vast potential in energy and trade.”\nAyaz Sadiq also said that Pakistan-Belarus Bilateral Relations are characterized by mutual respect. He further underscored that Pakistan-Belarus ties would expand through collaboration in economic, industrial, and agriculture sectors. During the meeting, matters related to enhancing bilateral relations, including trade and parliamentary relations, were deliberated in detail.\nBoth sides also expressed determination to further strengthen bilateral relations. The President of Belarus, Aleksandr Lukashenko remarked that Belarus attached great importance to its close ties with Pakistan. While expressing the desire to further expand bilateral cooperation with Pakistan, he added, “Pakistan has great potential in Energy, Trade and Agriculture Sectors.’\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:51:06.766Z"
}
