{
  "title": "NDMA conducts first National Industrial Disaster Preparedness & Response drills",
  "link": "https://www.app.com.pk/national/ndma-conducts-first-national-industrial-disaster-preparedness-response-drills/",
  "date_published": "2024-08-21T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): The National Disaster Management Authority (NDMA) successfully conducted the first of its kind two-day National Industrial Disaster Preparedness & Response Exercise at NDMA headquarters. Chairman NDMA Lt General Inam Haider Malik inaugurated the Exercises.\nThe prime objective of National SimEx on Industrial Hazards was to highlight the importance of effective management through proactive decision-making and timely implementation of on-ground measures to minimize the impact of industrial incidents, a news release said.\nThe exercise underscored the need for a strengthened coordination mechanism to ensure timely preparedness efforts and foster collaboration between government entities and industrial partners. Participants included Provincial Disaster Management Authorities (PDMAs), rescue agencies, and key players from the chemical and petroleum, oil& gas industries including Lucky Core Industries Limited, Sitara Chemical Industries Limited, Ittehad Chemicals Limited, NIMIR Industrial Chemicals Limited, Fauji Fertilizer Company Limited, Fatima Fertilizer Company Limited, Engro Fertilizer Company Limited,  Pak-Arab Refinery Company Limited,  Attock Refinery Limited, Pakistan Refinery Limited, Cynergyico Pakistan Limited, Sui Southern Gas Company Limited and Sui Northern Gas Pipelines Company Limited.\nSenior representatives from the Ministry of Foreign Affairs, Ministry of Industries & Production, and Ministry of Defence Production also attended the two-day exercise, highlighting the event’s significance and the collective commitment to enhancing industrial disaster preparedness and response capabilities.\nParticipants lauded the efforts of NDMA and remarked this SimEx as a significant step towards building a resilient framework for industrial disaster management in Pakistan, ensuring that all stakeholders are well-prepared to handle potential emergencies effectively.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:51:15.177Z"
}
