{
  "title": "Mohsin Naqvi pays homage to Martyrs on International Day of Remembrance and Tribute to the Victims of terrorism",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-pays-homage-to-martyrs-on-international-day-of-remembrance-and-tribute-to-the-victims-of-terrorism/",
  "date_published": "2024-08-21T10:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): Federal Minister for Interior Mohsin Naqvi has paid tribute to all the martyrs who sacrificed their today for ours peaceful tomorrow in connection with the observance of International Day of Remembrance and Tribute to the Victims of Terrorism.\nIn a message issued here, he said the nation cannot repay the great sacrifices of the martyrs who laid their lives in the war against terrorism, but we will try to repay the debt by eliminating all of the terrorists.\nInterior Minister praised the martyrs who sacrificed their lives in the war against terrorism, calling them the benefactors of the nation.\nHe noted that every segment of Pakistani society has made sacrifices in this war.\nHe said that the Pakistan Army, police, and law enforcement agencies have given their blood for the establishment of peace in the country.\nHe emphasized that there’s no parallel of Pakistan’s unwavering sacrifices in the war against terrorism.\nMohsin Naqvi pointed out that Pakistan is the country most affected by terrorism, with thousands of people martyred and injured in the war against terrorism.\nHe assured that the government and nation stand with the brave families of the martyrs and pay tribute to them in splendid words.\nHe reiterated that the entire nation expresses complete solidarity with the victims of terrorism.\nHe added that the Pakistani nation has faced the menace of terrorism with unwavering determination and courage.\nThe Interior Minister vowed that we will not rest until the eradication of the scourge of terrorism, and nation’s tomorrow will be more peaceful and secure.",
  "retrievedAt": "2025-08-11T04:51:15.087Z"
}
