{
  "title": "Advance technology being used to enable Sahiwal Coal plant to generate clean energy",
  "link": "https://www.app.com.pk/national/advance-technology-being-used-to-enable-sahiwal-coal-plant-to-generate-clean-energy/",
  "date_published": "2024-08-21T08:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): The Focal Person of Sahiwal Coal Fired Power Plant has said that the clean and green environment of the power plant is evidence of its environmentally friendly nature.\nThe advanced technology being used at Sahiwal Coal Fired Power Plant enables it to produce clean energy, according to a press release.\nThe combustion of coal in the boiler produces the heat to convert water into high-pressure steam to rotate the turbines and ultimately rotate the electrical generator to produce electricity, along with ash and other gases like CO2, NOx, and SOx majorly, it further said.\nAsh and these all gases are dangerous for the environment if they are not controlled. In the Sahiwal Coal Fired Power Plant, low NOx burner technology is being incorporated in the super-critical boiler. So, significantly less NOx is formed by reducing the peak flame temperature of burners in the boiler.\nTo control the effect of CO2, more than 50000 trees have been planted in the power plant and more trees are being planted under the Pakistan Prime Minister’s 10 billion Tree Campaign, the focal person further said.\nAfter the combustion in the boiler, the flue gas is treated in ESP (Electrostatic Precipitation) and FGD (Flue gas desulfurization). The incorporation of ESP technology has enabled the Sahiwal coal-fired Power Plant to remove ash from the flue gas while the FGD technology to desulfurize the flue gas to a value that is far less than that of the standards set by the Punjab Environmental Protection Agency (PEPA) and even World Bank.\nAll the emission values of flue gas are monitored through a Continuous Emission Monitoring System (CEMS). The values are monitored and controlled by the operation engineers 24/7 a day.\nThe ash is removed from the flue gas with an efficiency of 99.9% in ESP. The ash is then dumped into the ash yard where the spraying water vehicle sprays water several times a day to keep the top surface of dumped ash wet so that it does not fly in the air to cause environmental pollution.\nAfter ESP, the flue gas enters into Absorption Tower which is the main unit for the desulfurization process. In the tower, the sulfur dioxide reacts with limestone slurry in the presence of oxygen to form gypsum as a byproduct. 100% availability of FGD and ESP systems is ensured to guarantee environmental protection.\nThe verification of the safe limit of emissions is executed by a third party which is certified by PEPA. The environmental reports are also submitted to the Government Departments regularly from the Sahiwal Coal Fired Power Plant. These formal procedures and measures taken for protecting the environment by installation of advanced technology prove the sincerity of Sahiwal Coal Fired Power plant to provide clean energy to Pakistan National Grid.\nThe focal person said, a confusion, which is prevailing among the masses of Pakistan, is important to be cleared here.\nSahiwal Coal-Fired Power Plant is the first power project under the CPEC in Pakistan with a capacity of 1320MW.\nIt is also the first among the power plants of Pakistan which is equipped with the Super-critical boiler technology.",
  "retrievedAt": "2025-08-11T04:49:56.478Z"
}
