{
  "title": "Pakistan committed to further strengthen ties with Belarus: Ayaz Sadiq",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-further-strengthen-ties-with-belarus-ayaz-sadiq/",
  "date_published": "2024-08-21T10:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): National Assembly Speaker Sardar Ayaz Sadiq Wednesday said that Pakistan is committed to further strengthening bilateral ties with Belarus, particularly through enhanced parliamentary engagement.\nIn a meeting with Igor Sergeyenko, Speaker of the House of Representatives of the National Assembly of the Republic of Belarus in Minsk, Ayaz said “This visit marks an important step forward in our bilateral relations. We deeply appreciate your hospitality and are eager to build on the foundations laid over the past 30 years of diplomatic relations”.\nThe speaker emphasized the need to deepen parliamentary relations between Pakistan and Belarus, focusing on expanding the legal framework for cooperation, said a news release received here.\n“We are committed to revisiting and updating existing agreements to ensure they are more effective. Our Parliament will actively work on these frameworks to facilitate closer interaction,” Ayaz Sadiq said.\nOn the subject of bilateral cooperation, the speaker reiterated Pakistan’s support for Belarus in international platforms, including its bid to join the Shanghai Cooperation Organization (SCO).\nHe also affirmed Pakistan’s willingness to support Belarus in joining various organizations where Pakistan is a member. “We believe that our collaboration can be mutually beneficial, and we are ready to offer our support wherever possible,” he emphasized.\nMr. Igor Sergeyenko, Speaker of the House of Representatives of Belarus, expressed his gratitude for Pakistan’s consistent support at international forums.\nHe welcomed the visit of the Pakistani parliamentary delegation comprising Members National Assembly M.Asalm Ghumman, Syed Tariq Hussain, and Syed Hafeezuddin noting it as a significant milestone in strengthening the ties between the two countries.",
  "retrievedAt": "2025-08-11T04:51:16.428Z"
}
