{
  "title": "APPA urges Governor State Bank to timely conduct biometrics",
  "link": "https://www.app.com.pk/national/appa-urges-governor-state-bank-to-timely-conduct-biometrics/",
  "date_published": "2023-09-22T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP): All Pakistan Pensioners Association (APPA) General Secretary Aurangzeb Tanuli Friday appealed to the Governor State Bank of Pakistan to oblige the management of all banks to conduct timely biometrics of all pensioners in March and September as per the policy.\nIn a statement here, the Association General Secretary said it was not possible for pensioners to submit biometrics along with life and no marriage certificate together, which was against the policy.\nTanuli said blocking the pension account of a pensioner on this basis was illegal and this issue should be resolved immediately so that the problems of the pensioners could be resolved.\nThe general secretary pointed out the important issue and said that there were clear orders from the State Bank and the Finance Minister that all pensioners were required to get their biometrics done in March and September every year.\n“And if for any reason, if the biometric is not obtained, then the pensioner will have to submit the life certificate. Similarly, if a widow is a pensioner, then she will also be required to undergo biometrics and submit a no marriage certificate. After the age of 60 years, the requirement to submit a no marriage certificate will also cease to fulfill all these strict conditions,” he added.\nHe further mentioned that all male and female pensioners start visiting their respective banks in March and September, but every time they were turned away by the bank management asking them to come next time or month.\n“As a result of which time and money are wasted, the pensioners are afraid of passing the date. And if the biometric is not done in time, the pension of the pensioner is stopped,” he said.",
  "retrievedAt": "2025-08-11T09:45:30.833Z"
}
