{
  "title": "Work on Pak-Iran gas pipeline initiated: Minister Muhammad Ali",
  "link": "https://www.app.com.pk/national/work-on-pak-iran-gas-pipeline-initiated-minister-muhammad-ali/",
  "date_published": "2023-09-22T15:28:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 22 (APP):Caretaker Federal Minister for Energy, Power and Petroleum Muhammad Ali said on Friday that work on Pak-Iran gas pipeline has been initiated.\nHe was talking to the media after inaugurating Sui Northern Gas Pipelines Limited (SNGPL) first Model Customer Service Centre here at its Regional Office on Gurumangat Road.\nThe minister said that 20 per cent natural gas has been decreased as compared to last year, while the government would try to manage gas load-shedding in winter; however, he added the government could not provide gas on cheaper rates, after purchasing at higher rates. People would have to use the natural fuel wisely, he added.\nMuhammad Ali, responding to a query about Russian oil, said that only one cargo had arrived on trial basis, but the problem was to refine it. Only the Pakistan Oil Refinery was refining 46,000 tons of oil monthly, while demand was many times higher. The government was trying to engage private refineries to meet the demand, he added. The government is working on importing more Russian oil, resolving the refinery issues, and making efforts to provide maximum relief to people.\nThe minister said that taxpayers are feeding only 9 per cent to GDP of Pakistan, which is one of the lowest in the world; people would get relief only if tax collection improves.\nAs many as 14 counters have been set up at the Model Customer Service Centre, which included applications for new connection, change of ownership, re-connection, business development counter, billing counter, violation checking counter, billing office counter, accounts/treasury counter, business development process counter, distribution counter, operation counter, maintenance counter, billing industrial & commercial counter, reconnection process counter and inquiry office.\nCitizen will also be able to get duplicate payment slip, security refund and bill correction facilities while a help desk has also been established to provide guidance about energy conservation and safety measures, he said.\nManaging Director SNGPL Amir Tufail, Deputy MD Saqib Arbab, Senior General Manager Distribution Qaiser Masood and other officers were also present.",
  "retrievedAt": "2025-08-11T09:45:31.680Z"
}
