{
  "title": "All political parties to be provided level-playing field for elections: Solangi",
  "link": "https://www.app.com.pk/national/all-political-parties-to-be-provided-level-playing-field-for-elections-solangi/",
  "date_published": "2023-09-22T16:13:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 22 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi Friday reiterated the caretaker government’s commitment for providing a level-playing field to all registered political parties during the general elections.\nAddressing a news conference alongside Governor Sindh Kamran Khan Tessori, the minister assured impartial treatment to any political group during the election campaign.\nSolangi said the caretaker government’s tenure was extended a little bit due to the approval of fresh census results by the Council of Common Interest.\nHe pointed to Article 51 (5) of the Constitution, stating that elections would be held in line with the recently approved census after delimitation of the constituencies.\nThe minister disclosed that the Election Commission of Pakistan (ECP) was actively engaged in the delimitation process and announced that preliminary results of the process would be announced on November 27, with the final results set for release on November 30.\nIn accordance with the Election Act, he said the ECP would have to give 54 days to political parties for their election campaign.\nSolangi welcomed the announcement by the ECP that elections would take place in the first week of January, which ended propaganda against the caretaker government.\nAs regards the criticisms of Fawad Hassan Fawad, who served in the civil service for over 35 years, the minister highlighted that Fawad had worked with various governments.\nHe stressed that civil servants had no power over choosing their assignments, and that unfounded criticism of someone who had been unjustly imprisoned was unfair.\nSolangi also clarified that Fawad Hassan Fawad had no political affiliations.\nResponding to a query, the minister expressed his commitment to pursuing justice in the Jan Muhammad Mahar murder case, noting that he had personally raised the matter with the interim chief minister of Sindh.\nSolangi said the caretaker government had nothing to do with Nawaz Sharif’s matter, adding his cases were in the court, and it was inappropriate to speculate on the issue.\nHe stressed that all citizens in the country were entitled to their fundamental rights, highlighting the importance of student organizations as a pillar of democracy.\nThe minister underscored the role of the independent and empowered Election Commission in ensuring free, fair, and transparent elections, with the caretaker government requiring ECP approval for transfer postings.\nSolangi said government was actively working to address the issues of workers in newspapers and TV channels.\nHe confirmed the lawful arrest of journalist Khalid Jamil by the FIA and emphasized adherence to constitutional and legal procedures, including producing individuals before the court within 24 hours.\nSolangi said the caretaker government would not interfere in judicial matters.\nTo another query, he said the institutions were functioning freely and if anybody had any issue, they could reach out the relevant forums.",
  "retrievedAt": "2025-08-11T09:45:29.562Z"
}
