{
  "title": "Naval Chief attends 25th int’l Seapower Symposium-2023 at US",
  "link": "https://www.app.com.pk/national/naval-chief-attends-25th-intl-seapower-symposium-2023-at-us/",
  "date_published": "2023-09-22T12:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 22 (APP): Chief of the Naval Staff, Admiral Muhammad Amjad Khan Niazi has attended 25th International Seapower Symposium-2023 (ISS-25) held at US Naval War College Newport, Rhode Island during official visit to the United States of America (USA).\nThe event involved panel discussions on issues related to common maritime challenges and opportunities to enhance international maritime security cooperation.\nA large number of Heads of World Navies or their senior representatives attended ISS-25, a Pakistan Navy news release said on Friday.\nDuring ISS, bilateral meetings and interactions of the Chief of the Naval Staff with senior International Naval dignitaries including Chief of Staff Spanish Navy, Naval Chiefs of Azerbaijan, Egypt, Netherlands, Saudi Arabia, Secretary of the US Navy (SECNAV) and Chief of Naval Operations (CNO) of US Navy were held to discuss matters of mutual interest.\nDuring the interactions, Admiral Muhammad Amjad Khan Niazi briefed the participants on Maritime Perspective of Pakistan with special focus on PN contributions to regional maritime security.\nThe admiral highlighted the challenges to Indian Ocean security and mentioned Pakistan Navy’s initiative of Regional Maritime Security Patrol (RMSP) which was aimed to shoulder international obligations for safe and secure maritime environment in the region.\nThe purpose of International Seapower Symposium is to provide a forum for senior international naval leaders to discuss common maritime challenges and opportunities to enhance international maritime security cooperation.\nDiscussions at ISS would further strengthen the efforts to enhance cooperation in countering piracy, providing disaster relief & humanitarian assistance, coordinating search & rescue at sea including submarine rescue, planning & conducting coalition military operations and joint law enforcement to counter arms, drugs and human trafficking as well as fisheries and pollution violations.\nThe participation of the Pakistan Naval Chief in 25th International Seapower Symposium-2023 reflects Pakistan’s commitment for regional peace and is a manifestation of PN contribution towards regional maritime security through a collaborative approach.\nConcurrent to Symposium activities, Chief of the Naval Staff also met Commander Pacific Fleet, Commander U.S. Naval Forces Central Command (NAVCENT) and Commander US Coast Guard wherein matters pertaining to maritime security were discussed.",
  "retrievedAt": "2025-08-11T09:45:37.720Z"
}
