{
  "title": "Govt focused on strengthening capital market to bolster economy: Gohar Ejaz",
  "link": "https://www.app.com.pk/national/govt-focused-on-strengthening-capital-market-to-bolster-economy-gohar-ejaz-2/",
  "date_published": "2023-09-22T16:02:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 22 (APP):Caretaker Federal Minister for Commerce, Industries and Production, Dr Gohar Ejaz, on Friday, said that the government was focused and keen to strengthen the capital markets with the aim of bolstering the economy.\nThe minister reiterated the commitment while chairing a meeting of board of directors of Pakistan Stock Exchange during his visit to the PSX Karachi. PSX directors including Javed Kureishi, Ahmed Chinoy and Nadeem Naqvi; securities brokers and capital market representatives were present at the occasion.\nDr Gohar Ejaz said that the caretaker government was taking comprehensive and integrated measures in different sectors of the economy which would lead to stabilise and strengthen the national economy.\nMD and CEO PSX, Farrukh Khan, gave an overview of the capital market through the digital online platform and briefed about the potential for growth of the capital market, market capitalization to GDP ratio and other relevant matters and also presented suggestions for enhancing its role to benefit the economy.\nHe said that at present PSX capitalization to GDP ratio was one of the lowest in the region and that the market needed the support of the government along with the able guidance of the SECP to augment the market in this respect.\nHe termed minister’s visit and meeting with capital market stakeholders as a sign of encouragement for the capital market participants and entities including leading brokerage houses and market fraternity.\nOther market participants including securities brokers and capital market representatives apprised the minister on the challenges faced in the path to realization of full potential and growth of the capital market.\nThe Minister keenly listened to all the participants and informed them that government had sector specific plans to address the issues and boost the economy through the capital market.\nLater, PSX Board members presented a memento to caretaker Federal Minister for Commerce, Industries and Production, Dr. Gohar Ejaz.",
  "retrievedAt": "2025-08-11T09:45:29.551Z"
}
