{
  "title": "Imran Khan in pain as nothing illegal in leaked audio: Marriyum",
  "link": "https://www.app.com.pk/national/imran-khan-in-pain-as-nothing-illegal-in-leaked-audio-marriyum/",
  "date_published": "2022-09-25T16:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Sunday said that nothing illegal was in the (purported) leaked audio from the Prime Minister’s Office which made Imran Khan angry and caused him pain.\n“Imran Khan has gone mad as he finds nothing illegal in the leaked audio,” she said, adding his speech at a public gathering in Karak, Khyber Pakhtunkhwa was akin to a “shameless act”.\nReacting to Imran Khan’s speech, she said the purported audio was “a proof that no illegal act was done nor was any undue benefit given to anyone.”\nShe said the power plant was imported from India in accordance with law and the policy approved by the Imran-led government. Imran Khan should better go through from the decision given by Multan Bench of the High Court on July 18, 2020 about installation of a grid station for a housing society.\nMarriyum said Imran Khan, who traded off the country’s freedom, independence and economy against the foreign funding , was now raging with pain and anger as nothing illegal found in the audio leak. The person who received funding from Romita Shetty and Inder Dosanjh, was now crying out of the pain caused by uselessness of the audio leak.\nShe said Imran Khan was angry that he did not find PM Shehbaz Sharif involved in changing any policy, nor asking for land or 5 carat diamond. The Pakistan Tehreek-e-Insaf (PTI) chief was angry and in pain as there was no mention of his wife Bushra Bibi and 5 carat diamond in the leaked audio.\nThe person (Imran), who caught red-handed in spending charity for political and personal use, had every right to make hue and cry over a audio leak which did not prove any illegal conduct, she said while accusing Imran Khan of changing government’s policies for a five carat diamond.\nShe regretted that such a person (Imran Khan), who changed the government’s policy for 458 kanal land, was now hurling accusations on others.\nThe minister said Imran Khan, who changed rules of Tosha Khana for earning profit from three watches worth millions of rupee, should better introspect instead of accusing others of misconduct.\n“No anti-Pakistan conspiracy found in this audio as it was revealed in the leaked conversation of former finance minister Shaukat Tarin with the provincial ministers of the PTI governments,” she maintained.",
  "retrievedAt": "2025-08-11T15:37:55.338Z"
}
