{
  "title": "UN Sec. Gen to arrange donors’ conference soon: PM",
  "link": "https://www.app.com.pk/national/un-sec-gen-to-arrange-donors-conference-soon-pm/",
  "date_published": "2022-09-25T04:59:00.000Z",
  "source": "APP",
  "content": "LONDON, Sep 25 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday said that United Nations Secretary General Antonio Guterres had assured that they would be soon arranging a donors’ conference for the rehabilitation of the flood affected people of Pakistan.\nThe prime minister chaired a meeting via videolink to review relief and rehabilitation activities in the flood hit areas of the country.\nThe meeting was attended by federal ministers and the relevant authorities, PM Office Media Wing said in a press release.\nDuring the meeting, the prime minister said that he had held important meetings with United Nations Secretary General Antonio Guterres and other world leaders in which he apprised them of the devastation caused by floods in Pakistan and the government’s efforts at provision of relief and rehabilitation of the flood affectees.\nHe also mentioned his telephonic conversation with Saudi Crown Prince Muhammad bin Salman bin Abdulaziz al Saud.\nThe prime minister said that he also apprised the world leadership of Pakistan’s viewpoint over the climatic changes and the destruction it brought upon the country.\nThey had expressed their deep sympathies and offered condolences over the losses in Pakistan and assured that they would fully support the country with sincerity, he added.\nHe said that during his meeting with Bill Gates, Chairman of Bill and Malenda Gates Foundation, they discussed seeking of help from  World Food Programme for the supply of infants and children’s food in the flood affected areas.\nThe prime minister expressed the confidence that with the international community’s help and with the efforts of the national institutions, they would soon be out of the difficulties.\nRelevant authorities of the National Flood Response Coordination Center gave a briefing to the prime minister about the relief and rehabilitation work in the flood affected areas.",
  "retrievedAt": "2025-08-11T15:37:57.997Z"
}
