{
  "title": "Pakistan announces 100 scholarships for Bangladeshi students at OIC-COMSTECH Vice Chancellors’ Forum",
  "author": null,
  "content": "ISLAMABAD, Jun 19 (APP):In a major step to strengthen academic ties, Pakistan has announced 100 fully-funded scholarships for Bangladeshi students to pursue higher education in leading Pakistani universities.\nThe announcement was reiterated during the Special Vice Chancellors’ Forum for Bangladesh, hosted by OIC-COMSTECH at its Secretariat.\nThe forum brought together a seven-member delegation from Bangladesh comprising Vice Chancellors and senior representatives of prominent universities, along with Vice Chancellors from 15 top Pakistani universities, which are part of the COMSTECH Consortium of Excellence (CCoE).\nCoordinator General of OIC-COMSTECH, Prof. Dr. M. Iqbal Choudhary welcomed the visiting delegates and underscored the visit as a significant move toward deepening academic and scientific cooperation between two founding member countries of COMSTECH. He announced the offering of 100 scholarships for Bangladeshi students as a gesture of academic solidarity.\nSpeaking on the occasion, High Commissioner of Bangladesh to Pakistan, Md. Iqbal Hussain Khan lauded COMSTECH’s initiative for facilitating meaningful academic engagement between higher education institutions of the two countries. He emphasized the importance of partnerships in science, technology, and education for shared progress.\nDuring interactive sessions, Vice Chancellors from both sides explored avenues for collaboration, including student and faculty exchanges, joint research ventures, scholarship schemes, and the use of shared academic resources. It was agreed that each university would designate a focal person to ensure continued communication and follow-up on agreed initiatives.\nThe forum featured notable presentations, including a talk by Chancellor of Sir Syed CASE Institute of Technology, Prof. Dr. Shoab A. Khan on the evolution of Artificial Intelligence in Pakistan, and insights by Chairperson of the Private Education Institutions Regulatory Authority, Prof. Dr. Shoab A. Khan on enhancing university rankings.\nThe Bangladeshi delegation, visiting from June 16 to 21, also held meetings with major universities in Islamabad, Lahore, and Murree.\nThe delegates appreciated the warm hospitality and termed their visit as historic, productive, and a promising beginning for sustained academic collaboration between Bangladesh and Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:16:07.338Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-announces-100-scholarships-for-bangladeshi-students-at-oic-comstech-vice-chancellors-forum/",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T10:33:00.000Z"
}
