{
  "title": "KS relief concludes series of Eye Treatment Camps across Pakistan under Noor Saudi Initiative",
  "author": null,
  "content": "ISLAMABAD, Jun 19 (APP):The King Salman Humanitarian Aid and Relief Centre (KSrelief) has successfully wrapped up a series of eleven comprehensive eye care camps conducted throughout Pakistan under the umbrella of the Noor Saudi Volunteer Program 2025.\nIn collaboration with Al-Basar International Foundation and Al-Ibrahim Eye Hospital in Karachi, this initiative aimed to bring essential ophthalmic services to underserved communities, especially those facing financial hardship or living in areas with limited access to specialized medical care, said in a press release issued here on Thursday.\nThe eye camps were strategically organized across various regions, including urban and remote areas of Sindh, Balochistan, Punjab, and Azad Jammu & Kashmir. Designed to proactively identify and treat preventable eye conditions, the outreach program focused on early diagnosis, surgical intervention, and vision restoration to improve health outcomes and quality of life.\nDuring the implementation of the project, a total of 43,294 patients underwent eye examinations, with more than 4,484 surgeries carried out to address cataracts and other vision-impairing conditions. Furthermore, 11,050 corrective eyeglasses were distributed, along with essential medications prescribed on-site by professional medical staff.\nThe initiative had a meaningful impact across a wide geographic area, delivering sight-saving services to communities in Karachi, Matli, Kundairo, Shikarpur, Hyderabad, Naseerabad, Kharan, Khuzdar, Jhelum, and Rawalakot. These locations were specifically chosen to maximize reach and benefit residents with little to no access to ophthalmologic care.\nThis humanitarian project underscores the Kingdom of Saudi Arabia’s unwavering support for global health efforts and its ongoing commitment to combat preventable blindness. By extending free, high-quality eye care to thousands of individuals, KSrelief continues to champion the cause of vision health and offer renewed hope to those most in need.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:15:40.979Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ks-relief-concludes-series-of-eye-treatment-camps-across-pakistan-under-noor-saudi-initiative/",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T12:56:00.000Z"
}
