{
  "title": "PM calls for modernization, zero tolerance on fake medicines",
  "author": null,
  "content": "ISLAMABAD, Jun 19 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday directed the deployment of advanced technology to eliminate the illegal trade of medicines amid a zero-tolerance policy and called for stringent oversight mechanisms.\nThe prime minister chaired a high-level meeting on national health affairs, where he lauded the Ministry of National Health Services for its proactive approach under the leadership of Federal Minister Syed Mustafa Kamal, a Prime Minister’s Office news release said.\nThe prime minister reiterated the government’s unwavering commitment to delivering quality healthcare to citizens across Pakistan.\nIn the meeting, PM Shehbaz Sharif emphasized that providing the best possible healthcare facilities to the people remains the government’s top priority.\nHe directed the formulation of a collaborative roadmap involving welfare organizations and the private sector to improve health services in Islamabad.\nHighlighting the importance of international standards, PM Shehbaz encouraged Pakistani pharmaceutical companies to seek accreditation from the World Health Organization (WHO), stating it would not only enhance the quality of local medicines but also open doors to export opportunities.\nPM Shehbaz also underscored that there can be no compromise on the quality of medical education” and directed third-party validation of all medical colleges in Pakistan. He further instructed for a comprehensive review of the nursing sector to strengthen its capacity and service delivery.\nHe firmly stated that no political interference would be tolerated in the implementation of health reforms, ensuring a merit-based and transparent approach across the board.\nDuring the briefing, officials informed the Prime Minister that the entire process for registering medicines and medical devices is being fully digitized and will be completed by the end of next month. Moreover, the registration timeline is being reduced from one year to just three months.\nThey added that efforts are also underway to operationalize newly established Basic Health Units, Regional Blood Centers, and the Isolation Hospital and Infectious Treatment Center (IHITC) in Islamabad with the support of philanthropists.\nThe meeting was attended by Federal Ministers Dr. Ahsan Iqbal (Planning & Development), Syed Mustafa Kamal (National Health), Ahad Khan Cheema (Economic Affairs), Minister of State for Health Dr. Mukhtar Ahmad Bharath, and senior officials from relevant institutions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:14:31.674Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-calls-for-modernization-zero-tolerance-on-fake-medicines/",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T17:20:00.000Z"
}
