{
  "title": "Parliamentarians call for relief measures in Budget, stress unity among Muslim Nations",
  "author": null,
  "content": "ISLAMABAD, Jun 19 (APP):Members of Parliament have urged the government to provide maximum relief to the common man in the current budget.\nTalking to mediapersons outside the Parliament House, they emphasized the need for greater focus on the agriculture and industrial sectors to strengthen the economy and generate employment.\nSenator Shahadat Awan said that the Pakistan Peoples Party (PPP) has always prioritized increasing wages for laborers and improving their working conditions. He also highlighted the need to enhance taxation on the tobacco sector, pointing out that tax evasion in this area remains a serious concern and must be urgently addressed.\nAwan further stated that the PPP is in talks with the government to review the proposed increases in salaries and pensions, stressing the importance of aligning them with the inflation rate. “Government employees are facing serious financial difficulties due to rising prices,” he added.\nMNA Ali Musa Gilani called for unity among Muslim countries, stressing that it is the need of the hour for the Muslim world to come together and play an active role in stopping the ongoing Iran-Israel conflict. “Pakistan has always played a constructive role in promoting peace, stability, and development in the region,” he said.\nMNA Shahida Akhtar Ali of JUI-F stated that her party intends to propose amendments to the finance bill to provide relief to the masses. She also appreciated the recent meeting between Pakistan’s Chief of Army Staff General Asim Munir and former U.S. President Donald Trump, calling it a positive development in international relations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:13:18.456Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/parliamentarians-call-for-relief-measures-in-budget-stress-unity-among-muslim-nations/",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T09:48:00.000Z"
}
