{
  "title": "President visits Naval Headquarters, lauds impregnable defence of navy during Marka-e-Haq",
  "author": null,
  "content": "ISLAMABAD, Jun 19 (APP):President Asif Ali Zardari Thursday lauded Pakistan Navy’s resolute response, unwavering determination, and successful efforts in thwarting the hostile designs of Indian Navy.\nAccording to a press release of Pakistan Navy, he made these remarks during a visit to Naval Headquarters in Islamabad.\nUpon arrival, the President was warmly received by Chief of the Naval Staff, Admiral Naveed Ashraf, and was presented a Guard of Honour by a smartly turned-out naval contingent. The President also laid a floral wreath at the Shuhada Monument and was later introduced to the Principal Staff Officers at Naval Headquarters.\nThe President held a meeting with the Chief of the Naval Staff.\nDuring the meeting, Naval Chief apprised the President on matters pertaining to regional maritime security and operational readiness of Pakistan Navy. Later, the President was given a detailed briefing on Pakistan Navy’s strategy to ensure impregnable deterrence demonstrated during MARKA-E-HAQ.\nThe President expressed deep satisfaction over Pakistan Navy’s high level of operational preparedness and felicitated it on successfully defending the maritime frontiers of the motherland against Indian aggression. He reiterated the nation’s profound pride in its armed forces and expressed full confidence in their capabilities.\nThe President further assured the government’s full support for the capacity building of the Navy to meet evolving challenges in the maritime domain.\nChief of the Naval Staff, Admiral Naveed Ashraf, thanked the President for his visit. He also assured that Pakistan Navy, with the help of Allah (SWT), will continue to defend the country’s sea frontiers and maritime interests, both in peace and war.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:13:23.885Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-visits-naval-headquarters-lauds-impregnable-defence-of-navy-during-marka-e-haq/",
  "dateList": "2025-06-19",
  "date_published": "2025-06-19T18:40:00.000Z"
}
