{
  "title": "Questions raised on India’s secularism due to India’s new Citizenship law: Ex-Ambassador Riaz H. Khokhar",
  "link": "https://www.app.com.pk/national/questions-raised-on-indias-secularism-due-to-indias-new-citizenship-law-ex-ambassador-riaz-h-khokhar/",
  "date_published": "2020-01-28T22:24:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 29 (APP):Former Pakistan’s Ambassador to India, Riaz Hussain Khokhar on Wednesday said that the India’s secularism is questioned due to India’s new Citizenship law.\nHe was speaking at the Kashmir Conference : The Way Forward organised by\nthe Pakistan Institute of International Affairs (PIIA).\nRiaz Hussain Khokar said that war is not solution of any dispute, especially\nthe war between India and Pakistan and we need to create awareness among the masses about its demerits.\nHe said that we need a strategy for media to show the world the real  picture of the Kashmir case. Now today what we are watching it is the real India, he noted.\nEarlier in her welcome address, Chairperson PIIA, Dr. Masuma Hasan said\nafter the August 5, 2019 action of the Indian government with respect to the revocation of Articles 370 and 35A of the Indian Constitution and the subsequent formal but illegal integration of Indian occupied Kashmir with the Indian Union on October 31 2019, there was a spate of meetings and seminars on this crisis throughout the country.\nShe said that this conference is our attempt to make a contribution both to analysing the impact of India’s action on the region and the prospects for peace and to keeping the Kashmir issue alive and in the public sphere.\nShe said that Genocide Watch has confirmed that India’s actions in Kashmir fulfill all their ten stages towards genocide. The watchdog has issued a Genocide Alert for India administered Kashmir and called upon the United Nations and its members to warn India to refrain from committing genocide in Kashmir, she added.\nDr. Masuma said that Kashmir is not really a territorial dispute between Pakistan and India as is often, wrongly stated by some analysts. It is a matter of the expression of free will by the people of Kashmir, their right to decide their own future, she said.\nLater, she read out the speech of President Azad Jammu and Kashmir,Sardar Masood Khan.\nIn his speech, Sardar Masood said the Indian Occupied Jammu and Kashmir (IOJK) has been under lockdown and communication blockade for the past 179 days.\nSome 900,000 Indian forces invaded and laid siege to the territory on August 5, 2019 and have been brutalising its people with impunity ever since.\nHe said that the BJP-RSS regime have robbed Kashmiris of their rights to\npermanent residence, acquisition of property, education and employment; and have made elaborate vicious plans to grab Kashmiris’ land by settling Hindus from India in IOJ&K.\nHe said that for some 80,000 families living on this side of the LOC in\nAzad Kashmir, 2019 has been the worst year with 60 killed and 300 badly injured or disabled. Ceasefire violations by India continue, he added.\nSardar Masood said that in the aftermath of August 5, 2019, Azad Kashmir\nand Pakistan rose to defend the rights of the besieged people of Jammu and Kashmir.\nThe diaspora community, now numbering 10 million, helped us to make Kashmiris’ right to self-determination a truly international movement, he added.\nHe said that Pakistan, with the help of China, was able to mobilise the\nUN Security Council to hold two informal meetings on Kashmir after a passage of 50 years, This time around, even Indian civilian society called on the BJP-RSS regime and stood up for Kashmiris.\nSardar Masood suggested that the doors that have opened in the\ninternational forums, international community and international civil society should not be closed ever.\nHe advised to fully involve the United Nations and other multilateral\nfora to exert pressure on India.\nHe was of the view that the international media has crafted a true,\ngenuine and authentic narrative on Kashmir exposing Indian’s falsehoods and fabrications.\nHe suggested that Kashmiri and Pakistan mediapersons and communicators\nshould interface with the international media networks, both new and traditional, to shine a light on Indian atrocities and its illegal steps to alter demographic composition of the IOK, in clear violation of the Fourth Geneva Convention, establishment of illegal settlements, mass killings, blindings, torture, enforced disappearances and denial of rights to information and health.\nHe also called for making appeals to the world to stress that the most\nurgent task is to stop impending carnage and genocide in IOJ&K, justifying immediate intercession.\nReading out appeal on behalf of Sardar Masood, Dr. Masuma said the\naudience attending the conference to consider Jammu and Kashmir to be part of Pakistan, which was forcibly removed from the body politic of Pakistan through manoeuvres, massacres and aggression in October 1947.",
  "retrievedAt": "2025-08-11T18:42:54.340Z"
}
