{
  "title": "6 PSEs’ privatization likely to generate Rs 150 bln: Soomro",
  "link": "https://www.app.com.pk/national/somroo-expects-rs-150-billion-revenue-from-privatization-of-pses/",
  "date_published": "2020-01-29T02:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 29 (APP):Federal Minister for Privatization Muhammadmian Somroo Wednesday said the government was expecting to earn Rs 150 billion non tax revenue from the privatization of six loss making public sector entities (PSEs) by June 30.\nThe privatization process had been initiated again after a lapse of 10 years and initially six PSEs, including Sind Engineering, SME Bank, Guddu Power Plant, Pakistan Steel Mill, First Women Bank Limited and Jinnah Convention Centre would be sold out by the end of ongoing financial year, he said while addressing a press conference here along with Special Assistant to the Prime Minister Dr Firdous Ashiq Awan and Secretary Privatization Commission Rizwan Malik.\nSomroo said all the targeted privatization transactions would be completed within the stipulated time. The world’s renowned companies, including those from Japan, Thailand, Korea and Malaysia, were participating in the privatization process, which showed restoration of their confidence in the government’s policies for investment in the country, he added.\nThe minister said the government also intended to sell out around 27 public real-estate properties which would be put for auction within two months.\nHe said initially, the government had opted to privatize those state-owned entities, which were running in loss. The Pakistan Steal Mills was on top of the list, for which a financial advisor had already been hired, he added.\nSimilarly, the SME Bank, Guddu Power Plant, and Sind Engineering were also making losses, and they would be privatized through a transparent process, he added.\nSomroo said in the second phase, the government would focus on those entities, which had the ability to earn but due to some reasons were not generating income. They would be restructured through public-private partnership,.\nSecretary Privatization Commission Rizwan Malik said the government had planned to privatize six PSEs in the first phase while 10 more would be put on sale in the next one. The companies from across the world, including the European Union, the Middle East, Japan and South Korea, had shown their interest in Pakistan’s privatization process, he added.",
  "retrievedAt": "2025-08-11T18:42:46.120Z"
}
