{
  "title": "PTI reforms agenda to improve functioning of public departments: minister",
  "link": "https://www.app.com.pk/national/pti-reforms-agenda-to-improve-functioning-of-public-departments-minister/",
  "date_published": "2020-01-29T01:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 29 (APP):Minister of State for Parliamentary Affairs Ali Muhammad Khan on Wednesday said Pakistan Tehreek-e-Insaf government’s reforms agenda would further improve the organizational capacity of public sector departments.\nTalking to a private news channel, he said reformation of institutions is a continuous process and parliament has made some significant legislation to improve functioning of existing institutions.\nThe Minister said the PTI led government would not back away from its reforms agenda as it was for Pakistan’s development and progress.\nReplying a Question, he said it is high time to make the required amendments in election commission, keeping in view the reservations of opposition, he added.\nOrganizing transparent election is the core responsibility and ultimate objective of the election commission, he said adding, the possible amendments in election commission would be made after detailed discussion in parliament.\nThe incumbent government is committed to conduct local body election in time, he mentioned.\nAli Muhammad said every decision would be made after consultation of all political parties.\nTalking about Kashmir issue, he said it is diplomatic victory of Pakistan that the world is now taking notice of Indian atrocities in Indian occupied Kashmir.\nInternational community has started realizing that Kashmir is a flash point between two nuclear states and resolution of Kashmir issue is in the best interest of the world, he added.\nModi has committed a blunder by revoking special status of Kashmir, he said.\nThe minorities within India are not feeling safe under the leadership of an extremist leader Modi, he commented.",
  "retrievedAt": "2025-08-11T18:42:48.056Z"
}
