{
  "article_id": "2025-10-08_b38f2e1331dfcb5820b0b4733b7a85c0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/misbah-khar-meets-philippine-envoy-to-broaden-bilateral-cooperation-through-parliamentary-diplomacy/",
    "retrieved_at": "2025-10-11T23:59:17.887Z"
  },
  "metadata": {
    "title": "Misbah Khar meets Philippine envoy to broaden bilateral cooperation through parliamentary diplomacy",
    "author": null,
    "date_published": "2025-10-08T14:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 260,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 08 (APP):Ambassador Misbah Khar, Special Envoy for the Inter-Parliamentary Speakers' Conference (ISC), on Wednesday called on Dr. Emmanuel R. Fernandez, Ambassador of the Republic of the Philippines, at the Embassy of the Philippines in Islamabad to discuss potential areas of collaboration in connection with the upcoming ISC. Ambassador Khar briefed the Ambassador on the scope and objectives of the ISC, highlighting its role as an emerging platform that brings together parliamentary leaders to deliberate on global challenges and promote shared principles of peace, prosperity, and inclusive governance, said a news release. She underscored that the longstanding friendship between Pakistan and the Philippines provides a strong foundation for enhanced parliamentary cooperation and policy exchange in fields such as institutional development, social progress, and economic stability. She apprised that the Chairman Senate, Syed Yousaf Raza Gilani, has been unanimously chosen as the founding President of the ISC, a recognition of Pakistan's commitment to fostering dialogue and understanding among nations through parliamentary channels. Ambassador Fernandez welcomed the initiative and appreciated Pakistan's proactive approach in establishing the ISC as a timely and forward-looking effort to connect legislative institutions across regions. He assured Pakistan of the Philippines' constructive participation, noting that both nations share aspirations for sustainable peace and regional development. Khar conveyed Pakistan's gratitude for the Philippines' continued cooperation at multilateral forums and expressed hope that its participation in the ISC would bring valuable perspectives from the ASEAN region. The meeting concluded with a reaffirmation of mutual goodwill and a commitment to strengthen bilateral relations through active engagement under the ISC framework.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}