{
  "article_id": "2025-10-08_c02fdeabcf4b990901668dcb54491a29",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-calls-pakistan-saudi-defence-pact-symbol-of-brotherhood-urges-joint-efforts-for-global-strength/",
    "retrieved_at": "2025-10-11T23:57:39.333Z"
  },
  "metadata": {
    "title": "PM Shehbaz calls Pakistan-Saudi Defence Pact symbol of brotherhood, urges joint efforts for global strength",
    "author": null,
    "date_published": "2025-10-08T19:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 447,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 08 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday said the Pakistan-Saudi Arabia defence cooperation agreement is rooted in brotherhood and mutual trust, emphasizing that both nations, by working together, can secure a stronger position in the global community. He was addressing a luncheon held here at the Prime Minister's House in honour of the visiting Saudi delegation led by Prince Mansour bin Mohammad bin Saad Al Saud, Chairman of the Saudi-Pakistan Joint Business Council. Deputy Prime Minister and Foreign Minister Senator Ishaq Dar, federal ministers, senior officials, and prominent business figures attended the event. Prime Minister Shehbaz Sharif warmly welcomed Prince Mansour, saying it was a pleasure to see him again, noting that \"we are gathered here today as one family.\" He recalled his long-standing relationship with Saudi Arabia, sharing that he first visited the Kingdom in the 1960s and had since witnessed its remarkable progress. He described his recent visit to Riyadh as \"unique and unforgettable,\" lauding the warm hospitality extended by Crown Prince Mohammed bin Salman and the Saudi people. \"The Saudi leadership and people have always stood by Pakistan through every trial and difficulty,\" he said, reaffirming that every Muslim is ready to sacrifice for the sanctity of the holy sites. The prime minister underlined that the Pakistan-Saudi defence pact formalizes a relationship founded on deep fraternity. \"We are true brothers, and a brother always stands by his brother. We will always remain protectors of the holy cities of Makkah and Madinah,\" he declared. Highlighting the growing scope of bilateral cooperation, the prime minister said both countries are determined to enhance ties based on trade, investment, research, and innovation. \"This is a time of golden opportunities. Together, we can transform our shared business vision into reality,\" he said. The prime minister praised Crown Prince Mohammed bin Salman's dynamic and visionary leadership, crediting it for transforming Saudi society. \"Time and circumstances wait for no one. We must prepare ourselves for new challenges and opportunities. With cooperation and unity, we can establish a firm place in the global community,\" he added. The prime minister expressed confidence that Pakistan has a capable team ready to implement the agreed initiatives, while Saudi officials are equally enthusiastic about moving forward with new agreements. Prince Mansour bin Mohammad bin Saad Al Saud, in his remarks, said that he had met senior Saudi ministers before arriving in Pakistan to brief them on potential strategic projects. He said the Saudi business community was keen to invest in Pakistan and appreciated Prime Minister Shehbaz Sharif's focus on expanding cooperation in key sectors. He reaffirmed that the Saudi side shared Pakistan's priorities and would work closely to realize mutually beneficial goals.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}