{
  "article_id": "2025-10-08_bc0ac9c84011e45271419c29c464414e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/five-buildings-sealed-five-detained-for-violating-dengue-sops-in-ict/",
    "retrieved_at": "2025-10-11T23:57:18.255Z"
  },
  "metadata": {
    "title": "Five buildings sealed, five detained for violating dengue SOPs in ICT",
    "author": null,
    "date_published": "2025-10-08T20:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 279,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 8 (APP):Assistant Commissioner (AC) Nilore on Wednesday sealed five buildings and detained five individuals during an operation against violations of dengue prevention Standard Operating Procedures (SPOs). The district administration urged citizens to follow safety guidelines to control the spread of dengue in Islamabad. In line with the district administration's ongoing anti-dengue campaign, AC Nilore conducted inspections across various areas to ensure compliance with dengue prevention protocols. During the operation, several sites were found violating the standard operating procedures (SOPs) set by health authorities. The AC sealed five buildings where stagnant water and poor sanitation were detected, creating breeding grounds for mosquitoes. Five people were taken into custody for negligence and failure to implement required preventive measures. Legal action has been initiated against those found responsible under public health and municipal laws. The AC emphasized that regular inspections will continue to ensure full compliance with dengue prevention guidelines. He directed teams to intensify field monitoring, particularly in residential and under-construction sites, to prevent mosquito breeding. The district administration has urged citizens, building owners, and contractors to cooperate by eliminating stagnant water, covering water containers, and maintaining cleanliness around their premises. Officials stated that public cooperation is essential for controlling dengue and safeguarding community health. Awareness teams have also been deployed to educate residents about precautionary steps, including proper waste disposal and use of mosquito repellents. The administration warned that strict action will be taken against individuals or institutions found violating dengue SOPs in the future. The district authorities reiterated their commitment to implementing a zero-tolerance policy against negligence and called on citizens to report potential dengue breeding sites to the nearest control office or helpline for immediate response.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}