{
  "article_id": "2025-10-08_d08c8d887728192c13a8b8f617763fbd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/speaker-ayaz-sadiq-pays-tribute-to-martyrs-of-orakzai-operation-against-fitna-al-khawarij-terrorists/",
    "retrieved_at": "2025-10-11T23:59:38.416Z"
  },
  "metadata": {
    "title": "Speaker Ayaz Sadiq pays tribute to martyrs of Orakzai operation against Fitna al-Khawarij terrorists",
    "author": null,
    "date_published": "2025-10-08T13:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 210,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 08 (APP):Speaker of the National Assembly Sardar Ayaz Sadiq on Wednesday expressed deep admiration for the Pakistan Armed Forces and security agencies for their successful operation in Orakzai, which eliminated 19 Fitna al-Khawarij terrorists. He also paid heartfelt tribute to the eleven soldiers, including Lieutenant Colonel Junaid Arif and Major Tayyab Rahat, who laid down their lives in the operation. \"Lieutenant Colonel Junaid Arif set a shining example of leading from the front - a tradition that defines the Pakistan Army,\" the Speaker said, honoring the bravery and sacrifice of the martyrs. Sardar Ayaz Sadiq reaffirmed Pakistan's resolve to completely eliminate the threat of terrorism, stating: \"The sacrifices of our armed forces and security personnel in the war against terrorism will never go in vain. Terrorist elements will never succeed in fulfilling their nefarious designs.\" The NA Speaker expressed deep condolences to the families of the martyrs and assured them of the nation's solidarity. \"May Allah elevate the ranks of our martyrs and grant patience and fortitude to their grieving families,\" he prayed. He also stressed the unity and gratitude of the nation: \"The entire nation salutes the sacrifices of our armed forces. Their courage in the face of terrorism is the foundation of Pakistan's peace and security.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}