{
  "article_id": "2025-10-08_943c8b9f05cf43511a84ace77ca6a96e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-lauds-negotiations-body-assures-to-address-ajk-peoples-concerns/",
    "retrieved_at": "2025-10-11T23:59:22.092Z"
  },
  "metadata": {
    "title": "PM lauds negotiations body’s efforts; assures to address AJK people’s concerns",
    "author": null,
    "date_published": "2025-10-08T12:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 216,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 8 (APP): Prime Minister Shehbaz Sharif on Wednesday appreciating the amicable resolution of the situation in Azad Kashmir, assured that all-out steps would be taken to address the concerns of the Kashmiri people. The prime minister, in a meeting with members of the government's negotiating committee following the successful conclusion of the negotiation process in Azad Kashmir, appreciated their efforts for resolving the matter amicably. The meeting was attended by federal ministers Ahsan Iqbal, Muhammad Aurangzeb, Sardar Muhammad Yusuf, Dr. Tariq Fazal Chaudhry, and Ahad Khan Cheema, Adviser to PM Rana Sanaullah, Chairman of PM Youth Program Rana Mashhood Ahmad Khan, Raja Pervaiz Ashraf and Qamar Zaman Kaira. The prime minister also praised the Joint Action Committee for showing understanding and support for Kashmir's development and prosperity. \"The government will continue to serve the Kashmiri people and take steps to resolve their issues as public welfare and peace are our priorities. We have always been protecting the rights of our Kashmiri brothers and sisters and will continue to do so,\" he added. The prime minister said that his government has always focused on issues of Azad Kashmir, consistently addressed them on a priority basis, and would also continue to take steps for development and prosperity of the Kashmiri people in line with their aspirations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}