{
  "article_id": "2025-10-08_9bb3a1db1eda46fef5851d8e2d06b153",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/national-resilience-day-being-observed-with-renewed-commitment-to-disaster-preparedness/",
    "retrieved_at": "2025-10-11T23:59:23.625Z"
  },
  "metadata": {
    "title": "National Resilience Day being observed with renewed commitment to disaster preparedness",
    "author": null,
    "date_published": "2025-10-08T14:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 498,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 08 (APP):National Resilience Day is being observed across Pakistan on Wednesday to honor the victims of the 2005 earthquake, reaffirming the nation's commitment to strengthening disaster management and emergency response capabilities. The 7.6 magnitude 2005 earthquake claimed thousands of lives and caused extensive damage to infrastructure, particularly in Azad Kashmir and Khyber Pakhtunkhwa. In response, various events are being organized across the country, including in Azad Jammu and Kashmir, to express solidarity and offer heartfelt sympathies to the victims of this devastating calamity. A central ceremony was held at the National Disaster Management Authority (NDMA) headquarters to commemorate National Resilience Day. While speaking as the chief guest at the National Disaster Management Authority's event marking National Resilience Day, Minister for Science and Technology Khalid Hussain Magsi highlighted the crucial importance of active community engagement in strengthening disaster management efforts. He emphasized that local communities should play a pivotal role in ensuring timely and effective delivery of aid to disaster-affected populations. He emphasized the importance of leveraging modern technology to reduce the impact of disasters and to issue timely early warnings to vulnerable regions. He added that embracing the spirit of shared responsibility is the most effective path forward. National Disaster Management Authority (NDMA), Chairman Lieutenant General Inam Haider Malik, said that the country's early warning system now meets international standards. He also revealed plans to establish a National Resource Network aimed at enhancing Pakistan's ability to respond to natural and man-made disasters. He emphasised that October 8 stands as a solemn reminder of the 2005 earthquake and other natural calamities, calling for sustained efforts to enhance national resilience and bolster disaster preparedness. The NDMA Chairman emphasized that the day serves to showcase the nation's resilience and preparedness in facing disasters. He noted that lessons learned from events spanning 2005 to 2025 continue to shape and strengthen national strategies. The NDMA Chairman commended the people of Pakistan for consistently demonstrating unity and an unwavering spirit of support during every disaster, affirming the nation's resilience. He also paid heartfelt tribute to all volunteers and institutions for their unwavering dedication and service. The NDMA Chairman commended the people of Pakistan for consistently demonstrating unity and an unwavering spirit of support during every disaster, affirming the nation's resilience. The NDMA Chairman affirmed that the authority maintains close coordination with federal and provincial institutions, the armed forces, and international organizations to ensure a unified approach to disaster management. Pakistan is in the process of establishing a National Resource Network aimed at enhancing the country's disaster preparedness and response capabilities. He also underscored the importance of sharing experiences and knowledge to strengthen collective resilience and improve disaster response strategies. The NDMA Chairman extended heartfelt gratitude to the Pakistan Armed Forces, welfare organizations, and volunteers for their invaluable contributions. The ceremony drew participation from ministers, diplomats, experts, and individuals from diverse backgrounds. National Resilience Day stands as a powerful symbol of Pakistan's unwavering commitment to building a stronger, safer, and more resilient nation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}