{
  "article_id": "2025-10-08_e40319369072035af48927dd93b198df",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ecp-directs-punjab-to-conduct-lg-elections-in-december/",
    "retrieved_at": "2025-10-11T23:58:54.618Z"
  },
  "metadata": {
    "title": "ECP directs Punjab to conduct LG elections in December",
    "author": null,
    "date_published": "2025-10-08T15:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 363,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 08 (APP):In a major development, the Election Commission of Pakistan (ECP) has ordered local government elections in Punjab to be held in the last week of December 2025, under the provisions of the Local Government Act 2022. A four-member bench of the Election Commission - headed by Chief Election Commissioner Sikandar Sultan Raja and including Nisar Ahmed Durrani, Shah Muhammad Jatoi, and Babar Hassan Bharwana - issued the directive after hearing the long-pending case regarding the delay in Punjab's local government elections. The Special Secretary for Local Government from the Punjab government appeared before the five-member bench of the Election Commission. According to the Commission's directive, the delimitation process in Punjab will commence on Thursday and is expected to be completed within two months, paving the way for local government elections by the end of the year. During the proceedings, Chief Election Commissioner Sikandar Sultan Raja voiced displeasure over the criticism aimed at the Election Commission regarding the delay in conducting LG elections, and remarked: \"It is embarrassing for us that elections have yet to be held in Islamabad and Punjab.\" Earlier, the Election Commission had reserved its verdict in the Punjab local government elections case, with the Chief Election Commissioner pledging to announce it later the same day, Wednesday. Th ECP officials said that Punjab's local bodies' tenure ended on December 31, 2021, with no elections held for over three years. During this time, the provincial government made five amendments to the local government law, with a sixth in progress. Despite three rounds of delimitation and a declared schedule, the polls remained unheld. Officials noted that the 2022 Local Government Act remains in effect, allowing elections via EVMs or ballot papers. The DG Law confirmed no legal barriers to holding elections under the 2022 rules. The ECP's Special Secretary stated that delimitation in Punjab would take two to two-and-a-half months and must begin immediately, warning that the Supreme Court has cautioned against further delays. The Punjab government said its standing committee approved the new local government law on August 6, but floods and lack of an assembly session delayed its passage. The bill will be tabled in the next session.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}