{
  "article_id": "2025-10-08_9ded195cdab56f095488a9ce9a32880f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/parliamentary-caucus-on-child-rights-holds-crucial-briefing-on-child-abuse-conviction-rates-in-pakistan/",
    "retrieved_at": "2025-10-11T23:58:04.661Z"
  },
  "metadata": {
    "title": "Parliamentary Caucus on Child Rights Holds Crucial Briefing on Child Abuse & Conviction Rates in Pakistan",
    "author": null,
    "date_published": "2025-10-08T18:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 625,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 08 (APP):Under the leadership of Dr Nikhat Shakeel Khan, Convenor of the Parliamentary Caucus on Child Rights (PCCR) and Parliamentary Secretary for Science and Technology, the National Assembly convened an important meeting held here on Wednesday to address the alarming rise in child abuse cases across Pakistan. The session focused on reviewing trends in child violence, abuse, and exploitation, and examined the current conviction rates in these cases. Dr Nikhat Shakeel Khan opened the session by welcoming members and distinguished guests, emphasizing the collective responsibility of lawmakers to create a safe and nurturing environment for every child in Pakistan. Highlighting the urgent need for enhanced prevention and justice mechanisms, she called for identifying legal and institutional gaps and encouraged active parliamentary engagement to develop effective policy recommendations. The meeting was attended by prominent members of the PCCR, including Dr Shahida Rehmani, Secretary of the Women's Parliamentary Caucus; Syeda Nosheen Iftikhar, President of the Young Parliamentarians Forum; Ms. Shaista Pervaiz, Convenor of the Parliamentary Taskforce on SDGs; Mr. Pullain Baloch, Chairman of the Standing Committee on Information and Broadcasting; Parliamentary Secretaries Ms. Farah Naz Akbar, Ms. Rana Ansar, Ms. Aasia Ishaque Siddiqui, Ms. Zeb Jaffar, Ms. Kiran Imran Dar (Virtually), Barrister Danyal Chaudhary; and MNAs Syeda Shehla Raza, Ms. Nuzhat Sadiq, Dr. Shazia Sobia Aslam Soomro, Syed Ali Qasim Gillani (virtually), Ms. Sofia Saeed Shah (virtually), Ms. Asia Naz Tanoli, and Mr. Amjad Ali, along with Former Parliamentarians Ms. Surriya Asghar and Ms. Asiya Nasir. The Sustainable Social Development Organization (SSDO), represented by Mr Syed Kausar Abbas, delivered a comprehensive presentation detailing the prevalence of child abuse, child labour, early marriages, trafficking, and other forms of exploitation. The report also provided conviction statistics obtained under the Right to Information Act from law enforcement agencies in Khyber Pakhtunkhwa, Punjab, Sindh, Balochistan, and Islamabad. During the open discussion, several constructive proposals were made to strengthen child protection efforts. Parliamentary Secretary Ms. Zeb Jaffar advocated for workshops in Islamabad schools to educate children and parents on physical safety through storytelling focused on \"good touch, bad touch.\" Dr. Shahida Rehmani urged for the integration of harassment awareness into school curricula, while MNA Syeda Shehla Raza highlighted the effectiveness of visual aids such as films in sensitizing parents, children, and teachers. Syeda Nosheen Iftikhar shared findings from her constituency emphasizing the risks of leaving children unsupervised with relatives or domestic staff. Dr Amjad Ali stressed the importance of safe and regulated environments in schools and madrassas, whereas Syed Qasim Ali Gillani called for expedited conviction processes to protect victims from undue pressure. MNAs Dr. Shazia Sobia Aslam Soomro, Ms Farah Naz Akbar, and Ms. Sofia Saeed Shah underscored the need for comprehensive training and counseling of educators and staff to empower children in recognizing abuse. Parliamentary Secretary Ms Aasia Ishaque Siddiqui proposed the inclusion of anti-harassment features on mobile phones and gaming consoles, seeking collaboration with the Ministry of IT. Barrister Danyal Chaudhary highlighted the necessity of reinforcing institutional frameworks to rescue children forced into beggary by exploitative relatives. The members of PCCR also expressed deep concern over the plight of more than 6 million people affected by the recent 2025 floods across Pakistan. The caucus noted with particular alarm that a majority of those affected are women and children, who remain the most vulnerable in disaster situations. The caucus emphasized the urgent need for coordinated relief, rehabilitation, and protection measures to ensure the safety, health, and well-being of all affected children and their families. Concluding the session, Dr Nikhat Shakeel Khan expressed her heartfelt appreciation to all members for their unwavering commitment to child rights and thanked SSDO for their valuable contributions. The meeting ended with a group photo to commemorate this significant step toward safeguarding Pakistan's children.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}