{
  "title": "Provinces asked to ensure smooth, timely procurement of wheat",
  "link": "https://www.app.com.pk/national/provinces-asked-to-ensure-smooth-timely-procurement-of-wheat/",
  "date_published": "2021-04-05T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 05 (APP):Federal Minister for Finance, Revenue, Industries and Production Muhammad Hammad Azhar Monday issued strict directions to the province to ensure smooth and timely procurement of wheat.\nThe minister was chairing the meeting of the National Price Monitoring Committee (NPMC) here, which among others was attended by Federal Minister for National Food Security and Research (NFS&R), Syed Fakhar Imam, SAPM on Revenue Dr. Waqar Masood, Secretary Finance Division, Secretary Ministry of NFS&R, Additional Secretary Ministry of Industries and Production, senior representatives of the provincial governments, MD Utility Stores Corporation, Member Competition Commission of Pakistan, MD PASSCO and senior officials of the finance division.\nAccording to press statement issued by the Finance Ministry, the minister however, expressed satisfaction over the arrangements made and initiatives taken by the provincial governments in this regard.\nEarlier, the representatives of all the four provinces briefed the finance minister about their on-going wheat procurement plans.\nMeanwhile, the NPMC reviewed the price trend of essential commodities especially wheat flour, sugar, vegetable ghee, chicken and eggs during the last week.\nThe Secretary Finance briefed the Committee about weekly Sensitive Price Indicator (SPI), which decreased by 0.43% whereas prices of 12 basic commodities registered a decline and 24 items remained stable during the week under review, he added.\nThe Secretary Ministry of NFS&R briefed the committee about the sufficient stock of wheat across the country. The overall release position by the respective provinces was also reviewed during the meeting, the statement added.\nTaking stock of the situation, the finance minister directed the representatives of the provincial government to take appropriate measures for keeping prices of the wheat flour bags in check.\nThe NPMC urged the provinces to take all possible measures to ensure smooth supply of wheat at fair prices across the board.\nThe Punjab government updated the committee about setting up Ramzan/Sahulat Bazaars for providing essential commodities at subsidized rates during the holy month.\nThe committee directed the representatives of the provincial governments to ensure provision of basic commodities at discounted prices through Ramadan/Sahulat Bazaars in order to provide maximum relief to the consumers in compliance with the directives of the Prime Minister.\nThe Managing Director Utility Stores Corporation also briefed the committee about the measures being taken to ensure availability of basic need items at subsidized prices under the “Ramadan Relief Package” through chain of outlets across the country.\nThe finance minister directed MD USC to ensure uninterrupted supply of basic commodities at Utility Stores outlets during Ramadan.\nThe finance minister sought details from the provincial food Secretaries regarding prevailing sugar prices in respective markets and directed to strictly monitor the prices of sugar (at retail levels) to ensure steady supply and counter price disparity effectively.\nThe Additional Secretary, Ministry of Industries and Production updated the committee about slight decrease in international prices of sugar which would reduce the upward pressure on sugar prices in domestic markets.\nThe finance minister stated that controlling inflation is the top most priority of the government and emphasised the need for coordinated and consolidated efforts by all concerned to provide essential items to the general public at fair prices.",
  "retrievedAt": "2025-08-11T20:35:23.654Z"
}
