{
  "article_id": "2025-02-03_564fc56c625342253574e17356fb0766",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pnca-to-host-two-day-cultural-events-on-kashmir-solidarity-day/",
    "retrieved_at": "2025-08-27T12:20:55.967Z"
  },
  "metadata": {
    "title": "PNCA to host two-day cultural events on Kashmir Solidarity Day",
    "author": null,
    "date_published": "2025-02-03T10:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 311,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 3 (APP):The Pakistan National Council of the Arts (PNCA), in collaboration with the Ministry of Kashmir Affairs and Gilgit Baltistan will arrange a series of cultural events from February 4-5 at Pakistan to mark Kashmir Solidarity Day. According to an official of PNCA, the events are aimed at highlighting the struggles, sacrifices, and resilience of the Kashmiri people through various artistic expressions, including documentaries, photography, theatre, puppetry, and traditional folk music. The activities will begin with a special documentary screening and a photographic exhibition, running from February 04 to 05 in the main lobby of PNCA. The exhibition will feature a powerful visual narrative of the historical and ongoing struggle of Indian Illegally Occupied Jammu and Kashmir (IIOJK), along with captivating images showcasing the region's breathtaking landscapes and rich cultural heritage. On February 05, a special puppet show will take place at PNCA Hall to engage younger audiences by creatively depicting the resilience of Kashmiris through the art of puppetry. While a theatre drama titled \"Katehra\" will be staged as a part of the activities. The play, set in a courtroom, symbolizes the oppression faced by Kashmiris and their unyielding struggle for justice and self-determination. The evening will conclude with a Kashmiri Folk Music Night which will feature renowned Kashmiri folk artists performing soulful melodies that reflect the deep cultural roots, love, and resilience of the Kashmiri people. PNCA has invited the public to attend these events to express solidarity with the people of Kashmir and appreciate the artistic portrayal of their ongoing struggle. The event is expected to witness participation from the government officials, diplomats, artists, and cultural enthusiasts, making it a significant occasion to reaffirm Pakistan's unwavering support for the Kashmiri cause. It is a regular feature for PNCA to mark Kashmir Solidarity Day through arranging such activities to educate the younger generation about the Kashmir cause.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}