{
  "article_id": "2025-02-03_1e90f12f0b03e496478b24181d4b99e1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/sfd-delegation-calls-on-pm/",
    "retrieved_at": "2025-08-27T12:20:04.618Z"
  },
  "metadata": {
    "title": "SFD delegation calls on PM",
    "author": null,
    "date_published": "2025-02-03T13:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 340,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 03 (APP): A delegation of Saudi Fund for Development (SFD), led by Sultan Bin Abdul Rehman Al Marshad, Chief Executive Officer (CEO) called on Prime Minister Muhammad Shahbaz Sharif on Monday. The prime minister welcomed the delegation and appreciated the long-standing friendship between the Kingdom of Saudi Arabia and Pakistan and the efforts of SFD for providing financing to Pakistan in the fields of health, energy, infrastructure and education as well the for the reconstruction after the 2022 floods, PM Office Media Wing said in a press release. Deputy Prime Minister Ishaq Dar, Minister for Economic Affairs Division Ahad Khan Cheema, Minister for Finance Muhammad Aurangzeb, Minister for Information & Broadcasting Ataullah Tarar, Minister for Petroleum Dr. Musaddiq Malik and SAPM Tariq Fatemi alongwith senior officials of the Government of Pakistan attended the meeting. Saudi Ambassador to Pakistan Nawaf bin Said Al-Malki was part of the four member Saudi delegation. The CEO, SFD thanked the Prime Minister and Government of Pakistan for the warm welcome and hospitality extended to the Saudi delegation. The CEO, SFD shared updates with the prime minister about the ongoing projects including Mohmand Multi-purpose Hydropower Project, Golan Gol Hydropower Project, Malakand Regional Development Project, and other projects funded through Saudi grants. The prime minister, while appreciating the support of the SFD, highlighted the need to expedite the processing of the new projects, shared with SFD, in the field of green energy and infrastructure, which once implemented would go a long way in the economic revival of the country, besides serving the needs of the local communities. The CEO, SFD assured early processing of the shared projects and also reiterated that the Kingdom of Saudi Arabia, under the leadership of the Royal Family, would extend all possible assistance and continued support to Pakistan. The prime minister thanked the CEO and members of the delegation and conveyed his best wishes to all the members of the Royal Family, especially Khadim-e-Harmain Sharifain King Salman bin Abdulaziz Al Saud and Crown Prince and Prime Minister Mohammed bin Salman.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}