{
  "article_id": "2025-02-03_29e5dfa4c22ec2edc881ff06c781a8e4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/peca-aims-to-curb-fake-news-protect-digital-media-attaullah-tarar-2/",
    "retrieved_at": "2025-08-27T12:20:58.235Z"
  },
  "metadata": {
    "title": "PECA aims to curb fake news, protect digital media: Attaullah Tarar",
    "author": null,
    "date_published": "2025-02-03T08:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 376,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Feb 03 (APP):Federal Minister for Information and Broadcasting, Attaullah Tarar, has reiterated that the Prevention of Electronic Crimes Act (PECA) is aimed at eliminating fake news and addressing the damages caused through social media. Speaking as the chief guest at the oath-taking ceremony of the Associated Press of Pakistan (APP) Union, he emphasized that social media could not be left unchecked under the guise of journalism. He warned that fake propaganda, false news, harassment, child abuse content, threats to national security, economic uncertainty, and personal defamation were being spread online, creating unrest in society. To regulate digital platforms, Tarar announced the establishment of a Digital Media Protection Authority, which will include members from the private sector, press clubs, and journalist organizations. Journalists and IT professionals would also be part of its tribunal. The authority will ensure swift decision-making, with tribunals required to pass orders within 24 hours, and appeals could be made to the High Court and Supreme Court. The minister assured that all stakeholders would be consulted before finalizing \"This is a crucial step in addressing the threats posed by social media,\" said Tarar, adding that the law will help curb misinformation and malicious content. He urged journalistic organizations to support the legislation, which incorporates global best The minister also addressed the damaging effects of corruption, stating that it had caused irreparable harm to institutions. He reaffirmed the government's commitment to reforming institutions under the Ministry of Information, making them profitable and efficient. He further highlighted the vital role of national institutions like Pakistan Television (PTV), Radio Pakistan, and APP in promoting Pakistan's image globally. Recognizing the struggles of journalists, Tarar assured that addressing their challenges remains a top priority. He announced that funds would be allocated in the upcoming budget for journalists who pass away during service. Emphasizing the importance of employees as a national asset, he urged them to work with dedication and integrity for the betterment of their institution. He also assured the resolution of employees issues and distributed shields among The event was attended by PML-N leader Begum Sajida Farooq Tarar (mother of the minister), Coordinator for Heritage and Culture Farah Diba, Director General Radio Sheikh Saeed, Bureau Chief APP Lahore Talib Hussain, and several senior journalists and media professionals.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}