{
  "title": "Saudi Arabia bars firms to lay off Pakistani workers for 3 months",
  "link": "https://www.app.com.pk/national/saudi-arabia-bars-firms-to-lay-off-pakistani-workers-for-3-months/",
  "date_published": "2020-04-20T23:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 21 (APP):The Saudi government has decided to bar the companies from laying off Pakistani workers for the next three months.\nThe decision to the effect was taken on the request of Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development (OP&HRD) Sayed Zulfikar Bukhari, an OP&HRD Ministry press release said on Tuesday.\nSaudi Vice Minister for Labour and Social Development Dr Abdullah bin Nasser Abu Thuniyan, in a video conference call, assured SAPM Zulfikar Bukhari that the Saudi firms would not expel the Pakistani workers for the next three months and pay them salaries during the period.\nThe Saudi government would also ensure full payment of dues to the already laid-off workers, he added.\nThe Saudi minister also announced free of cost extension in the visas of Pakistani labourers till December.\nBoth the sides discussed the issues faced by the Pakistani manpower in Saudi Arabia in the wake of coronavirus pandemic.\nThe SAPM asked the Saudi vice minister to ensure facilitation to the Pakistani workers in every possible way.\nThe two sides agreed to remain in constant contact during the prevailing situation. The resumption of flight operations between the two countries also came under discussion.\nThe Saudi vice minister also informed the SAPM about his government’s decisions to extend the entry and exit visas of Pakistani nationals and free of charge services for transfer of remittances to Pakistan through STC pay.\nZulfikar Bukhari expressed his gratitude for the cooperation extended by the Saudi government . “We want to fulfill every need of our nationals in the trying times,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:07:57.015Z"
}
