{
  "title": "Pakistan faces greater challenge of saving poor from dying: PM",
  "link": "https://www.app.com.pk/national/pakistan-faces-greater-challenge-of-saving-poor-from-dying-pm/",
  "date_published": "2020-04-21T09:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 21 (APP):Prime Minister Imran Khan Tuesday said unlike the richest countries, including the United States and European states, which had been hectically trying to save their economies from the debilitating effects of coronavirus, his government faced a greater challenge of saving the poor population from dying due to looming hunger.\nThe prime minister, in a televised address to the nation at a time when the deadly pathogen affected more than 2.4 million people across the globe resulting in more than 170,000 fatalities, recounted how the COVID-19 was wrecking havoc with the world economy, and said nobody could predict how long the challenge would persist. Different countries were now opting to ease the lockdown.\n“The poor segments of society in the country have been facing hard times,” he added.\nHe said the Ehsaas Rashan Portal would provide succor to the poor, needy and deserving people after completion of their data.\nDeflating the opposition’s criticism with regard to Tiger Force, he maintained that it was a volunteer force which would not seek any monetary benefits. Its volunteers were out on the streets due to their sheer passion for humanity to collect relevant data. They would post the data of the deserving and philanthropists on the portal, he added.\nHe said the government would bring together the deserving people and the donors on the portal. The government’s role would be only to facilitate the match-making between the donors and the beneficiaries through availability of the data about eligible beneficiaries to the donors.\nThe portal is a donor-beneficiary linking system for Rashan (food) distribution and has been set up to enable the private sector to reach the most vulnerable.\nThe prime minister said even the United Kingdom also shored up a volunteer force to face the situation and if need arose in future, the government would also involve all other institutions.\nAbout prayers and congregations during the holy month of Ramazan, Imran Khan said in different Muslims countries, decisions had been made to keep the mosques closed to contain the spread of coronavirus.\n“We are a sovereign country and I get a bad feeling when I watch the police force resorting to baton charging during the lockdown. Ramazan is a period of praying and offering obligations, and nobody wants to close the mosques. In an independent society, the people are involved for taking decisions over the national issues with independent minds,” he added.\nHe said the fight against the coronavirus could be won only through collective efforts and full participation of the public as the virus did not discriminate among different strata of the society.\nThe prime minister said with complete consultation of the country’s leading Ulema, President Dr Arif Alvi succeeded in developing a consensus leading to adoption of 20 points guidelines, which would be implemented strictly during the holy month.\nHe also urged the nation to prefer offering religious obligations at homes and in case, they wanted to visit mosques, they should strictly follow the guidelines.\nHowever, he added that the government would be forced to review its decision and take action in case the virus infection spread in any area. The factories and the construction sector were also opened conditionally as the owners were bound to fully implement certain SOPs (standard operating procedures).\nAbout the return of expatriates, the prime minister said the provinces feared that it could spread the coronavirus for the moment as the health system was grappling with the existing cases.\nHe said it was not possible to shut 220 million people or to get all of them tested, however, they were learning from the global experiences. The isolation of infected persons was the key to overcome the pandemic, he added.\nThe prime minister observed that trials and tribulations always led to test a nation’s resolve. Throughout the world, different affected countries were combating the pandemic, but once the threat subsided, it would be espied how a country managed to overcome the challenge.\nHe also reiterated his resolve to bring the hoarders and profiteers to book through the relevant laws, saying he considered such elements as ‘national culprits’ who wanted to take undue benefits by creating difficulties for the general public.\nThe prime minister also referred to the State of Madina, which for the first time in the world, took responsibility of supporting the vulnerable sections of society.\nThe difference between the wild life and human existence was based upon how the poor and feeble members of society were treated by the state, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:07:51.655Z"
}
