{
  "title": "Health Ministry partners with Google for COVID-19 response",
  "link": "https://www.app.com.pk/national/health-ministry-partners-with-google-for-covid-19-response/",
  "date_published": "2020-04-21T01:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 21 (APP):Ministry of National Health Services, Regulations and Coordination has entered into a partnership with global technology giant Google to raise awareness on prevention of coronavirus (COVID-19) in the country.\nFree space has been provided by Google for public education through all existing channels, including search, display and Youtube. Through this assistance, the ministry of health will be able to deliver critical information to Pakistanis on how to prevent and cope with the spread of COVID-19.\nThe free space or ad credits provided are worth USD five million and are part of Google’s Ad Grants Programme and are anticipated to run from April until the end of the year.\nTo support Pakistan both in the ongoing short-term response to the virus, and in the long-term, Google is concentrating on three priorities that they believe are critical to a sustainable recovery included promoting accurate and reliable information, supporting education and learning and contributing to business continuity and economic recovery.\nSpecial Assistant to the Prime Minister on Health, Dr Zafar Mirza lauded the assistance from Google, stating that, “This assistance is critical in helping the Pakistan government raise awareness on COVID-19 and highlight how its citizens can protect themselves and prevent the further spread of the virus.”\nGoogle’s mission is to organize the world’s information and make it universally accessible and useful. Through products and platforms like Search, Maps, Gmail, Android, Google Play, Chrome and YouTube, Google plays a meaningful role in the daily lives of billions of people and has become one of the most widely-known companies in the world.\nGoogle stated that, “COVID-19 puts intense demands on us all, and we’re determined to uphold our responsibility in this unprecedented time to enable access to trusted information, support remote learning, back small businesses, and more. The initiatives we’ve shared today are the start.\nWe’re standing with Pakistan to do all we can to help as we overcome COVID-19 and shape a stronger future.”\nSince the virus first began to spread, Google has been focusing on making sure people have the information and tools they need. In early March, Google allocated USD 25 million in ad credits to the World Health Organization (WHO) and government agencies worldwide.\nSpeaking on Google’s assistance and partnership with WHO, the Representative of WHO in Pakistan, Dr Palitha Mahipala shared that, “in today’s age of misinformation, companies like Google can help get reliable and trustworthy information across to concerned citizens. This partnership will greatly support the COVID-19 response.”",
  "retrievedAt": "2025-08-11T19:07:55.066Z"
}
