{
  "title": "Registration exam for foreign medical graduates essential for safety of patients: PMDC - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: While a campaign has been started to abolish registration exam for foreign medical graduates, Pakistan Medical and Dental Council (PMDC) has made it clear that the exam is essential for the safety of patients.\n\nThe council has claimed that the health and safety of masses is the top priority and vowed that it will never compromise on it.\n\nIt is worth mentioning here that concerns of foreign medical graduates (FMGs) are being circulated on social media and a few days ago they also held a press conference claiming that they should be allowed to practice in Pakistan.\n\nThe PMDC spokesperson stated that there were three categories of Pakistani graduates who had obtained degrees from foreign institutions mainly from Afghanistan, Central Asian Republics such as Kyrgyzstan and Iran. Most of these graduates started their foreign education when PMDC Ordinance 1962 and the Pakistan Medical Commission (PMC) Act 2020 were in place.\n\n“The Parliament promulgated PMDC Act 2022 and the new council was reconstituted in April 2023. The present council has implemented several reforms to promote medical education. These initiatives not only focus on medical education in the country but also for Pakistani nationals who intend to pursue education abroad, ensuring patient safety and strengthening the national health system,” he said.\n\n“The PMDC Act 2022 provides the Council to assess and recognise foreign medical institutions and only those graduates of foreign institutions duly recognised by PMDC are eligible for the issuance of provisional registration. These graduates may be granted provisional registration; however, it is mandatory for them to pass the National Registration Examination (NRE) before obtaining full license to practice.\n\nThe PMDC has started a rigorous process of assessment of foreign medical institutions where Pakistani students are enrolled. However, several institutions do not qualify the PMDC regulatory framework and their graduates are demanding the issuance of a provisional registration certificate for clinical services.\n\nIn the recent past, at least two medical universities from Punjab have raised serious concerns on quality of medical education of these graduates from some foreign countries,” he said.\n\n“The present council has discussed this issue of prime public interest carefully and thoroughly. Accordingly, it was decided that only those graduates of foreign institutions duly recognised by PMDC are eligible for the issuance of provisional registration prior to NRE. All other graduates enrolled at the time of erstwhile PMDC or PMC and their institutions not yet recognised under the new law, will be issued provisional registration once they qualify for the NRE examination,” he said.\n\n“Furthermore, only graduates of foreign institutions included in the Educational Commission for Foreign Medical Graduates (ECFMG) accredited lists are eligible to appear in the NRE. This standard practice is also adopted by different countries. It is also important to emphasise that the requirement of passing the examination for the issuance of a provincial or full license is not a new phenomenon. In fact, it was started by the Council in early 90s under the PMDC Ordinance 1962,” the spokesperson said.\n\n“Authorities of the medical profession of every country need to be confident that every doctor entering practice has the clinical knowledge and judgement to provide safe patient care. For example, the US requires foreign doctors to pass the USMLE, the UK requires the PLAB (or GMC approved alternatives), Canada requires the MCCQE exams and Pakistan requires the NRE for foreign graduates.\n\nLicensing exams provide a fair, standardised way to evaluate all graduates, regardless of where they studied. Exams are taken to check whether graduates are familiar with local expectations and patients must feel assured that every doctor they see has been rigorously assessed. Licensing exams strengthen confidence in the healthcare system,” he added.\n\nPublished in Dawn, September 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:40:19.847Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941990/registration-exam-for-foreign-medical-graduates-essential-for-safety-of-patients-pmdc",
  "dateList": "2025-09-15",
  "date_published": "2025-09-15T01:29:42.000Z"
}
