{
  "title": "Trump vows national emergency in Washington DC over ICE dispute - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump said on Monday he would call a national emergency and federalise Washington DC after Mayor Muriel Bowser said its police would not cooperate with Immigration and Customs Enforcement (ICE).\n\nAt issue is the provision of information on individuals living in, or entering, the United States illegally. Trump’s threat adds to a move critics have seen as federal overreach, with more than 2,000 troops patrolling the city.\n\nThe comments come after several thousand protesters hit the streets this month over Trump’s August deployment of National Guard troops to “re-establish law, order, and public safety“, after calling crime a blight on the capital.\n\n“In just a few weeks. The ‘place’ is absolutely booming … for the first time in decades, virtually no crime,” Trump said on Truth Social.\n\nBowser’s office did not immediately respond to a request for comment on Trump’s post.\n\nEarlier, he had put the metropolitan police department under direct federal control and sent federal law enforcement, including members of ICE, to police the streets. It is unclear when their mission will end.\n\nTrump blamed “radical left Democrats” for pressuring Bowser to inform the government about the non-cooperation with ICE, adding that if the police halted cooperation with ICE, “crime would come roaring back”.\n\nHe added: “To the people and businesses of Washington DC, don’t worry, I am with you and won’t allow this to happen. I’ll call a National Emergency, and federalise, if necessary!!!”\n\nBowser, who has previously praised Trump’s surge of federal law enforcement, bringing a sharp decline in crime, earlier signed an order for the city to coordinate with federal law enforcement.\n\nThe National Guard serves as a militia answering to the governors of the 50 states, except when called into federal service. The DC National Guard reports directly to the president.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/15130553bcfad51.webp",
  "retrievedAt": "2025-09-19T14:40:04.562Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942160/trump-vows-national-emergency-in-washington-dc-over-ice-dispute",
  "dateList": "2025-09-15",
  "date_published": "2025-09-15T08:11:19.000Z"
}
