{
  "title": "COMMENT: A familiar script, but not many silver linings - Newspaper - DAWN.COM",
  "author": null,
  "content": "GIVEN the rage in India over this summer’s conflagration, and demands to boycott the latest tournament clash between Pakistan and India, it was something of a surprise to see so many Indian fans at the Asia Cup match in the UAE on Sunday night.\n\nNonetheless, the stadium wasn’t full, and India’s fans did outnumber their rivals. Much to the chagrin of warmongers, the crowd enjoyed a friendly rivalry and the players just got on with doing their jobs. Business as usual also meant that Pakistan were thoroughly outplayed by India — as is the custom in international tournaments.\n\nIn fairness, the pitch had settled down by the time India batted. However, their all-round supremacy was clear, much to the annoyance of Pakistan supporters.\n\nPakistan simply scored too few runs, and India chased them down with ease and ominous competence. Even two early wickets for Saim Ayub failed to create any doubt about the outcome.\n\nThe most consistent performers in Pakistan’s innings seemed to be the umpires, given their readiness to deliver verdicts in India’s favour\n\nMuch will be made of how India’s batsman hammered boundaries and judiciously rotated the strike. It will be argued that Pakistan are transitioning into the modern version of T20 cricket that requires an unrelenting assault on bowlers.\n\nThe problem for Pakistan is that you can’t re-engineer a batting line-up under the bright lights of international cricket. You need to prepare the players best suited for that strategy outside international cricket, before unleashing them as the finished article.\n\nAfter winning the toss and deciding to bat, Pakistan were going at under five runs an over at the halfway mark. They had lost Ayub from the first legitimate ball of the innings. Half their side, all their top order except Farhan, was gone for 64 runs. The sixth fell on the next delivery.\n\nThe most consistent performers in Pakistan’s innings, although it did not affect the result, seemed to be the umpires, given their readiness to deliver verdicts in India’s favour.\n\nThe only win was that a batsman wearing green hit Jasprit Bumrah for six.\n\nPakistan had previously faced 399 balls from the world’s foremost pace bowler without clearing the ropes. On his 400th, Sahibzada Farhan, the lone standard-bearer of his country’s batting hopes, smote Bumrah back over his head with an effortlessness that made you wonder how it had never happened before. Let’s celebrate that because there wasn’t much else to enjoy about Pakistan’s batting performance.\n\nThe only other bright spark in the gloom was the sight of an Afridi hitting sixes with abandon in the desert’s fields of green. Shaheen took a leaf from his father-in-law’s playbook by choosing beast mode for this innings, and it suits him, too. Better for him to thrash a few sixes than to muck around looking inept.\n\nBatting woes\n\nBatting depth in international cricket should be a statement of domination; for Pakistan it is an admission of failure. For experienced watchers of Pakistan’s batting misadventures, two things are clear. Firstly, this current crop lacks quality. Secondly, they are inexperienced in their general experience of batting and the situations that a batsman might be exposed to. The few experienced cricketers in the lineup, including the captain Salman Agha, failed to adjust to the conditions and the match situation.\n\nThis latest version of Pakistan’s batting order is meant to be an attacking one. Yet, the number of dot balls remains worryingly high. Pakistan have swapped an experienced group of batsmen majoring in dot balls for a mob of inexperienced batsmen majoring in dot balls. This situation won’t be fixed until Pakistan cricket understands that the Pakistan Super League does not a batsman make.\n\nEven Pakistan fans have stopped pretending that their team are serious contenders. However, the inexperience in India’s batting line-up offered a little reason for optimism. But India’s newer batsmen always look perfectly ready for the challenges of international cricket — witness Abhishek Sharma’s dismantling of Afridi at the start of India’s innings.\n\nOn a pitch that helped bowlers of all persuasion, India’s attack showed its greater experience and ability. The spinners, in particular, ran riot. Kuldeep Yadav is capable of troubling any batsman, but the truth is that only cricket fans of Gen X and older will remember an age when Pakistan’s top order was able to dominate spin bowling.\n\nAll of this confirms once again that the developmental and structural failures in Pakistan cricket are not in good health. And, those failures are most obviously manifested in what the country’s batsmen produce.\n\nThe Pakistan Cricket Board, the hangers-on who rely on Pakistan cricket for their own benefit, and many fans are in absolute denial on this point.\n\nPakistan’s batsmen, as a group, cannot play spin. Heroics in the Pakistan Super League are merely an illusion of competence.\n\nThe tournament is far from over for Pakistan but, given what we have seen, it’s hard to imagine this particular Pakistan team, at this stage of its development, winning the Asia Cup.\n\nThe events in this cricket match will not linger in the memory, however, it will be remembered as the match that restored cricketing relations between India and Pakistan soon after the countries competed in the air with jet fighters. Pakistan might argue that they won the one that mattered.\n\nPublished in Dawn, September 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c741854a708.jpg",
  "retrievedAt": "2025-10-12T04:11:20.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942015",
  "dateList": "2025-09-15",
  "date_published": "2025-09-15T01:28:54.000Z"
}
