{
  "title": "Spectrum locked at 274 MHz? - Business - DAWN.COM",
  "author": null,
  "content": "“Spectrum is the invisible infrastructure behind every call, every payment, every online classroom – to unlock Pakistan’s digital future, we need a pricing and policy framework that encourages investment, not hesitation,” Amir Ibrahim, CEO of Jazz and Chairman of the Telecom Operators Association (TOA), recently told the government.\n\nThe government is serious about enhancing digital inclusion and acknowledges that every additional megahertz of spectrum is not just about better technology; it is about inclusion and growth of services like fintech, healthtech, edtech, cloud, entertainment etc that improve lives and livelihoods.\n\nBut this vision rests on a strong foundation of reliable, high-quality connectivity and is only possible with adequate availability of spectrum.\n\nThe spectrum shortage is the single biggest reason behind network congestion, dropped calls, and slower data speeds experienced by users every day in the country.\n\nThe state and private sector disagree over spectrum auctions as the country continues to struggle with stunted internet connectivity\n\nPakistan currently operates on just 274 MHz of spectrum, less than half of what regional peers enjoy and far below global benchmarks, and the government looks reluctant to adopt any model other than the auction of spectrum.\n\nDuring the sixth meeting of the Spectrum Advisory Committee on International Mobile Telecommunication spectrum for the improvement of next-generation mobile broadband services in Pakistan, held recently in Islamabad, a presentation titled ‘Building Digital Pakistan through effective spectrum policy’ was given by Julian Gorman, Head of APAC, GSMA.\n\nAmong other things, the GSMA demanded the government of Pakistan “resolve outstanding legal, regulatory & fiscal issues”.\n\nThe GSMA also asked the government to set the reserve price of the spectrum to be released for 5G at comparatively lower than previous auctions. Mr Gorman gave the examples of Saudi Arabia, Vietnam, Indonesia etc where the spectrum price has been around 10 per cent or even lower than the spectrum price set previously in Pakistan.\n\nMoreover, the GSMA stated that the government of Pakistan has to resolve outstanding legal, regulatory & fiscal issues, referring to the long-standing litigation of 2.6 MHz — the prime band for 5G operations.\n\nThe matter has been stuck in the courts for around 20 years by one of the licensees of the Pakistan Electronic Media Regulatory Authority (Pemra), and the whole government machinery has expressed its helplessness over the matter.\n\nNot only is the matter lingering, but the officials of Pemra as well as the Frequency Allocation Board have not clearly disclosed the names and details of parties who have been holding the 2.6 MHz band for such a long time.\n\nThough the names were read out recently in a speedy manner by the law department of Pemra in an off-the-record briefing as well as a parliamentary committee, they went without repetition or disclosing any details.\n\nThe other reason for indecisiveness regarding the spectrum auction was the pending merger case of Telenor-Pakistan with PTCL.\n\nWhile these thoughts are agreed upon by all concerned, unfortunately the country has not been moving ahead in the right direction, as per Shaza Fatima, Minister for IT and Telecom. She clearly responded that nobody should give examples of other countries: “If we do not go for a fair and transparent auction, who will face NAB [National Accountability Bureau] and court cases later?”\n\nThe former IT and telecom minister, Syed Aminul Haque, stated around four years back in 2021 that Pakistan should allocate spectrum to the four telecos free of cost, as he was pushing for the launch of 5G in the country.\n\n“But we have two serious issues: the attitude of the finance ministry, who want to generate revenue from the sale of spectrum through the auction process, and secondly, the fear of NAB.”\n\nEarlier, in 2018, NAB initiated investigations against Anusha Rahman, former IT & telecom minister; Ishaq Dar, former finance minister; Dr Ismail Shah, former chairman of the Pakistan Telecommunication Authority; and other senior officials of the Authority for the decisions taken by them in 2014.\n\n“I have always advocated that dedicated teams have to be trained in NAB, and they, along with the PPRA [Public Procurement Regulatory Authority] personnel, should be part of major deals – because nobody can give answers to any query after two to three years of taking any decision,” Mr Haque told. “But they [NAB] do not want to become part of any decision-making process, and they always go after the persons after they are not in the office.”\n\nPublished in Dawn, The Business and Finance Weekly, September 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c76e2dc1554.gif",
  "retrievedAt": "2025-10-12T04:10:22.300Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942108/spectrum-locked-at-274-mhz",
  "dateList": "2025-09-15",
  "date_published": "2025-09-15T01:40:46.000Z"
}
