{
  "title": "Indian forces gun down top Maoist rebel, two others - World - DAWN.COM",
  "author": null,
  "content": "Indian security forces killed a top Maoist commander and two other rebels in a gun battle on Monday, officials said, as the government intensifies efforts to crush the decades-long conflict.\n\nIndia is waging an all-out offensive against the last remaining traces of the Naxalite rebellion, named after the village in the foothills of the Himalayas where the Maoist-inspired guerrilla movement began nearly six decades ago.\n\nMore than 12,000 rebels, soldiers and civilians have been killed since a handful of villagers rose up against their feudal lords there in 1967.\n\nThe latest gun battle took place early on Monday in the mineral-rich eastern state of Jharkhand, India’s Central Reserve Police Force (CRPF) said in a statement. The federal police described the operation as a “major breakthrough”.\n\nThree “top Naxal commanders” were killed in the fight, the CRPF said, including Sahdev Soren, who was part of the central committee of the Maoist organisation. Authorities had issued a bounty of around $113,000 for his capture.\n\nLast week, forces killed another Maoist commander and nine others in a fierce gun battle along the forested border between the states of Odisha and Chhattisgarh.\n\nThe Indian government has vowed to crush the rebellion by the end of March next year.\n\nThe rebellion controlled nearly a third of the country with an estimated 15,000 to 20,000 fighters at its peak in the mid-2000s. A crackdown by Indian troops across the “Red Corridor” has killed more than 400 rebels since last year, according to government data.\n\nThe group’s chief, Nambala Keshav Rao, alias Basavaraju, was gunned down in May, along with 26 other guerrillas.\n\nThe conflict has also seen several deadly attacks on government forces. A roadside bomb killed at least nine Indian troops in January.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:40:05.769Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942152/indian-forces-gun-down-top-maoist-rebel-two-others",
  "dateList": "2025-09-15",
  "date_published": "2025-09-15T07:44:30.000Z"
}
