{
  "title": "President Zardari assures Shanghai Electric of amicably resolving ‘any outstanding issues’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari on Monday assured the Shanghai Electric Power Company that “any outstanding issues” would be amicably resolved as he invited the firm to invest in Pakistan’s energy infrastructure.\n\nThe firm last week decided to terminate its offer to acquire up to 66.4 per cent of K-Electric Ltd due to changes in Pakistan’s business environment. It added that since the planning of the “major asset purchase”, the company had strictly adhered to relevant laws, regulations, and normative documents, actively promoting the various tasks involved in this major asset purchase.\n\n“Given that the counterparty has consistently failed to meet the conditions precedent for closing and the changes in the business environment in Pakistan have rendered this transaction no longer aligned with the company’s international development direction, after careful study and analysis, in order to effectively safeguard the interests of the company and all its shareholders, the company has decided to terminate this major asset purchase,“ it had said.\n\nKE is the only electricity generator, transmitter, and distributor for Karachi and its adjoining areas, and the only listed electricity supplier. It was privatised in 2005. Shanghai Electric Power had agreed to buy a controlling shareholding in KE from Abraaj Group back in 2016 for a sum of $1.77 billion. The transaction never materialised because the seller failed to obtain the required approvals from different authorities and liquidity constraints as a consequence of mounting circular debt in the country’s power sector.\n\nPresident Zardari met Shanghai Electric Chairman Wu Lei today and later visited the company’s facilities in Shanghai while on a 10-day trip to China.\n\n“He invited Shanghai Electric to explore further investment in the modernisation of Pakistan’s transmission and distribution network. President Zardari assured Shanghai Electric that any outstanding issues would be resolved amicably and in a spirit of mutual cooperation,” said a statement from the PPP.\n\nThe president also thanked the chairman for the company’s contribution to meeting Pakistan’s energy needs, generating employment and supporting socio-economic development.\n\nPresident Zardari further reaffirmed Pakistan’s commitment to enhancing security measures to ensure a safe and conducive environment for Chinese workers in the country, with CEO Lin Jigen expressing gratitude to the government for the security arrangements provided to its employees working in Pakistan.\n\nThe company chairman gave a briefing on its projects in Pakistan, including its work in Thar coal, nuclear energy, and coal-fired power plants.\n\nPresident Zardari underlined the importance that Pakistan attached to the development of the Thar coal project, including the potential of coal-gasification, and witnessed the signing of a Memorandum of Understanding (MoU) for the establishment of a coal gasification plant in Thar.\n\nThe MoU was signed between MFTC Coal Gasification & Manufacturing (Pvt) Ltd and Sino Sindh Resources (Private) Ltd/Shanghai Electric.\n\nThe statement said this was the first coal gasification and fertiliser project based on Thar coal, which would not only contribute to meeting the country’s energy needs but also play a vital role in supporting the agriculture sector.\n\nThe president was accompanied by First Lady Bibi Aseefa Bhutto-Zardari, PPP Chairman Bilawal Bhutto-Zardari, Senator Saleem Mandviwalla, Sindh Senior Minister Sharjeel Memon, Sindh Planning and Energy Minister Syed Nasir Shah, China’s Ambassador to Pakistan Jiang Zaidong and Pakistan’s Ambassador to China Khalil Hashmi.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/15194151f8cf7d8.webp",
  "retrievedAt": "2025-09-19T14:40:03.077Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942206/president-zardari-assures-shanghai-electric-of-amicably-resolving-any-outstanding-issues",
  "dateList": "2025-09-15",
  "date_published": "2025-09-15T14:48:04.000Z"
}
