{
  "title": "Tech disparity and the privatisation of money - Newspaper - DAWN.COM",
  "author": null,
  "content": "Once again, the world finds itself at a critical juncture. The old order has been uprooted by the rise of new powers, and with it, a new global contest has begun.\n\nIn the battle for economic dominance, technology has become the new frontline. Just as artificial intelligence is transforming the way we work, cryptocurrencies are reshaping the very foundation of finance and challenging the state’s control over the flow of money.\n\nFor now, most digital currencies, like Bitcoin and Ethereum, are notorious for their dramatic highs and lows, which makes them impractical to use as a reliable medium of exchange. Consumers need something more reliable. This gave rise to a new class of cryptocurrencies known as stablecoins.\n\nStablecoins are designed to keep their prices steady by linking their value to other assets like fiat currencies or commodities. This makes stablecoins a safer means for quickly transferring funds. And since blockchain transactions are recorded almost instantaneously on digital ledgers, these coins allow cross-border and retail transactions to be completed within minutes instead of days and within a fraction of the fee charged by card issuers and banks.\n\nMore importantly, stablecoins could lead to the rise of new, innovative products. It could play a similar role to that of bank accounts and money market funds, or tokens backed by stocks, private equity stakes, debt, and ETFs.\n\nFor these reasons, US President Donald Trump recently signed the Guiding and Establishing National Innovation (Genius) Act. The Act requires issuers to get a federal license, disclose the reserve composition, have a one-to-one high-quality liquid asset backing, and conduct independent reserve audits. It essentially demands full transparency from issuers in order to boost investor confidence in dollar-backed cryptos.\n\nAlready, companies are lining up to create their own stablecoins. Companies like Stripe, JPMorgan Chase, Walmart, and Amason are planning to issue their own stablecoins. In Pakistan, more than 100 million people are unbanked, and the use of stablecoins could provide a quicker way to bring them into the formal financial system without having to open a traditional bank account. This would greatly help the freelance community and overseas Pakistanis, who face hurdles in the form of high fees, payment delays, and a lack of access to reliable payment platforms like PayPal.\n\nWith the growing popularity of digital currencies, richer and more advanced countries may benefit from technological advancement, whereas poorer countries may have to grapple with the negative consequences\n\nWhile there are obvious benefits, there is also a risk that the growth of these stablecoins could derail the financial system. The fear is that if companies and commercial banks start issuing their own private money, stablecoins could one day dislodge central banks and upend monetary policy control. This is especially true for developing countries like Pakistan, which are often plagued by volatile currency swings and inflation.\n\nThe use of dollar-backed stablecoins could potentially lead to the dollarisation of the economy. Already, dollar stablecoins are gaining traction in countries like Nigeria and Turkey, where fears of inflation are high and the trust in the government is low.\n\nPakistan, too, could face a similar threat. Informal money transfer and black market foreign exchange trading would lead to the creation of a parallel economy that exists beyond the reach of the central bank. Stablecoins’ ability to bypass intermediaries could lead to money laundering and terrorism financing concerns.\n\nOnce again, the disparity caused by new tech is in focus here. Richer and more advanced countries benefit from technological advancement, whereas poorer countries have to grapple with the negative consequences. Nevertheless, the United States has now endorsed stablecoins as part of its wider shift in its stance to promote digital assets in order to ensure the dollar’s dominance in an increasingly digitised world.\n\nRegardless of who wins the digital currency race, the rise of such tech could one day pose a real threat to the Pakistani economy. The best solution for Pakistan is to double down on its effort to create its own Central Bank Digital Currency (CBDC). CBDCs can mirror a lot of the benefits that these new cryptocurrencies offer.\n\nAt the same time, the State Bank should also develop a framework for regulating stablecoins. Like many other new technologies before it, stablecoins could just be another hype. However, in the absence of any proactive measures, they could potentially be used by foreign powers to undermine the Pakistani economy.\n\nCrypto was created to decentralise power. A bold invention in a time when states are increasingly seeking to consolidate their control over every aspect of life. Crypto’s past has proven its allure as well as the chaos that comes with it. It promises to revolutionise finance as well as destabilise it. The challenge now is to not stop innovation but to guide it.\n\nThe writer is an a digital transformation specialist\n\nPublished in Dawn, The Business and Finance Weekly, September 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:40:06.733Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942099",
  "dateList": "2025-09-15",
  "date_published": "2025-09-15T01:40:47.000Z"
}
