{
  "title": "Rashid vows to maintain law, order in capital at any cost",
  "link": "https://www.app.com.pk/national/rasheed-vows-to-maintain-law-order-in-capital-at-any-cost/",
  "date_published": "2022-03-27T09:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 27 (APP): Minister for Interior Sheikh Rashid Ahmed on Sunday vowed that maintenance of law and order would be ensured at all cost in the federal capital and no one would be allowed to take law into his hands.\nAddressing a press conference here, the minister said permission was given to Pakistan Democratic Movement (PDM) for holding public gathering at H-9 on Saturday and show cause notice had already been issued to them for vacating the venue. Srinagar Highway would be kept opened on the directives of the Apex Court, he added.\nHe said stern action would be taken against those who found involved in blocking the roads besides registering First Information Reports against them.\nThe minister said permission was given to Pakistan Muslim League-Nawaz(PML-N) for holding rally at H-9 on March 28.\nHe said holing rally was opposition’s constitutional right and their time had over now. He expressed the hope that Jamait-e-Ulema Islam (JUI-F) would avoid confrontation and vacate the venue as PML-N had already been allowed to hold public gathering there on March 28.\nIf someone tried to create hurdle, the administration would take action as per the directions of the court, he warned.\nTaking jibes at Bilwal Bhutto for seeking Prime Minister resignation, he said the ‘Gang of Three’ would never succeed in their designs, adding, Imran Khan would emerge as victorious. The opposition did not know that Imran Khan would play till last ball, he asserted.\nHe said the opposition was making efforts to buy conscience of members through looted money. Terming Nawaz Sharif fugitive, he said Shahbaz Sharif was also trying to escape but caught at airport.\nThe minister said control room at the interior ministry would remain open round the clock for seven days and he would personally monitor the entire situation, adding, any untoward situation could be reported at the phone numbers- 0519206660 and 0519218594.\nHe said probably voting on no confidence against the Prime Minister would be held on April 4 if it the motion would be tabled on March 28 in the House.\nRasheed said name of Member National Assembly, Jam Abdul Karim had been put in Exit Control List and directives had been issued to arrest him soon after his arrival from Dubai as he was nominated in murder of journalist Nazim Jokhio.\nHe said anti-Pakistan elements wanted to sabotage the Organization of Islamic Cooperation Foreign Ministers summit but our armed forces, Rangers, FC and administration foiled their all such designs.\nReplying to a question, the minister said that he had advised the PM to impose Governor’s rule in Sindh and declare emergency but the PM rejected his advised.\nKeeping in view immense popularity of Imran Khan, he said that he advised the PM to go far early general elections after passage of poor-friendly and welfare oriented budget for year 2022-23.\nTo another question, he said the army chief would complete its tenure.",
  "retrievedAt": "2025-08-11T14:37:00.633Z"
}
