{
  "title": "‘Three rodents’ out to attack country’s sovereignty: Fawad",
  "link": "https://www.app.com.pk/national/three-rodents-out-to-attack-countrys-sovereignty-fawad/",
  "date_published": "2022-03-26T20:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 27 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain on Saturday came down hard on the trio of opposition parties’ leaders including Shehbaz Sharif, Asif Ali Zardari and Maulana Fazlur Rehman for getting united against independent foreign policy and the country’s sovereignty.\n“Three rodents, who got united against the independent foreign policy, are now out to attack sovereignty of Pakistan,” he said while talking to the media persons here at the Parade Ground where swathes of people have already arrived to attend the Pakistan Tehreek-e-Insaf (PTI) historic public gathering named after “Amr-bil-Maruf” [Enjoining the right].\nFlanked by Special Assistant to the Prime Minister on Political Communication Shahbaz Gill and PTI senior leader Aamer Mehmood Kiani, he lashed out at the opposition leaders for joining forces against Prime Minister Imran Khan who did not only want the country to lead the Muslim Ummah, but also made serious efforts for making it to the fortress of Islam.\nThey would not get a way out as the entire nation stood by the prime minister for his passion for the welfare of masses, he added.\nThe spirit and passion of PTI workers were unprecedented, he said, praying to the Almighty to keep it alive.\nHe also prayed for safety of Pakistan and PM Imran Khan and said this spirit and passion of workers were associated with the prime minister.\nThe minister said the PTI caravans were marching towards the Federal Capital from across the country to express solidarity with the prime minister ahead of the no-trust motion.\nHighlighting the prime minister’s initiatives at the diplomatic front, he said the country had an independent foreign policy and there was nothing on the earth that could buy or threaten Pakistan.\nHe said the entire nation was proud of Prime Minister Imran Khan.\nOn the occasion, SAPM Shahbaz Gill said the Parade Ground was already brimming with children, women and youngsters even a day before the PTI’s historic public gathering.\nPTI leader Amir Kiani said the response of PTI workers to the prime minister’s call was “unbelievable”.\nEarlier, Information Minister Fawad Hussain reviewed the arrangements for the PTI’s historic public gathering scheduled to be held on Sunday.",
  "retrievedAt": "2025-08-11T14:37:03.875Z"
}
