{
  "title": "President links development of women with effective communication",
  "link": "https://www.app.com.pk/national/president-links-development-of-women-with-effective-communication/",
  "date_published": "2022-03-27T15:19:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 27 (APP): President Dr. Arif Alvi has said that the art of communication is vital to empower the women and put them to the path of development.\nWhile addressing the concluding ceremony of the 2nd annual conference on the development discourses and critiques at the IBA city campus here on Sunday, he said that the effective communication plays an important role in the development.\nHe said that some people could not adjust themselves to meet the needs of communication.\nThe President said that there are some tools and we have to acquire them to achieve our goals.\nHe further said that tool sets are available to improve the food production and health system.\nThe President said that it is the common perception in our society that the molvis are playing their role as obstacle to controlling population in the country, which is wrong. He said that they (Molvis) are here to help us.\nHe further said that there are 9 millions pregnancies in the country in a year and out of them 4 millions are unwanted.\nThe President said that the women are not provided with equal rights even in the West.He said that the women have talent and they get admission into medical colleges 70 to 80 percent on merit in Pakistan.\nHe said that the effective communication is need of the hour to cope the challenges coming on the way to development.\nEarlier, Executive Director of the IBA, S Akbar Zaidi welcomed the President Dr. Arif Alvi to the Conference and said that they had very diverse discussions during the conference.\nHe said that tiny to big issues have been tried to cover in the development conference including the discussions on the disability. He further said that the representation of the women has also been ensured.",
  "retrievedAt": "2025-08-11T14:36:58.946Z"
}
