{
  "title": "Dog leads police to owner’s killers in Sahiwal - Pakistan - DAWN.COM",
  "author": null,
  "content": "SAHIWAL: The relentless efforts of a pet dog to dig through a heap of burnt garbage led villagers and Okanwala Bangla police to solve the mystery of the brutal murder of Umer Hayat, an agricultural labourer.\n\nInvestigations revealed that Umer’s wife Shamim and her brother, Fida Hussain, were guilty of murdering him, disfiguring his face, and disposing of his body in a nearby garbage heap, which they set on fire to conceal the crime.\n\nThe police arrested both suspects on Monday and nominated them in the case filed on Feb 18.\n\nThe murder occurred in village 105/12-L, Tehsil Chichawatni, between the nights of Feb 13 and 14. On Feb 18, a pet dog unearthed Umer’s feet from the burnt garbage, alerting villagers and landlord Nadeem Abbas Shah, at whose farmhouse Umer was employed.\n\nAccording to reports, Syed Bilal Nawaz, a resident of the village, called the police emergency line (15) on Feb 18 after noticing human feet at the burnt garbage. Villagers had observed the pet dog digging the heap.\n\nThe Okanwala Bangla police rushed to the scene and recovered a severely damaged, unidentifiable body from the burnt garbage.\n\nSahiwal DPO Rana Tahir formed an investigation team led by DSP Taseer Riaz and Station House Officer Shahzad Ahmed. Despite forensic and autopsy, the body’s identity remained unknown.\n\nFollowing a tip from villagers and further investigation, the police traced Umer Hayat’s last known residence at Nadeem Abbas Shah’s farmhouse.\n\nUmer alias Multani had been working with his wife Shamim and their four children at the farmhouse for the past two years. He belonged to Multan, while Shamim was from Khanewal. They had been married for 15 years and had four children.\n\nA few days before the body’s discovery, Nadeem Abbas Shah informed the police that Umer and his family had left his employment and returned to their hometown in Tehsil Jahaniya, Khanewal.\n\nOn Feb 18, the police registered a murder case against unknown persons. Before burial, the police contacted Umer’s mother in Multan to check if any family member was missing. She reported that her son had disappeared from the farmhouse. When police showed her the feet, she initially denied it was her son. Shamim also denied recognising the feet.\n\nHowever, police questioned both families on why they had not reported Umer’s disappearance.\n\nDNA samples were taken from Umer’s mother and the deceased for confirmation. A few days later, Umer’s mother called the police and identified the feet as her son’s.\n\nUpon further investigation, police learned that Shamim had claimed she left the farmhouse with Umer and their children on Feb 12. However, inquiries in village 157/10-R revealed that Shamim had arrived there alone with her children and brother Fida Hussain without Umer.\n\nFurther probe discovered that both Umer and his wife Shamim had allegedly affairs.\n\nShamim confessed that Umer confronted her about the affair a week before his murder, leading to a violent altercation. Seeking revenge, Shamim called her brother Fida, and together they murdered Umer. They disfigured his face with an iron rod and bricks, shifted the body to a garbage heap, and set it on fire to destroy the evidence.\n\nSHO Shahzad Ahmed confirmed that both Shamim and Fida have been arrested, and their case has been completed for trial.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:26:08.649Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900199/dog-leads-police-to-owners-killers-in-sahiwal",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T03:27:11.000Z"
}
