{
  "title": "Supreme Court acquits suspect in 2008 Pakistan Ordnance Factory bomb blast case - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Supreme Court has acquitted of all charges a suspected bomber for his alleged involvement in the Aug 2008 bomb blast outside the Pakistan Ordnance Factory (POF) in which 69 people were killed.\n\nThe suspect was acquitted after the top court extended him the benefit of the doubt, deciding that the conviction and sentences handed down by the trial court and upheld by the high court were not sustainable.\n\n“The prosecution did not bring on record any evidence to establish that the appellant was a member of any proscribed organisation nor that he was motivated by or working for a terrorist group,” observed Justice Athar Minallah in a judgement while extending relief to him. The verdict was issued by the court last week.\n\nJustice Athar Minallah was heading a three-judge Supreme Court bench that had taken up an appeal by Hameedullah against the Feb 1, 2016 decision of the Rawalpindi Bench of the Lahore High Court of upholding his conviction and confirmation of death sentence on a jail petition.\n\nJustice Minallah says prosecution failed to provide concrete proof, points out inconsistencies in evidence\n\nHameedullah was apprehended by military personnel and accused of being part of the attack. Witnesses claimed he was wearing an explosive jacket and carrying a hand grenade, but key details of his arrest and the evidence against him were riddled with inconsistencies.\n\nThe prosecution’s case relied heavily on the testimonies of Subedar Major Ghulam Rasool and Subedar Muhammad Rafique, who stated they captured Hameedullah at the scene.\n\nHowever, their accounts conflicted — one said Hameedullah tried to detonate his jacket, while the other claimed he did not. Neither witness had expertise in handling explosives, raising doubts about how they safely removed the jacket before the police arrived, the judgement explained.\n\nIt would be appropriate for us not to make any observation regarding the alleged recovery of explosives from District Akora Khattak lest it may prejudice the trial pending before a competent court pursuant to registration of a separate criminal case, the judgement said, adding the prosecution had failed to discharge its obligation of proving the guilt of the appellant beyond a reasonable doubt.\n\nIt does not appeal to a prudent mind that the appellant and the complainant, who were 30 paces from another suicide bomber who detonated the suicide jacket, would remain unscathed, the judgement explained.\n\nIt was an incident in which the impact and its harm were seen much further than 30 paces, the judgement highlighted, adding the prosecution was required to establish that the jacket was laden with explosives and that the two grenades contained explosives.\n\nThe prosecution did not send the jacket and the grenades for analysis to a notified forensic laboratory, the judge further observed.\n\nOn Aug 27, 2008, the jacket, two grenades and pellets were sent to the District Civil Defence, Rawalpindi, which examined the items and sent a report the same day.\n\nThere is nothing on record to show that the explosives were sent to a notified laboratory or that the District Civil Defence Rawalpindi was an established expert, having appropriate facilities to give a conclusive opinion, the judgement explained.\n\nLikewise, the prosecution did not bring on record any evidence to establish that the appellant was a member of a proscribed organisation nor that he was motivated by or was working for a terrorist group, it added.\n\nJustice Athar Minallah said even a single reasonable doubt warrants acquittal. With no concrete proof linking Hameedullah to the attacks or a terrorist outfit, the court overturned his conviction, declaring him innocent due to insufficient evidence.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:26:21.178Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900108/supreme-court-acquits-suspect-in-2008-pakistan-ordnance-factory-bomb-blast-case",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T00:46:30.000Z"
}
