{
  "title": "First Black Republican congresswoman dies - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Mia Love, the first Black Repu­blican Congress­woman, has died after a three-year battle with brain cancer, her family wrote on social media. She was 49.\n\nLove died on Sunday surrounded by her family. “With grateful hearts filled to overflowing for the profound influence of Mia on our lives, we want you to know that she passed away peacefully today,” the family wrote.\n\nLove was born Ludmya Bourdeau to Haitian immigrants on Dec 6, 1975 in New York City. After earning a degree in fine arts from the University of Hartford, she converted from Catholicism to the Church of Jesus Christ of Latter-day Saints and moved to Utah.\n\nIn college, she met Jason Love. The couple reconnected in Utah, married and had three daughters. She was elected to the city council in Saratoga Springs, Utah, in 2003 and then was elected mayor in 2009 as a proponent of smaller government during the recession of the late 2000s.\n\n“I wasnt elected in Saratoga Springs because of my race or my gender or my heels,” she said in 2013, according to her biography on the United States House of Representatives website. I was elected by the people there because I had a plan and a vision to get us financially stable.\n\nIn 2014, Love was elected to Congress, becom­ing the first Black Republican Congress­woman and first black lawmaker representing the state of Utah. She represented the 4th Congressional District in Utah from 2015 to 2019 in Congress, where she served on several committees including the House Financial Services Commit­tee. After losing in the 2018 midterm elections, Love became a political commentator for CNN and served as an elector for Utah in the 2020 Electoral College.\n\nIn 2022, she was diagnosed with a glioblastoma, a malignant brain tumor. Utah Governor Spencer Cox said he was “heartbroken” after learning of her death, calling her a “true friend” in a post on X.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e1f55b6b85f.gif",
  "retrievedAt": "2025-10-12T02:10:01.851Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900159/first-black-republican-congresswoman-dies",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T00:46:10.000Z"
}
