{
  "title": "Dearth of drugs takes its toll on bosses of another hospital - Newspaper - DAWN.COM",
  "author": null,
  "content": "LAHORE: Chief Minister Maryam Nawaz on Monday sacked the principal and the medical superintendent of another major health facility in Lahore mainly over non-availability of medicines.\n\nDuring a visit to the Jinnah Hospital, the CM expressed her severe indignation over the complaints of some patients for being deprived of medicines despite their [purported] ‘availability’ in the store of the facility. Following their complaints, she ordered removal of Jinnah Hospital principal Prof Asghar Naqi and medical superintendent (MS) Prof Kashif Jahangir from their posts.\n\nEarly this month, the CM had removed Mayo Hospital Lahore chief executive officer (CEO) Dr Asghar Nauman and MS Prof Dr Faisal Masood from their posts on complaints of some patients regarding the non-availability of medicines, besides poor treatment and sanitation conditions.\n\nA video clip showing the CM snubbing Prof Masood had drawn widespread criticism for “public humiliation” of a senior doctor, with some suggesting she should empower and task the health ministers to improve the service delivery at public hospitals in the province instead of indulging in “political stunts”.\n\nCM sacks Jinnah’s principal, MS; orders making checklist reports of hospitals daily\n\nOn Monday’s visit to the Jinnah Hospital, the CM interacted with a good number of patients inquiring them about the availability of medicines and treatment facilities including medical tests. Most patients complained about not getting medicines even in the emergency. Uncleanliness was another issue at the hospital.\n\nIt merits mentioning that the Jinnah Model Pharmacy (JMP) of Jinnah Hospital was facing a ‘closure’ due to Rs140 million in outstanding payments. The hospital administration had accused the vendor of overbilling under various heads, including medicines, medical devices and other items.\n\nThe vendor suspended the supply of medicines and equipment to critical patients. The delayed payment issue has been persisting for over a year. Similarly, in the case of Mayo Hospital it transpired that the medical superintendent had already tendered his resignation following Rs3.5bn pending liabilities of the institute and requested the government many times for release of the funds.\n\nFollowing reports that the public hospitals in the province are facing funds shortage, the CM on Monday also directed the authorities concerned to ensure immediate payment of dues of these health facilities. She further directed to take immediate steps for the provision of free medicines to the public sector hospitals.\n\nThe CM also presided over a meeting to review administrative affairs of the Mayo Hospital.\n\nShe directed to display medicines list in every government hospital on electronic boards. She also ordered to activate and highlight ‘Maryam Nawaz Complaint Counters’ in all government hospitals besides providing mist fans in the open waiting areas.\n\nShe directed the authorities concerned to visit the hospitals on a daily basis and prepare a checklist report. “More than one organisation will prepare a checklist to know the actual situation of hospitals. The checklist will include doctors, staff attendance, free medicines, lab tests, biomedical equipment.”\n\nThe CM also directed to ensure monitoring of the waiting lists for operations and tests in the public hospitals. Availability of parking facility, cafeteria and wheelchairs should also be checked on a daily basis.\n\nThe CM also ordered replacing worn-out curtains with blinds in wards which caused infection.\n\nShe directed the healthcare commission to conduct a quality audit of the laboratories of public hospitals.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:26:04.961Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900209",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T03:38:45.000Z"
}
