{
  "title": "US aid cut to hamper TB control efforts in Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: With 510,000 new cases each year, Pakistan ranks fifth among countries with the most cases of tuberculosis, but recent aid cuts by the US threaten to upend efforts to control the disease in the country.\n\nIn a statement on World TB Day observed on Monday, the World Health Organisation (WHO) said Pakistan makes up for 61pc of all cases in the Eastern Mediterranean Region (EMR).\n\nGlobally, the WHO estimated that 1.25 million children and young adolescents (aged 0 to 14) fall ill with TB each year, with nearly 600 children dying every day from the preventable and treatable disease.\n\nIn Pakistan alone, an estimated 81,000 children develop TB each year, often with subtle symptoms that delay diagnosis until the disease has advanced.\n\nThe statement issued by WHO claimed that in EMR, a person is diagnosed with TB every 34 seconds and every six minutes, a life is lost.\n\nCountry reports over 0.5m new cases each year; MSF calls upon govt, intl donors to make up for funding gap\n\nTB spreads rapidly in refugee camps, slums, and among displaced people with weakened immune systems.\n\nWhile Pakistan has the highest number of cases in the region, countries like Afghanistan, Somalia, Morocco and Sudan also face significant challenges.\n\n“It is ironic that the world is still struggling to control a disease that has existed for 4,000 years,” the statement added.\n\nIt warned that Drug-resistant TB (MDR-TB) was becoming more common, making diagnosis and treatment more difficult.\n\nMDR-TB required complex, long-term care, yet many healthcare workers lacked the training to manage it.\n\n“TB remains the world’s deadliest infectious disease. Even during the Covid-19 pandemic, TB caused more deaths, claiming over 1.2 million lives annually.”\n\nThe WHO warned that if TB detection remained inadequate and drug-resistant strains continued to spread, “we could witness a historic rise in deaths and illnesses”.\n\nAccording to the WHO, progress has been made worldwide in TB control, but EMR has lagged behind.\n\nTACTiC initiative\n\nDoctors Without Borders (MSF), an NGO, has urged governments and international donors to prioritise sustained investments in diagnosing, treating, and preventing TB with a critical focus on children.\n\nIn 2024, MSF launched the groundbreaking TACTiC initiative “Test, Avoid, Cure TB in Children” to adopt the latest WHO guidelines for pediatric TB management in Pakistan.\n\nThe programme began in Gujranwala, with a targeted household contact screening campaign enrolling 42 children under 15 for early intervention.\n\nBuilding on this success, in March 2025 MSF inaugurated a decentralised model of care at the Baldia Rural Health Centre in Karachi.\n\nIt offers a comprehensive package of pediatric TB services, including on-site screening, advanced diagnostics, tailored treatment regimens and preventive treatment supported by mobile chest clinics and community outreach efforts to identify high-risk contacts and raise awareness, MSF stated.\n\n“Children with TB are our most vulnerable patients, yet their symptoms are often so subtle that diagnosis is delayed until it is too late and has become life-threatening,” said Dr Ei Hnin Hnin Phyu, the medical coordinator for MSF Pakistan.\n\n“Through TACTiC, we are detecting TB early and providing timely, life-saving treatment and prevention, giving these children a chance to thrive.”\n\nAid cuts\n\nHowever, efforts to control TB are under threat due to the recent funding cuts by the US, which contributes over half of all international TB funding.\n\nDue to the cuts, only 26 per cent of the $22 billion annual target has been met.\n\nThis shortfall jeopardises essential community-based services that drive active case finding, high-risk family screening, and TB preventive treatment for children, MSF reported.\n\nMSF teams in Sindh reported that these cuts were undermining critical screening and treatment services.\n\nDr Cathy Hewison, the head of MSF’s TB Working Group, called upon all countries and international donors to step up and ensure sustained funding for TB care for all, especially young children.\n\nThe Pakistan Medical Association (PMA) has raised alarm over the number of TB cases in the country.\n\nThe PMA has emphasised the urgent need for more investment in combating the deadly disease.\n\nPMA Secretary General Dr Abdul Ghafoor Shoro called for enhanced funding for innovative diagnostic tools, treatment regimens, and preventive strategies tailored to the Pakistani population.\n\n“Tackling poverty, malnutrition, and poor living conditions, which are significant risk factors for TB, are critical for long-term control of the disease,” Mr Shoro added.\n\nHe said the government, international organisations, and public should join hands in the fight against TB.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:26:39.734Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900170/us-aid-cut-to-hamper-tb-control-efforts-in-pakistan",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T00:45:51.000Z"
}
