{
  "title": "The curious case of Karachi’s Hotel Metropole ‘renovation’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: There is construction work underway at Hotel Metropole, or what’s left of it. Green construction netting shrouds the scaffolding making one wonder about what is being built.\n\nThe crumpling structures on its other end facing Sharea Faisal where there used to be an old cinema house and a once popular open-air restaurant have been bulldozed with diggers at work. A new wall and gate have come up to prevent entry from that side. Uniformed guards there stay vigilant round the clock.\n\nThey say they don’t know what is being constructed there, but visitors are not welcome. Still one can get a view of what remains of Hotel Metropole after it was sliced into half with one side demolished. The hotel was built around an open area in the centre.\n\nThis vast courtyard had a lawn not visible from the outer side. But after half of the hotel was demolished, the open area did serve as a makeshift marriage lawn and a parking area for several years, a far cry from the glamorous programmes that used to be held there once upon a time.\n\nThat was when Karachi had even less than a handful of big hotels to boast of. Hotel Metropole among them just could not have missed. It was big, it was majestic, it was situated on a traffic island. The hotel also had two very similar looking grand glass door entrances on each of its two broader sides, one of which faced Sind Club and the other the Services Mess.\n\nThe hotel land said to be acquired in phases by Cyrus Minwalla even before the creation of Pakistan had, and still has, the most ideal location.\n\nBuilt in 1951, the hotel was inaugurated by the Shahenshah of Iran. Besides holding glamorous functions, parties and programmes it also housed offices and culture centres such as the German Reading Room, which later grew into the Goethe Institut. The outer road-facing shops on the ground floor housed restaurants, shops and airline offices including Pan Am and Cathay Pacific. In fact, the owner’s son, Darayus Cyrus Minwalla, popularly known as Happy Minwalla, owned the Cathay Pacific agency in Pakistan.\n\nBut for years now Hotel Metropole has remained in ruins that remind of images of the Colosseum in Rome, Italy, not the grand hotel that it once was. The demolition was started in the early 2000s. The place was sold off by the Minwallas in 2017 to the Mega Conglomerate Pvt Ltd, a company owned by business tycoon Habibullah Khan.\n\nThereafter, there was talk of a six-star hotel coming up here. But that was possible only if the occupants of the remaining building would vacate it, which was not easy. The new owners still face that issue with around four occupants holding ground. They claim to have legal rights.\n\nIn 2019, the Sindh government had decided to acquire the hotel land to prevent the construction of the high-rise on its place and instead develop a modern park for children and elderly people. However, the plan could not materialise till date.\n\nZahid Hassan of Habib Carpets on the Sind Club side says he got his shop on pagri (a rental system) 56 years ago.\n\n“There have been efforts to make us vacate our shops here but we sought justice against it in the court of law,” Mr Hassan told Dawn. “When the owners appealed in the Supreme Court, the case once again was decided in our favour.”\n\n“So now we hear that the portion owned by the Mega Conglomerate will have a new showroom. That’s what is being constructed where there is digging underway,” he said.\n\nAs for the old remaining side of the hotel building, there is only renovation work going on there. “Since the building looks like a skeleton with no window frames and also plaster coming off, it is now going to get a fresh look to keep it from looking like an eyesore that will spoil the look of the new showroom,” the shop owner pointed out.\n\nMeanwhile, no one at the Mega Conglomerate Pvt Ltd was available for comment. Dawn emailed them to receive no response for three days. There was also no one attending their five landlines.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e1e973bc11b.gif",
  "retrievedAt": "2025-08-25T15:26:22.192Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900132/the-curious-case-of-karachis-hotel-metropole-renovation",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T00:46:17.000Z"
}
