{
  "title": "Partial curfew slapped in Upper South Waziristan - Pakistan - DAWN.COM",
  "author": null,
  "content": "SOUTH WAZIRISTAN: Authorities once again imposed a partial curfew in the Upper South Waziristan tribal district on Monday due to security concerns.\n\nThe curfew will be effective from 6am to 6pm, according to an official notification issued here on Monday evening.\n\nDuring the period of ban, the movement of people and vehicles will be restricted on three key roads, including those from Azizabad Chowk to Sarvekai and Jandola to traffic, from Asman Manza and Ladha to Makin, from Bi Bi Raghzai to Kotkai and Jandola, and from Barwand to Mouley Khan Sarai.\n\nDeputy Commissioner Saleem Jan urged people to use alternative routes to avoid any inconvenience.\n\nAuthorities cite security concerns as reason for the move\n\nA similar curfew was imposed last Monday in both Upper and Lower South Waziristan districts due to high-security risks.\n\nDIALYSIS SERVICES SUSPENDED: More than 50 dialysis patients in South Waziristan are facing serious challenges due to the suspension of dialysis services in the region.\n\nDuring a news conference at the Wana Press Club on Monday, the relatives of kidney patients, accompanied by local residents, urged the government to urgently restore the services.\n\nThey resented the suspension of dialysis services at the district headquarters hospital in Wana.\n\nThe relatives said due to the suspension of salary payment to doctors, the hospital, except for the emergency department, had effectively shut down.\n\nThe situation has left dialysis patients without treatment options, forcing many to rely on Sholam Hospital for treatment.\n\nThe relatives warned that while Sholam Hospital could accommodate dialysis patients until March 25, the facility would close if the pending salaries were not cleared.\n\nThey complained that a lack of dialysis services would leave over 50 patients in desperate need of treatment and could cause severe health complications.\n\nThe families warned that if no action was taken by the government, they would launch a street protest for an indefinite period along with patients at the Jawed Sultan Camp after March 25.\n\nThey urged Chief Minister Ali Amin Khan Gandapur, MNA Zubair Khan and MPA Ajab Gul to take immediate and decisive steps to ensure permanent dialysis services at both Wana DHQ Hospital and Sholam Hospital.\n\nThe families pointed out that there was an urgent need for the government to address the critical issue and ensure that the dialysis patients in the South Waziristan region receive the essential medical care they need.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:09:54.902Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900090/partial-curfew-slapped-in-upper-south-waziristan",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T00:46:52.000Z"
}
