{
  "title": "The view from Aurangzeb’s grave - World - DAWN.COM",
  "author": null,
  "content": "WHAT else was happening in the world when Mughals ruled India from 1526 till Aurangzeb’s death in 1707? The strange question flows from stranger demands by Hindu nationalists to raze his nondescript grave in Aurangabad.\n\nWas he that evil? Should Britons then campaign to have the crypt of Henry VIII blown up for his ghastly abuse and murder of the hapless women he married? The psychopathic Briton was a contemporary of Babar and Humayun, India’s first Mughal rulers, one a poet as glimpsed in his fabled memoirs, the other an incorrigible mystic.\n\nHindutva ideologues have been traditionally incensed with India’s Muslim rulers, usually for no better reason than Hitler had for hating Jews or Netanyahu’s genocidal impulse towards Palestinians. Without softening their criticism for cruel rulers at home, the BJP might usefully ponder what they are missing out in their ideas about cruel usurpers. Let their hatred of Aurangzeb remain intact if it helps them take a cursory look at the time the Europeans arrived on American shores three decades ahead of Babar’s inauguration as India’s first Mughal king.\n\nThe European rulers authorised over 1,500 wars, attacks and raids on native Indians, said to be the most brutal of any country in the world against its indigenous people. According to historical accounts, by the close of the so-called ‘Indian Wars’ in the late 19th century, fewer than 250,000 Indigenous people remained from the estimated 10 million living in North America when Columbus arrived in 1492.\n\nThere was another event that took place in 1707, one that evidently remains more relevant for the world today than a dead Mughal emperor buried in a distant grave. England and Scotland united to create Great Britain that year. The marriage of convenience had reverberations across the Western world and impacted the consolidation of British rule in America. However, the forced union has been up for divorce ever since, surviving several close calls by nationalist Scots seeking independence. The Scots want to correct a historical wrong. What is the Hindu right hoping to achieve by digging up a 300-year-old grave?\n\nTrue, Prime Minister Modi’s worldview regards Aurangzeb as an anti-Hindu zealot who imposed protection tax on non-Muslims. Fair enough. Professional historians don’t disagree that he had the narrowest of visions among the Mughals to rule a multicultural country like India. But historians also offer an opposite evidence, that of the Muslim ruler’s generous grants to Hindu temples even as he destroyed some others.\n\nTruth be told, nobody was bothered by Aurangzeb or his grave till the BJP fanned it into a communal frenzy for its patently cynical politics. The party’s communal mobilisation was helped along by a dubious Hindi movie, applauded and backed by the Modi establishment. The movie Chaava depicts Aurangzeb’s brutal murder of Maratha warrior king Sambhaji but it ignores crucial bits of history to construct a communally polarising story, not the first in Hindutva’s quiver.\n\nThe question is who the ideal ruler was, which Aurangzeb was not. Some say it was Akbar, but the Hindu right hates him with often greater zeal.\n\nLet’s grant for the sake of respite for Aurangzeb’s charged up critics that the Mughal emperor was a terrible ruler. He killed his religiously eclectic elder brother Dara Shikoh to ascend the throne. He fought peasant rebellions led by Sikhs, Marathas and Jats.\n\nHowever, the Muslim zealot had a flaw in his zealotry. He kept high-level Hindu generals in his army. And there was at least one significant moment when his alleged anti-Hindu zeal took a pause, and he assaulted fellow Muslim rulers in Bijapur and Golconda. Also, while he executed the revered Sikh Guru Tegh Bahadur, he decapitated Shah Sarmad just as gruesomely when the ‘naked mystic’ challenged the court’s puritan culture.\n\nThe assassinations bear a striking resemblance to T.S. Eliot’s account of Henry II’s killing of Archbishop Thomas Beckett, which the poet describes in the play Murder in the Cathedral. Sarmad, a Persian-speaking Armenian Sufi, was said to be a Jewish interloper who converted to Islam though only to be denounced as a heretic by Aurangzeb’s orthodox advisers. Sarmad’s grave abuts the Jama Masjid in Delhi and is popular with men and women of different faiths visiting there to seek boons.\n\nThe question is who the ideal ruler was, which Aurangzeb was not. Some say it was Akbar, but the Hindu right hates him with equal and often greater zeal. Not that Muslim puritans harbour much love for Akbar who they consider a traitor for being open-minded towards other religions.\n\nWas there a Hindu ruler then who did not fight Hindu rulers, or was the task left to Muslims alone? What does one make of the fact that Chandragupta Maurya and his fabled strategist Chanakya battled the Nanda rulers of Magadh and defeated them by deceit? Did Chanakya distinguish between Hindu and non-Hindu challengers to Chandragupta? It’s as fictional as saying Muslim kings were more forgiving with Muslim challengers.\n\nHow do we explain the clamour to destroy an old grave in Aurangabad now in Maharashtra? Suppose the campaign never happened. What would then be making the headlines? There are several chestnuts in the fire. The economy is riding choppy seas, not made any easier by Donald Trump’s threat to slap high tariffs. Elections are due in the crucial state of Bihar later in the year.\n\nAurangzeb had a historical connection with the region and polarisation could benefit the BJP. Possibly the likeliest reason for targeting Aurangzeb today lies in the Brahmin-Maratha rivalry for power in Maharashtra. The current state chief minister is a BJP Brahmin who curiously replaced a Maratha ally who is said to be fuming.\n\nThe movie has been accused of portraying Maratha rivals as betraying the Maratha ruler Sambhaji to Aurangzeb. Professional historians say the conspirators were Brahmins. The violence obfuscates the embarrassing detail. The movie is doing well, and Aurangzeb is in no condition to change the script, leave alone protect his grave.\n\nThe writer is Dawn’s correspondent in Delhi.\n\njawednaqvi@gmail.com\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e21f780b40e.png",
  "retrievedAt": "2025-10-12T02:10:05.869Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900185/the-view-from-aurangzebs-grave",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T03:15:19.000Z"
}
