{
  "title": "President, PM express condolences over demise of army chief Gen Munir’s mother - Pakistan - DAWN.COM",
  "author": null,
  "content": "The mother of Chief Of Army Staff (COAS) General Asim Munir has passed away, with leaders across the country expressing their condolences, state media reported on Tuesday morning.\n\nPresident Asif Ali Zardari and Prime Minister Shehbaz Sharif conveyed their heartfelt condolence to the army chief, according to the state-run Associated Press of Pakistan.\n\n“We share the grief of General Syed Asim Munir over his mother’s passing. My heartfelt condolences go out to the bereaved family during this difficult time,” the president said in a statement.\n\nHe prayed for the departed soul and strength for the military chief’s family to bear the loss.\n\nIn his statement, PM Shehbaz also extended his condolences and prayed for the “eternal peace of the departed soul”.\n\nJamiat Ulema-i-Islam (JUI-F) chief Maulana Fazlur Rehman also prayed that the deceased gets the highest rank in Jannah, according to a post on X by his party.\n\nFazl noted that losing a “compassionate and loving person such as one’s mother is surely a big shock”. “There is no alternative for a mother.”\n\nThe JUI-F chief said passing away in the holy month of Ramazan would “surely be a reason for elevated ranks”.\n\nPPP Chairman Bilawal Bhutto-Zardari expressed his deep grief over the demise.\n\n“Losing one’s mother is the greatest shock of one’s life,” Bilawal was quoted as saying on his party’s X account.\n\nHe prayed for the army chief and his family to bear the loss with patience and courage.\n\nPlanning Minister Ahsan Iqbal, Information Minister Attaullah Tarar, Minister of State Armaghan Subhani, Sindh Governor Kamran Tessori, Sindh Chief Minister Murad Ali Shah, Khyber Pakhtunkhwa Governor Faisal Karim Kundi, Senate Chairman Yousaf Raza Gilani, among others, also expressed their condolences.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/25091819ae639d6.png",
  "retrievedAt": "2025-08-25T15:26:08.777Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900216/president-pm-express-condolences-over-demise-of-army-chief-gen-munirs-mother",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T04:05:52.000Z"
}
