{
  "title": "Shortcut tactics - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE IMF is reported to have blocked a government move to ‘substantially’ slash retail electricity prices, pre-empting the announcement of the cut the prime minister was supposed to have made in his Pakistan Day address. Resultantly, consumers, particularly low-middle-income households battered by runaway inflation, were not only denied the promised relief of Rs8 per unit of electricity, they have been further burdened with a per litre increase of Rs10 in the petroleum levy.\n\nA report in this paper says that a plan was shared with the IMF staff mission, during the recently concluded performance review of the Fund’s $7bn loan, for an approximately Rs2 per unit tariff reduction on account of ‘savings’ from the revision of power purchase contracts with a group of selected IPPs. As an afterthought, the authorities had increased the petroleum levy to a maximum of Rs70 to divert the additional revenues to maximise relief in power tariffs.\n\nThat the lender is reviewing, if not making, crucial decisions shows how much this country has come to rely on it for loans, thanks to decades of bad policy choices and elite greed. True, this kind of ‘oversight’ by a global lender appears to be intrusive, and impinges on sovereignty. But in the context of states where ruling elites habitually ditch reforms to make politically motivated, selfish policy choices for their own economic and financial benefit, it may be a necessary compromise.\n\nOn the face of it, the IMF’s decision to veto the move to reduce retail power tariffs seems to be against the interests of middle-class consumers whose electricity bills have outpaced their home rental rates following the 18pc increase last July as a prior action for agreement with the lender for its support to the wobbly economy. The IMF has not only blocked the tariff reduction move; it has also stopped policymakers from cutting federal transaction taxes on real estate, which the government is desperate to implement to please the powerful property tycoons.\n\nThe base prices of electricity have risen by more than 150pc since 2021. We have expensive electricity because of several factors, including but not limited to transmission and distribution inefficiencies, power theft, rampant corruption in and mismanagement of distribution companies, over-dependence on imported fossil fuels for generation, the absence of a competitive energy market, low penetration of renewable solar and wind energy and unviable power purchase agreements. While the government’s effort to reduce power prices is commendable given the impact on the public and small businesses, the attempts to slash one burden and increase the other is not a sound policy choice. Long-term, sustainable tariff reduction demands that policymakers address the deep-seated structural issues plaguing the power sector rather than finding shortcuts to please the electorate for political gains.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:26:09.932Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900179/shortcut-tactics",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T02:56:02.000Z"
}
