{
  "title": "Sammi, 4 others detained in Karachi for a month under MPO - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Sindh government on Tuesday detained Baloch Yakjehti Committee (BYC) leader Sammi Deen Baloch and four others for 30 days under the Maintenance of Public Order (MPO) following the group’s protest in Karachi.\n\nKarachi police on Monday detained Sammi and several others for violating Section 144 and used force to break up the BYC’s protest against the recent arrests of its leadership and a crackdown on its Quetta sit-in.\n\nThe BYC had announced a protest at the Karachi Press Club (KPC) against the “illegal detention” of its key leaders, including Dr Mahrang Baloch who was arrested on Saturday along with 16 other activists from their protest camp in Quetta, a day after claiming that three protesters had died due to police action.\n\nIn Karachi, Artillery Maidan police booked Sammi and five other detained activists under Section 188 (disobedience to an order duly promulgated by a public servant) for violating Section 144.\n\nAccording to Tuesday’s order by the Sindh government’s home department, a copy of which is available with Dawn.com, the Sindh inspector general of police (IGP) had recommended had recommended a 30-day detention period for Sammi, Razzak Ali, Abdul Wahab Baloch, Shehdad and Sultan.\n\nThe order stated that the five were “instigating [the] public to block roads and organise sit-ins in Karachi, which may disturb peace and tranquility and can create serious law and order problems”.\n\nIt went on to say that the presence of the five people “is likely to pose grave threat to the public safety and can cause breach of peace and tranquility.”\n\nThe order further said that the Sindh government “has sufficient reasons to believe that the five people “[should] be arrested and detained for a period of 30 days from the date of arrest”.\n\nTheir custody shall be placed under the Central Prison Karachi senior superintendent, the order read.\n\nOn Tuesday afternoon, Sammi’s lawyer Jibran Nasir confirmed that she had been confined at Central Jail under the MPO issued and would be kept there for 30 days.\n\n“The learned judicial magistrate discharged all five accused in the FIR registered yesterday,” Jibran said in a post on X.\n\n“As soon as the accused were discharged and ordered to be released the police started waving the MPO order. While Sammi surrendered and willfully gave her arrest, the whereabouts of four others Lala Wahab, Raziq, Sultan and Shahdad are unknown,” he said.\n\nJibran added that he would be challenging the MPO in the Sindh High Court tomorrow.\n\nOther protesters detained on Monday were identified as Abdul Wahab, Mustafa Ali, Shahzad Rab, Hamza Iftikhar and Sultan Hamal.\n\nThe FIR registered on the complaint of a policeman stated that about 35-40 men and women arrived at Fawara Chowk and attempted to enter the Red Zone. The complainant said the police tried to prevent them, but the protesters allegedly entered the sensitive area forcibly.\n\nThe police took action and detained Sammi, Abdul Wahab and four other nominated persons, while others fled.\n\nAhead of the protest, the commissioner imposed Section 144, and all roads leading to the Karachi Press Club — the venue of the protest — were blocked with the help of temporary barriers.\n\nThis caused massive traffic jams in the city centre, where citizens remained stuck for hours and many of them were seen breaking their fast on the road.\n\nOn the other hand, two separate counter-protests were held in the nearby area, where participants held placards and chanted slogans against the BYC as well as the banned Balochistan Liberation Army (BLA).\n\nHowever, it was unclear under what arrangements the counter-protests were organised despite the imposition of Section 144.\n\nOne such protest was being held outside the KPC, with participants holding placards reading “a link to RAW: BLA and BYC”, referring to India’s intelligence agency Research and Analysis Wing.\n\nMore people had gathered at a petrol station near Zainab Market, with one of the placards reading “two sides of the same coin — BLA and BYC”.\n\nSome banners carried by protesters at the Fawara Chowk mentioned the Pakistan Ulema Council as the organiser.\n\nAnother demonstration was also held to show solidarity with the armed forces near Zainab Market. Videos of the protest showed protesters chanting slogans against the BYC leadership as well as BLA.\n\nDeputy Inspector General (DIG) South Syed Asad Raza told Dawn.com: “Some people were organising a counter-protest at Fawara Chowk; they were dispersed. Nobody is being allowed to organise public protests or assemblies in the light of notification by Commissioner Karachi.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/251341218aff2aa.jpg",
  "retrievedAt": "2025-08-25T15:26:06.167Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900238/sammi-4-others-detained-in-karachi-for-a-month-under-mpo",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T08:58:29.000Z"
}
