{
  "title": "BYC protest, section 144 and Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "All the roads leading to the Karachi Press Club are blocked with big, blue police vans. The city’s downtown is clogged and shut down; it’s a mess. That, and there is Section 144 imposed in District South — home to the aptly coined ‘red zone’. All of this, and more to follow for one reason: a protest that didn’t even last 50 minutes.\n\nOn this hot Monday afternoon, the petrol pump at the mouth of Zainab Market is crowded with young men and women. They are chatting among themselves — some confused, others with a look of familiar resignation on their faces.\n\nThe demonstration is organised by the Baloch Yakjehti Committee against the “illegal detention” of its members, including BYC chief organiser Mahrang Baloch in Quetta. They are to be joined by Karachi’s civil society members. The original venue was to be the Press Club but since all roads leading to it are blocked, the protesters gather wherever they can.\n\nMany of them carry posters of Dr Mahrang. “For her tireless advocacy against enforced disappearances, extrajudicial killings and systematic oppression in Balochistan,” it reads. “Nominated for the Nobel Peace Prize 2025,” it adds.\n\nA majority of the demonstrators are donned in a black chador with colourful stripes — similar to the one Mahrang is usually seen in — even the men. They have it wrapped around their head. But the men refuse to speak to the media. “Talk to the women,” they say.\n\nThe women, clad in traditional Balochi attire, are more welcoming. “We are here today to voice our protest against the arrest of Dr Mahrang. She is our red line and you have crossed it,” says *SB, a student at the University of Karachi.\n\nStanding next to her is another girl, younger. She doesn’t speak but stands resolutely in front of the press cameras. Her eyes look straight ahead, confident and fearless. Sammi Deen Baloch, BYC leader and general secretary of the Voice for Baloch Missing Persons, is there too.\n\n“Like every time, we see that all the roads to the press club are sealed, our colleagues are being threatened and there are also threats of illegal arrests,” she says. “Despite all this, we are trying our best to continue this protest.”\n\nOnce a sizeable crowd has gathered, the demonstrators try to move towards the middle of the road. “Zinda hay muzahimat zinda hay (resistance lives, resistance lives),” the ladies chant.\n\nThe men, meanwhile, surround them in a circle, almost like a barricade. However, from the get-go, the police are determined not to let the protest continue. They start closing in as soon as the protesters move onto the main road.\n\nSoon, the protective layer around the protesting women is broken and the police are seen dragging Sammi Deen. It is a tug of war, half of her is being pulled by the protesters, the other half by the police. “You’re not here to eat kebabs,” thunders one police officer at the women police personnel standing around the protesters. “Get in and start breaking them up,” he orders.\n\nFor the next half an hour — give or take — the protesters and the police seem to be moving through the traffic as if stuck on glue. The police, it appears, are focused on taking the BYC leaders into custody. The protesters, the majority of them women, would like to prevent this.\n\nThey resist for several minutes. There are several heated exchanges. “Do you have no shame?” the protesting women scream. “You are violating Section 144,” the female officers retort. The male officers, initially careful, are now closing in.\n\nAs the altercation continues, an elderly Baloch woman screams angrily at the police.\n\n“For Mahrang, for Sammi Deen, for all my Baloch sisters, I will sacrifice my life … not once but again and again,” says R*, the elderly Baloch woman originally hailing from Zhob district. For the last few years, she has called Karachi’s Rahman Garden her home.\n\nAs she tries to break through the crowd of protesters protecting Sammi Deen, she falls to the ground. One of her sandals flies to the other end of the road. But she is quick to stand back up — Razia is surprisingly agile for her age; or maybe it’s the adrenaline. “Who are you cowards fighting women?” she bellows.\n\nOther Baloch women run to her rescue. But the crowd, and the police on their tail, have moved forward. The argument continues. At that moment, a man comes running. “Disperse, they are planning to use tear gas,” he shouts and disappears as quickly as he appears.\n\nSuddenly, a minivan parks nearby. It was there since the beginning, but deliberately discreet. Now, its speakers are blasting. “India k dost humare dushman (India’s friends are our enemies),” they say. The occupants are carrying Pakistan’s flag. Their placards have the Pakistan Ulema Council inscribed on them.\n\nThey are, it seems, immune to the ambit of Section 144 — at several points, they are helped by police in moving forward.\n\nThrough the microphones, they also warn of taking matters into their own hands. The crowd is a little distracted, but the police aren’t. They seize the chance and throw Sammi and the women protecting her inside a police van. Off they go.\n\nThose left behind are sweaty now, and tired. Some run after those arrested, others sit on the nearby footpath, and the remaining are busy making phone calls. One by one, they all begin to leave.\n\nOn the other side, the men in the vans continue shouting slogans, now taking over the main road. Is Section 144 still imposed, Hajra Ahmed of the Women’s Democratic Front wonders aloud. “How can the state allow this and not us?”\n\n“These are the Baloch women whose brothers, sons, fathers and husbands were forcibly abducted from their homes. So they have to now speak for themselves and this [the BYC] is their movement,” she says. “But we are seeing how state oppression of them is increasing … the state is basically scared of their growing popularity.”\n\nOn the other hand, ZB*, a younger protester says she isn’t affiliated with any organisation but is only here for her fellow Baloch. “We have given up on the government; they just don’t want to listen to us,” she laments.\n\n“Every single time, we have only held a peaceful protest but they want to create drama. Why? What is their problem with peace?” ZB* demands.\n\nAs the BYC protest, which attracted less than 100 people — the vast majority of them women — dissipates, what it leaves in its wake is a soul-crushing traffic jam stretching from Mereweather Tower at II Chundrigar Road to Numaish Chowrangi. Hundreds are forced to break their fasts on the road with biscuits bought from nearby bakeries.\n\nThey join the odd dozen who are also breaking fast with Governor Kamran Tessori who has set up slides and swings outside the Governor’s House — a few steps away from the protest site.\n\nFinally, by 7pm, the road clears. At the Artillery Maidan police station, situated at a distance of five minutes, protesters are behind lockups.\n\nSome names have been withheld to protect privacy.\n\nHeader image: Protesters hold up Mahrang’s posters at a BYC demonstration in Karachi on March 24, 2025.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/242226032820aab.jpg",
  "retrievedAt": "2025-08-25T15:26:06.926Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900069/byc-protest-section-144-and-karachi",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T05:10:36.000Z"
}
