{
  "title": "Edhi Foundation funds $4m equipment at Karachi’s JPMC for free breast cancer treatment - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Edhi Foundation is funding breast cancer treatment equipment worth $4 million for Karachi’s Jinnah Postgraduate Medical Centre’s (JPMC) Breast Radiation Bay, named after Abdul Sattar and Bilquis Edhi.\n\nThe Edhi Foundation is the country’s premier social welfare organisation. The Bilquis & Abdul Sattar Edhi-Breast Radiation Bay is set to begin its services in April 2026 and will be jointly operated by the Patients Aid Foundation (PAF) and the Sindh government, according to a statement issued today from Dr Tariq Mahmood, professor emeritus of radiation oncology at JPMC.\n\n“Every day, 160 breast cancer patients will get free of charge treatment on state-of-the-art Helix Tomotherapy units,” it said.\n\nThe statement said the units would utilise new technology for accurate localisation of lesions and deliver radiation with zero risk of unnecessary exposure to the heart.\n\nIt added that the Sindh government had also pledged to provide funds needed for the repair and maintenance of the equipment after the expiry of its annual warranty to ensure smooth and efficient operations.\n\n“Breast cancer is a leading cause of death in females. Around 30,000 new breast cancer cases are diagnosed every year in Pakistan,” the statement said, adding that almost all cases of malignant breast cancer required surgery, chemotherapy and radiation treatment.\n\nIt pointed out that even though surgery and chemotherapy facilities were widely available in the public and private sectors, slots for radiation therapy were not available for the timely management of cancer due to the lack of availability of linear accelerators in the country.\n\n“Most of the centres in Pakistan, which are offering breast radiotherapy, are treating breast cancers with 2D/3D CRT, whereas the updated worldwide standard of care demands IMRT/VMAT radiotherapy and that is available at very few centres but the cost of treatment is beyond the reach of a common man,” it added.\n\nThe statement said that a new technology was introduced around the world to deliver radiation at an accurate site through Surface Guided Radiotherapy (SGRT) and Deep Inhalation Breath Hold (DIBH) to avoid unnecessary radiation exposure to healthy critical structures.\n\nIt said that to date, this technology was not available in Pakistan. “SGRT and DIBH saves women’s hearts from unnecessary exposure, and it is of extreme importance, especially in younger aged breast cancer patients,” the statement added.\n\nIt said PAF was working in a public-private partnership with the Sindh government and so far, JPMC’s bed capacity had been increased from 1,100 to 2,208 by constructing new buildings for various wards while outfitting them with the latest equipment and machinery, and ensuring their continuous maintenance.\n\nThe statement said that a further 600 bedded new projects were under completion.\n\nThe statement concluded by saying that JPCMC’s Radiation Oncology was the only centre in the world that offered “absolutely free of charge cancer treatment with cutting-edge technologies” irrespective of nationality, religion and ethnicity.\n\n“So far, patients from 167 cities of Pakistan and 15 countries have availed this free facility,” the statement said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/252224282b30618.jpg",
  "retrievedAt": "2025-08-25T15:26:04.008Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900275/edhi-foundation-funds-4m-equipment-at-karachis-jpmc-for-free-breast-cancer-treatment",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T18:09:12.000Z"
}
