{
  "title": "Oscar-winning Palestinian director released following arrest after Israeli settlers’ attack - World - DAWN.COM",
  "author": null,
  "content": "Hamdan Ballal, a Palestinian co-director of the Oscar-winning documentary No Other Land, was released on Tuesday following his arrest by Israeli soldiers in the occupied West Bank after being attacked and injured by settlers.\n\nThe Israeli military also confirmed it arrested three Palestinians in the Masafar Yatta area, including Ballal. It said it detained three Palestinians suspected of hurling rocks at forces and one Israeli civilian involved in a “violent confrontation” between Israelis and Palestinians — a claim witnesses interviewed by the Associated Press disputed.\n\nIn a post on X, the Israeli military said it sent soldiers to the village of Susya to defuse tensions after “terrorists” threw stones at Israeli settlers. But the “terrorists” began throwing stones at the soldiers and the police, resulting in the arrest of three Palestinians and an Israeli, it said.\n\nHowever, it denied reports that a “Palestinian was arrested while inside an ambulance”.\n\nBy Tuesday afternoon, Ballal was released, according to his fellow co-director Yuval Abraham, who co-directed with him the Oscar-winning documentary film No Other Land.\n\nAbraham, who had originally posted about the detention on X, said on Tuesday that “Hamdan Ballal is free and is about to go home to his family.” Contacted by AFP, Israeli police did not immediately confirm his release.\n\nEarlier, Abraham had said that a group of “armed KKK-like masked settlers” had “lynched” Ballal and that he had injuries to his stomach and head. But Israeli “soldiers invaded the ambulance he called, and took him”, AFP had reported.\n\nIn a post on X, Abraham said a “group of settlers” had set upon Ballal.\n\n“They beat him and he has injuries in his head and stomach, bleeding. Soldiers invaded the ambulance he called, and took him. No sign of him since,” Abraham wrote.\n\nHe clarified in a subsequent post that, “Hamdan was assaulted and beaten up, not murdered. My use of ‘lynched’ was a mistranslation from Hebrew (English isn’t my first language). He’s injured and being held at a police station in a settlement. They did not let his lawyer speak to him yet so we don’t know more.”\n\nThe incident took place in the southern West Bank village of Susiya, according to the anti-occupation NGO Centre for Jewish Nonviolence, whose members said they filmed the events first-hand. Abraham also shared footage of the attack by the Israeli settlers in a post on X, which showed the attackers hurling rocks at a vehicle.\n\nThe video provided by the Centre for Jewish Nonviolence showed a masked settler shoving and swinging his fists at two activists from the group in a dusty field at night, Al Jazeera reported separately.\n\nThe activists rush back to their car. “Get in, get in!” one shouts, and they duck inside as the thuds of rocks can be heard hitting the car.\n\n“Car window was broken,” the driver says as they drive off.\n\nA group of 10 to 20 masked settlers also attacked Jewish activists at the scene with stones and sticks, smashed their car windows and slashed their tyres.\n\nAccording to their lawyer Lea Tsemel, police told her they were being held at an unidentified military base for “medical treatment”, the Associated Press reported.\n\nBut Tsemel said she hadn’t been able to reach them and had no further information on their whereabouts.\n\nBasel Adra, the co-director of No Other Land, witnessed the detention and said about two dozen settlers — some masked, some carrying guns, some in Israeli uniform — attacked the village. Soldiers who arrived pointed their guns at the Palestinians, while settlers continued pelting stones.\n\n“We came back from the Oscars and every day since there is an attack on us,” Adra told Associated Press. “This might be their revenge on us for making the movie. It feels like a punishment.”\n\nHe told the Associated Press that settlers entered the village on Monday evening shortly after residents broke the daily fast for Ramazan.\n\nA settler who, according to Adra, frequently attacks the village, went over to Ballal’s home with the military, while soldiers shot in the air. Ballal’s wife heard her husband being beaten outside and scream, “I’m dying,” Adra added.\n\nAdra said that he then saw soldiers take Ballal, who was handcuffed and blindfolded, from his home into a military vehicle. He added that Ballal’s blood was still spread all over on the ground outside his front door.\n\nSome of the details of Adra’s account were backed up by another eyewitness, who spoke on condition of anonymity out of fear of reprisal, according to the Associated Press.\n\nIsrael has occupied the West Bank since 1967. No Other Land, which was directed by Israeli-Palestinian activists, won best documentary at this year’s Academy Awards.\n\nShot in nearby Masafer Yatta, the documentary follows a young Palestinian struggling with forced displacement as the Israeli army tears down his community’s homes to make space for a firing zone.\n\nThe Israeli army declared Masafer Yatta a restricted military zone in the 1980s. The West Bank, excluding Israeli-annexed east Jerusalem, is home to around three million Palestinians as well as nearly half a million Israelis who live in settlements that are illegal under international law.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/25092813b3432af.jpg",
  "retrievedAt": "2025-08-25T15:26:08.950Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900218/oscar-winning-palestinian-director-released-following-arrest-after-israeli-settlers-attack",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T04:42:29.000Z"
}
