{
  "title": "AIDS pandemic risks global resurgence amid US funding halt: UN - World - DAWN.COM",
  "author": null,
  "content": "GENEVA: The world risks returning to the worst days of the global AIDS pandemic following the sudden halt to US foreign aid funding, the UN’s top AIDS official said on Monday, warning millions would die.\n\nThe United States has historically been the world’s biggest donor of humanitarian assistance, but President Donald Trump has slashed international aid since returning to the White House two months ago, putting the entire humanitarian community into a tailspin.\n\nDays later, the State Department said life-saving HIV work under the President’s Emergency Plan for AIDS Relief (PEPFAR) would continue. But the disruption to health funding and the impact on broader services were having a devastating impact on people living with HIV/AIDS, UNAIDS executive director Winnie Byanyima told reporters in Geneva.\n\n“This sudden withdrawal of US funding has been shutting down many clinics, laying off thousands of health workers ... All this means that we expect to see new infections rising. UNAIDS has estimated that we could see 2,000 new infections every day,” she said. Byanyima said that if the US funding is not reinstated or others do not step in to fill the gap, “there will be an additional... 6.3 million AIDS-related deaths”, a 10-fold increase, in the next four years alone.\n\n“You’re talking of losing the gains that we have made over the last 25 years. It is very serious,” she told reporters in Geneva. “It is reasonable for the United States to want to reduce its funding over time, but the sudden withdrawal of life-saving support is having a devastating impact,” she said. “The US cuts mean that today, 27 countries in Africa and Asia are experiencing shortages of staff, disruptions of diagnostics treatment and surveillance systems are collapsing.”\n\nGlobal AIDS resurgence risk\n\nLooking beyond the next four years, if aid funding is not restored, “we see the AIDS pandemic... resur­ging globally”, growing in Eastern Europe and Latin America, Byan­yima said. “We’ll see it come back, and we’ll see people die the way we saw them in the ‘90s and in the 2000s.” She hailed US leadership in the fight against AIDS as “the greatest acts of humanity in global health”.\n\nShe highlighted the US anti-HIV initiative PEPFAR, which is considered one of the world’s most successful public health efforts, having saved an estimated 26 million lives over two decades. Now, thanks to US innovations, the world is “at the cusp of another revolution in prevention treatment”, Byanyima said, pointing to a new drug called lenacapavir, developed by US pharmaceutical giant Gilead.\n\nTrials have showed the drug to be 100 per cent effective, and Byanyima said tests were under way towards providing it as a single injection per year — far more afforable for low-income countries.\n\n“That is almost like a flu vaccine,” she said. “If this could be rolled out ambitiously ... we could cut down new infections to close to zero. We could see the end of AIDS.”\n\nByanyima appealed to the “deal-maker” Trump directly, insisting that rescuing the global HIV response was “an amazing deal “: lenacapavir is able to “make profits for Gilead, to create good jobs for Americans and to save lives”. She suggested that when PEPFAR is brought back online, UNAIDS could work with the United States and other donors to help low-income countries become self-sufficient in the fight against HIV.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:10:23.689Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900165/aids-pandemic-risks-global-resurgence-amid-us-funding-halt-un",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T00:46:10.000Z"
}
