{
  "title": "Pakistan embark on Asian Cup quest with Syria clash - Sport - DAWN.COM",
  "author": null,
  "content": "AL AHSA (Saudi Arabia): When Stephen Constantine was appointed Pakistan’s head coach almost 18 months ago, he was clear in his mind that the target for his side should be realistically aiming to qualify for the 2027 AFC Asian Cup.\n\nA historic victory over Cambodia paved the way for Pakistan’s place in the third round of the Asian Cup qualifiers for the first time with Constantine and his charges opening their campaign in Group ‘E’ against much-fancied Syria on Tuesday.\n\nThe group winner gets a spot at the tournament in Saudi Arabia with Myanmar and Afghanistan the other teams in the section.\n\nPakistan face a tall order if they are to qualify for the Asian Cup and there has been little change to the dynamics of the sport in the country since Constantine first arrived.\n\nThe Englishman had pleaded for a domestic league to begin in order to provide local players regular competition but once again, he will have players who have had little action on the pitch apart from training sessions with the foreign-based players arriving to bolster the squad.\n\nThe team lost all its six matches in the second round of qualifying, which merged with the preliminaries for the 2026 FIFA World Cup, and now face a side which has qualified for the last two editions of the Asian Cup.\n\nSyria reached the knockout stages of the last edition of the Asian Cup in 2023 and have an imposing forward line boosting Omar Khribin, the 2017 AFC Asian Players of the Year, and Omar Al Soma.\n\nWhile Syria are hosting their home games on neutral venues, Pakistan have had experience of playing at the Prince Abdullah Bin Jalwai Stadium, where they lost 4-0 to Saudi Arabia in the second round of qualifying in November 2023.\n\nPakistan will start as underdogs against Syria but in Constantine, they have a tactician in the dugout who has the nous to get a result for his side.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/251157310197dd5.jpg",
  "retrievedAt": "2025-08-25T15:26:34.696Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900148/pakistan-embark-on-asian-cup-quest-with-syria-clash",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T00:46:04.000Z"
}
