{
  "title": "Journalist Farhan Mallick sent to Karachi jail over alleged ‘anti-state’ content - Pakistan - DAWN.COM",
  "author": null,
  "content": "A court in Karachi sent journalist Farhan Mallick to jail on a 14-day judicial remand on Tuesday for allegedly airing “anti-state” content on his outlet’s YouTube channel.\n\nMallick, the founder of media agency Raftar and a former news director at Samaa TV, was arrested on March 20 in Karachi and booked under the Prevention of Electronic Crimes Act (Peca) as well as the Pakistan Penal Code. The next day, he was handed into the Federal Investigation Agency’s (FIA) custody for four days.\n\nMallick was presented before the court of Judicial Magistrate-I (East) Khalique Zaman today. Investigation Officer Zeeshan Awan appeared during the hearing.\n\nThe FIA sought an extension of the Raftar founder’s physical remand till April 3. However, the court denied the request and sent him on a 14-day judicial remand.\n\nSeparately, the court also took up Mallick’s bail petition and issued notices to the respondents, including the prosecutor and the investigation officer, for the next hearing on March 27.\n\nAccording to a first information report (FIR) dated March 20, the FIA had received a report about Raftar TV’s YouTube channel, which was “involved in running a campaign for the posting of anti-state videos targeting the dignitaries mentioned in violation”.\n\nMallick had been booked under sections 16 (unauthorised use of identity information), 20 (offences against the dignity of a natural person) and 26-A of the Prevention of Electronic Crimes Act (Peca) 2016, as well as sections 500 (punishment for defamation) and 109 (abetment) of the Pakistan Penal Code (PPC).\n\nNotably, Section 26A is among the provisions recently added to the Peca laws, wherein fake news is defined as any information about which a person “knows or has reason to believe to be false or fake and likely to cause or create a sense of fear, panic or disorder or unrest”.\n\nAny person found guilty of spreading such information could be sentenced to up to three years in prison or fined up to Rs2 million, or both.\n\nThe criminalisation of online disinformation has spread fear in Pakistan, with journalists among those worried about the potentially wide reach of the law.\n\nEarlier today, Raftar said Mallick was to appear before a “link judge” as the previous judge would not be coming.\n\n“We’ve been at the court since 8:30am, as today the FIA was ordered to present Mr Farhan after their investigative remand period ended,” a post on Raftar’s official X account said.\n\n“In the morning we were told the judge was not going to be coming today. Farhan will now have to appear before a link judge. The link judge is waiting for the regular court to send files. The regular court is waiting for the FIA to bring Farhan,” it added.\n\nThe outlet, noting that it was almost 11am, said “this kind of delay is frustrating and raises concerns about the process”.\n\nThe arrest was met with widespread criticism from the media fraternity as well as rights activists.\n\nThe International Federation of Journalists (IFJ) and its affiliate, the Pakistan Federal Union of Journalists (PFUJ), also condemned all charges against the journalist and demanded his immediate release.\n\n“The arrest of senior journalist Farhan Mallick and the arbitrary raid of Raftar is a hugely concerning case of state harassment against a news outlet publishing in the public interest,” the IFJ said in a statement today.\n\n“This case has much wider and worrying ramifications for the entire media sector in Pakistan and this state-instituted campaign against Mallick must stop. Journalists must be safeguarded for their right to report freely without fear of reprisal or retaliation,” it asserted.\n\nThe statement also quoted the PFUJ as condemning “the unlawful arrest of media personnel, and the registration of a fake case based on baseless allegations on a media manager”.\n\nThe Committee to Protect Journalists (CPJ) had called for his immediate and unconditional release, saying that Pakistani authorities must “cease harassing journalists in retaliation for their journalistic work”.\n\n“The alarming detention of prominent journalist Farhan Mallick, along with the disappearance of journalist Asif Karim Khehtran and the abduction of exiled journalist Ahmed Noorani’s brothers, shows how the Pakistani government has no regard for press freedom and independent journalism,” said Beh Lih Yi, CPJ’s Asia programme coordinator.\n\n“This must stop, and the state of Pakistan should respect the law,” Lih Yi added, calling on officials to allow Mallick and “his media outlet to independently carry out their work”.\n\nCPJ’s text messages requesting comment from Information Minister Attaullah Tarar received no response, the committee said.\n\nThe Human Rights Commission of Pakistan called on authorities to “check the overreach of agencies […] and uphold the right to freedom of expression”.\n\nPakistan is ranked 152 out of 180 countries in a press freedom index compiled by Reporters Without Borders.\n\nThe country has long been criticised by watchdogs for restricting internet access, including temporary bans on YouTube and TikTok, while X is officially blocked.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/25152023efca42d.png",
  "retrievedAt": "2025-08-25T15:26:04.836Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900244/journalist-farhan-mallick-sent-to-karachi-jail-over-alleged-anti-state-content",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T11:03:31.000Z"
}
