{
  "title": "Swabi traders hire underage boys for harvesting pea crop - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWABI: Vegetable traders have hired underage boys for harvesting pea crops in violation of child labour laws, it was learnt here on Monday.\n\nThis correspondent visited fields in different areas, where it was observed that children were harvesting pea crops.\n\nEvery child is paid according to as many sacks he fills in a day.\n\nNasrullah Khan, a young worker, told Dawn that he earned from Rs400 to Rs450 a day. He said he had been working in the pea fields for the last two months.\n\n“I never went to school and my parents never asked me to acquire knowledge. They are happy that I give them my earnings as they are financially strained,” he said.\n\nAnother child, Sudais Khan, said he earned Rs500 a day. “The vegetable trader employed me after my parents talked to him.”\n\nThe children said they had to work to support their families as they were poverty-stricken.\n\nA farmer said parents are happy that their children were earning something for their families.\n\nTalking to Dawn on condition of anonymity, the traders said they did not force anyone to work on fields, and the parents contacted them for employing their children.\n\nWhen contacted, the labour department officials said that they were not aware of the children involved in pea harvesting.\n\nSECURITY ENHANCED: Security in the famous Link Road bazaars in the district headquarters has been enhanced as the number of Eid shoppers has increased, police officials said.\n\nThe Link Road and its adjacent markets are popular among women shoppers.\n\nWhen contacted, a police official confirmed to Dawn the policemen had been deployed in the bazaars along with private security personnel to ensure a peaceful environment for the Eid shoppers.\n\nPublished in Dawn, March 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:10:44.551Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900086/swabi-traders-hire-underage-boys-for-harvesting-pea-crop",
  "dateList": "2025-03-25",
  "date_published": "2025-03-25T00:46:52.000Z"
}
