{
  "title": "Prime Minister taking positive steps for durable growth of country: Sheikh Rasheed",
  "link": "https://www.app.com.pk/national/prime-minister-taking-positive-steps-for-durable-growth-of-country-sheikh-rasheed/",
  "date_published": "2020-12-04T15:14:00.000Z",
  "source": "APP",
  "content": "QUETTA, Dec 04 (APP):Federal Minister for Railway Sheikh Rasheed Ahmed on Friday said Prime Minister Imran Khan was taking positive measures for development of country and prosperity.\nHe expressed these views while talking to media personnel during inspecting of ITTMS project and National Logistics Cell (NLC) at Pak-Afghan border near Chaman area of Killa Abdullah district.\nThe Federal Minister said Pakistan Railway situation would be improved and travel facilities could be provided to citizens from completion of main line- 1 (ML-1) adding the repairing work of warehouses to be started for up gradation of railway.\n‘A meeting can be conducted in December to address issues land of railway at Pak-Afghan border’, he said.\nSheikh Rasheed said there have inflation throughout of world due to coronavirus saying central government led by Prime Minister Imran Khan would complete its tenure of five years.\nHe also criticized eleven parties were gathered for hiding their plunders despite several corruption cases were also registered against them in the country adding the opposition leaders said giving respect votes but they were pushing voters towards coronavirus through their procession.\nImran Khan government will not be finished from Pakistan Democratic Party (PDM) processions, he added first wave of the pandemic virus had been copped through best policy of Prime Minister Imran Khan and efforts were also underway to quell the second wave of deadly virus for ensuring protection of public lives from it.\n“PDM said respect the vote but let the voters die from deadly virus”, he mentioned adding ML-1 project has important for development of Railways and systems of railway would be promoted step by step.\nSheikh Rasheed maintained if a plot of railway is sold, the deficit of railway can be eliminated adding Railways would improve after running main line-1 (ML-1).\nEarlier, He inspected ITTMS and NLC projects where he reviewed trade activities at Pak-Afghan border near Chaman area of Killa Abdullah district.\nConcerned official briefed Sheikh Rasheed regarding projects progresses and their requirements in detail.\nThe Federal Minister also appreciated the officials in this regard and assured that he would take all possible efforts for progress of railway sector which was important for growth of the country.",
  "retrievedAt": "2025-08-11T20:05:51.104Z"
}
