{
  "title": "Web Portal opened for Kafaalat beneficiaries facing biometric failures",
  "link": "https://www.app.com.pk/national/web-portal-opened-for-kafaalat-beneficiaries-facing-biometric-failures/",
  "date_published": "2020-12-04T10:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 4 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar Friday announced the opening of a web portal to address complaints of Kafaalat beneficiaries facing failure in biometric verification.\nIn her tweet, the special assistant said “Ehsaas has opened a web portal complaints.pass.gov.pk to address the bio metric failure issue being faced by the Kafaalat beneficiaries while receiving their payments”. The Kafaalat beneficiaries facing bio-metric failure in receiving payments can report at the web portal immediately.\nجن احساس کفالت صارفین کو بائیومیٹرک ادائیگیوں میں انگوٹھوں کے نشانات کی تصدیق کے مسائل درپیش ہیں ان کی دادرسی کیلیئے احساس کی جانب سے ویب پورٹل کھول دیا گیا ہے۔ پورٹل کا لنک درج ذیل ہے۔ مزید تفصیلات اس معلوماتی ویڈیو میں ملاحظہ کریں۔https://t.co/U9pMduXgLt pic.twitter.com/qovfQAjC2w\n— Sania Nishtar (@SaniaNishtar) December 4, 2020\nThe payments under Kafaalat program Phase-I were continued smoothly across the country, ensuring COVID precautionary measures including maintaining social distancing, hand sanitization and setting multiple payment counters.\nDr. Nishtar urged the beneficiaries to keep their Computerized National Identity Cards with them at the time of receiving their payments and receive their computerized receipt.\nIt is pertinent to mention here that the payments for July-December 2020 to the beneficiaries of Kafaalat program of Ehsaas were continued across the country.\nThe Ehsaas Kafaalat payment will be made in two phases. The Phase-I has commenced under which payments would be made to 4.3 million women beneficiaries.\nEach beneficiary will be paid Rs 12,000 covering the period July to December 2020. The combined payment for six months was being made.\nThe prime minister had already given approval to increase this number to seven million women which means seven million households would be benefited from this program.\nThe payments to additional beneficiaries will be made December 2020 onwards and the process will be completed in the current fiscal year.\nIn Pakistan, most of the digitally and financially excluded segments are destitute women. Ehsaas Kafaalat ensures financial and digital inclusion of deserving women across the country.",
  "retrievedAt": "2025-08-11T20:05:54.464Z"
}
