{
  "title": "Pakistan is all set to benefit from COVID-19 vaccines",
  "link": "https://www.app.com.pk/national/pakistan-is-all-set-to-benefit-from-covid-19-vaccines/",
  "date_published": "2020-12-04T06:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 04 (APP): Pakistan has completed all prerequisites to submit the vaccine request to GAVI, through the COVAX facility, a coalition for equitable access to COVID-19 vaccines by all countries.\nAccording to official sources, Pakistan and other GAVI eligible countries are likely to receive free of cost vaccines for a proportion of the population as well as additional quantities on special subsidized rates.\nReleasing the application template on 17th November, GAVI had fixed 7th December as the deadline to receive application.\nThe Expanded Programme on Immunization under the guidance of the Ministry of National Health Services Regulations and Coordination established a technical working group that worked round the clock to complete the consultation process having all stakeholders on board.\nThe proposal drafted therein was endorsed by the National Technical Advisory Group (NITAG) on Immunizations on 1st December and approved by the National Interagency Coordination Committee (NICC) Friday in a meeting chaired by Dr. Faisal Sultan, Special Assistant to Prime Minister on National Health Services.\nParticipants of the meeting convened through video link included Director General Health, representative of the Ministry of Finance, National and Provincial EPI Managers, Representatives of WHO and UNICEF, GAVI as well as the other development partners and international donors.\nSpeaking on the occasion Dr Faisal Sultan highlighted the efforts of the government to curtail the impact of COVID-19 using all potential measures and available options.\n“Ensuring availability of safe and effective vaccine to the most vulnerable population groups, the soonest possible, is yet another tool that the Government is looking to benefit from”, stated Dr Faisal Sultan.\n“Protecting the healthcare workforce at the forefront of the response against the COVID-19, shall ensure our strength to tackle the challenge head on while protecting elderly with co-morbidities will help in reducing the associated morbidity and mortality”, he added.\nDr Safi Malik, Director General Health congratulated EPI team on developing a concise proposal taking into account the operational realities.\nThe representative of partner organizations also appreciated the government’s commitment and proactive approach to benefit from every opportunity as it arises to mitigate the impact of devastating pandemic of recent times.\n“COVAX facility would best benefit countries at advance level of preparedness. Endorsement from all stakeholders of a proposal developed through national consensus enhances Pakistan’s chances to be among first countries benefiting from the initiative” said Dr Rana Muhammad Safdar, National Coordinator for EPI and Polio Eradication.\nThe dedicated NICC meeting of high significance was convened by the Ministry of National Health Services today to deliberate on Pakistan’s application for submission to GAVI.\nDepending upon the availability of resources, COVAX initiative aims to ensure equitable supply of COVID-19 vaccine to all countries, irrespective of economic status.",
  "retrievedAt": "2025-08-11T20:05:54.450Z"
}
