{
  "title": "Continuity of democracy vital for progress: Chaudhry Sarwar",
  "link": "https://www.app.com.pk/national/continuity-of-democracy-vital-for-progress-chaudhry-sarwar/",
  "date_published": "2021-01-28T16:39:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 28 (APP): Governor Punjab Chaudhry Mohammad Sarwar has said that the tradition of creating hurdles for those who want to put the country on road to progress and prosperity should end now.\nTalking to media during a seminar on health at a local hotel here on Thursday, he said continuity of democracy was essential for a country’s development, prosperity and stability.\nGovernor Punjab Chaudhry Sarwar said, “No system can survive in Pakistan except democracy and the public also supports the continuity of democracy.”\nSarwar said that the Opposition lawmakers under PDM alliance had neither submitted their resignations, nor they will stage a long march, adding that the opposition will also fail to table no confidence motion against Prime Minister Imran Khan.\nTo a question, Governor Punjab said regardless of PDM’s claims, elections will be held in 2023, adding Prime Minister Imran Khan will complete his constitutional term.\nHe said the Opposition should respect the mandate of the masses given to the PTI, stressing those who try to destabilize the government were not well-wishers of the country.\nEarlier, speaking at seminar, Governor Punjab said the doctors who fought on the frontline during the COVID-19 pandemic were the heroes of nation and their services would always be remembered.\nHe said that it was the government’s top priority to ensure the provision of health facilities to the people, adding that issuance of ‘Health Insaaf Card’ by the government under the leadership of Prime Minister Imran Khan was a historic project due to which no poor citizen will be deprived of basic health facilities.\nChaudhry Mohammad Sarwar said Punjab government was launching a typhoid vaccination campaign from February 1.\nHe said it was responsibility of all those serving in the health sector to ensure the provision of health facilities to every citizen.\nSarwar said that it was our joint responsibility to make Pakistan healthy, strong and prosperous",
  "retrievedAt": "2025-08-11T20:17:24.163Z"
}
