{
  "title": "Bill for open Senate elections, dual nationals to be tabled next week: Dr Babar",
  "link": "https://www.app.com.pk/national/bill-for-open-senate-elections-dual-nationals-to-be-tabled-next-week-dr-babar/",
  "date_published": "2021-01-28T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP): Advisor to Prime Minister for Parliamentary Affairs Dr Babar Awan Thursday said the government will introduce a constitutional amendment bill in the Parliament next week for open voting in the Senate elections and to give the dual nationals the right to contest elections.\nSpeaking at a press conference along with Minister for Information and Broadcasting Senator Shibli Faraz, he said the election reforms package was prepared after a series of meetings chaired by Prime Minister Imran Khan.\nThis will be the first constitutional reforms package since 1985 to ensure that Senate elections are held in a free, fair and transparent manner, he noted.\nDr Babar recalled that in the past Senate elections were made controversial with purchase of votes and corruption.\nHe said the proposed constitutional amendments will be a test case for opposition which in the past had supported the idea of open voting in the Parliament.\nThe introduction of reforms package in Parliament will make it clear who in the opposition supported fair elections and wanted to stop the buying of votes and horse trading and who would be doing otherwise, he continued.\nThe Advisor said Prime Minister Imran Khan had made it clear that irrespective of the fact that his party would get more or less votes he would pursue the electoral reforms in the Senate and the path of accountability.\nDr Babar Awan said a road map had been given to the political parties in the Parliament to stop the horse trading and buying of votes in elections.\nNawaz Sharif and Benazir Bhutto signed the Charter of Democracy in May 2006 and one of its point was that indirect elections should be open and identifiable votes should be cast in it, he observed.\nThe advisor said the reforms were a national agenda and nobody would want to get Senators elected through use of money or corruption.\nHe said the opposition parties did not support the presidential reference for transparent elections in the Senate.\nAccording to the amendment to be made in article 59(2) of the constitution, an open vote will be cast instead of the single transferable vote in the Senate election, he explained.\nWhile through another amendment in the article 63(1)(c) the dual nationals will be able to contest the upcoming Senate elections and elections of Parliament and provincial assemblies in future.\nIn case a dual national wins an election he would have to give a clear proof before taking oath as the legislator that he had renounced his foreign citizenship. If he will lose the election, the dual national will have no need to renounce his foreign citizenship, he added.\nHe was hopeful that many dual nationals will want to take part in the Senate elections.\nHe said the latest report of Transparency International was about the corruption done in the tenures of the previous governments.\nDr Babar urged the opposition parties to support the government in undertaking electoral reforms in the Parliament.\nHe said talks will continue will the opposition in the Parliament on matters of national importance.",
  "retrievedAt": "2025-08-11T20:17:28.672Z"
}
