{
  "title": "AJK PM, KA/GB Minister discuss current Kashmir affairs; Decides to construct bunkers along LoC in AJK",
  "link": "https://www.app.com.pk/national/ajk-pm-ka-gb-minister-discuss-current-kashmir-affairs-decides-to-construct-bunkers-along-loc-in-ajk/",
  "date_published": "2021-11-17T15:06:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK), Nov 17 (APP): Federal Minister for Kashmir Affairs and GB Ali Amin Gandapur Wednesday called on the Prime Minister of Azad Jammu and Kashmir Sardar Abdul Qayyum Niazi in the federal metropolis to discuss issues related to the Azad Jammu  Kashmir Council, construction of bunkers along the LOC, party affairs besides matters of mutual interest.\nSpeaking on the occasion the AJK Prime Minister Sardar Abdul Qayyum Niazi said that India has intensified the reign of terror in occupied Jammu Kashmir and was also targeting the civil population at the line of control.\nHe said the people of LOC have been offering sacrifices for the defense of the country along with the Armed Forces of Pakistan.\nThe Prime Minister stressed the need for the completion and construction of bunkers for the people of LOC.\nHe said Special plans for development and prosperity of the people of LOC would be included in the Kashmir Development Package.\nHe said Reforms are underway for the socio economic development for the people of Azad Kashmir according to the vision of the Prime Minister of Pakistan Imran .\nFederal Minister for Kashmir Affairs Ali Amin Gandapur assured full cooperation from the federal government for the construction of bunkers on the LOC and said that Pakistan Prime Minister Imran Khan has a special interest in the development of Azad Kashmir.\nHe said Prime Minister of Pakistan Imran Khan has exposed the Indian forces brutalities and gruesome human rights violations by the Indian forces in occupied Kashmir.\nThe Government and people of Pakistan will continue to provide political, diplomatic and moral support to the Kashmiris people for attaining their fundamental right to self determination.",
  "retrievedAt": "2025-08-11T21:37:16.676Z"
}
