{
  "title": "Exports increase by 25.2% to Rs1.57 trillion in 4 months",
  "link": "https://www.app.com.pk/national/exports-increase-by-25-2-to-rs1-57-trillion-in-4-months/",
  "date_published": "2021-11-17T07:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP): The exports from the country in rupee term witnessed an increase of 25.2 per cent during the first four months of the current fiscal year as compared to the corresponding month of last year, Pakistan Bureau of Statistics (PBS) reported.\nAccording to PBS provisional figures, the exports from the country during July-October (2021-22) were recorded at Rs1,570,444 million as against the exports of Rs1,254,337 million during July-October 2020-21.\nMeanwhile, on year-on-year basis, the exports from the country increased by 23.77% in October compared to the exports of October, 2020. The exports during October, 2021 amounted to Rs.423,371 million against the exports of Rs. 342,063 million during October, 2020.\nOn month on months basis, the exports increased by 4.58% when compared to the exports of Rs. 404,847 million in September 2021.\nThe main commodities of exports during October, 2021 were knitwear (Rs. 78,497 million), readymade garments (Rs. 51,068 million), bed wear (Rs. 49,425 million), cotton cloth (Rs. 31,528 million), rice (Rs. 20,431 million), cotton yarn (Rs.18,225 million), towels (Rs.14,092 million), madeup articles Excluding towels & bedwear (Rs.12,217 million), rice Basmati (Rs.8,987 million) and oil seeds, nuts and kernals (Rs.6,893 million).\nOn the other hand, Imports during July–October (2021-22) totaled Rs. 4,168,515 million as against Rs. 2,514,545 million during the corresponding period of last year showing an increase of 65.78%.\nLikewise, the imports into Pakistan during October, 2021 amounted to Rs. 1,096,467 million as against Rs. 1,102,998 million in September, 2021 and Rs. 633,218 million during October 2020 showing a decrease of 0.59% over September, 2021 but an increase of 73.16% over October 2020.\nThe main commodities of imports during October, 2021 were petroleum products (Rs. 123,455 million), natural gas, liquefied (Rs.81,608 million), petroleum crude (Rs.62,718 million), medicinal products (Rs. 49,292 million), iron & steel (Rs. 46,694 million), palm oil (Rs. 42,257 million), fertilizer manufactured (Rs.39,132 million), plastic materials (Rs.35,984 million), iron & steel scrap (Rs.35,034 million) and power generating machinery (Rs. 27,000 million).\nMeanwhile, in Dollar terms, the country’s total merchandise exports surged by 24.94 during the first four month of the current fiscal year compared to the corresponding period of last year.\nThe exports during July-October (2021-22) were recorded at $9.462 billion against the exports of $7.573 billion during July-October (2020-21).\nOn the other hand, the imports into the country also surged by 65.40 percent by growing from $15.176 billion last year to $25.101 billion during the current fiscal year, the PBS data added.",
  "retrievedAt": "2025-08-11T21:37:24.466Z"
}
