{
  "title": "Electoral reforms package to ensure fair, transparent elections: Fawad",
  "link": "https://www.app.com.pk/national/electoral-reforms-package-to-ensure-fair-transparent-elections-fawad/",
  "date_published": "2021-11-17T17:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Wednesday felicitating the nation particularly nine million overseas Pakistanis, said the passage of Electoral Reforms Package would ensure free, fair and transparent upcoming elections in the country.\nTalking to media outside Parliament House, he said the passage of Bills related to use of Electronic Voting Machines (EVMs) and grant of right to vote to overseas Pakistanis had proved once again that Pakistan Tehreek-e-Insaf (PTI) was the largest party of the country having broad based support of the masses from every nook and corner of the country.\nHe said the Majlis-e-Shoora has okayed unprecedented legislation passing the bills linked the basic rights of citizens and foundation of free and fair elections has been laid. He thanked coalition partners for extending support to the government.\nThere will be i-voting system for Pakistanis living abroad,conducting elections was the responsibility of the Election Commission and legislation was responsibility of the Parliament.\nHe said the legislation would help protecting the rights of women and children. Special courts for women and children would be set up.\nHe said that government had made optimum effort to evolve consensus with the opposition on electoral reforms and adopt the bill unanimously but it played a negative role in the legislation process.\nCriticizing opposition leadership, he said opposition leaders were political dwarfs. Those considering to move no-confidence motion against government functionaries should have a second thought about their assessments.\nHe said former Prime Minister Nawaz Sharif did not play even cricket without support of his own umpires. The politics of those brought up in the lap of martial law remained dependent on others’ support.\nHe said consequent upon the legislation passed by Majlis –e Shoora, special courts for women and children to be set up in the country.\nHe said he had predicted in the morning that Pakistan Peoples Party Chairman Bilawal Bhutto Zardari and Leader of the Opposition in National Assembly Shahbaz Sharif were the ‘defeated people’.",
  "retrievedAt": "2025-08-11T21:37:13.678Z"
}
