{
  "title": "Pakistan strongly condemns restrictions on Friday prayers in India,  mosques’ vandalization",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-restrictions-on-friday-prayers-in-india-mosques-vandalization/",
  "date_published": "2021-11-17T07:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP): Pakistan on Wednesday strongly condemned the restrictions imposed by the Bharatia Janta Party’s government in Haryana, India on offering Friday prayers by Muslims at several places.\n“We are also deeply concerned over continued vandalization of mosques and attacks against prayer places of Muslims by Sangh Parivar extremists with the complicity of BJP ruled states of Uttar Pradesh and Haryana,” the Foreign Office said.\nIn another abhorrent act of sacrilege of Muslim religious places, radical Hindu groups reportedly dumped cow dung at several places of Friday prayers.\nThe Foreign Office said, “The senseless attacks against Muslims and their places of worship, houses and businesses are continuing in Tripura as well despite international concern.”\nIt said the BJP ruled states had arrested hundreds of individuals including well-known advocates and journalists under the draconian laws such as Unlawful Activities (Prevention) Act for raising voice against gross and systematic human rights violations of minorities particularly Muslims.\nIn the state of Maharashtra, violent attacks were unleashed against Muslims’ shops, mosques, and shrines by radical activists of BJP and its affiliated groups including Bajrang Dal, Vishwa Hindu Parishad, and Maharashtra Navnirman Sena.\n“Pakistan calls on the international community, particularly the United Nations and relevant international human rights and humanitarian organizations to fulfill their responsibilities to stop the rising Islamophobia,” it said.\nThe FO stressed that the violent attacks against minorities particularly Muslims in India be stopped, ensuring their safety, security and well-being and the protection of their places of worship.",
  "retrievedAt": "2025-08-11T21:37:24.961Z"
}
