{
  "title": "Eid-ul-Adha celebrated across Pakistan",
  "link": "https://www.app.com.pk/national/eid-ul-adha-celebrated-across-pakistan/",
  "date_published": "2022-07-10T15:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 10 (APP):Eid-ul-Azha was celebrated across the country on Sunday with religious fervor to commemorate the great sacrifice of Hazrat Ibrahim (AS) and Hazrat Ismael (AS).\nEid-ul-Azha, one of the biggest festival observed by Muslims around the world on the 10th day of Zul-Hijjah, the last month of the Islamic calendar.\nThe day began with special prayers in the mosques, eidgahs and open places for the stability, integrity, unity and solidarity of the Muslim Ummah, progress and prosperity of the country.\nUlema in their Eid’s sermons highlighted the significance of the philosophy of great sacrifice offered by Hazrat Ibrahim (AS) and Hazrat Ismael (AS).\nPeople offered sacrifice of animals to follow Sunnah of Hazrat Ibrahim (AS). The meat was then divided into three parts to be shared equally among the deserving, family and friends.\nFederal and Provincial government had chalked out elaborate security arrangement across the country to ward-off untoward incidents. Civic authorities of different cities and towns also made special arrangements for disposal of offal and other solid waste during the three days of Eid.\nRadio Pakistan, PTV and private TV channels aired special programmes in connection with Eid-ul-Azha while newspapers published special supplements highlighting the importance of the sacrifice.\nIn Islamabad, a large gathering was held at Faisal mosque to offer Eid prayer. A large number of people also offered prayers across the city mosques. The Capital Development Authority (CDA) devised a comprehensive plan to remove offal and entrails from all sectors of federal capital.\nThe civic agency deputed more than 2,000 sanitation staff and 100 vehicles to carry out cleanliness duties and dug up 80 pits in 44 locations to dispose of remains of sacrificial animals.\nIn Peshawar, big congregations were held at historic Mohabat Khan mosque, Sonehri mosque, Masjid e Zarghoni and at other places. The ulema and religious scholars highlighted the importance of sacrifice of animals rituals and philosophy behind Sunnah of Hazrat Ibrahim (AS).\nKhyber Pakhtunkhwa Chief Minister, Mahmood Khan offered Eid-ul-Azha prayer at Governor House mosque. While Acting Governor Khyber Pakhtunkhwa Mushtaq Ahmed Ghani offered Eid prayer in Abbottabad. Provincial Minister for Labour Shaukat Yousafzai, Senator Dost Muhammad Mehsud, Chief Secretary Dr Shahzad Bangadh, IGP Moazam Jah Ansari and others senior officials also offered Eid prayers.\nChief Minister Mahmood Khan said that Eid-ul-Azha gives us teachings of sacrifice, love, unity and living for each other. Sacrifice of the animals gave a strong message of sacrificing everything to please Allah Almighty and sharing grief and happiness of each other, he said in a message on Eid-ul-Azha.\nIn Lahore, a large number of Eid congregations were held at mosques, Imam bargahs, parks and open places. A comprehensive plan was devised to ensure cleanliness on the occasion of Eid-ul-Azha.\nPunjab Chief Minister Hamza Shehbaz celebrated Eid with destitute children of SOS village and distributed gifts among them and staff of the institute.\nHe said that SOS village was playing an important role in providing shelter to the destitute children.\nEid congregations were held in all small and major cities of Sindh including Karachi. Khateebs and Aima, in their Eid sermons, prayed for the development, prosperity and security of the country and unity and solidarity of Muslim Ummah. The congregations of Eid-ul-Azha were also held across Balochistan including Quetta city.\nBalochistan Chief Minister Abdul Quddus Bizenjo, Chief Justice Balochistan High Court Justice Naeem Akhtar and Chief Secretary Balochistan Abdul Aziz Uqaili offered Eid prayer at Governor House in Quetta.\nSimilarly, In Azad Jammu and Kashmir, special Eid-ul-Azha prayer congregations were held at small and major cities of all ten districts of the liberated territory including the state’s metropolis Muzaffarabad, Mirpur, Kotli, Bhimbher, Haveili, Hattiyan, Bagh, Sudhanoti, Rawalakot and Neelam valley districts where people offered Eid prayer at the mosques, eid gahs and open places.\nIn Gilgit Baltistan, Eid-ul-Azha congregations were held in Gilgit and other districts and tehsils. In Gilgit, big Eid gatherings were held in Konodas Eidgah, Eid Jutial Gilgit and Shah Karim Hostel.\nPresident Dr Arif Alvi offered Eid prayer in Karachi. He prayed for the prosperity and development of the country and solidarity of Muslim Ummah. The president also greeted people, present on the occasion.\nEarlier in his message to the nation, the president said as the country faced economic challenges, there was a dire need to utilize the spirit of sacrifice.\nHe affirmed brotherhood, selflessness and empathy for the destitute to emerge as a strong nation.\nPrime Minister Muhammad Shehbaz Sharif offered Eid prayer at Jati Umra, Raiwind. He prayed for the prosperity of nation, development and solidarity of the country.\nEarlier in his Eid message, he felicitated the nation on the auspicious occasion and called upon the people to pay special attention to the needy and poor to truly realize the spirit of sacrifice.",
  "retrievedAt": "2025-08-11T15:13:54.948Z"
}
