{
  "title": "PM offers Eid prayers at Jati Umra",
  "link": "https://www.app.com.pk/national/pm-offers-eid-prayers-at-jati-umra/",
  "date_published": "2022-07-10T02:36:00.000Z",
  "source": "APP",
  "content": "RAIWAIND, July 10 (APP): Prime Minister Shehbaz Sharif offered the Eid ul Azha prayers at his family residence in Jati Umra on Sunday.\nThe prime minister along with Chief Minister Punjab Hamza Shehbaz, Capt (retd) Muhammad Safdar and other people prayed for the prosperity of the country and the unity of Muslim community across the globe.\nEarlier in his Eid message, he felicitated the nation on the auspicious occasion and called upon the people to pay special attention to the needy and poor to truly realize the spirit of sacrifice.\nHe also appealed to the general public to strictly follow the precautionary measures against the coronavirus pandemic while celebrating Eid with their dear ones.\nhe said Allah Almighty made sacrifice an extraordinary ritual to show immense admiration for the obedience of Hazrat Ibrahim (AS) and Hazrat Ismail (AS). “The real meaning of sacrifice is the obedience and submission to Allah. Allah sees the intention of His obedient men and on that basis gives the reward.”\nHe said our salvation lies in following the pious character of Hazrat Ibrahim (AS) and his noble son Hazrat Ismail (AS) and noted that Muslims can fulfill their obligation during the special occasion of Eid-ul-Azha by helping out orphans, widows, needy and poor.\nHe called upon Pakistanis to pay special attention to giving assistance during Eid-ul-Azha to brothers and sisters facing difficulties and problems.\nThe prime minister said, “We should share the happiness of Eid with needy and deprived around us, who are affected by the wave of international inflation.”\n“We should also not forget those affected by the recent floods and rains and fully help them in this hour of need. It is our duty to support them and share their grief. The young generation can learn a lot from the meaning of sacrifice during Eid.”\nThe PM called upon the youth to become a living example of tolerance, patience, selflessness and sacrifice in society.\nHe appealed to the public to strictly follow the precautionary measures against the coronavirus pandemic.\nHe directed the district administrations and departments concerned to carry out their responsibilities efficiently, timely dispose off animal waste and ensure cleanliness.",
  "retrievedAt": "2025-08-11T15:13:54.442Z"
}
