{
  "title": "IHCRA fixes Rs1800 fee for dengue test at private labs",
  "link": "https://www.app.com.pk/national/ihcra-fixes-rs1800-fee-for-dengue-test-at-private-labs/",
  "date_published": "2022-09-15T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): Islamabad Health Care Regulatory Authority (IHCRA) has fixed Rs1800 for dengue test fee at private laboratories to facilitate the masses.\nPeople can get their test done at IHRA certified laboratories at a discounted rate, deputy commissioner Islamabad Irfan Nawaz Memon told the media on Thursday.\nHe said Islamabad Capital Territory Administration (ICTA) was making all-out efforts to keep citizens safe from dengue.\nTo prevent a dengue outbreak in the metropolis, he said all the stakeholders were taken onboard to expedite actions to contain the deadly virus.\nA dengue awareness campaign was also underway in schools, public parks, bus stands, shopping malls and hospitals to sensitize the masses about preventive measures for dengue.\nAround 192 patients were detected positive with the deadly fever during the last 24 hours, said the DC.\nMemon said separate wards and beds were allocated in government and private hospitals for the purpose.\nThe number of dengue patients in various government and private hospitals was 821.\nAll the assistant commissioners and surveillance teams were checking dengue hotspots on a daily basis, including junkyards, bus stops, tyre shops, under construction sites, service stations and graveyards.\nLast day, he said around 50 raids were conducted in Tarlai, Alipur Farash, Bhara Kahu, Nelore, Tarnol, Kuri Road and other places to ensure implementation of anti-dengue standard operating procedures, he added.\nThe DC said multiple teams were also leading anti-dengue fumigation drive that include workers from the Capital Development Authority (CDA), Municipal Corporation of Islamabad (MCI) and other departments.\n“All housing societies were directed to increase their fumigation activities,” said the DC. “A team is also tasked with rapid response for areas where dengue cases surface,” he added.\nHe said the ICTA administration had also imposed Section 144 in the city. Legal action will be taken against anyone found letting water accumulate outside their homes.\nAn official in ICTA told APP that Islamabad’s suburbs have begun to report a rising number of cases.",
  "retrievedAt": "2025-08-11T15:34:49.062Z"
}
