{
  "title": "Pakistan, Iran reaffirm desire to strengthen trade, connectivity",
  "link": "https://www.app.com.pk/national/pakistan-iran-reaffirm-desire-to-strengthen-trade-connectivity/",
  "date_published": "2022-09-15T15:13:00.000Z",
  "source": "APP",
  "content": "SAMARKAND, Sep 15 (APP): Prime Minister Shehbaz Sharif on Thursday met with Iranian President Seyed Ebrahim Raisi wherein both the countries agreed to further promote bilateral relations in diverse fields.\nDuring the meeting, held on the sidelines of the annual Meeting of the Council of Heads of State of Shanghai Cooperation Organization being held here, both sides affirmed the desire to strengthen cooperation in economic, trade, connectivity, energy, culture and people-to-people links.\nThe two leaders exchanged views on the entire range of bilateral relations.\nBoth the leaders positively evaluated the outcome of the Pakistan-Iran Joint Economic Commission and agreed to further promote bilateral relations in diverse fields.\nThe prime minister underscored the need for closer bilateral engagement for boosting economic and energy cooperation, operationalizing barter trade, opening border sustenance markets, and facilitation of Pakistani Zaireen.\nIt was agreed that Pakistan would be sending a delegation to discuss measures for expanded cooperation in bilateral trade and energy sectors.\nPrime Minister Sharif extended his gratitude to President Raisi and to the people of Iran for their solidarity and support with the Pakistani nation during the massive floods in the country.\nHe highlighted the devastating impact of the floods caused by climate change, and underscored that Pakistan, with the least carbon emissions, was bearing the cost of something for which it was not responsible.\nHe stressed the importance of tangible international action to help address the challenges that climatically vulnerable countries like Pakistan were facing.  The prime minister reiterated his invitation to President Raisi to visit Pakistan at the earliest convenience. President Raisi renewed his invitation to the prime minister to visit Iran.",
  "retrievedAt": "2025-08-11T15:34:47.135Z"
}
