{
  "title": "PM meets Putin; reaffirms commitment to expand trade, security cooperation",
  "link": "https://www.app.com.pk/national/pm-meets-putin-reaffirms-commitment-to-expand-trade-security-cooperation/",
  "date_published": "2022-09-15T14:26:00.000Z",
  "source": "APP",
  "content": "SAMARKAND, Sep 15 (APP): Prime Minister Shehbaz Sharif on Thursday met Russian President Vladimir V. Putin here wherein he reaffirmed Pakistan’s commitment to work closely with Russia to further expand and strengthen bilateral cooperation.\nDuring the meeting held on the sidelines of the Shanghai Cooperation Organization (SCO) Council of Heads of State, the prime minister said Pakistan was committed to expand cooperation with Russia across all areas of mutual benefit including food security, trade & investment, energy, defence and security.\nThe two leaders discussed bilateral ties and exchanged views on regional and international issues.\nThe prime minister thanked President Putin for Russia’s expression of solidarity and support for the people affected by the massive floods in Pakistan. He also shared details of the devastating impact of this climate-induced calamity.\nPrime Minister Sharif expressed satisfaction at steady growth of Pakistan-Russia relations, which were marked by strong mutual trust and understanding.\nIt was agreed to convene the next meeting of the Inter-Governmental Commission (IGC) in Islamabad at an early date.\nAppreciating Russia’s constructive role in Afghanistan, the prime minister said that both Pakistan and Russia had vital stakes in a peaceful and stable Afghanistan.\nHe said that it was essential to intensify the pace of international engagement on Afghanistan and reaffirmed Pakistan’s commitment to support all regional and international efforts to stabilize Afghanistan.\nDuring the meeting, Russian President Putin, while calling for need to work on connectivity and energy projects, discussed possibility of Pakistan Russia Stream Gas Pipeline project which he said required the infrastructure for delivery of LNG to Pakistan, according to a statement issued by the Russian presidency.\nIt was highlighted that the political stability in Afghanistan was essential to accomplish the connectivity projects.\nHe said Russia saw Pakistan as a priority partner in Southeast Asia and Asia as a whole and the relations between the two countries were developing “absolutely positively.”\nHe expressed condolences over the loss of life caused by floods in Pakistan. He said Russia had dispatched the necessary humanitarian aid to Pakistan and was ready to help organise assistance to the flood victims.\nPresident Putin said regrettably, the Pak-Russian bilateral ties subsided due to the pandemic, but the next meeting of the intergovernmental commission was scheduled to take place in Karachi this autumn.\nHe hoped that during the upcoming meeting, both sides would not only find ways to restore mutual trade but also to increase it.",
  "retrievedAt": "2025-08-11T15:34:47.508Z"
}
