{
  "title": "Fed govt providing relief to flood victims with dedication: Kaira",
  "link": "https://www.app.com.pk/national/fed-govt-providing-relief-to-flood-victims-with-dedication-kaira/",
  "date_published": "2022-09-15T17:12:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 15 (APP): Advisor to Prime Minister on Kashmir Affairs Qamar Zaman Kaira has said the federal government is busy in providing the maximum relief to the flood victims with dedication as the damage is very huge.\nTalking to the media during his visit to the office of Administrator Kashmir State Property here on Thursday, he said the government was distributing relief goods among the flood-affected people with the help of the Pak Army.\nHe said the National Disaster Management Authority (NDMA) and Provincial Disaster Management Authority (PDMA) were monitoring the relief work in an effective way.\nHe said that major part of relief work was being done by the provincial governments, adding that the Pakistan Tehreek-i-Insaf (PTI) was running governments in two provinces, Punjab and KPK, adding that the PDM was working in Balochistan and the PPP in Sindh.\nHe said that funds were also transparently distributing under the Benazir Income Support Programme.\nHe said Prime Minister Shehbaz Sharif and Foreign Minister Bilawal Bhutto were also striving hard to collect donations for the flood victims from countries, adding that relief goods were much needed as the damage was very huge.\nHe also appealed to the international community to help Pakistan to come out of this crisis.\nDiscussing the Kashmir state property in Pakistan, he said several things had been reviewed in the meeting, adding that some responsibilities had been given to the administrator, legal advisers and other people regarding the complaints.\nHe said strict legal action would be taken in case of embezzlement in the Kashmir state property after complete investigation.\nAdministrator Jammu and Kashmir state property Bilal Aftab Ahmad Khichi andSecretary Kashmir Affairs Sher Alam Mehsud were also present.",
  "retrievedAt": "2025-08-11T15:34:44.827Z"
}
