{
  "title": "Pakistan’s Floods; death toll touched 1,486, injured 12,749: NDMA",
  "link": "https://www.app.com.pk/national/pakistans-floods-death-toll-touched-1486-injured-12749-ndma/",
  "date_published": "2022-09-15T09:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): The death toll due to devastating monsoon floods across the country on Thursday surged amid property losses as five more perished in the past 24 hours, taking the total death count to 1,486.\nMoreover, 12,749 individuals were reported injured since the onset of the rainy season.\nThe National Disaster Management Authority (NDMA) issued a 24-hour situation report released on routine basis that accounted overall life, property and infrastructure losses due to the heavy rains which lashed out various parts of the country.\nThe heavy rains and flash floods caused deaths in various flood affected areas. The Provincial Disaster Management Authority (PDMA) Balochistan reconciled its data on deaths mentioning mortality number counted in incidents on September 9. It noted that one man, woman and child in Killa Saifullah.\nIn Khyber Pakhtunkhwa (KP), a man and child were reported dead and a man injured in Kurram District.\nThere was no incident or loss to report in Islamabad Capital Territory (ICT), Gilgit Baltistan (GB), Punjab, Sindh and Azad Jammu and Kashmir (AJK) during the last 24 hours.\nThe massive torrential rains in the past 24 hours have damaged 300 kilometers (km) roads in Balochistan whereas 10,336 livestock animal died whereas 5,091 houses got damaged during heavy downpour incidents including 2,166 fully damaged and 2,925 got partially damaged during rains.\nHowever the cumulative damages so far stated that almost 12,718 km road, 390 bridges and 1,760,372 houses and 918,473 livestock animals got damaged due to the heavy rains in various districts of all the provinces including that of Gilgit Baltistan and Azad Jammu and Kashmir (AJK).\nThe NDMA report highlighted that 81 districts across the country were notified as calamity hit areas with some 33,046,329 people affected, 179,281individuals rescued in various rescue operations and 546,288 people inhabited in camps.\nThe joint surveys for damage assessment were started in 30 districts of Balochistan and some 32 teams were deployed for the survey that was likely to be completed by September 25.\nIn GB, four teams were deployed in the region that started the survey from September 12 and was expected to complete by September 20.\nIn Punjab, three survey teams were deployed in the field that initiated the survey from September 12 and was expected to complete by September 30. In KP, some six teams were on the ground to initiate the survey that commenced on September 15 and would be completed by October 15.\nIn Sindh, the survey would commence as soon as practically possible and was expected to commence from September 25.",
  "retrievedAt": "2025-08-11T15:34:51.847Z"
}
