{
  "title": "PM, Kyrgyz President agree to enhance economic cooperation",
  "link": "https://www.app.com.pk/national/pm-kyrgyz-president-agree-to-enhance-economic-cooperation/",
  "date_published": "2022-09-15T16:33:00.000Z",
  "source": "APP",
  "content": "SAMARKAND, Sep 15 (APP): Prime Minister Muhammad Shehbaz Sharif met with President of Kyrgyzstan Sadyr Zhaparov on the sidelines of SCO Council of Heads of State meeting here on Thursday and exchanged views on growing bilateral relations.\nThe Kyrgyz President expressed sympathies and condolences over the loss of precious lives and damage to property in the massive floods in Pakistan caused by climate change.\nThe Prime Minister thanked President Zhaparov for the expression of solidarity and shared details of the devastation resulting from the unprecedented floods.\nHe also stressed the importance of urgent global action to address the threat of climate change and the need for support to countries like Pakistan that had virtually no contribution to carbon emissions.\nThe two leaders underscored the need for closer cooperation in trade, investments, energy and people-to-people contacts. The leaders accorded particular focus to further strengthening of high-level exchanges, inter-parliamentary relations, and defence and security ties.\nThe leaders agreed to convene the next meeting of the Joint Ministerial Commission at the earliest. They also reiterated their resolve for timely completion of the “CASA-1000” power transmission project.\nThe Prime Minister reaffirmed Pakistan’s readiness to facilitate Kyrgyz Republic’s access to the sea through Gwadar and Karachi ports. He also welcomed the resumption of chartered flights between the two countries.\nThe Prime Minister thanked for hosting more than 11,000 Pakistani students in medical universities of the Kyrgyz Republic and hoped that the Kyrgyz government will continue to facilitate them and ensure their safety and security during the period of their educational stay in the country.\nThe two sides agreed to maintain regular high-level contacts. The Prime Minister extended an invitation to President Zhaparov to visit Pakistan at an early date.",
  "retrievedAt": "2025-08-11T15:34:45.560Z"
}
