{
  "title": "Ashrafi urges Muslim world’s aid agencies to help flood victims in Pakistan",
  "link": "https://www.app.com.pk/national/ashrafi-urges-muslim-worlds-aid-agencies-to-help-flood-victims-in-pakistan/",
  "date_published": "2022-09-15T13:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi, emphasizing the need to accelerate the relief activities, Thursday urged the Muslim world’s aid agencies to help the flood victims in Pakistan.\nTalking to APP, Ashrafi who is also the chairman of Pakistan Ulema Council, assured the development charities for all possible support to conduct relief and rehabilitation work in the flood-hit areas of the country.\n“His august office and state institutions doors are always open to those organizations and individuals want to help the people facing critical situation due to monsoon rains and flash floods in the country,” he added.\nHe also asked the government machinery to further improve the cooperation and coordination mechanism with the national and international philanthropists and welfare agencies that wanted to carry out relief activities in the flood affected areas.\nExpressing gratitude to Saudi government for taking extraordinary measures to help the flood-stricken people in Pakistan, he said the King Salman Humanitarian Aid and Relief Center (KSrelief) had dispatched hundreds of tons relief goods including food, medical supplies and shelters in the affected areas so far.\nAshrafi also welcomed the KSrelief’s initiative for launching a countrywide humanitarian campaign to help the flood affected people in Pakistan.\nHe said Khateeb and Chief Imam of Masjid Al Haram Sheikh Abdul Rehman Al Sudais had also appealed the Muslim Ummah to come ahead for all-out support to the affected people.\nKeeping in view the prevailing crisis, he proposed the political leadership of the country to express unity particularly to cope with this national emergency on a war footing.\nLauding Ulema and Mashaykh’s contribution in the rescue and relief activities across the country, he said theywould seek philanthropists assistance in their Friday sermons for the flood-ravaged people by highlighting the blessings of Allah Almighty for those who help their brethren in need.",
  "retrievedAt": "2025-08-11T15:34:48.379Z"
}
