{
  "title": "Govt efforts continue to reduce number of missing persons",
  "link": "https://www.app.com.pk/national/govt-efforts-continue-to-reduce-number-of-missing-persons/",
  "date_published": "2022-09-15T13:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): Federal Minister for Law and Justice Senator Azam Nazeer Tarar on Thursday assured the participants of the cabinet sub-committee on enforced disappearance and missing persons that government’s effort was to reduce the number of missing persons cases in future and get rid of this scourge.\nHe expressed these views while chairing a meeting of Cabinet sub Committee to deliberate a policy relating to enforced disappearances.\nFederal Interior Minister Rana Sanaullah, Federal Minister for Science and Technology Agha Hassan Baloch, Federal Minister for Poverty Alleviation Shazia Marri, Federal Minister for Maritime Affairs Faisal Sabzwari, Senator Kamran Murtaza, IG Islamabad Police, DIG Balochistan, DIG Sindh, anchor person Naseem Zahra, parents of missing journalist Mudassar Mehmood Naro, Prof. Faisal Manzoor Baloch, human rights activist Sami Baloch and daughter of missing Dr. Deen Muhammad Baloch participated in the meeting.\nThe Minister said that the missing persons who could be traced should have access and this cycle could be stopped in the future.\nThe Interior Minister said that the government fully understand the pain and sorrow of the families of the missing persons, it wanted to proceed with this issue in good faith.Shazia Marri said that people’s hopes had been restored from this committee.\nHuman rights activist Sami Baloch said that she had high hopes for this committee due to which the families of the missing persons ended the ongoing sit-in in Quetta.On this occasion, the Law Minister thanked the participants of the Balochistan sit-in for ending the sit-in and trusting the committee.\nAnchor person Naseem Zahra expressed his views on the issue of enforced disappearance and missing persons, while the parents of missing journalist Mudassar Mahmood Naro submitted submissions before the committee regarding the disappearance of their son.\nNaseem Zahra hailed the process of calling the meeting of the committee every week and said that this was the first time that a forum had shown seriousness for the recovery of missing persons.",
  "retrievedAt": "2025-08-11T15:34:47.483Z"
}
