{
  "title": "Vandalism of Sikh leader’s poster, Hindu temple triggers tension in Canada",
  "link": "https://www.app.com.pk/national/vandalism-of-sikh-leaders-poster-hindu-temple-trigger-tension-in-canada/",
  "date_published": "2022-09-15T09:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 15 (APP): The situation in Canada’s multicultural district of Brompton turned tense after the police arrested an Indo-Canadian man for vandalizing Sikh leader Shaheed Jarnail Singh Bhindranwale banner in Caledon city, days ahead of Khalistan Referendum voting scheduled on September 18.\nOntario Provincial Police confirmed that it has charged an Indo-Canadian man with criminal mischief for vandalizing Sikh leader banner in Caledon which led to community tensions as Caledon was home to thousands of Sikhs who have protested the attack on their revered figure, according to media reports.\nThirty-eight years after he was killed in ‘Operation Blue Star’ in Amritsar, Punjab, nationalist Sikh leader Jarnail Singh Bhindranwale is regarded as a martyr, saint and icon of Khalistan movement by tens of millions of Sikhs.\nTwo videos have gone viral on social media showing Shaheed Bhindranwale’s billboard in a main roundabout being vandalized. Another video shows a man tearing down Shaheed Bhindranwale pictures from the billboards, advertising Khalistan Referendum.\nThe vandalization of Khalistan Referendum banners is being considered as an attempt to anger pro-Khalistan Sikhs who had taken out large scale rallies in support of 18 September voting.\nA video of “Khalistan Zindabad” and “Hindustan Murdabad” graffiti outside famous BAPS Mandir in Toronto went viral on social media with both Hindu and Sikh netizens blaming each other for the vandalism.\nHowever, no one has been arrested in connection to the attack on the Mandir. Netizen have shared a video showing the “Khalistan Zindabad” slogan written at the entrance of the local Hindu temple.\nResponding to the video, the netizens expressed hate for the Sikh community. Several users called for graffiti against Sikh Gurdwaras in Surrey and Brampton in response to the graffiti.\nLocal Indian community leaders have confirmed that hooligans have targeted Khalistan Referendum banners and posters with Shaheed Bhindranwale pictures.\nKhalistan Referendum campaign — in which Sikhs are asked to answer the question “Should Indian governed Punjab be an independent country?” — has drawn fierce opposition from New Delhi, Indian media and pro-India segments of Non-Resident Indians (NRIs).\nIt’s being organised by Sikhs For Justice (SFJ) – a human rights group which has held Khalistan referendum voting in the UK and Europe, drawing tens of thousands of Sikhs.",
  "retrievedAt": "2025-08-11T15:34:51.221Z"
}
