{
  "title": "Arrangements finalized in AJK to observe Kashmir Solidarity Day",
  "link": "https://www.app.com.pk/national/arrangements-finalized-in-ajk-to-observe-kashmir-solidarity-day/",
  "date_published": "2020-02-02T00:58:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK):, Feb 02 (APP):In Azad Jammu and Kashmir (AJK), adequate arrangements have been given final touches to observe Kashmir Solidarity Day on February 5 to reiterate complete solidarity with the brethren of turbulent Indian occupied Jammu & Kashmir (IOJ&K).\nThe day would be observed to express solidarity with Kashmiri brethren coupled with the renewal of the pledge to continue extending fullest support to the Kashmiris globally-acknowledged legitimate right to self determination.\nIndia has kept bulk part of the internationally-acknowledged disputed Himalayan state in its illegal and forcible occupation against the aspirations of the people of the state.\nThis year, the Kashmir Solidarity Day was being observed in most tragic scenario that was followed by August 05, last year sinister act of scrapping special status of the IOJ&K by the hardliner Modi-led Indian government through abrogation of the article 370 and 35-A of the Indian constitution.\nThe bleeding occupied valley has been turned into the world’s largest prison following imprisonment of the people protesting against the nefarious Indian action under the shadow of the occupying Indian guns. It would be a state holiday across the AJK.\nThe people and governments of Pakistan and AJK observe the solidarity day every year not only to renew their deep-rooted love and affection with the people of IOJ&K but also to reiterate their commitment and dedication to the liberation of the motherland from the Indian subjugation.\nThe day will dawn with special prayers for the martyrs of Kashmir, victory of the freedom struggle and expression of solidarity with the Kashmiri people. Besides mass rallies, symposia, walk-for-peace, conventions meetings and speech declamations, a unique ceremony at all the six bridges, linking Pakistan and AJK—where a human chain comprising Pakistanis and Kashmiris to convey solidarity with each other, will be the hallmark of the day-long events everywhere to observe the day.\nCommenting on the scheduled observance of the Kashmir Solidarity Day this year, Vice Chairman National Events Organizing Committee and Mirpur Assistant Commissioner Yasir Riaz has said that the Kashmir liberation movement is in full momentum in Jammu & Kashmir state and the celebration of Kashmir Solidarity Day always marked an impact on the liberation movement, by giving it fresh momentum this day of Feb 5 every year.",
  "retrievedAt": "2025-08-11T18:43:58.842Z"
}
