{
  "title": "PM highlighting Kashmir issue internationally as its ambassador: Murad",
  "link": "https://www.app.com.pk/national/pm-highlighting-kashmir-issue-internationally-as-its-ambassador-murad/",
  "date_published": "2020-02-02T10:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 2 (APP):Minister for Communications and Postal Services Murad Saeed Sunday said Prime Minister Imran Khan is presenting the Kashmir issue at international forums as an ambassador of Kashmiris.\n“We are exposing horrible face of India to the world. Kashmir is a national cause and the whole Pakistani nation will observe upcoming Kashmir Day in its true sense to express absolute solidarity with the Kashmiris.”\nHe was talking to media personnel at Islamabad-Murree Dual Carriageway (IMDC) here.\nOn this occasion National Highway Authority (NHA) also arranged “Solidarity with Kashmir Art Competition” in collaboration with Street Art Pakistan in which a large number of students from the universities of the twin cities and that of Lahore and National College of Arts participated.\nThe students on the wall of Islamabad-Murree Dual Carriageway (IMDC) painted pictures expressing solidarity with Kashmiri Brethren.\nMurad saeed commended the artistic capabilities of the participating students. He also planted saplings along the IMDC.\nSecretary Communications Division Jawwad Rafique Malik, Chairman of NHA Capt (R) Sikandar Qayyum and senior officers from Ministry of Communications, National Highway Authority, National Highways and Motorway Police and local administration were also present.\nThe minister said six months back the Prime Minister Imran Khan exposed the terrifying face of Bharti Hitler Narendra Modi to the world. From that day to date, the Government of Pakistan is presenting Kashmir issue effectively on international forums including United Nations and World Economic Forums.\nIt is a great success of our foreign policy, that Kashmir issue is discussed thrice in the Security Council of the United Nations during the last six months.\nMurad Saeed said, Kashmir is not the internal issue of Bharat as now it is going to solution internationally.\nHe urged to utilize social media for the Kashmir cause in a more effective way. He said, “Kashmiris say we are Pakistanis. We say, Kashmiris are ours and Kashmir is ours”. He reiterated commitment to highlight Bharti atrocities in occupied Kashmir on International level.\nChairman of NHA Capt (R) Sikandar Qayyum also presented special shields to visiting Minister Murad Saeed and Federal Secretary Communications Jawwad Rafique Malik.",
  "retrievedAt": "2025-08-11T18:43:47.795Z"
}
