{
  "title": "ML-1, project to increase speed, passengers, reduce travelling time: Minister",
  "link": "https://www.app.com.pk/national/ml-1-project-to-increase-speed-passengers-reduce-travelling-time-minister/",
  "date_published": "2020-02-02T03:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 2 (APP):In order to increase speed, passengers and reduce travelling time from Peshawar to Karachi, a feasibility of ML-1, project has been prepared to achieve progress in the railway system.\nMinister for Railways, Sheikh Rashid Ahmed, expressed these views while talking to a private news channel programme.\nHe said initiating ML-1 project was the only way out to run railways system without any trouble.\nThe feasibility of this gigantic new track project of worth billions of dollars had already been finalized and the tender would be invited in next few weeks, he stated.\nCommenting on Tazgam inferno, he said an inquiry had already been ordered to investigate the train tragedy.\nSheikh Rashid said the responsible elements behind this accident would be awarded punishment as per inquiry report.\nIn reply to a question, he said ML-1 project would open a large number of jobs.\nTo a question about rising train mishaps, the minister said it was quite dangerous to use 18th century railway track in the present circumstances. There was a dire need to construct a new track without delay, otherwise, the people could face problem while travelling by train, Sheikh Rashid warned.\nWe could use this centuries old track for some ten years more but constructing new track, would only be the solution to get rid of any type of train or railway crossing accidents. To a question, he said an efficient and diligent officers would be required to smooth running of the management of railways.\nAbout Railway corruption, he said Chief Justice of Pakistan’s (CJP) observation could not be ruled out.\nHe, however said that all out measures have been taken to make the railway corruption free. He claimed that with old material and locomotive, the railway had generated billions of rupees, profit.",
  "retrievedAt": "2025-08-11T18:43:51.844Z"
}
