{
  "title": "Sheikh Rashid assures full cooperation for timely execution of KCR",
  "link": "https://www.app.com.pk/national/sheikh-rashid-assures-full-cooperation-for-timely-execution-of-kcr/",
  "date_published": "2020-02-01T23:43:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 02 (APP):Minister for Railways Sheikh Rashid Ahmed Sunday assured the Sindh government that his ministry will extend all possible cooperation and support for timely execution of\nKarachi Circular Railways (KCR) project, including handing over Pakistan Railways land; if required for this project.\nAddressing media at his Camp Office here, the minister said that in compliance with the directives of the Supreme Court of Pakistan on this account, he would hold a meeting with Sindh Chief Minister Syed Murad Ali Shah at the Chief Minister House on Monday to discuss the issues/hindrances to KCR.\nHe said Pakistan Railways had got vacated its 38 kanals of land occupied in the city and five kanals more was yet to be vacated. “It is history, no one can occupy Railways land for long,” he remarked.\nHe said his ministry had conceived many projects for strengthening/ modernizing railways network including upgradation of 1885 Kilometers track named ML-1 at estimated cost of Rs 9 billion. It would be a milestone for the development and prosperity of Pakistan Railways. At least, 100,000 jobs would be created through this project, besides a modern university would be set up in Sindh as a part of it.\nRecognizing the importance of Karachi in the country’s economy, he said, the most experienced and well-reputed team of PR officers would soon be transferred here from Lahore, the PR Headquarters.\n“We realize potential of Karachi as the ports city and an international economic hub. Karachi section is the backbone of Pakistan Railways and due importance was not given to it in the past,” he said.\nHe said in pursuance of its revolutionary programme, Railways Ministry had planned to uprgrade PR workshop in Hyderabad so that engines and bogies could be repaired /overhauled there instead of sending to Mughulpura workshop in Lahore.\nA goods train was also being launched to support Pak-Afghan transit trade. He said three freight trains were handed over to private companies and the Ministry would welcome any private company bringing engines and bogies under “our policy of Free Track”.\nSheikh Rashid Ahmed said that due to limited resources it was difficult for Pakistan Railways to run more trains, he added.\nTo a query from media, he said through better policy and administrative steps, Pakistan Railways had brought down its deficit in revenue by rupees four billion and this year it would be further reduced by Rs 6 billion.\n“We will bring deficit to zero level in 3 years, against targeted period of 5 years,” he reaffirmed.\nTo another question, the Railways Minister said Pakistan Railways fares were rationalized to bring improvement in the railways services.\nWhen his attention was drawn to Coronavirus, Sheikh Rashid Ahmed said it could impact Pakistan’s economy, especially textile sector.\nTo a question, he said Pakistan Railways hospitals in Karachi would be revamped and run under public-private partnership.",
  "retrievedAt": "2025-08-11T18:43:59.934Z"
}
