{
  "title": "Action initiated against top customs officials upon PM’s direction",
  "link": "https://www.app.com.pk/national/action-initiated-against-top-customs-officials-upon-pms-direction/",
  "date_published": "2020-02-02T04:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 2 (APP):A wide scale sweeping action against high ranking customs officials found involved in smuggling of valued goods and causing billions of rupees losses to the national kitty, was underway on the direction of Prime Minister Imran Khan.\nUnder this drive, a number of high ranking officials including four top collectors had been removed from posts due to their failure to control smuggling in various forms, including misdeclaration of valued goods and evasion of taxes, a government source privy to the massive probe confided to APP on Sunday.\nThese officials included four collectors Raza Baloch, Ahsan Ali Shah, RS Syed Naghmani, Dr Iftikhar and member customs Jawad Agha, the source told.\nThe prime minister himself, during his public addresses, had hinted at the working of certain mafia within the customs under the patronage of influential political clout which in the past also stymied performance of the Federal Board of Revenue.\nThe prime minister had repeatedly expressed his zero tolerance over the issue of corruption in all walks of life and resolved to bring transparency in the public sector functioning. All the ministries and divisions had been directed to take above board action against all those involved in corruption.\nSuch robust drive under the PTI government’s manifesto had again given a clear and loud message to all officials that no incidence of corruption would be tolerated and swift punitive action would be taken against them.\nUpon the basis of concrete reports of the customs intelligence, the FBR in its press release also acknowledged removal of five senior officers along with the dealing officials from the key positions at the head of Customs operations and regional Collectorates in Peshawar and Quetta.\nThis action has been taken to stem the illegal flow of foreign origin goods without payment of due amount of duty and taxes into the country.\nThe scourge of smuggling and tax evasion at the country’s borders directly led to increase in prices of daily commodities, thus badly affecting the common man.\nInterestingly, the source further divulged that in the light of the FIA’s investigation into this scam, quantum of wheat smuggling could also be exposed, paving way for initiation of legal action against all those involved in it irrespective of their authority or political sway.\nThe Federal Investigation Agency has been tasked to formally proceed against these officials and thoroughly investigate the issue.\nAccording to the source, a number of arrests might take place shortly.\nThe unprecedented move initiated after a report of Customs intelligence was submitted for the perusal of the prime minister who was keenly pursuing such issues.\nThe source further claimed that due to the influence of such powerful mafia, even the FBR, in the past, had found itself helpless to swing into action.\nOnce the investigation was completed by FIA, the further leads about the role of this racket, officials’ connivance, their incompetence or other reasons would be unearthed.\nAccording to details as provided by FBR, at the Torkham customs-station in the Khyber Pakhtunkhwa, Afghan goods vehicles were entering and leaving the station without filing the mandatory Goods Declaration (GD) for import clearance and without paying any duty and taxes.\nOnly fake GDs were used for the gate passes. Besides, assessment of duty and taxes was not being done properly, giving undue benefit to the importers, at the expense of public exchequer.\nThe report revealed that so far, 355 such vehicles were identified as having managed to escape the mandatory filing of GD and payment of duty and taxes due to collusion and corruption at that station.\nSimilarly,discrepancies were reported in import clearance of prime quality iron bars, white spirit, and Afghani fruits at customs-stations in the Balochistan province.\nAccording to the source, in Karachi as per reports, more than 500 containers were detected involving misdeclarations amounting to billions of rupees in tax evasion.",
  "retrievedAt": "2025-08-11T18:43:50.039Z"
}
