{
  "title": "Faisalabad playing pivotal role in strengthening national economy: Sadiq Sanjrani",
  "link": "https://www.app.com.pk/national/faisalabad-playing-pivotal-role-in-strengthening-national-economy-sadiq-sanjrani/",
  "date_published": "2020-11-20T11:31:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Nov 20 (APP): Senate Chairman Muhammad Sadiq Sanjrani has said that Faisalabad is one of the most important cities among other industrial ones which is playing a pivotal role in strengthening national economy.\nHe was talking to the media after inaugurating a new textile spinning mills at the Faisalabad Industrial Estate on Friday.\nHe said that future of Pakistan was directly linked with industrialization as it would not only help industrialists to earn profit but also create much need job opportunities in addition to paying taxes to run the country.\nHe appreciated the resilience of local industrialists and said that they had faced difficult times and now they were going to harvest fruits of development very soon. He invited the industrialists to invest in Gawadar which would be new future of Pakistan.\nHe added that: “Overall environment in Baluchistan is feasible for investment and there is no issue of law and order especially in Gawadar”.\nHe invited industrialists to personally visit and see peaceful environment in Gawadar where regularly international conferences and seminars were held.\nHe said that establishment of industrial units in Gawadar would also help exporters to save extra charges of transportation and they could export their foreign consignments without wastage of time.\n“Their investment will not only help Baluchistan but also benefit Pakistan as a whole”, he added.\nHe also appreciated the courage of industrialists who boldly faced coronavirus. He said that it was time when many countries bowed down and closed their units, but Pakistan tactfully faced the pandemic and not only saved the people but also continued the manufacturing process in the country.\nChief Executive Officer Faisalabad Industrial Estate Management Company (FIEDMC) Amir Sleemi, Sheikh Danish of Best Exports Group and prominent industrialists were also present.\nEarlier, the chairman also visited Sadaqat Mills where CEO Sheikh Khurram Mukhtar briefed him about industrial activities.",
  "retrievedAt": "2025-08-11T20:02:23.752Z"
}
