{
  "title": "Issue of missing persons to be solved once and for all times, SCP told",
  "link": "https://www.app.com.pk/national/issue-of-missing-persons-to-be-solved-once-and-for-all-times-scp-told/",
  "date_published": "2024-12-04T08:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 4 (APP):The Federal Cabinet has formed a sub-committee to look into the matter of missing persons in order to resolve the issue once and for all.\nThis was stated by the Deputy Attorney General for Pakistan (AGP) Javed Iqbal while arguing before the six-member Constitutional Bench of the Supreme Court of Pakistan Wednesday.\nThe AGP pleaded before the Court that the Federal Government is concerned about the issue of missing persons and has formed a sub-committee of the cabinet to look into the matter and make recommendations.\nThe Constitutional Bench of the Supreme Court of Pakistan, headed by Justice Amin-ud-Din Khan, issued notices to the Federation, the Ministry of Interior and all other parties in the case to produce their reports before the court in the next hearing to be conducted in the coming week.\nJustice Jamal Mandokhail, during the proceedings, observed that this is a significantly important case. Thousands of people are reported missing and cases have been filed in the High Courts and the Supreme Court, he said.\nPoliticians like Barrister Aitzaz and Latif Khosa were present in the Court.\nMandokhail said this issue needs to be addressed by the parliament. However, the Court continued to observe that such a serious issue can not be addressed through mere words without action.\nJustice Muhammad Ali Mazhar inquired from the AGP as to how many missing persons were being recovered by the Commission of Inquiry on Enforced Disappearance (COIED).\nJustice Hasan Azhar Rizvi, questioned, that the COIED has the data. What does the data say about the culprits behind the disappearance? What do the recovered people say about their abductors?\nJustice Jamal Mandokhial, while indicating some previous incidents of forced disappearance, said that some missing persons after being recovered said that were not missing and were in the Northern Areas for rest and fun.\nJustice Musarrat Hilali, while addressing ASC Latif Khosa, questioned him, that people from your party too were gone missing. What was their statement about the abductors on their return?\nASC Khosa responded to the Court and said that their kids would be abducted if they spoke.\nJustice Naeem Afghan referred to a case in the Balochistan High Court, in which 25 lawyers were directed by the court to go to the homes of the missing persons after they arrived back. Nobody was however willing to appear before the court. One purpose of this exercise was to know if some individuals from the Army are involved, the Court may ask for their court martial, he added.\n‘Solution to the issue of forced disappearance is on all the stakeholders to sit together and sort out the way out’, Justice Mandokhial remarked.\nThe Court adjourned the hearing for next week and served notices to the federation and the Ministry of Interior for fresh reports on the issue.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:17:57.622Z"
}
