{
  "title": "NDMA conducts “Winter Freeze” simulation exercise to enhance disaster preparedness",
  "link": "https://www.app.com.pk/national/ndma-conducts-winter-freeze-simulation-exercise-to-enhance-disaster-preparedness/",
  "date_published": "2024-12-04T12:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 4 (APP):The National Disaster Management Authority (NDMA) has conducted a two-day simulation exercise, “Winter Freeze”, to bolster Pakistan’s readiness for winter-related disasters, including extreme cold weather, smog, and earthquakes.\nThe “Winter Freeze” exercise took place at the NDMA headquarters from December 3rd to 4th, 2024.\nThis event is part of NDMA’s ongoing efforts to strengthen the country’s disaster preparedness and response mechanisms.\nThe simulation included a series of challenging scenarios, such as a severe blizzard hitting northern areas which led to snowstorms, road blockages, power outages, and stranded tourists in parts of the country.\nThe exercise also simulated a major earthquake in northern Balochistan and southern Khyber Pakhtunkhwa, testing the effectiveness of rescue operations, medical response and mobilization of humanitarian response in remote areas.\nAdditionally, the simulation addressed severe smog conditions in Punjab, particularly in Lahore, focusing on the health impacts, emergency medical responses and measures to prevent the dangers of air pollution.\nThe participants of SimEx included Provincial Disaster Management Authorities (PDMAs), Gilgit-Baltistan Disaster Management Authority (GBDMA), State Disaster Management Authority (SDMA) law enforcement bodies, and representatives of humanitarian organizations.\nParticipants acknowledged the platform provided by NDMA for preparedness and timely measures to deal with disasters and also gave their feedback and suggestions so that possible future disasters can be avoided. Effective action plans can be drawn up to deal with disasters and emergencies.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:25:44.048Z"
}
