{
  "title": "Ethiopia, Pakistan agree on enhancing aviation cooperation",
  "link": "https://www.app.com.pk/national/ethiopia-pakistan-agree-on-enhancing-aviation-cooperation/",
  "date_published": "2024-12-04T13:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 04 (APP): Ethiopia and Pakistan on Wednesday agreed to bolster the bilateral relations by expanding their cooperation in the aviation sector.\nBoth sides agreed to this end during a meeting between Special Envoy and Ambassador Extraordinary and Plenipotentiary of Ethiopia to Pakistan, Dr. Jemal Beker Abdula and Federal Secretary for the Ministry of Aviation Ahsan Ali Mangi.\nDuring the meeting, they had a detailed discussion on the matters of mutual interests including the bilateral cooperation for increasing air connectivity between the two countries, and also transferring knowledge and technology.\nDuring the meeting, Ambassador Dr. Jemal expressed his gratitude for the crucial support extended by the government of Pakistan in the commencement of the Ethiopian Airlines’ operations in Karachi. He underscored the significance of launching the Ethiopian Airlines in other cities of Pakistan to increase mobility not only between Ethiopia and Pakistan, but also Africa and Pakistan.\nThe ambassador briefed the federal secretary on the pivotal role being played by Ethiopian Airlines in the effective implementation of the ‘Look Africa and Engage Africa’ policies of Pakistan strengthening government-to-government, people-to-people, and business-to-business relations between Pakistan and African countries.\nHe said the Ethiopian Airlines have been brought to this country under the ‘Enter and Operate in Africa through Ethiopia’ policy launched by the Ethiopian Embassy Islamabad.\nThe ambassador also highlighted the growing popularity of Ethiopian Airlines among the people of Pakistan who have been fully appreciating the services offered by one of the largest airlines in the world.\nOn the other hand, Ahsan Ali Mangi acknowledged the critical role being played by Ethiopian Airlines in bringing Africa closer to Pakistan and assured the ambassador of his institution support in advancing the bilateral cooperation in the aviation sector.",
  "retrievedAt": "2025-08-10T12:24:33.623Z"
}
