{
  "title": "Billion dollars’ investment from Saudi Arabia being actualized: Tarar",
  "link": "https://www.app.com.pk/national/billion-dollars-investment-from-saudi-arabia-being-actualized-tarar/",
  "date_published": "2024-12-04T15:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 04 (APP): Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar on Wednesday said a number of Memoranda of Understanding (MoUs) signed between Pakistan and Saudi Arabia this year for billion dollars of investment have been actualized, boosting the national economy and creating job opportunities in the country.\nThe Minister revealed the information in a news conference following the successful visit of Prime Minister Shehbaz Sharif to Saudi Arabia where he attended the One Water Summit and held meetings with the global leaders including Saudi Crown Prince Mohammed Bin Salman and President of France Emmanuel Macron.\nHe said PM Shehbaz had returned from Saudi Arabia today after a brief but successful and significant visit.\nIn last six months, he said the prime minister had held five meetings with the Saudi Crown Prince that reflected a significant boost in the Pak-Saudi relations that had reached to the new heights. “It also validates that the 28 MoUs signed between the two countries during the recent visits of the high-level Saudi delegations are on the ground and actualizing,” he added.\nThe minister cited opening of Aramco Petrol Pumps in different cities of Pakistan as an outcome of these billion dollars’ investment from Saudi Arabia. The process for the launch of Al-Baik food chain in Pakistan was also underway, he added.\nHe said the leadership of Saudi Arabia, in the last night meeting, had expressed their delight and satisfaction over actualization of the MoUs signed between the two countries in diverse sectors including agriculture, mines and minerals, energy, and IT skills.\nTarar cited the Crown Prince as saying that “Pakistanis are our brothers and sisters, and there is no limit for investment in Pakistan.” Yesterday meeting of the prime minister with the Crown Prince was a historic event and a milestone in the bilateral relations of the two countries,” he added.\nHe said during the meeting, both the countries’ leadership agreed on enhancing relations in the areas of economy, business and investment to further strengthen their exemplary relations.\nTarar said the prime minister had expressed good wishes for the Khadim al-Haramayn al-Sharifayn also.\nHe said PM Shehbaz Sharif had not only advanced Pakistan’s foreign policy, but also revived and stabilized the economy, for which he is being appreciated by the global leaders.\nUnder the leadership of PM Shehbaz, he said, the stock market had crossed 100,000 points, interest rate and KIBOR stood at 15 per cent and 13 per cent, respectively and on top of that the inflation had plummeted to 4.8 per cent which has broken all previous records.\nOn the other hand, he said the Pakistan Tehreek-e-Insaf had decimated the economy and harmed Pakistan’s relations with brotherly countries.",
  "retrievedAt": "2025-08-10T12:21:23.554Z"
}
