{
  "title": "Multiple projects for Gwadar, Lasbella uplift on cards",
  "link": "https://www.app.com.pk/national/multiple-projects-for-gawadar-lasbella-uplift-on-cards/",
  "date_published": "2021-02-21T08:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 21 (APP): The Balochistan government will soon start carrying out multiple development projects amounting to Rs 12.3 billion in as many as 45 union councils of Gwadar and Lasbella for socio-economic development of its residents.\nAll the proposed development projects had received approval of the competent authority, an official of the Balochistan government told APP.\nHe said the approved projects included construction of two Jetties at Jiwani and Ormara and floating Jetti at Kundmalir, establishment of eight hatcheries and 80 commercial net cultures.\nUnder the special development initiative, he said programmes would be initiated with an aim to impart vocational and technical trainings to around 12,000 females and 6,300 males.\nThe official said the government was striving to develop the coastal area, with an objective to pull the people out of poverty by covering all ultra-poor households.\nIn addition to digitization, he said more initiatives would be rolled out soon to boost the sector, which remained neglected for the last couple of decades due to negligence of previous governments.\nHe said the provincial government was making all-out efforts to ensure provision of basic facilities including education and health to its people so that maximum people could be pull out of poverty.\nA holistic strategy was also prepared to construct 120 kilometers road infrastructure in the coastal area for socio-economic development of the fisher folks, he said, adding “The province has a capacity to produce good quality fish for the global market, which can generate more revenue for the province,” he maintained.\nTo a query, he said Chief Minister Balochistan Green Boats Scheme for fishermen would be completed in the financial year 2020-2021 with a cost of Rs500 million.\nHe said Rs 150 million would be earmarked for setting up rest houses, restaurants, motels, international fast food chains, wash rooms and emergency response centers at coastal tourist destinations during the next financial year.\nThe state of the art hospital was also being set up at Gwadar to ensure best health facilities to the people of the area, he noted.",
  "retrievedAt": "2025-08-11T20:23:32.006Z"
}
