{
  "title": "IHC seeks details of vacant posts at Patwar Circle",
  "author": null,
  "content": "ISLAMABAD, Sep 25 (APP):The Islamabad High Court (IHC) on Thursday directed the Deputy Commissioner ICT to fill the details of vacancies within seven days in a case against private individuals doing official work in the Patwar Circles of the federal capital.\nJustice Mohsin Akhtar Kayani, hearing the case, remarked that if the vacancies are not filled, the Secretary Establishment Division will have to be summoned.\nDuring the hearing, the petitioner, the Additional Attorney General, Assistant Attorney General and Deputy Commissioner Islamabad appeared in court.\nThe Deputy Commissioner told the court that he had written a letter to the ministry for permission in July but has not yet received permission for recruitment. Justice Kayani expressed annoyance over not implementing the court order and said that it has been a year since these stories were being told. They are doing illegal work by appointing secretaries in the Patwar Circles.\nThe court remarked that it is necessary to serve a contempt of court notice to every officer and make them work. It said that they do not implement the court decision, they are CSP officers and they do not understand one thing, adding that none of the Attorney General’s Office, Advocate General’s Office, State Council give a correct answer. Clear all the vacancies within seven days.\nThe Deputy Commissioner should personally take steps to fill the vacant seats with the Secretary Establishment. The Civil Judge and Revenue Officer do not have the authority to fix the issues.\nJustice Kayani said that eleven people are running an illegal Patwar Khana. The court adjourned the hearing of the case till October 7.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:29:36.752Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ihc-seeks-details-of-vacant-posts-at-patwar-circle/",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T17:39:00.000Z"
}
