{
  "title": "Conference on strategic realignments in the Indian Ocean region concludes",
  "author": null,
  "content": "ISLAMABAD, Sep 25 (APP):The Maritime Centre of Excellence (MCE) organised the second conference titled “Shifting Tides Revisited: Strategic Realignments in the Indian Ocean Region – One Year On” at Pakistan Navy War College (PNWC), Lahore.\nThe conference focused on the evolving strategic landscape of the Indian Ocean Region (IOR) amid intensifying great-power rivalry, the growing impact of emerging technologies, and Pakistan’s adaptive strategies, said a news release issued by the Director General Public Relations (Navy).\nWhile addressing the gathering, former Chairman Joint Chiefs of Staff Committee Gen Zubair Mahmood Hayat (Retd) said: “If any violence or mischief is planned or executed against Pakistan from the sea, the onus of what happens thereafter squarely rests on Bharat’s shoulders. Let there be no ambiguity; Pakistan’s response will be swift, unexpected and meaningful.”\nFormer Foreign Minister Hina Rabbani Khar, in her remarks on the evolving maritime challenges of the Indian Ocean, emphasized the importance of diplomatic foresight, regional cooperation and multilateral engagement.\nEarlier, President MCE and Commandant PNWC, Rear Admiral Sohail Ahmad Azmie, welcomed the distinguished guests in his opening remarks, highlighting the strategic significance of the IOR and the challenges arising from international disputes.\nOther eminent speakers included Advisor NCA and former DG SPD Lt Gen Khalid Ahmed Kidwai (Retd); former Foreign Secretary Ambassador Aizaz Ahmad Chaudhry; Vice Admiral Khan Hasham Bin Saddique (Retd); President National Institute of Maritime Affairs (NIMA) Vice Admiral Ahmed Saeed (Retd); President Centre for Aerospace and Security Studies (CASS) Islamabad Air Marshal Javaid Ahmed (Retd); Director External Linkages QAU Prof Dr Salma Malik; Rear Admiral Syed Faisal Ali Shah (Retd); and Executive Director Strategic Vision Institute (SVI) Brig Dr Naeem Salik (Retd).\nThe conference was attended by leading diplomats, defence officials, members of the media, scholars and a large number of university students, reflecting wide professional and academic interest in the evolving dynamics of the Indian Ocean Region.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:29:13.540Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/conference-on-strategic-realignments-in-the-indian-ocean-region-concludes/",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T19:09:00.000Z"
}
