{
  "title": "Uzbekistan, UNO to expand full-scale partnership, tasks to achieve SDGS",
  "author": null,
  "content": "ISLAMABAD, Sep 25 (APP):President of the Republic of Uzbekistan Shavkat Mirziyoyev held talks with United Nations Secretary-General António Guterres, in the framework of the events of the 80th session of the UN General Assembly in New York City.\nIssues of further expanding cooperation with the UN in the context of implementing national tasks to achieve the Sustainable Development Goals were discussed.\nAt the beginning of the conversation, the Head of our state sincerely congratulated António Guterres on the anniversary session of the UN, firmly supporting his initiatives on reforming the Organization’s system in line with modern realities, said a release issued by the Embassy of Uzbekistan in Islamabad, on Thursday.\nThe unprecedentedly high level of partnership between Uzbekistan and the UN was noted with satisfaction. More than 160 programs and projects are being successfully implemented. In October, the signing of a new five-year Cooperation program is expected.\nIn recent years, at the initiative of the Uzbek side, 13 UN General Assembly resolutions have been adopted. Uzbekistan has been elected a member of such reputable bodies as ECOSOC, the Human Rights Committee and the Statistical Commission.\nAt Uzbekistan’s initiative, tomorrow a high-level forum on combating children cancer and other catastrophic diseases will be held at the UN Headquarters. Active preparations are underway for the 43rd UNESCO General Conference in the city of Samarkand.\nAntónio Guterres highly praised the speech of the President of Uzbekistan at the anniversary General Assembly, especially highlighting the importance of his initiatives on achieving the Sustainable Development Goals, shaping the New Central Asia, promoting global cooperation in digital technologies and artificial intelligence, in the field of youth, enlightened Islam and others.\nDuring the conversation, an exchange of views also took place on pressing international and regional issues.\nAs a result of the meeting, an agreement was reached on developing full-scale partnership in priority areas, designing new programs and cooperation projects.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:28:47.758Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/uzbekistan-uno-to-expand-full-scale-partnership-tasks-to-achieve-sdgs/",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T20:33:00.000Z"
}
