{
  "title": "Govt signs Rs 1.225 trillion scheme to cut circular debt: Leghari",
  "author": null,
  "content": "ISLAMABAD, Sep 25 (APP):Federal Minister for Power Sardar Awais Ahmad Khan Leghari on Thursday announced a major breakthrough in tackling the power sector’s financial challenges, saying the government has signed a Rs 1.225 trillion scheme to reduce circular debt as part of a long-term plan to eliminate it within six years.\nIn a video message on the occasion of the Circular Debt Financing Scheme ceremony, Leghari recalled that when the present government assumed office, the circular debt stood at nearly Rs 2.4 trillion. “Through sustained reforms and coordinated efforts, the Power Division has already reduced it by Rs 800 billion,” he said.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/09/sasa.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nHe explained that until now, consumers were paying around Rs 3.25 per unit as a debt service surcharge, which was only being used to cover interest payments while the principal amount remained outstanding. “Under the new arrangement, the debt service surcharge will also contribute to repayment of the Rs 1.225 trillion principal amount,” he added.\nThe minister termed the development a “historic step” toward resolving the chronic issue of circular debt, stressing that it reflects the vision and guidance of Prime Minister Muhammad Shehbaz Sharif. “Through the collective efforts of all institutions, the dream of bringing the circular debt to zero is becoming a reality,” Leghari remarked.\nHe reaffirmed the government’s commitment to achieving the target of eliminating the entire circular debt within six years, calling it essential for the stability of Pakistan’s power sector and economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:30:31.937Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-signs-rs-1-225-trillion-scheme-to-cut-circular-debt-leghari/",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T14:59:00.000Z"
}
