{
  "title": "Federal Ombudsman takes notice of rising stray dog attacks in Islamabad",
  "author": null,
  "content": "ISLAMABAD, Sep 25 (APP):Federal Ombudsman Ejaz Ahmad Qureshi has taken suo motu notice of the growing number of stray dogs in the federal capital, following media reports and public complaints about increasing attacks, particularly on children and senior citizens.\nThe Ombudsman observed that negligence on the part of the Capital Development Authority (CDA) and the Municipal Corporation of Islamabad (MCI) has resulted in a worsening situation, with incidents of dog bites becoming a serious concern.\nHe directed the CDA and MCI to ensure full implementation of the policy developed by the Islamabad Wildlife Management Board (IWMB) to curb the stray dog population.\nAccording to details, the Ombudsman’s Secretariat received numerous complaints from residents regarding stray dogs in residential areas, parks, hospitals, and markets.\nTaking notice of these reports, the Ombudsman instructed the concerned authorities to find an urgent and effective solution.\nIt may be recalled that some time ago, the Ombudsman had constituted a high-level committee which held several meetings with senior officials of relevant departments and developed recommendations.\nAs a result, a Stray Dog Population Control Centre (SDPCC) was established near Tarlai, Islamabad, and a comprehensive policy was formulated by IWMB. However, the policy has not been fully implemented.\nThe Ombudsman stressed that both CDA and MCI must act immediately to enforce the policy in its entirety. He also recalled that earlier, he had taken notice of the unavailability of anti-rabies vaccines in government hospitals in Islamabad.\nFollowing his directives to the National Institute of Health (NIH) and the Drug Regulatory Authority of Pakistan (DRAP), the issue was resolved and the vaccine is now available in all government hospitals of the capital.\nRecently, on the Ombudsman’s instructions, Director General Muhammad Ashfaq Ahmed prepared a detailed study report on the stray dog issue, reviewing all aspects, relevant laws, and international practices.\nThe report highlighted that the growing number of stray dogs is contributing to diseases, environmental pollution, and accidents, with children and elderly citizens being most at risk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:30:25.971Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/federal-ombudsman-takes-notice-of-rising-stray-dog-attacks-in-islamabad/",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T15:16:00.000Z"
}
