{
  "title": "Housing Minister meets ADB delegation to explore cooperation on land data bank, housing sector initiatives",
  "author": null,
  "content": "ISLAMABAD, Sep 25 (APP):A delegation from the Asian Development Bank (ADB) called on Federal Minister for Housing and Works, Mian Riaz Hussain Pirzada, at his office on Thursday to explore avenues for mutual cooperation on land data bank and housing sector initiatives.\nThe meeting focused on exploring avenues of mutual cooperation, particularly the establishment of a Land Data Bank, which the Ministry aims to develop for comprehensive information on federal assets, with special emphasis on prime land holdings across the country.\nWelcoming the delegation, the minister thanked ADB team for their cooperation in key areas to uplift the housing and real estate sector in Pakistan.\nWhile emphasizing the importance of ADB’s technical and financial support, Minister underlined the Government’s commitment to ensuring transparency, optimal utilization of resources, and attracting investment through modern data-driven systems.\nSecretary Housing, Hamed Yaqoob Sheikh, highlighted that the purpose of the Land Data Bank is to compile accurate and accessible data on the federal government assets.\nHe explained that much of the land currently faces encroachment, depriving the government of its benefits. With the establishment of this system, supported by GIS-based features, the Ministry would be able to evaluate commercial value, attract private investment, and ensure optimal utilization.\nThe Secretary expressed appreciation for ADB’s valuable observations regarding the National Housing Policy 2025.\nHe further suggested that ADB could act as a technical partner and guarantor, particularly for projects engaging the private sector.\nThe Secretary also outlined potential areas of collaboration, including subsidy mechanisms in the housing sector, mortgage facilities and housing finance structures, green housing and climate-resilient construction techniques, urban regeneration policy updates, low-cost housing models and construction industry transition and establishment of data banks for planning and monitoring.\nThe ADB team presented their observations on thematic areas and target groups, expressing readiness to explore meaningful cooperation.\nThey emphasized the importance of addressing the housing subsidy framework and stressed the need to adopt community-based models of social urban infrastructure, similar to the Singapore model, ensuring maximum welfare and participation.\nThe meeting concluded with both sides expressing their commitment to advancing collaboration for sustainable housing development, modernization of asset management, and creation of inclusive urban infrastructure in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:30:27.959Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/housing-minister-meets-adb-delegation-to-explore-cooperation-on-land-data-bank-housing-sector-initiatives/",
  "dateList": "2025-09-25",
  "date_published": "2025-09-25T15:03:00.000Z"
}
