{
  "title": "Research-based poster’s exhibition held at AIOU",
  "author": null,
  "content": "ISLAMABAD, Jan 08 (APP):A research exhibition titled ‘Poster Presentations’ was organized late Tuesday at the Central Library of Allama Iqbal Open University (AIOU).\nMPhil and PhD students from the Department of Library Science showcased their research work during the event.\nA total of 28 research papers were presented, including 10 by PhD students and 18 by MPhil students.\nDean Faculty of Social Sciences and Humanities, Professor Dr. Abdul Aziz Sahir, examined all the projects, scholars individually gave presentation on their research projects to him.\nCommending the efforts of the Department of Library Science, Dr. Sahir emphasized the importance of aligning research with contemporary social and societal needs.\nHe acknowledged that all the research projects prepared by the students addressed current demands effectively.\nSpeaking about the history, significance, and necessity of libraries, Prof. Dr. Abdul Sahir remarked that there was a time when libraries held a central position in society.\nHowever, the younger generation’s interest in reading books has declined compared to the past.\nHe stressed the need to restore the bond with books and rebuild the strong connection that once existed to achieve prominence in society.\nThis research-based poster presentation was organized by the Department of Library and Information Science.\nAccording to the Chairman of the Department, Dr. Parvez Ahmad, the aim  of exhibition was to encourage scholars and highlight the research work of students.\nThe senior faculty member of the department, Dr. Munazza Jabeen, supervised the research work.\nShe stated that the MPhil and PhD students had completed their coursework, and the poster presentation was intended to give scholars the opportunity to create and display posters while discussing their research.\nIt is worth mentioning that the Vice Chancellor of the University, Professor Dr. Nasir Mahmood, has been paying special attention to the quality of education and the promotion of a research culture.\nHe emphasized the need to bring research papers into the marketplace to support the socio-economic development of the country.\nHe noted that unfortunately, most research papers in the country’s universities remain confined to institutional records.\nHe stressed the importance of taking research beyond library shelves and into practical application.\nA clear indication of the University’s focus on education and research is its achievement in the Times Higher Education Impact Rankings 2024.\nAccording to the report, the university secured the first position among 89 Pakistani universities in Sustainable Development Goal (SDG) 4: Quality Education.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:28:40.443Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/research-based-posters-exhibition-held-at-aiou/",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T12:52:00.000Z"
}
