{
  "title": "Around 382,118 job seekers registered with OEC",
  "author": null,
  "content": "ISLAMABAD, Jan 8 (APP):Around 382,118 job seekers registered with Overseas Employment Corporation (OEC) an attached department of Ministry of Overseas Pakistanis and Human Resource Development (OP&HRD).\nAn official source told APP here on Tuesday, he said that OEC was established year 1976, as a Public Sector recruitment agency, registered as a private limited company, under Companies Act, 1913 (now Companies Act, 2017, Section-42).\nIt is a Public Sector company governed under Public Sector Companies (Corporate Governance) Rules, 2013 of Securities & Exchange Commission of Pakistan (SECP).\nIt’s an Autonomous Body under administrative control of Ministry of Overseas Pakistanis and Human Resource Development, he added.\nHe said that 144,600 emigrants dispatched so far while 95,692 overseas returned after completing their jobs contract from the different countries.\nThe source revealed that 25,106 Korean Language trained candidates, 118 Japanese language trained candidates and\n200 IELTS trained nurses were also registered with OEC.\nPakistan, the sixth most populous country of the world, possesses highly skilled, skilled/semi-skilled and unskilled workforce which can cater world’s demand in different skill categories.\nIt was the responsibility of OEC to promote overseas employment, facilitate overseas employers in selection of work force and provide competent, reliable and cost-effective human resource from Pakistan for international labour market. Overseas employment reduces unemployment in the country and it is an important source of foreign earnings/remittance which plays a major role in socio-economic development of the country, he added.\nOEC, since its inception has facilitated more than 142,000 professionals in securing overseas employment in different countries.\nOEC is committed to explore new avenues for exporting manpower and confident to extend our best services.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:29:07.235Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/around-382118-job-seekers-registered-with-oec/",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T08:33:00.000Z"
}
