{
  "article_id": "2025-05-26_700cf226dca151b1cdd9d02ec90d570e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/polio-drive-begins-over-100000-children-vaccinated-on-day-one-in-ict/",
    "retrieved_at": "2025-08-27T15:54:17.281Z"
  },
  "metadata": {
    "title": "Polio drive begins: over 100,000 children vaccinated on day one in ICT",
    "author": null,
    "date_published": "2025-05-26T18:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 504,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 26 (APP):The first day of the anti-polio campaign concluded on Monday in the federal capital with the city administration reporting that 24 percent of the total target was achieved. Out of 461,125 children scheduled to be vaccinated across Islamabad, 108,848 received polio drops on Monday. A review meeting was held under the chairmanship of Islamabad's Deputy Commissioner Irfan Memon to assess the campaign's progress. The meeting was attended by the Additional Deputy Commissioner East, Assistant Commissioners, and representatives from health and other concerned departments. Officials shared a detailed briefing about the number of children vaccinated, overall management, and the field situation. They reported that the campaign started smoothly and received cooperation from families in many areas. The meeting also discussed households that refused to allow vaccinations. According to the officials, teams were identifying such cases and making efforts to reach out again with awareness messages. Authorities reviewed how to counter misinformation and address hesitation among parents. Security arrangements and the safety of polio workers also came under discussion. Officials stated that security teams had been deployed with field staff to ensure their protection during house-to-house visits. Deputy Commissioner Irfan Memon acknowledged the efforts of the vaccination teams and said the campaign could not move forward without their dedication. He also appealed to residents of the city to welcome polio workers and ensure their children receive the vaccine. \"We can only protect our children by working together,\" he said. \"If the vaccination team does not reach your home, immediately inform the district administration.\" Memon stressed that ensuring a healthy and safe future is the right of every child and the shared responsibility of all citizens. The anti-polio campaign in Islamabad will continue in the coming days. Authorities are aiming to vaccinate all targeted children before the campaign concludes. Officials have also set up a helpline and contact points for residents to report any areas missed by vaccination teams. The administration is calling on communities to cooperate fully and help eliminate the disease from the region. With rising concern over the presence of polio virus in some parts of the country, Islamabad authorities are focusing on achieving maximum coverage during the campaign. Health teams have been deployed in urban and rural areas, including slums and temporary settlements, to ensure no child is left out. The administration also said that social mobilizers are active in the field, educating parents and encouraging them to vaccinate their children. District authorities plan to continue daily review meetings to monitor progress and resolve challenges on the ground. The success of the campaign, they say, depends on both effective coordination and public response. The health department has urged people to trust the polio vaccine, which is safe and essential for preventing lifelong disability in children. They added that parents should support the teams by cooperating and spreading awareness within their communities. As the campaign moves into its second day, Islamabad's administration is aiming to increase the number of vaccinated children and reduce refusal cases through better engagement and quick response.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}