{
  "article_id": "2025-05-26_f248cceaa14d6cb742f41b5215f2ad26",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/hanif-abbasi-congratulates-lahore-qalandars-on-winning-psl-final/",
    "retrieved_at": "2025-08-27T15:54:15.610Z"
  },
  "metadata": {
    "title": "Hanif Abbasi congratulates Lahore Qalandars on winning PSL final",
    "author": null,
    "date_published": "2025-05-26T08:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 26 (APP):Federal Minister for Railways Hanif Abbasi Monday extended heartfelt congratulations to Lahore Qalandars on their remarkable victory in the Pakistan Super League (PSL) final. In his message, the minister praised the team's performance, calling it a shining example of the passion and dedication of Pakistani youth. He said that the victory was a result of outstanding teamwork and relentless hard work and congratulated the entire nation on this memorable win. \"Lahore Qalandars have secured a brighter future for Pakistan cricket,\" said the minister, as he paid tribute to the players and coaching staff for their commitment and efforts. He emphasized that the victory would inspire courage and determination among the country's youth. \"This success stands as a symbol of national unity and the advancement of sports in Pakistan,\" he added. The minister reiterated the government's commitment to promoting sports and supporting young talent across the country. He expressed hope that Lahore Qalandars' win would enhance Pakistan's global image in cricket. \"The entire nation celebrates this moment of joy,\" he added. The victory, he said, serves as a motivating example for other cricket teams in Pakistan. He commended the Qalandars for proving that anything is possible through hard work and passion and offered his prayers for the continued success of the players.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}