{
  "article_id": "2025-08-31_4459046cda911e54470771f8dcd2d97c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/jknf-pays-glowing-tributes-to-syed-ali-geelani-on-his-martyrdom-anniversary/",
    "retrieved_at": "2025-09-06T10:44:04.335Z"
  },
  "metadata": {
    "title": "JKNF pays glowing tributes to Syed Ali Geelani on his martyrdom anniversary",
    "author": null,
    "date_published": "2025-08-31T08:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 297,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 31 (APP): Jammu and Kashmir National Front (JKNF) has paid glowing tributes to the iconic resistance leader and former Chairman of All Parties Hurriyat Conference, Syed Ali Shah Geelani, on his martyrdom anniversary. In a statement issued on Sunday, the National Front Spokesman Muhammad Haseeb Wani lauded the deceased leader's unparalleled sacrifices, unwavering resolve, and uncompromising stand on the Kashmir issue. He said Geelani's name would forever remain a symbol of courage, resistance, and the people's unshakable commitment to the right to self-determination in the history of Kashmir. \"Geelani was not merely a leader; he was the living embodiment of the Kashmiri people's collective will to resist subjugation. He spoke truth to power without fear, stood like a rock against Indian oppression, and emerged as the uncompromising voice of the oppressed,\" Wani said. The Front leader strongly condemned the inhuman treatment meted out to the veteran leader even after his death. He noted that the occupation authorities buried Geelani in the dead of night, barred his family and people from attending his funeral and deprived the nation of bidding farewell to its leader. \"This shameful act was a gross violation of human rights and a blatant assault on religious and cultural values,\" he added. Reiterating the Kashmiris' pledge to carry forward Geelani's mission, Wani said the struggle for freedom would continue on all fronts until India's forcible occupation of Jammu and Kashmir comes to an end. Wani called upon the United Nations and the world community to break their criminal silence, take notice of Indian atrocities, and take concrete measures to ensure the Kashmiri people's fundamental right to self-determination. He warned that the apathy and indifference of international institutions was nothing short of siding with the oppressor and strengthening the hand of the occupying state.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}