{
  "title": "Economic, financial strength vital for country’s sovereignty: President",
  "link": "https://www.app.com.pk/national/economic-financial-strength-vital-for-countrys-sovereignty-president/",
  "date_published": "2022-07-17T11:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 17 (APP): President Dr Arif Alvi has said that economic and financial strength was vital for taking independent decisions and observed that country could achieve accelerated economic growth by imparting skills to youth and women through short and extensive training courses in various fields especially in Information and Communications Technology (ICT) sector.\nHe said that meaningful and active role of Pakistani diaspora was imperative to uplift the business and industrial sectors and to impart skills to youth and women to help Pakistan achieve self-sufficiency which would enable the country to take independent political, financial and economic decisions for the betterment of the people.\nThe president made these remarks while virtually addressing the 45th Annual Convention of the Association of Physicians of Pakistani Descent of North America (APPNA), USA, from Aiwan-e-Sadr, President Secretariat Press Wing said in a press release on Sunday.\nPresident APPNA, Dr Haroon Durrani, and members of the Pakistani diaspora in USA attended the virtual Convention.\nThe president regretted that Pakistan did not have the capacity in the past to absorb its highly educated, productive and precious human resource which resulted in its migration to developed countries of the world where, by sheer dint of merit, they became high achievers in many high value sectors and contributed in the development and prosperity of their host country.\nThe president said that Pakistani diaspora could contribute to uplift and add value to business, industrial, agriculture and services sectors of Pakistan and in the development of non-productive population, such as the uneducated youth and women by imparting them technical skills and expertise in relevant fields.\nHe also appreciated the Pakistani physicians in USA for earning excellent reputation in the host country and for their valuable contributions towards Pakistan’s development.\nHe urged them to establish telehealth services in Pakistan in order to provide guidance and consultancy to the patients, especially to the poor and deprived segments of the population.\nWhile identifying various sectors where Pakistan needed to make progress, he said that we needed to provide further incentives to the ICT sector and equip our youth with marketable ICT skills.\nUpdating the participants on issues and opportunities of Pakistan, the president said that strong democratic institutions, curbing the menaces of corruption, nepotism and jobbery, empowering women financially and focusing on the skill development of its human resources were essential for Pakistan’s socio-economic development.\nHe said that Pakistan through its Digiskills online training program has successfully imparted IT skills to over 2.4 million youth and enabled them to earn a decent living for themselves.  He emphasized that scale and scope of such fast-track training programs needed to be enlarged and expanded across the country.\nWhile updating the participants on salient features of Pakistan’s Foreign policy, the President said that Pakistan had shifted the focus of its foreign policy from geo-strategic to geo-economics and was promoting regional trade and connectivity by optimally utilizing its unique geographic location, especially in the context of Central Asian Republics which were keen to link themselves to rest of the world to promote regional trade and economic cooperation.\nThe president emphasized that Pakistan did not believe in polarization and camp politics and was trying to maintain cordial relations with all its international partners.\nHe said that Pakistan and USA had historical relations and Pakistan played a key role to link USA and China and had cooperated with USA in its war on terror.\nHe urged the Pakistani diaspora to address misgivings and misunderstanding about Pakistan in USA in the wake of the US withdrawal from Afghanistan. He also called upon the Pakistani diaspora to play their role in highlighting the human rights violations being committed by India in the Indian Illegally Occupied Jammu and Kashmir.\nThe president lauded the Overseas Pakistanis’ love and passion for their motherland, and commended them for rendering invaluable services and providing assistance during floods, earthquakes, and the COVID-19 pandemic.",
  "retrievedAt": "2025-08-11T15:15:29.987Z"
}
