{
  "title": "Benefits of reforms to start reaching people soon: Farrukh Habib",
  "link": "https://www.app.com.pk/national/benefits-of-reforms-to-start-reaching-people-soon-farrukh-habib/",
  "date_published": "2021-12-12T12:58:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Dec 12 (APP):State Minister for Information and Broadcasting Farrukh Habib has said that people will soon start enjoying the benefits of comprehensive and prudent reforms for sustained economic growth with a focus on enhancing exports and tax collection, facilitating masses and weeding out corruption.\nAddressing a function at the Faisalabad Chamber of Commerce & Industry (FCCI), he particularly mentioned the national policies adopted by Prime Minister Imran Khan and said that as a result of it, Pakistan managed maximum exports in a single month, Nov 2021, up to $2.9 billion, while it was 34 per cent in excess to the exports of same month of last year, and 47pc more than Nov 2018.\nHe said during the first five months of the current fiscal year, Pakistani sports stood at $12.37 billion, which were 37pc higher than the exports of the corresponding period in 2018.\nAbout health sector, he said that the government was offering the best possible health facilities to masses and people in Punjab would start getting health cards from Monday, and the process would be completed by March 2022. Under the arrangement, each card holder family would be entitled to free medical facilities up to Rs 1 million, he added.\nHe said that despite corona pandemic, Pak exports remained 35pc more than the exports of other countries of South Asia. He said that the last year, the federal government also released Rs 250 billion as refund.\nAbout the agriculture sector, he said the government provided subsidy to the farming community and as a result of it, all corps recorded phenomenal yield and Pakistan would have no need to import cotton and sugar this year. Due to this additional yield, Pakistan could be able to make $4 billion additional exports, he added.\nAbout gas, he said that work on pipeline project with the cooperation of Russia would be started soon. He said the government was also constructing 10 dams which would not only generate 10,000 megawatts of electricity but also store 13 million cusec feet water for irrigation purposes.\nAbout local issues of Faisalabad, the state minister said that Chief Minister Punjab Sardar Usman Buzdar had constituted Provincial Finance Commission on the pattern of National Finance Commission. Under the commission, all districts would get their due share on the basis of their population and backwardness. “It will ensure balanced development of the province,” he added.\nHe promised that he would make his best efforts to ensure membership of FCCI in BoDs of all major public sector departments and autonomous bodies.\nAbout Faisalabad Master Plan, he said that various sectors had reservations about it and hence its approval was delayed and now the consultants had resubmitted new draft of the proposed master plan. He promised that once again stakeholders would be consulted to make it up to the mark.\nRegarding Ring Road project, he said there were two proposals: one was to dualise 98-kilometre long bypass, which would have a cost Rs 27 billion, and the other proposal was to only rehabilitate the current bypass in its current situation with a cost of Rs 10 billion. He was optimistic that out of these proposals, one would be finalised very soon.\nAbout dualization of railway track from Khanewal to Shahdra via Faisalabad, he said that its survey had been completed and now the project was awaiting funding from federal government and Asian Development Bank.\nAbout a local train from Gojra to Sangla Hill, he said that it would certainly shift the passenger load from roads to the railway track and this project could be handled by the Pakistan Railways from its own resources.\nAbout mass transit project, he said that the Punjab chief minister had promised provision of electric buses to Faisalabad which would not only facilitate the local commuters but also help in arresting environmental pollution.\nCommenting on a demanding to linking M-3 and M-4, he said that this project was under consideration and experts were making estimates for its cost. He said that a dual carriageway was available from Faisalabad to Jaranwala.\nIt could be rehabilitated and upgraded which would make journey between Lahore to Faisalabad through Lundianwala just for one-hour duration.\nAbout other development projects, he said that a project was under consideration to make Sammundri Road signal free. Similarly, another ring road would also be developed to reduce traffic burden on the existing roads.\nHe told that sufficient land has been earmarked for state-of-the-art campus of Faisalabad Medical University (FMU). He said that a new hospital would also be built over 22 acres of Evacuee Trust Property lying unutilised near graveyard of Ghulam Muhammad Abad.\nHe said that Faisalabad Institute of Cardiology (FIC) had also been upgraded and PC-1 for new outdoor has been prepared. Similarly the work on second phase of Children Hospital Faisalabad would also be started very soon.\nEarlier, President FCCI Atif Munir Sheikh presented welcome address and appreciated government policies especially policy of smart lockdown which brought best dividend for the industrialists in addition to resolving the chronic issue of unemployment.\nAbout parking plazas, he proposed that FCCI was ready to built new parking plazas and after recovering its expenditure during 10 to 15 years these properties would be handed over to the government.\nHe also identified other problems including Chiniot Dam and safe city projects and opined that Farrukh Habib will play his role in materialization these projects on top priority basis.\nLater, FCCI shield was presented to State Minister Farrukh Habib. Representatives of business community and officials concerned attended the ceremony.",
  "retrievedAt": "2025-08-11T21:42:42.576Z"
}
