{
  "title": "President directs SLIC to pay over Rs 1.6 m to deceased policyholders’ families",
  "link": "https://www.app.com.pk/national/president-directs-slic-to-pay-over-rs-1-6-m-to-deceased-policyholders-families/",
  "date_published": "2021-12-12T07:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): President Dr. Arif Alvi has rejected four separate representations, filed by the State Life Insurance Corporation of Pakistan (SLICP) against the decisions of the Federal Ombudsman, ordering it to pay a collective sum of over Rs 1.6 million to families of the deceased life insurance policyholders.\nThe corporation had refused to pay the amount assured in the life insurance policy on the flimsy ground stating that the insured persons did not deliberately disclose their pre-insurance ailments at the time of obtaining the policy.\nThe president upheld the decision of the Wafaqi Mohtasib and ordered that SLICP must fulfill its contractual obligations and pay the policy, besides reporting compliance to the Ombudsman within 30 days.\nAs per details, Shakeel Zafar Khan, Muhammad Nawaz, Ghulam Yaseen, and Tanveer Hussain had obtained life insurance policies from SLICP for the sums assured of Rs 700,000, Rs 500,000, Rs 210,000, and Rs 200,000 respectively.\nSubsequently, the insurance policyholders expired and their families filed separate insurance claims, which were repudiated by SLICP on the ground that the deceased policyholders had pre-insurance ailments which they had concealed at the time of obtaining the policies.\nFeeling aggrieved, the family members of policyholders approached Wafaqi Mohtasib to seek justice.\nThe complainants contended that the deceased persons had no pre-insurance diseases and the insurance claims had been rejected unjustifiably.\nThe Wafaqi Mohtasib, having investigated the cases, noted that the onus to prove that the policyholders suffered from some disease before obtaining the policy and willfully hid the facts from the insurance agency rested upon the SLICP.\nIt further stated that the insurance agency must present evidence regarding the existence of alleged pre-insurance ailments and its knowledge on the part of policyholders.\nThe Mohtasib observed that in the instant cases, the agency had failed to present any evidence or diagnostic assessment to corroborate the claim of SLICP.\nIt further noted the fact that all four field officers of the agency had categorically declared that the deceased were healthy at the time of the issuance of the policy.\nThe Mohtasib, therefore, ordered SLICP to fulfill its contractual obligations by making payments of the full policy claims to the complainants, besides asking SLICP to look into its procedures for the issuance of medical and non-medical policies so that claims of good health or otherwise were duly filtered at the proposal stage.\nLater on, the SLICP filed four separate representations with the President against the decisions of the Mohtasib.\nThe President upheld the decisions of the Wafaqi Mohtasib and referred to Section 80 of the Insurance Ordinance, 2000, which provides that no policy claim after two years from the date it was effected may be called into question on the ground that a statement made in the proposal for insurance or in any report of a medical officer was inaccurate or false.\nHe also noted that the documents produced by SLICP pertained to post-insurance ailments and no document had been presented which proved the existence of disease at the time of obtaining the policy.\nThe president also quoted a decision of the Lahore High Court which rejected hypertension, diabetes, and mellitus as exceptional reasons for rejection of insurance claims.\nThe court, in its decision, had held that the majority of people suffering from such ailments, by remaining more careful in their lifetime, lived either for decades or longer than people not having such diseases, therefore, the concealment of such diseases could not be termed as done fraudulently.\nThe president in his decisions wrote that in view of the facts of the cases, the maladministration on part of the Agency stood established, therefore, the representations of SLICP were rejected. “SLCIP must report compliance to the learned Ombudsman within thirty days”, the president directed.",
  "retrievedAt": "2025-08-11T21:42:39.808Z"
}
