{
  "title": "ICT is important for socio-economic development of any country: IT Minister",
  "link": "https://www.app.com.pk/national/ict-is-important-for-socio-economic-development-of-any-country-it-minister/",
  "date_published": "2020-10-23T13:54:00.000Z",
  "source": "APP",
  "content": "KARACHI, Oct 23 (APP): Federal Minister for Information Technology and Telecommunication, Syed Amin ul Haq, visited Sir Syed University of Engineering and Technology to discuss the issues of common interests and options for developing the IT sector with collaborated efforts.\nSpeaking on the occasion, the minister said our youth has tremendous potential and what they need is a proper guideline for a journey towards success.\nHe pointed out that in Pakistan 3.2% of GDP is reserved for education, yet we are endeavoring to take it to 10% at least.\nSyed Amin ul Haq said that the rapid adoption of Information and Communication Technology (ICT) is immensely important for the socio-economic development of any country and our focus is to enhance the growth of economy.\nThe efforts are paying off as the IT industry is growing in terms of the number of companies, revenue, exports, and workforce every year.\nThe million rupees would be spent to expand the G3 and G4 coverage in the rural areas of country and majority of population would get benefits, federal minister said.\nChancellor SSUET, Jawaid Anwar said that to boost the economy, we should cut down the import and increase the volume of exports.\nInformation technology is a key lever of economic development and innovation is the prime determinant of the rise and fall of societies.\nVice-Chancellor SSUET, Prof. Dr. Vali Uddin welcomed the Federal Minister for Information Technology and Telecommunication and addressing the gathering he said, “The vision of Sir Syed University is to meet the demands of challenging times as envisioned by Sir Syed Ahmed Khan by transforming Pakistan into a knowledge-based society through some impact projects and innovation in education, research, and creativity.\nThe university is playing a leading role as a university of engineering and technology in national socio-economic development by meeting the challenges of modern time through creating alliances and partnerships between academia and industry.\nThe university’s focus is on innovation, research, and commercialization with a deep sense of social and moral responsibility imbued with the Aligarh Spirit.”\nSyed Junaid Imam, CEO Ignite, said that Digital Pakistan is based on pillars skill development, innovation, and entrepreneurship. Collaboration with universities for developing soft skills increases credibility of children globally and locally.\nSyed Hassan gave an informative presentation on IT development focusing on National Idea Bank, which is entry point for big and small ideas to be investigated by universities.\nMemorandum of Understanding was also signed between Sir Syed University of Engineering & Technology and Ministry of Information Technology and Communication Pakistan.\nRegistrar Syed Sarfraz Ali and Syed Junaid Imam signed the MoU on behalf of Sir Syed University and Ministry of Information Technology and Telecommunication Pakistan respectively.\nSir Syed University will provide a platform through National Idea Bank for collecting ideas. The university will develop a sustainable business model for the idea bank.",
  "retrievedAt": "2025-08-11T19:55:55.989Z"
}
