{
  "title": "Trump’s remarks, a snub to Modi regime: Shehryar Afridi",
  "link": "https://www.app.com.pk/national/trumps-remarks-a-snub-to-modi-regime-shehryar-afridi/",
  "date_published": "2020-10-23T13:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP): Chairman of the Parliamentary Committee on Kashmir, Shehryar Khan Afridi Friday said that Narendra Modi’s expansionist agenda had been exposed to the world and it could no more keep its occupation of Jammu and Kashmir.\nReferring to the recent remarks of US President Donald Trump about India, he said Trump’s remarks were a diplomatic snub for Modi as India was facing international isolation.\nHe was addressing a one-day seminar, here with regard to Black Day, titled “Kashmir’s Prolonged Military Occupation: Lessons from history and the way forward”, organized by Legal Forum For Oppressed Voices of Kashmir (LFoVK).\nShehryar Afridi observed that the war between Azerbaijan and Armenia reflected failure of United Nations Security Council in resolution of territorial conflicts and Kashmir could spark a new war between Pakistan and India if the United Nations failed to play its due role in resolving the dispute.\nHe added that the United Nations needed to learn from the fate of League of Nations. He said that the UN was also fast losing its purpose and Kashmir resolution was its biggest test.\nHe said that the countries were heading towards new confrontation and wars which depicted failure of the UN.\nHe said that the world needed to take notice of the crimes against humanity were being carried out by fascist regime of Narendra Modi under the influence of terrorist Rashtriya Swayamsevak Sangh (RSS) which wanted to make India into a Hindu Rashtra.\nHe said that India was imposing hybrid war on Pakistan and for the past three days, Indian media was involved in spreading fake news to malign Pakistan.\nShehryar Afridi said the Pakistan Tehreek-e-Insaaf government and Prime Minister Imran Khan had exposed the falsehood of India.\nPresident Azad Jammu & Kashmir (AJK) Sardar Masood Khan said Kashmiri leadership had waged a war for independence in 1947 and got the AJK freed from the occupational forces of India.\nHe said that tribesmen had taken part in the freedom movement along with their Kashmiri brethren. He said that state of AJK had been liberated as a base camp for the freedom struggle of Kashmir.\nHe said that October 26 hence was remembered as Day of Solidarity between the peoples of Pakistan and Jammu and Kashmir.\nHe said that first genocide of Kashmiris had been at hands of Indian forces in Jammu soon after the partition of the subcontinent.\nHe also trashed the Indian insistence that Kashmir was a bilateral issue between Pakistan and India and said that Kashmir was an international issue and any dialogue must be held under the auspices of United Nations as the UN had guaranteed Kashmir resolution.\nAmbassador (R) Abdul Basit said that there was a dire need for Pakistan to continue with its longstanding and consistent stance on Kashmir dispute.\nHe called for appointing a special envoy on Jammu and Kashmir.\nHe urged Prime Minister Imran Khan to back actions with rhetoric on Kashmir. He said that Pakistan could not afford to engage India bilaterally on Kashmir as India was not willing to budge an inch from its stance on Kashmir.\nHe said that Kashmiris were ready to make any sacrifice but Pakistan needed to take a decision whether its resolve was as strong as of Kashmiris.\nProminent Kashmiri leader Shaikh Tajammul Islam said that we had to wage a law fare against India. He said that Pakistan was yet to build its legal case on Kashmir’s occupation against India.\nHe said that Pakistan had now very strong legal case on Kashmir and India’s case has crumbled.\nHe said that Pakistan needed to present its case on Kashmir to the world as India had accepted the fact that the so-called instrument of accession was missing from its archives.",
  "retrievedAt": "2025-08-11T19:55:57.770Z"
}
