{
  "title": "Consultative meeting discusses economic aspects of COVID-19",
  "link": "https://www.app.com.pk/national/consultative-meeting-discusses-economic-aspects-of-covid-19/",
  "date_published": "2020-10-23T10:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 23 (APP): Health Services Academy and Population think tank has arranged an international consultative meeting on economic aspects of COVID-19 in Pakistan.\nThe meeting was attended by international technical experts and high level federal and provincial government officials to share evidence and highlight efforts to mitigate the negative impacts of COVID-19 on Pakistan’s economy.\nThere was detailed discussion on ways to improve public spending on health, explore alternative financing mechanisms to enhance revenue generating capacity, reprioritize health budgets and steps to revive the economy.\nSpecial Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr Sania Nishtar highlighted government response to COVID-19, bearing the fact that a large percentage of Pakistan’s population is below the poverty line that could be hard hit by the pandemic.\nShe elaborated how an immediate financial protection mechanism was developed for the very poor people and those working in the informal sector of Pakistan.\nDr. Shabnum Sarfraz, Member Social Sector and Devolution, Ministry of Planning, Development and Special Initiatives, highlighted inter-ministerial collaboration and a national action plan for COVID-19 along with a report on macroeconomic impact analysis.\nShe said that the Planning Ministry promptly established a coordination mechanism of foreign assistance to contain the impact of COVID-19.\nDr. Awad Mataria from the World Health Organization highlighted the need for transforming health financing mechanisms and need for different funding strategies to make money available for health in times of need.\nEazaz Aslam Dar, Additional Secretary Economic Affairs Division, discussed health budget allocation and expenditures and difficulties in the processes.\nDr. Ali Hamandi from the World Bank talked about the need for creating a fiscal space for health and the importance of overall conducive economic environment in which more funds can be mobilized for health.\nDr. Zulfiqar A. Bhutta, an international public health expert, presented a multi-country evidence about the direct and indirect socio-economic impacts of COVID-19.\nThe meeting invited feedback and recommendations from the stakeholders on key strategic questions deliberated in the meeting.\nThe federal and provincial leadership along with experts and development partners agreed to continue work in this important area and identified issues and challenges that may hinder the efforts for economic revival.\nIn this regard, improved data collection and analysis, efficient use of existing resources and controlling wasteful use of resources, emergency preparedness were noted for improvements in the system.\nThe meeting was concluded with a consensus of enhanced collaborative efforts to cope with the economic challenges of Covid-19 for Pakistan, while ensuring a social and economic progression for the country.\nSyed Atta-ur-Rehman, Additional Secretary Ministry of National Health Services Regulations and Coordination, committed on behalf of Ministry of Health to strive for better efficiency in fund utilization as per recommendations and enhance efforts for securing more funds for health.\nThe Vice Chancellor of Health Services Academy pledged continued support for further work in this important area and thanked the participants for joining.",
  "retrievedAt": "2025-08-11T19:56:01.079Z"
}
