{
  "title": "Caretaker PM wants regular research, innovation as outcome of higher education",
  "link": "https://www.app.com.pk/national/caretaker-pm-wants-regular-research-innovation-as-outcome-of-higher-education/",
  "date_published": "2023-08-27T10:41:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 27 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Sunday stressed upon formulation of a planning to ensure that higher education at the universities level should become a regular base for the latest research and innovative achievements.\nHe said that graduated students should be equipped with the professional skill-sets to meet the requirements of industries.\nThe prime minister expressed these views during a meeting with a delegation of vice chancellors of public sector universities of Balochistan that called on him, PM Office Media Wing said in a a press release. The delegation apprised the prime minister of the progress over higher education and the pertaining issues.\nThe prime minister underscored the need of promoting a culture of research and creativeness as the lack of innovation was linked with the deficiency in research and higher education.\nThe caretaker prime minister further asked for setting up incubation centers for the students by the industrial sector in universities, so that they could get opportunities for the contemporary research, adding that with these measures, trained manpower would be provided to the industries, thus paving way for an industrial revolution.\nHe shared that with continuous facility of higher education, improvement could be brought in different sectors of life.\nThe youth should be provided with ample opportunities to seek higher education, so that the talented young lot could play their due role in the progress of the country, he said, adding the youth and manpower were the vital assets for a better future.\nThe caretaker prime minister also underlined to remove all hurdles in the pursuit of higher education by bringing it at par with the international standards.",
  "retrievedAt": "2025-08-11T09:20:14.538Z"
}
