{
  "title": "PM urges solid steps for reduction in electricity bills",
  "link": "https://www.app.com.pk/national/pm-urges-solid-steps-for-reduction-in-electricity-bills/",
  "date_published": "2023-08-27T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): Prime Minister Anwaar-ul-Haq Kakar Sunday here said solid measures should be presented to him in the next 48 hours for reduction in increased electricity bills.\nHe was chairing a meeting on increase in electricity bills, power theft and problems of the power sector.\nHe was given a detailed briefing on the increase in electricity bills of July.\nHe said no step would be taken in haste to avoid harm to the country.\nThe prime minister said such steps would be taken which would not put additional burden on the national exchequer and would also facilitate the consumer.\nIt was not possible that the common man was in difficulty and the Prime minister and the bureaucracy were using free electricity from their taxes, he added.\nHe said relevant ministries and departments should provide details of the institutions and officers who were getting free of cost electricity.\nHe said he represented the common man, adding the electricity expenditure of the Prime Minister House and Pakistan Secretariat should be reduced as much as possible.\n“Even switch off the air-conditioner of my room if this is needed,” he remarked.\nHe said detailed consultation would be held with provincial chief ministers on Monday on steps to save electricity and on the issue of increased electricity bills in July.\nThe power distribution companies should give a road map for stopping electricity theft, he added.\nThe PM said reform plans in the electricity sector and short, medium and long term plans should be presented as soon as possible.\nCaretaker federal ministers Shamshad Akhtar, Gohar Ejaz, Murtaza Solangi, Advisor to Prime Minister Dr Waqar Masood, Secretary Power, Chairman NEPRA, Chairman WAPDA and other officers attended the meeting.",
  "retrievedAt": "2025-08-11T09:20:08.035Z"
}
