{
  "title": "Hydro-power potential vital for socioeconomic uplift of Kashmiris: AJK PM",
  "link": "https://www.app.com.pk/national/hydro-power-potential-vital-for-socioeconomic-uplift-of-kashmiris-ajk-pm/",
  "date_published": "2023-08-27T16:06:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK): Aug 27 (APP):: Azad Jammu and Kashmir Prime Minister Chaudhry Anwar Ul Haq, while referring to the region’s incredible hydro-power potential, has said that taking full advantage of the existing hydro-power potential was imperative for socioeconomic uplift of the people of Azad Jammu Kashmir.\nThe PM said this while speaking at a high level meeting of the Energy and Water Resources Department held at Jammu Kashmir House in the federal metropolis on Sunday.\nStressing the need for an uninterrupted supply of electricity across the state, the PM said that along with repair and maintenance of the feeders there was an urgent need to improve the power distribution system.\nThe PM also sought feasibility reports regarding Khurshidabad Power Project, Transmission Line from Minhasa to Bagh and Transmission Line from Rampura to Barora.He directed the concerned authorities to prepare a feasibility report on whether the Mang area should be linked to Rawalakot or Palindri.\nHe said that Betaar Power Project should be upgraded for the comfort of the people of Haveli. He said that PDO must ensure better maintenance of its projects so that citizens do not face any difficulties.\nAnwaar emphasized the need to adopt a better strategy regarding Jagran 1, 2, 3, 4.The Prime Minister also stressed maintenance of community development projects and local power houses in Neelum, Haveli and Jhelum Valley.\nHe said that the demands/needs of commercial, industrial and domestic users should be taken into account and the billing system should be made transparent so that there was no inconvenience to the public.\nThe Prime Minister also sought decentralization of the M&D department to reduce the workload.\nHe said that the three Chief Engineers have a heavy responsibility to bring out-of-the-box solutions to provide convenience to the people.\nHe said that the department should satisfy its seven and a half lakh customers through its best service.\nEarlier, Secretary of Energy and Water Resources AJK govt. Chaudhry Muhammad Tayyab gave a detailed briefing to the Prime Minister regarding the electricity distribution system in Azad Kashmir.\nThe meeting was attended among others by senior minister Colonel (retd) Waqar Ahmed Noor, Government Ministers Sardar Faheem Akhtar Rabbani, Mian Abdul Waheed, Chaudhry Muhammad Rashid, Chaudhry Yasir Sultan, Member Kashmir Council Raja Shuja Khurshid Rathore, Special Assistant Colonel (retd) Maroof, Additional Chief Secretary Development/Principal Secretary Fayaz Ali Abbasi, Secretary Energy and Water Resources Chaudhry Muhammad Tayyab and Chief Engineer Saeed Gilani.",
  "retrievedAt": "2025-08-11T09:20:08.039Z"
}
