{
  "title": "PM greenlights Pakistan-China JV project for industry relocation",
  "link": "https://www.app.com.pk/national/pm-greenlights-pakistan-china-jv-project-for-industry-relocation/",
  "date_published": "2024-06-26T07:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP):Prime Minister Shehbaz Sharif on Wednesday gave the green light to the joint ventures between Chinese and Pakistani companies for relocating the Chinese industries to Pakistan.\nChairing a meeting to discuss the matters of the Board of Investment (BoI), he said that promoting both local and foreign investment in Pakistan was among the government’s priorities.\nHe said the government was taking all possible steps to create a business-friendly environment for traders and investors. The prime minister directed the concerned to submit a comprehensive report on the follow up of Memorandum of Understanding (MoUs) signed between Pakistani and Chinese companies in Shenzhen during his recent visit to China.\nHe also instructed a review of the draft law for the Special Economic Zones One Stop Shop in light of the developments following his China visit.\nPrime Minister, Shehbaz said there was significant potential for relocating China’s textile, leather, footwear, and other industries to Pakistan. Meanwhile, during the briefing, the BoI Secretary said that the steps were being taken to relocate Chinese industry to Pakistan.\nIt was told that the services of Chinese experts were being hired for establishing Business Facilitation Centre in the federal capital and the draft of “Easy Business Act” was being sent to Cabinet Committee for Legislative Cases.\nThe meeting was attended by Federal Minister for Privatization and Investment Abdul Aleem Khan, Federal Minister for Commerce Jam Kamal, Federal Minister for Finance and Revenue Muhammad Aurangzeb, Federal Minister for Petroleum Dr. Musadik Malik, Prime Minister’s Coordinator, Rana Ehsan Afzal and relevant senior government officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:30:33.439Z"
}
