{
  "title": "Balochistan Govt to enrol 400 children of labourers in higher educational institutions this year",
  "link": "https://www.app.com.pk/national/balochistan-govt-to-enrol-400-children-of-labourers-in-higher-educational-institutions-this-year/",
  "date_published": "2024-06-26T14:40:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jun 26 (APP): The Balochistan government has decided to enrol around 400 children of labourers in higher educational institutions across the country on scholarship basis this year.\nThe Labour and Manpower Department has registered 200 children of laborers and the registration of 200 more children in the process would be completed by July 15.\nThis was decided in a review meeting of the Department of Labour and Manpower which was chaired by Balochistan Chief Minister Mir Sarfraz Bugti here Wednesday\nThe meeting reviewed the progress of the Youth Skills Development Program. The Chief Minister was informed that the first batch of skilled youth from Balochistan would be sent abroad in March 2025, while unskilled would also be sent abroad for employment in December 2025.\nAdviser to the Chief Minster on Labour and Manpower Sardar Ghulam Rasool Ummrani, Chief Secretary Balochistan Shakeel Qadir Khan, Secretary Labour Welfare, Director General B-TEVTA and other officials concerned were also present in the meeting.\nThe chief minister directed that the implementation of the Youth Skills Development Program should be expedited and also ensure the provision of employment after imparting the skill among the youth.\nHe stressed that Kuchlak Driving School should be made operational immediately and B-TEVTA should provide driving training to 100 people in the first phase of the program so that they can be sent to Oman for employment.\nThe chief minister said that the number of registered labourers in Balochistan was much less than the actual figure and ordered that the Labour department should collect accurate data of labourers through special survey and register them.\nHe said that efforts would be made to bring the labourers into the social security plan and for their welfare.\nSarfraz Bugti said that industrial owners deliberately do not disclose the actual number of workers to save social security costs.\nHe added that majority of labourers in Balochistan were not paid according to the wages fixed by the government. Exploitation of workers will not be allowed and their social security will be ensured, he added.\nAdviser to Chief Minister on Labour and Manpower Sardar Ghulam Rasool Ummrani told the meeting that according to the vision of the chief minister, comprehensive measures were being taken to provide technical training to the youth of Balochistan. He said that special measures would be taken for the registration of workers.",
  "retrievedAt": "2025-08-11T03:29:05.685Z"
}
