{
  "title": "Kashmiri delegation meets IAHRA representative, briefs about prejudiced judicial system in IIOJK",
  "link": "https://www.app.com.pk/national/kashmiri-delegation-meets-iahra-representative-briefs-about-prejudiced-judicial-system-in-iiojk/",
  "date_published": "2024-06-26T06:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP):Kashmir delegation to United Nations comprising of Advocate Parvez Shah and Dr Waleed Rasool met representative International Association for Human Rights Advocacy (IAHRA), Miss K Pormica  at United Nations Human Rights Council and briefed her about the prejudiced judicial system operating in Indian Illegally Occupied Jammu and Kashmir IIOJK.\nThe representative was apprised that the engineered Judicial System was giving unnecessary adjournments to the government by design to cause delays in the cases of detainees incriminated in concocted cases to break their will of the detainees, received a press release from Geneva.\nShe was also apprised that the under-trial prisoners are not presented before the courts on the date of hearing to restrict their meeting with lawyers and the families and thereby these detainees are made invisible.\nThe under trials are tried in special courts outside the state which makes it difficult for lawyers to represent them in the trial courts and at the same time, free legal aid is non-existent.\nThe representative to the International Associations for Human Rights Advocacy was also acquainted with the pathetic conditions of the prisoners lodged in different Indian jails where these detainees were denied the basic facilities guaranteed under the jail manual and international law.\nThe delegation also brought to her notice that the Indian government was forcing the detainees to sign a bond to the extent that if they were released would not speak or support the ongoing struggle for the right to self-determination guaranteed under United Nations resolutions.\nThe representative showed serious concern about the flawed legal system existing in Indian Illegally occupied Kashmir and promised to speak on the engineered legal system and plight of Kashmiri prisoners in the coming events.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:30:42.799Z"
}
