{
  "title": "PM invites opposition to hold dialogue for country’s betterment",
  "link": "https://www.app.com.pk/national/pm-invites-opposition-to-hold-dialogue-for-countrys-betterment/",
  "date_published": "2024-06-26T10:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP):Prime Minister Shehbaz Sharif on Wednesday invited the opposition political parties to join heads for a dialogue to discuss the ways for taking the country ahead.\n“Let us sit together to take the country ahead. Let us talk for the betterment of the country. There is no other way forward,” the prime minister said addressing the National Assembly, while responding to a point of order by Sunni Ittehad Council Ali Muhammad Khan.\nHe recalled that in the past too, he had invited the political parties to evolve a consensus on a Charter of Economy but that idea was ridiculed just for political point-scoring.\nHe said the way the sloganeering was done on the offer, was the darkest chapter in the country’s history.\nPrime Minister Shehbaz said that the House should also fix the responsibility on those who contributed to such a bitterness in the society.\nThe prime minister also recounted his ordeal of facing victimization and that he was in jail when his mother passed away. Despite request to the jail superintendent, he was not given exemption from court appearance, he added.\nHe said that despite being a cancer survivor and with a backbone ailment, he used to be driven to courts on the ordinary prison van just to exacerbate the condition, but he never complained.\nPrime Minister Shehbaz said that other PML-N leaders like Khawaja Muhammad Asif and Rana Sanaullah also faced humiliating treatment despite being the under-trial prisoners.\nBut he said, having faced all the victimization, he would never want his political adversaries to face an identical situation.\nThe prime minister said that if the Pakistan Tehreek-e-Insaf founder faced any problems in jail, that should be conveyed to the government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:30:10.088Z"
}
