{
  "title": "Kashmiri delegation call on Mark Ellis at UN Geneva and briefed about judicial system in IIOJK",
  "link": "https://www.app.com.pk/national/kashmiri-delegation-call-on-mark-ellis-at-un-geneva-and-briefed-about-judicial-system-in-iiojk/",
  "date_published": "2024-06-26T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 26 (APP):At the United Nations Human Rights Council (UNHRC) in Geneva, a Kashmiri delegation gave a comprehensive briefing on the interference of the Executive in the Judicial system of Indian Illegally Occupied Jammu and Kashmir, highlighting the delay in justice and application of draconian laws on common Kashmiris striving for their right to self-determination.\nThe delegation comprising Advocate Parvez Shah and Dr. Waleed Rasool, & Gazalla Habib met with Dr. Mark Ellis Executive Director International Bar Association at the United Nations Geneva, received a press release from Geneva.\nThey detailed that the occupation authorities deliberately detained people under the draconian Public Safety Act (PSA) a preventive law for years when the ordinary laws already existed in the disputed territory. The Public Safety (PSA) leaves little room for the detainees to challenge the same in ordinary courts. The only remedy available for the detainees is a writ of habeas corpus which is fixed for hearing after a couple of months as the courts are already overburdened.\nThey also apprised the Executive Director that if by luck the writ is fixed for hearing, the government seeks adjournments and thereby plays delaying tactics which prolongs the detention of the detainees.\nThe delegation also brought to his notice if the court is convinced and quashes the detention, the executive authority rearrests the detainee and keeps him in circulation which is a violation of international. The detainee if released after the years of detention does not get any reparation from the authorities for the illegal detention of years.\nThe delegation also briefed the Executive Director International Bar Association that in Indian Illegally occupied Kashmir the Occupation forces enjoy impunity under the Armed Forces Special Powers Act (AFSPA) which has escalated extra-judicial killings in Kashmir. The occupation forces kill innocent Kashmiris for awards and rewards and thousands of Kashmiris have been buried in mass graves. The National Investigation Agency of India operates in disputed territory and confiscates the properties of pro-freedom people without giving them any chance of hearing.\nThe Executive Director International Bar Association showed serious concern about these draconian law applicable in Indian Occupied Jammu and asked the Kashmir delegation to provide more details about the Judicial system operating in disputed territory.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:30:06.139Z"
}
