{
  "article_id": "2025-01-29_d6c48499237aac42ff987da001a5c1fa",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/caya-25-layne-robinson-sensitise-young-leaders-about-youth-work/",
    "retrieved_at": "2025-08-27T12:11:15.477Z"
  },
  "metadata": {
    "title": "CAYA-25 Layne Robinson sensitise young leaders about youth work",
    "author": null,
    "date_published": "2025-01-29T11:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 199,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 29 (APP):A capacity building session was held here on Wednesday to sensitise the international young leaders and NYC members about youth work. Head of delegation Commonwealth Secretariat Layne Robinson here at Jinnah Convention Center. The session aimed to highlight the significance of youth engagement and development. The event began with an interactive activity where participants, divided into groups, answered questions about the Commonwealth's history, geography, and structure. Robinson introduced key youth development approaches, including deficit-based, youth-for-development, equity and welfare, and asset-based empowerment models. He defined youth work as \"all forms of rights-based engagement that build personal awareness and support social, political, and economic empowerment.\" He also gave a historical overview of youth work from the 1970s to the present, discussing ongoing challenges such as: Lack of formal recognition as a profession, Limited qualification pathways, Insufficient supervision of youth work practice, Inadequate investment in youth services. Robinson outlined the Commonwealth's achievements, including training over 14,000 youth workers, establishing youth ministries and networks, and developing frameworks to measure youth development progress. He also introduced the Qawya Board of Trustees for 2024-26 and upcoming youth work initiatives. The session concluded with a rapid-fire Q&A, keeping participants engaged until the end.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}