{
  "article_id": "2025-01-29_c2fc3f2448842a57c75f233b089aaa79",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-promoting-environment-friendly-power-generation-awais-leghari/",
    "retrieved_at": "2025-08-27T12:10:35.188Z"
  },
  "metadata": {
    "title": "Govât promoting environment friendly power generation: Awais Leghari",
    "author": null,
    "date_published": "2025-01-29T13:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 271,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 29 (APP): Federal Minister of Energy Awais Ahmed Leghari on Wednesday said that the current government was promoting environment friendly electricity generation from alternative sources instead of expensive imported oil. Briefing the Senate Standing Committee on Climate Change, the federal minister said that before today, power generation plants were being set up under different policies, but now we have introduced a new system in which power plants will be set up through a competitive process. He said that so far, the Ministry of Energy had closed five factories running on expensive imported furnace oil. These factories used to generate 2,500 megawatts of electricity, he said, adding that these factories were not only polluting the environment but were also putting a heavy burden on the national exchequer. Awais Leghari said that the closing of these factories saved billions of rupees for the national treasury. He said that converting electric tube-wells to solar energy in Balochistan can save 80 to 100 billion rupees annually. He said that our farmers should water their crops through drip irrigation, which can save more than 80 percent of water. He further said, I myself water my lands through drip irrigation and I am saving 82.2 percent of the water. We will have to save groundwater, otherwise it will go down very low after some time. The federal minister said that to promote electric vehicles and motorcycles in the country, the price of electricity at charging stations has been reduced from Rs. 71 per unit to Rs. 39.70. He said that if banks and international institutions are ready to provide loans, it will yield positive results.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}