{
  "article_id": "2025-01-29_be68ead21a7b752304c0548cc4df8401",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sarfraz-bugti-extends-felicitation-to-china-on-chinese-new-year/",
    "retrieved_at": "2025-08-27T12:10:36.199Z"
  },
  "metadata": {
    "title": "Sarfraz Bugti extends felicitation to China on Chinese New Year",
    "author": null,
    "date_published": "2025-01-29T13:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 289,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "QUETTA, Jan 29 (APP): Chief Minister Balochistan, Mir Sarfraz Bugti, extended his heartfelt congratulations to the leadership and people of the People's Republic of China on the occasion of the Chinese New Year. He emphasized that the friendship between Pakistan and China is a strong historical bond that continues to grow stronger with time. In his message of felicitation on Wednesday, the Chief Minister said that China's remarkable progress and prosperity serve as an example for the entire world. Pakistan is ready to learn from China's experiences and advance on the path of development. He highlighted that CPEC will prove to be a significant milestone in Balochistan's progress, ushering in a new era of economic activities and development in the province. Mir Sarfraz Bugti expressed optimism that Pakistan-China relations will further strengthen in the new Chinese year and that both countries will enhance cooperation in all sectors. He extended his best wishes for prosperity, progress, and success to the people of China, expressing hope that the new year would bring peace and happiness for both Chinese and Pakistani citizens. The Chief Minister reiterated that Pakistan stands alongside China in its journey of progress, and both nations will work together to ensure economic stability and development in the region. He further said that Balochistan offers immense opportunities for Chinese investment and collaboration, and the provincial government is committed to expanding this partnership. He said that the joy of the Chinese New Year was not only a moment of celebration for the people of China but also a source of happiness and hope for the people of Pakistan. The Balochistan government will continue to play its role in strengthening friendly ties between the two nations through all possible cooperation, he concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}