{
  "article_id": "2025-01-29_da5942750bdf12c770aa358c71c37780",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/lums-develops-case-study-on-jazzcashs-remarkable-turnaround/",
    "retrieved_at": "2025-08-27T12:10:47.113Z"
  },
  "metadata": {
    "title": "LUMS develops case study on JazzCash’s remarkable turnaround",
    "author": null,
    "date_published": "2025-01-29T14:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 309,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 29 (APP):Continuing its efforts towards academia-industry collaboration, the Suleman Dawood School of Business (SDSB) at LUMS has developed another case study for its academic and executive programmes, focused on the successful turnaround of JazzCash. This case study highlights the power of disruption and innovation in today's rapidly evolving business landscape said a news release. SDSB has pioneered the use of the case method of teaching in Pakistan. Students engage with real-world business challenges, assuming the role of decision-makers to analyse and develop practical solutions in an interactive classroom setting. Authored by SDSB faculty, Dr. M. Adeel Zaffar, Dr. Adnan Zahid and Dr. M. Shehryar Shahid, the case titled JazzCash: Successful Fintech in an Emerging Market explores how the company navigated uncertainty and embraced disruption to transform into a leader in Pakistan's fintech sector. Students will examine JazzCash's journey from a period of significant challenges to becoming the country's largest fintech platform, focusing on the adaptability, innovation, and resilience that drove its success. JazzCash's evolution - from overcoming high attrition and operational hurdles to becoming Pakistan's first profitable fintech by 2023 - serves as a model of strategic restructuring, customer-centric innovation, and technological overhaul. Today, JazzCash is the country's largest issuer of digital loans, leading QR payments network, and a dominant player in e-commerce payment solutions. Murtaza Ali, President of JazzCash, expressed his appreciation for LUMS, stating, \"Our transformation was fueled by a commitment to creating a sustainable business that offers real value to customers and society. Through this partnership with LUMS, we aim to inspire future leaders to pursue ambitious goals while balancing profitability with social impact.\" LUMS continues to enrich student learning by integrating impactful case studies that bridge theory and practice, furthering its dedication to advancing education and fostering meaningful industry partnerships, and preparing future leaders to drive change in both local and international contexts.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}