{
  "article_id": "2025-01-29_1500fb3122e5e4e3165d69ca8066b991",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-declaration-reaffirms-commitment-to-strengthen-cooperation-in-science-and-technology-among-oic-states/",
    "retrieved_at": "2025-08-27T12:11:04.476Z"
  },
  "metadata": {
    "title": "Islamabad Declaration reaffirms commitment to strengthen cooperation in Science and Technology among OIC states",
    "author": null,
    "date_published": "2025-01-29T12:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 354,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 29 (APP):The 2nd Annual Meeting of the COMSTECH Consortium of Excellence (CCoE) and week-long visit of high level delegation of Rectors/Vice chancellors from OIC member countries concluded in Islamabad with the adoption of the Islamabad Declaration, reaffirming the commitment of OIC member states to fostering collaboration in science, technology, higher education, and health sectors. A high-level delegation of 28 members from 17 leading universities and institutions of OIC countries undertook a week-long visit to Pakistan, engaging in discussions and partnership-building activities. The delegation included representatives from Palestine, Malaysia, Bangladesh, Oman, Jordan, Russian Federation, Somalia, Uganda, Tanzania, Mauritania, Indonesia, and Iran. During the visit, the delegation participated in the 2nd Annual Meeting of CCoE and the 5th Rectors Conference, alongside rectors and vice-chancellors of Pakistani institutions. During this productive visit, over 30 Memorandums of Understanding (MOUs) were signed, paving the way for enhanced collaboration in education, research, and industry. The delegates visited top Pakistani universities and leading industrial groups in Faisalabad and Lahore, including Government College University Faisalabad, The University of Faisalabad, the University of the Punjab, and Gourmet Foods, to explore avenues fort joint initiatives. It was agreed to enhance cooperation in science, technology, higher education, and health sectors through joint projects, training, workshops, and seminars, exchange of faculty, experts, and formation of mechanisms aimed at learning from one another's experiences, expertise, and knowledge. The delegation lauded COMSTECH's initiatives for Palestine, particularly the provision of 5,000 scholarships and research fellowships for Palestinian students and researchers. They assured their full support for the rehabilitation and restructuring of Palestine's education and health sectors. To further strengthen academic and research ties, the delegation extended an invitation to Pakistani vice-chancellors from CCoE member institutions for future collaborative engagements. The meeting concluded with a unanimous commitment to advancing the goals of the COMSTECH Consortium of Excellence through practical and result-oriented partnerships. The Islamabad Declaration symbolizes the collective resolve of OIC member states to harness science, technology, and education as key drivers for sustainable development. The partnerships formed during this visit are expected to pave the way for innovation, knowledge exchange, and long-term progress across the OIC region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}