{
  "title": "Project launched for capacity building training of QEC",
  "link": "https://www.app.com.pk/national/project-launched-for-capacity-building-training-of-qec/",
  "date_published": "2024-11-27T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP):The Higher Education Commission (HEC), via its flagship World Bank supported project Higher Education Development in Pakistan (HEDP), has focused on improving the quality of teaching and learning in decentralized higher education institutions i.e. Affiliated Colleges (AC) and Affiliating Universities (AUs) by establishing quality enhancement units. These tertiary level institutions are often resource starved and need continuous support.\nThe Quality Enhancement Cells in Affiliated Colleges (QECACs) within the Quality Enhancement Cells (QEC) in affiliating universities aim at supporting the colleges affiliated with them. The QECACs oversee various aspects of the quality of education imparted at affiliated colleges e.g., faculty, evaluation system and curriculum etc. It is the responsibility of these universities to ensure the quality of the education of the programs authorized in their affiliated colleges, said a press released issued here Wednesday.\nThe QECACs also periodically assess all academic activities being undertaken by colleges and develop self-assessment reports. The reports include assessment of the program offered in terms of the program objectives, learning outcomes, availability of faculty, requisite content relevance and resources needed.\nThe HEDP has established 45 functional units (QECACs) across Pakistan within QECs of affiliating universities. HEDP supported these by providing technical and financial support to the universities for QECACs. Likewise, Quality Enhancement Cells (QECs), the existing structures in the universities that were established by HEC, were also revamped by the HEDP to comply with the recently approved Quality Assurance framework of HEC. These QECs are envisioned to be strategic organs facilitating Higher Education Institutions (HEIs) to fulfil their mission and subsequent goals having prime responsibility of quality in HEIs as well as in their constituent units and affiliated colleges.\nRecently, the HEC revised ‘QEC Terms of Reference / Functions’, for the Quality Enhancement Cells, established in both private and public sector across the country via its Quality Assurance Agency. The HEDP project facilitated the reorganization and development of 45 QECs as per new framework, which were also duly verified by the third-party validation firm.\nIn this regard, a series of trainings are planned, and the first cohort of training was held at the National Institute of Banking and Finance (NIBAF), Islamabad. More than 40 representatives from HEIs of Balochistan, Gilgit-Baltistan, Islamabad/Rawalpindi, Punjab, and Khyber Pakhtunkhwa attended. The sessions focused on capacity-building of both QECs and the newly established QECACs across Pakistan.\nIn addition to expert trainers, HEC team including Agha Muhammad Raza, Deputy Director, Quality Assurance Agency HEC, Mr. Shoaib Irshad, Deputy Director, Coordination Division HEC and Dr. Arshad Bashir, Consultant HEDP, led various sessions. The key topics covered included quality assurance in higher education, roles, and responsibilities of QECs, implementing and monitoring QA processes and developing action plans for quality enhancement.\n“It is the university that ultimately grants the degree to students, making it critically important for affiliated colleges to enhance the quality of education they provide. This means that affiliated colleges must strive to meet, or even exceed, the standards and benchmarks set by the university. They should ensure that their students receive an education that is on par with the university’s expectations’’, said Mr. Awais Ahmed, Advisor Global Engagement and Project Coordinator HEDP.\nIn addition to the Project Coordinator HEDP, the closing ceremony was attended by Mr. Asif Hussain, Director, Quality Assurance Agency, HEC and other senior officials of HEC, who in their keynote addresses, emphasized the significance of quality assurance in higher education. They also engaged with participants, gathering valuable feedback about the presented certificates of participation to conclude the event on a high note.\nThe HEDP is a 400 Million USD flagship project of HEC aimed to support research excellence in strategic sectors of the economy, improve teaching and learning, and strengthen governance in higher education.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:40:28.404Z"
}
