{
  "title": "Muqam slams PTI leaders for fleeing protests, abandoning workers; terms PTI’s “final call” as missed call",
  "link": "https://www.app.com.pk/national/muqam-slams-pti-leaders-for-fleeing-protests-abandoning-workers-terms-ptis-final-call-as-missed-call/",
  "date_published": "2024-11-27T18:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP):Federal Minister for Kashmir Affairs, Gilgit-Baltistan and SAFRON and President PML-N Khyber Pakhtunkhwa Engineer Amir Muqam, has strongly criticized leaders of Pakistan Tehreek-e-Insaf (PTI) for fleeing the scene of violent protest while leaving their supporters behind.\nIn a statement issued on Wednesday, Muqam stated that ‘We’ve said it before this “final call” will prove to be a missed call’. He said there is a clear divide between the PTI and its leaders who wanted to create anarchy in the country.\nHe condemned the actions of PTI leadership, accusing them of inciting chaos under the guise of political protests.\nMuqam said that the agenda of these people was to shed blood which was not fulfilled. “This is not a party but a group working on an agenda to destabilize the country.” He said that such actions are part of a broader plan to spread chaos and anarchy in the country.\nMuqam said PTI’s so-called political protests often end in chaos, with leaders abandoning their supporters once violence erupts. He pointed out how leaders like “Bushra Bibi” and Ali Amin Gandapur, ran away from the workers in the darkness of the night and held a press conference again.\nOnce again, PTI workers were used for personal gains and the so-called leaders ran away. “These leaders used workers for their personal gains, then left them behind,” Muqam said.\nHe said, “A new chapter of courage was written last night, as they ran away second time and insulted the Pashtuns.”\nThe minister said that PTI leaders, including Bushra Bibi and Ali Amin Gandapur, would be held accountable for the violence, loss of lives, and destruction of public property that occurred during the protest.\n“We will hold them accountable for the blood of innocent people and the damage to public property,” Muqam stated.\nThe indiscriminate use of the resources of the provincial government for the political activities is highly deplorable for the people of the province. They attacked the federal capital instead of using these resources for the welfare of the people, he added.\n“Their actions against the state are unforgivable, and we will ensure that they are brought to justice,” Muqam added.\nMuqam said that it was planned to sabotage the peace of the country. Repeated attacks on the federal government are highly condemnable, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:40:00.114Z"
}
