{
  "title": "PM for firm decisions to end future mayhems, sit-ins",
  "link": "https://www.app.com.pk/national/pm-for-firm-decisions-to-end-future-mayhems-sit-ins/",
  "date_published": "2024-11-27T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday expressed his zero tolerance for any future violent onslaught and sit-ins by a group of miscreants in Islamabad and resolved to take stern decisions to put an end to repeated string of violent chaos and damages to the country’s economy.\nAddressing a meeting of the federal cabinet, the prime minister without mentioning the name of Pakistan Tehreek-e-Insaf (PTI) led recent onslaught on the federal capital, said that repeated attacks by a clique of miscreants had forced them to rethink.\nWith the collective deliberations, they had to take strict measures, to quell such scenes in future as they could no longer put all their resources and energies into it, leading to economic destruction, he observed.\n“They should have only one option before them; that is progress and prosperity o Pakistan. As a Prime Minister, chief executive, as members of the cabinet and parliamentarians, they will not let that coterie of anarchy to inflict further harm on country’s economy,” he maintained.\nThe prime minister said that once again an assault was mounted on Islamabad, but on previous night, all the law enforcement agencies had collectively and with good strategy dispersed the protest and provided relief to the public.\nAs a result of such riot, Islamabad in particularly and the country in generally, witnessed huge economic losses as businesses were closed, traders were raising hue and cry, owners of the factories were in distress; daily wagers found it hard to get one time meal while the patients were stranded, he added.\nIn twin cities, the prime minister said the life was paralyzed. In the larger context, the economic losses were manifolds, the country’s stock exchange market which had crossed the historic mark of 99,000 points few days back, lost 4,000 points in one day due to chaos.\nThese miscreants had become the permanent enemies of Pakistan’s progress. But after restoration of peace, the PSE rallied and crossed the earlier figure, he said, adding the trend in business was like a flight of a soaring bird and investments poured in where the peace and opportunities existed.\nThe prime minister regretted that such like dangerous trend of upheaval and attacks was set by a party of troublemakers as it was not visible prior to the year 2014, because none of the political parties had ever thought of mounting attacks on the federal capital.\nDuring 2014, Chinese President Xi’s visit to Pakistan was postponed due to 126 days sit in by the same figures and their leadership created mess and used foul language, which was still haunting their minds, he added.\nThe prime minister also referred to the launching of protest on the eve of SCO heads of government summit in Islamabad, which had prompted concerns among a number of heads of close friendly countries about their visit to host Pakistan.\nHe also criticized staging of protest by the same party during a visit by the delegation of Kingdom of Saudi Arabia.\nThe prime minister said the mischief makers had also injured and killed security personnel during the recent attack. No patriotic or even a resident of the country could imagine to harm the country for personal interests and could go to such extreme of damaging the country.\nHe opined that the law and constitution ensured right for a peaceful protest.\nAbout the recent visit of President of Belarus, the prime minister said that they were taking decisions to enhance bilateral ties and cooperation between the two countries and on the other hand, there were scenes of battles.\nA number of Rangers and police personnel were martyred whereas dozens others were injured, he added.\nThe prime minister said that they could no longer waste their energies to tackle these spectacles on daily basis and stressed to ponder as to why the country was still mired in foreign debts even after passage of 77 years.\nHe also viewed that if the culprits of 9th May riots were given exemplary punishment by the courts, such like spectacles would not have happened.\nThe prime minister also appreciated the Islamabad, Punjab, Sindh police force and other law enforcement agencies for quelling the fresh wave of attack and particularly thanked the chief of army staff for his cooperation with regard to law and order situation.\nHe said that in Khyber Pakhtunkhwa, the terrorists and insurgency was on the rise while in Kurram, dozens of people were killed, but instead focusing on the law and order situation there, the provincial government had left the residents in the lurch and led an armed attack on Islamabad.\nThe prime minister said that the provincial government of KPK did not pay heed to the hardships of the poor people but instead indulged in foul language and hurled threats against the federal government.\nThe recent mayhem had caused Rs190 billion daily damages to the country’s economy adversely affecting country’s exports and imports, he said, adding for the personal interests, their leadership was damaging the country’s interests which ‘is a bigger crime and will not be forgiven’.\nHe said that today’s meeting had only one point agenda that was to discuss the situation seriously emerging after repeated assaults by a party as they could no longer sap their energy and resources in confronting them.\nHe further stressed that the government would not let certain situation in future to happen under any condition. It would not happen; not under their watch and time. “We will steer Pakistan out of the challenges,” he added.\nIn a veiled manner, he said it pained them (PTI) that Pakistan was saved from default. He prime minister credited the coalition parties in the federation who with sincere and joint efforts, arrested the galloping inflation and price hike.\nThe coalition parties had put their political interests at stake to save the country. In the last eight months, the economy was on path of recovery. “No one is empowered to create such a miracle but owing to joint efforts,” he added.\nThe prime minister recollected that the PTI leadership could not defy the 2018 historic rigging and Imran Niazi at that time had promised him to form an inquiry committee but it could not held its meetings.\nThe prime minister said with personal centered statement, an attempt was made to harm fraternal ties with a brotherly country.\nThe prime minister termed the political manoeuvres by the particular party as ‘a Fitna’ as there was no room for chaos in politics and likened these to worst kind of fascism of Nazis.\nThe directive of Islamabad High Court was torn into pieces as a person was hell bent to sacrifice the country for the sake of his vested interests, he further added.\n“We will break that hand which harms the country,” he added.",
  "retrievedAt": "2025-08-10T15:39:43.357Z"
}
