{
  "title": "Speakers for ensuring safe, harassment-free workplaces for women",
  "link": "https://www.app.com.pk/national/speakers-for-ensuring-safe-harassment-free-workplaces-for-women/",
  "date_published": "2024-11-27T09:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP): The Office of the Auditor-General of Pakistan organized an awareness seminar on the Protection Against Harassment of Women at the Workplace Act, 2010, aimed at fostering safe, inclusive, and respectful work environments for women.\nThe event was organized in collaboration with UN Women and brought together key stakeholders from various sectors, according to a press release issued by the office of AGP on Wednesday.\nIn his keynote address, Chief Guest Auditor General of Pakistan Muhammad Ajmal Gondal emphasized the importance of fostering an environment where all employees—especially women—feel valued, respected, and safe.\nHe stressed that true organizational success stems from the relationships cultivated within the workplace. “For an organization to truly succeed, it is essential that all employees feel safe, valued, and respected, and that their voices are heard,” Mr. Gondal stated.\nHe further committed to building a workplace where harassment of any form is completely intolerable, and swift, effective action is taken when issues arise.\nDr. Iram A. Khan, Additional Auditor-General (HQs) and Chair of the Seminar, shared the Auditor-General Office’s initiatives for the well-being of female employees.\nHe highlighted the establishment of inquiry committees at both the head office and field offices to address harassment complaints. Dr. Khan also spoke about the creation of a daycare center at the head office, ensuring the comfort and safety of working women. She reiterated the Department’s commitment to a safe and inclusive environment, setting an example for other organizations in the country.\nFauzia Viqar, the Federal Ombudsperson for FOSPAH, highlighted the significant progress made by her office in tackling workplace harassment across Pakistan, providing valuable insights into the legal framework and support systems in place.\nLouise Nylin, Country Representative for UN Women, applauded the collaboration between the Auditor-General’s office and her organization, underscoring the importance of partnerships in achieving gender equality and protecting women’s rights in the workplace.\nThe seminar featured a presentation on workplace harassment laws by Meher Jamy from FOSPAH and an engaging session on gender and social norms by Zahra Kamal.\nMuhammad Younas Khalid of UN Women led a thought-provoking discussion on international best practices for creating respectful workplaces, with particular focus on the situation in Pakistan.\nConcluding the event, Ghufran Memon, Additional Auditor-General (Operations), reinforced the seminar’s key message: preventing harassment requires more than just policies; it demands a cultural shift. He called for unwavering commitment from every individual in the organization, from leaders to employees, to uphold values of respect, equality, and accountability. “It requires creating environments where everyone feels safe speaking up when they witness or experience inappropriate behavior,” he emphasized.",
  "retrievedAt": "2025-08-10T15:40:37.152Z"
}
