{
  "title": "PTI’s protest in Islamabad a ‘colossal failure,’ says minister Tarar",
  "link": "https://www.app.com.pk/national/ptis-protest-in-islamabad-a-colossal-failure-says-minister-tarar/",
  "date_published": "2024-11-27T08:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP):: Federal Minister for Information, Broadcasting, National Heritage, and Culture, Attaullah Tarar, stated on Wednesday that all the bold claims and plans of Pakistan Tehreek-e-Insaf (PTI) had been shattered following their failed protest.\nIn a late night press conference, the minister described the protest as a ‘colossal failure,’ emphasizing that it had become the inevitable fate of the PTI. He took a jibe at PTI’s founder’s so-called “final call,” dismissing it as nothing more than “a missed call.” He further pointed out that those who had gathered to secure the release of their leader fled when many of their workers were arrested. Tarar remarked that both Ali Amin Gandapur and Bushra Bibi had abandoned their supporters and ran away when the arrests began.\nTarar also recounted how he personally traveled from D-Chowk to Eleventh Avenue, where he witnessed scenes of chaos and disorder caused by PTI protesters. He described how the protesters fled, leaving behind their shoes and clothes.\nThe minister added that there was evidence to suggest that PTI had planned to storm Parliament by breaching the Red Zone. Referring to the party’s leadership, Tarar remarked, “Gandapur has fled for the second time,” underlining the disarray among the party’s ranks.\nHe also contrasted PTI’s recent actions with their earlier protests, recalling the 126-day sit-in, during which the party enjoyed the backing of certain influential powers.\nTarar criticized PTI’s rush to act, noting that even their vehicles were involved in collisions due to their haste. “They were in such a hurry that they crashed their own cars,” he quipped.\nThe minister emphasized that while the government sought to avoid violence, it was necessary to deal sternly with miscreants. Reflecting on PTI’s past, he reminded the public that the party had previously fled from Pakpattan and was now retreating from Islamabad. He warned that PTI would not attempt such actions again, adding, “After the 26th Amendment and the damage caused in Parliament, they will not dare to try this again.”\nTarar also suggested that PTI had a hidden agenda behind the protests, claiming, “Their plan was to sabotage the visit of the President of Belarus and cause damage.” He highlighted what he described as crucial evidence that was destroyed when a container was set on fire. “What were those pieces of evidence that were burned by setting the container on fire?” he questioned.\nThe minister confirmed that efforts were underway to clear the roads and restore order, but made it clear that there would be no concessions for the PTI leadership. “There is no deal, no concession. We saw cowardice here,” he stated.\nThe minister also criticized the disparity in lifestyles, pointing out that while Imran Khan’s and Bushra Bibi’s children enjoyed luxurious lives, the children of the poor were being manipulated to damage public property. He strongly condemned PTI activists’ attacks on media houses, assuring that those responsible would be held accountable.",
  "retrievedAt": "2025-08-10T15:40:54.228Z"
}
