{
  "title": "Normalcy returns to Islamabad: roads, shops reopen after PTI ends protest",
  "link": "https://www.app.com.pk/national/normalcy-returns-to-islamabad-roads-shops-reopen-after-pti-ends-protest/",
  "date_published": "2024-11-27T07:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP):Following a large-scale operation against protestors, normalcy is gradually returning to the federal capital on Wednesday with business activities resuming and educational institutions expected to reopen tomorrow.\nThe district administration’s cleanup efforts are underway, and containers blocking various roads in the city have been removed. The roads that had been closed due to the protests are now accessible again, said an official.\nThe cleanup operations, including the removal of containers from key locations such as the Red Zone, are ongoing under the directives of the Deputy Commissioner (DC) Islamabad, Irfan Memon, who has instructed assistant commissioners to clear their respective areas.\nHe emphasized that all available resources are being utilized to clear the roads swiftly, aiming to have them open for citizens by morning. He has also directed that cleanup efforts on all city roads be completed by then.\n“We aim to reopen the roads for citizens at earliest,” DC Memon stated, underscoring the administration’s commitment to resolving the issue swiftly.\nThe deputy commissioner also directed his team to ensure cleanliness across all major highways following the removal of obstacles, ensuring that the roads remain safe and accessible for the public.\nMurree road clearance continues simultaneously, the removal of containers from Murree Road, which was sealed off for three days due to the protests, is in progress.\nIn another development, following PTI called off its protests, all motorways have reopened for traffic. The routes between Islamabad and Lahore are also restored.\nMotorway police confirmed that Motorway M-2 has reopened for traffic between Lahore and Islamabad, and Motorway M-11 is now open for Lahore to Sialkot traffic. Additionally, Motorways M-4, M-14, and M-3 have also resumed operations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:41:12.883Z"
}
