{
  "title": "Govt. directs Punjab, KP CSs to maintain law & order",
  "link": "https://www.app.com.pk/national/govt-directs-punjab-kp-css-to-maintain-law-order-2/",
  "date_published": "2022-11-08T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 08 (APP): The Federal government on Tuesday directed Chief Secretaries of Punjab and Khyber Pakhtunkhwa (KP) to maintain law and order to ensure the free movement of people in their respective provinces.\nThe letters written by the Ministry of Interior to Chief Secretaries of both provinces cited the disruption caused by protesters to the movement of the people which is in contravention of Article15 of the Constitution of Pakistan.\nThis Article of the Constitution promises freedom of movement to every citizen of Pakistan and is viewed with great concern.The letters further pointed out that it appears that the provincial governments are failing in their constitutional/ legal obligations to maintain law and order which can have serious consequences.\nHence, it is requested to immediately remove the protesters to restore smooth movement on motorways, highways and link roads.Moreover, the letter addressed to Punjab Chief Secretary also mentioned Ministry of Interior’s earlier letter No 13/23/2022 dated November 5, 2022, wherein it had been requested to take effective measures for maintaining law and order situation and protection of life and liberty of all citizens in the province, being primary responsibility of provincial government.\nIt has been further observed that small groups of protesters are bent on closing the motorways (including M-2), highways and link roads. This is impeding the routine movement of the people, transportation of goods, inter-city travel, hampering the provision of emergency services and children’s access to schools.\nIt is also adversely affecting the economy of the country and it seems that instead of undertaking efforts to control the situation, the police have assumed the role of silent spectators.",
  "retrievedAt": "2025-08-11T15:51:36.289Z"
}
