{
  "title": "Chairman Senate congrats Sikh community on Baba Guru Nanak’s birthday",
  "link": "https://www.app.com.pk/national/sanjrani-congrats-sikh-community-on-guru-nanak-birthday/",
  "date_published": "2022-11-08T18:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): Chairman Senate Muhammad Sadiq Sanjrani has congratulated the Sikh community around the world on the 553rd birth anniversary of Baba Guru Nanak Dev Ji, the founder of Sikh religion.\nIn his message on the occasion of Baba Guru Nanak’s birth anniversary, Chairman Senate said that Pakistan welcomes thousands of Sikh pilgrims visiting holy religious places, a press release said on Tuesday.\nHe said that Pakistan is the second home of Sikh pilgrims.\nGuru Nanak gave the message of brotherhood, love, humanity and friendship, he said adding that there is an urgent need to promote inter-religious harmony across the world.\nHe underlined that world peace is only possible through human brotherhood and cultural harmony.\nChairman Senate said that the people of Pakistan believe in love and every year the people of the Sikh community from all over the world receive the priceless gift of love.\nHe mentioned that Pakistan is strengthening the idea of friendship with the Sikh community.\nHe further said that a large number of Sikh community coming to Pakistan to perform religious rituals on the birthday of their religious leader Guru Nanak Dev ji, which is proving to be the beginning of a golden era for the promotion of peace and love.\nMuhammad Sadiq Sanjrani further said that a large part of Sikh religious places are in Pakistan, including Gurdwara Darbar Sahib in Kartarpur, which is of great importance to the Sikh community.\n“To promote goodwill and religious harmony, Pakistan opened the Kartarpur Corridor and started visa-free access to Gurdwara Darbar Sahib. This initiative also provide visa free access to the Sikhs in India through Kartarpur” he added.\nThe Gurdwara Kartarpur complex is a gift from the people and leadership of Pakistan to the Sikh community in India and around the world, Sadiq Sanjrani said.",
  "retrievedAt": "2025-08-11T15:51:32.535Z"
}
