{
  "title": "WB’s regional director calls on finance minister",
  "link": "https://www.app.com.pk/national/wb-director-calls-on-finance-minister/",
  "date_published": "2022-11-08T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): Regional Director for Infrastructure in South Asia, World Bank Guangzhe Chen called on Federal Minister for Finance and Revenue Senator Mohammad Ishaq Dar at the Finance Division on Tuesday.\nCountry Director World Bank Najy Benhassine, SAPM on Finance Tariq Bajwa, SAPM on Revenue Tariq Mehmood Pasha, Secretary Finance and other senior officers of the Finance Division attended the meeting, said a press release issued here.\nThe Finance Minister welcomed Guangzhe Chen and highlighted the current economic outlook of Pakistan’s economy.\nHe apprised the delegation of various policy measures being undertaken by the present government to ensure the sustainable and inclusive economic growth and development by enhancing ease of doing business, encouraging exports and facilitating various sectors of the economy.\nGuangzhe Chen appreciated and congratulated the government of Pakistan for successfully completing the fiscal reform program – RISE.\nHe briefed the Finance Minister about the various other programs being undertaken by the World Bank in the country in line with the vision of the government of Pakistan.\nHe highlighted the support by the World Bank for relief and rehabilitation work in the flood affected areas of Pakistan.\nIshaq Dar commended the developmental role of World Bank in Pakistan and further added that Pakistan values the financial and technical assistance provided by the World Bank for the institutional reforms and economic development of the country.\nThe Finance Minister assured the delegation that every possible support would be provided by the incumbent government for the current projects being undertaken by World Bank in Pakistan and thanked the delegation for their persistence contribution in the economic development of Pakistan.",
  "retrievedAt": "2025-08-11T15:51:32.532Z"
}
