{
  "title": "PNCA, Nomad kicks off various art activities",
  "link": "https://www.app.com.pk/national/pnca-nomad-kicks-off-various-art-activities/",
  "date_published": "2022-11-08T12:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): Pakistan National Council of the Arts (PNCA) and Nomad Art Gallery here Tuesday kicked off various week-long art activities to celebrate cultural diversity of Pakistan and create social harmony through soft expressions of art.\nThe activities including a group art exhibition, performance, workshops, storytelling and seminar by various artists will continue till November 16. While the opening show was the group exhibition of paintings and art pieces titled ‘Diversity and Social Harmony” by various artists featuring traditional and contemporary arts.\nThe exhibition showcased an exquisite collection of artworks, including paintings and ceramics as an attraction of Pakistani art. The event is a collaboration between Nomad Gallery and PNCA. S. Najam Kazmi, Samina A. Akhtar, Zafar Ali, Khurram Abbas, Hassan Sheikh, Areej Nasir, Emaan, Tauqeer Hilbi, Alefiya, Rakshanda Atawar, Hassnain Awais, Nabahat Lotia, Jamil Hussain and Kuzhad are among the participating artists.\nThe event was inaugurated by Ambassador of European Union, Riina Kionka who lauded the role of Pakistani artists for contributing into the art scenes through diverse cultural expressions and mastery of techniques.\nDirector General PNCA, Ayub Jamali on the occasion said the event is an attempt to bring various established artists under one roof for promotion of cultural heritage.\nPakistani art has a long tradition and history and Pakistani artists are very talented. It consists of a variety of art forms, including painting, sculpture, calligraphy, pottery and textile arts such as woven silk. The arts are a vehicle through which human beings cultivate distinct social, cultural and individual identities, while transmitting values, impressions, judgments, ideas, visions, spiritual meanings, patterns of life and experiences across time and space, said Nageen Hyat, Curator of the show and Director Nomad Gallery.\nShe said that traditional art is important as it passed down through generations and provides a shared experience for the entire community. With values, cultural practices, and belief systems embedded in these art forms, they often form a common language through which the different communities that fabricate the society can be engaged.\nPakistan’s culture is diverse and has always found itself rooted to traditions along with art. It can be seen through the various monuments and iconic architectural structures across the country that are testaments to its glorious history. Culture and creativity here manifest themselves in almost all economic, social and other activities, she added.\nNajam Kazmi is working as a miniature, contemporary and traditional artist since 1989 to date. He was conferred the Tamgha-e- Imtiaz by the Government of Pakistan and honored by the life time achievement award by the Rawalpindi Art Council. He has exhibited in many countries including Pakistan, Turkey, Iran, Algeria, Sri Lanka, India and the Gulf.\nSamina A. Akhtar a senior artist having exhibited in multiple countries while Khurram Abbas’s work is based on social injustice and his war trauma. As the memories never fade he expresses them in his painting, the visuals of which help him to alleviate their impact. His work is meant to be an expression of protest in silence.\n“As an artist, I am mostly concerned about various issues relevant to my cultural background and most of my works reflect multiple social, political, and religious aspects as well as racism, sectarianism, injustice, and terrorism, which are inter-connected at some levels. Being artists, we are concerned citizens and get easily affected by the actions and extremism taking place in our surroundings. And I am always keenly observing human behavior rapidly changing in my surrounding,” said Zafar Ali about his work.\nHassan Sheikh says that “during my early years experimenting in the field, I realized that to most South Asians, miniature is only an ancient artistic expression used during the pre-colonial times. Thus, I began my art practice by exploring ways to develop the expression such that it becomes relevant in today’s context.”\nRakhshanda Atawar’s work, with a portfolio expanding 3 decades, is a free hand use of rich colors, the effort guided by emotional outbursts. The latest series is heavily influenced by one considerable factor, having to remain in lockdown during the pandemic.",
  "retrievedAt": "2025-08-11T15:51:38.110Z"
}
