{
  "title": "HEC announces undergraduate scholarships for GB students",
  "link": "https://www.app.com.pk/national/hec-announces-undergraduate-scholarships-for-gb-students-2/",
  "date_published": "2024-09-12T06:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 12 (APP):The Higher Education Commission (HEC) has announced undergraduate scholarships for the students of Gilgit-Baltistan to study in top Pakistani Universities/Institutions.\nAccording to the official sources from HEC, the students who intend to pursue undergraduate studies (four/five years BS programs) from HEC-recognized public sector universities/degree awarding institutions (DAIs) can apply for these scholarships.\nThe scholarships are being offered for the academic year 2024-25 in all areas of study/disciplines under the project titled, “Undergraduate Scholarship Program for the Students of Gilgit-Baltistan in Top Pakistani Universities/Institutions (Batch-IV).\nThe applications can be submitted by September 30, 2024, at the latest. Eligible candidates can apply on the HEC portal. Applications in hard form will not be accepted. Candidates are required to apply on https://eportal.hec.gov.pk Application processing fee is required to be submitted to the HEC account.\nHEC GB Undergraduate Scholarship covers tuition fees, hostel fees, and other charges -a maximum of Rs. 240,000 per year, A stipend of Rs.15,000 per month, books and a travelling allowance of Rs. 30,000 per annum.\nA per eligibility criteria, applicants must have a domicile/local certificate of Gilgit-Baltistan. Applicants must have completed Secondary School Certificate (SSC) and Higher Secondary School Certificate (HSSC) and/or equivalent. However, priority will be given to those students who have passed/completed their SSC/HSSC or equivalent from Gilgit-Baltistan.\nThe applicants already availing of any other scholarship are not eligible to apply. The applicants can apply to any public sector university/institution in Pakistan. However, any expenditure over and above the cost given in PC-1 will be borne by the student himself/herself. The maximum age limit is 22 years as of the closing date of application submission. The candidates will have to meet HEC and university criteria for admission to BS programs.\nApplicants are required to submit applications online through: https://eportal.hec.gov.pk. HEC reserves the right to postpone or cancel the scholarship process at any stage without assigning any reason.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:01:18.806Z"
}
