{
  "title": "NA body approves outsourcing of Parliament Lodges’ cleaning arrangements",
  "link": "https://www.app.com.pk/national/na-body-approves-outsourcing-of-parliament-lodges-cleaning-arrangements-2/",
  "date_published": "2024-09-12T18:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 12 (APP): The National Assembly Standing Committee on House and Library Thursday approved the outsourcing of cleaning arrangements of Parliament Lodges and directed to refer the matter to the Finance Committee of the National Assembly.\nThe meeting of the National Assembly Standing Committee on House and Library was held at Parliament House under the chairmanship of Deputy Speaker National Assembly Syed Ghulam Mustafa Shah.\nMatters related to outsourcing of cleanliness arrange, works in Parliament Lodges, construction of additional family suites and servant quarters, cleaning and maintenance works in Parliament Lodges and security arrangements were deliberated during the meeting.\nThe Committee approved the outsourcing of cleaning arrangements of Parliament Lodges and directed to refer the matter to the Finance Committee of the National Assembly.\nIt is pertinent to mention that the issues of outsourcing cleaning and maintenance works and other arrangements in the Parliament Lodges was referred by the Finance Committee of the National Assembly to the Standing Committee on House and Library.\nWhile mentioning the outsourcing of  management of Parliament Lodges, the Deputy Speaker said that a comprehensive working plan is under preparation to outsource cleaning and maintenance and other works in Parliament Lodges. In the first phase of the project, sanitation arrangements would be outsourced and  the project will be implemented in two years.\nIn the meeting, the members expressed serious reservations over the undue delay in the construction of additional family suites and servant quarters adjacent to the Parliament Lodges, highlighting that due to the delay in the project, the cost of the project has increased manifold.\nThe Deputy Speaker also directed the Chairman CDA to improve the cleaning and repair arrangements in Parliament Lodges.\nThe committee expressed its concern over the lack of parking facility in the Parliament Lodges and the problems caused due to parking of vehicles at the entry points and directed to convert the vacant space in front of  Block-F into a parking area. It was also decided to install  biometric system to ensure the attendance of CDA staff.\nChairman CDA informed the committee that the tenders for the projects of additional family suites and servant quarters will be opened this month, and all possible steps will be taken to complete the project soon.\nMembers of the National Assembly Ali Khan Jadoon, Ijaz Hussain Jakarani, Zainab Mehmood, Kiran Haider, Sardar Nabil Ahmed Gabol and Shahida Begum participated in the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:01:43.313Z"
}
