{
  "title": "Mushahid hosts Christmas-cum-New Year’s Party",
  "link": "https://www.app.com.pk/national/mushahid-hosts-christmas-cum-new-years-party/",
  "date_published": "2024-01-03T13:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 03 (APP): The Senate’s Standing Committee on Defence Chairman Mushahid Hussain Sayed, who represents the Federal Capital in the Senate, held a Christmas-cum-New Year’s Party in honour of sanitation workers at the E-7 Park on Wednesday, which was attended by about 150 persons.\nLauding the hard work, role and contribution of sanitary workers to keep Islamabad ‘clean and green’, he said: “You are the real VIPs. Given your honesty, dedication and hardwork, we are proud of you.”\nHe also awarded shields of appreciation to two retiring sanitary workers – Yaqoob Masih, who served for 42 years, and Saifur Rahman, who served for 38 years.\nTalking to the media, Senator Mushahid said that Islamabad was a city of the elites, where the ‘VIP culture’ was prevalent and only VIPs were acknowledged or honoured.\nHowever, he wanted to set a different example, by “honouring our unsung heroes, the poor, underclass belonging to the Christian community, who are the weakest and most oppressed section of Pakistani society”.\nHe said the sanitary workers were the real VIPs, who did not hold any high office but they served selflessly, beyond the call of duty, at meagre salaries, and “it is because of them that our city (Islamabad) is clean and beautiful”.\nHe said,”We must uphold the Quaid-e-Azam’s vision of equality for all Pakistanis, irrespective of religion, caste or creed and respect the National Flag where the white colour honours non-Muslim Pakistanis.”\nLast year too, Senator Mushahid arranged a similar function in honour of Manzoor Masih, a retiring sanitary worker and other members of the CDA sanitation staff.\nThe head of CDA Labour Union, Chaudhry Yasin, and Senator Fawzia Arshad also participated in the function.",
  "retrievedAt": "2025-08-10T23:21:35.932Z"
}
