{
  "title": "President stresses upon investing in Braille education for inclusive society",
  "link": "https://www.app.com.pk/national/president-stresses-upon-investing-in-braille-education-for-inclusive-society/",
  "date_published": "2024-01-03T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 04 (APP): President Dr Arif Alvi while reiterating the commitment to advance the rights of persons with disabilities, has said that investing in Braille education, upgrading its inclusion and broadening access to its materials are pivotal steps towards developing an inclusive and equitable society.\n“Uniting for universal accessibility isn’t a privilege but a reflection of our collective resolve. I am confident that by working together, we can create a world where barriers are eliminated and opportunities are made accessible for everyone,” the president said in a message on the occasion of World Braille Day being observed on January 4.\nThe president said that they were commemorating the “World Braille Day” to highlight the significance of improving access to knowledge for persons with visual disabilities.\nHe also expressed his admiration for Pakistan’s progressive efforts in enhancing accessibility for persons with visual impairments.\n“Today we also pay homage to Louis Braille whose invention transformed the lives of millions of people with visual disabilities with literacy. Braille is more than a tactile script; it symbolizes empowerment, freedom and inclusivity for people with visual impairments,” the President Secretariat Press Wing, in a press release, quoted him as saying.\nPresident Alvi said Pakistan had demonstrated remarkable dedication in advancing Braille literacy and accessibility, which is exemplified by its endorsement of the internationally acclaimed Marrakesh Treaty for visually impaired persons which would help them access millions of books in Braille, audios, and large prints.\nThe nation had made significant efforts to incorporate Braille within educational institutions and libraries, offering enhanced materials for higher education, he added.\nMoreover, the president said Pakistan had initiated advanced training programs benefiting students, educators and parents, to facilitate an inclusive environment in public spaces where persons with visual impairments can smoothly access vital information and education.\n“By integrating Braille, Pakistan demonstrates an unwavering dedication to inclusivity, ensuring equitable access to education, literature, training and rehabilitation opportunities across every province, irrespective of visual ability,” he added.\nThe president opined that these endeavours highlighted the nation’s commitment to upholding the rights and dignity of all its citizens.",
  "retrievedAt": "2025-08-10T23:20:36.027Z"
}
