{
  "title": "ECP announces January 22 deadline for postal ballot applications ahead of General Elections",
  "link": "https://www.app.com.pk/national/ecp-announces-january-22-deadline-for-postal-ballot-applications-ahead-of-general-elections/",
  "date_published": "2024-01-03T12:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 3 (APP):The Election Commission of Pakistan (ECP) has set January 22 as the deadline for receiving applications for postal ballot papers for the upcoming General Elections for the National Assembly and Provincial Assemblies of Punjab, Sindh, Khyber Pakhtunkhwa, and Baluchistan.\nAccording to the Election Commission of Pakistan (ECP), this provision is exclusively offered to government officials, armed forces personnel, and individuals in public offices, along with their spouses and children residing in a location different from the registered constituency.\nAdditionally, individuals in detention and those with physical disabilities unable to travel, possessing a Computerized National Identity Card (CNIC) with a physical disability logo issued by the National Database and Registration Authority (NADRA), are eligible to cast their votes through postal ballots.\nLikewise, individuals appointed by the Returning Officer, such as police personnel assigned duties at polling stations different from their designated voting location, must submit their postal ballot applications to the Returning Officer within three days of their appointments.\nThe ECP clarifies that these applications should be made using the specified form and submitted to the Returning Officer of the relevant constituency in which these individuals are registered as voters.\nThose who receive postal ballots will not have the privilege to cast their votes in person at the polling stations. Alternatively, individuals can download the application forms from the Election Commission of Pakistan’s website, www.ecp.pk.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:21:52.131Z"
}
