{
  "title": "CED urges pol. parties, national institutions to hold dialogue for ensuring free, fair elections",
  "link": "https://www.app.com.pk/national/ced-urges-pol-parties-national-institutions-to-hold-dialogue-for-ensuring-free-fair-elections/",
  "date_published": "2024-01-03T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 03 (APP):Coalition for Elections and Democracy (CED), a coalition of leading civil society organization, has urged the political parties and national institutions to hold dialogue for ensuring free and fair elections in the country.\nThrough the dialogue, the key stakeholders must address complaints regarding level playing field for political parties and develop consensus to reduce political polarization before conducting next elections, said a news release by the Center for Peace and Development headed by its  Executive Director Mukhtar Ahmad Ali.\nAll the stakeholders should work for implementation of constitutional obligations and holding of timely general elections in all areas of Pakistan. Any action that undermine the constitutional order, respect of government institutions, and credibility of upcoming elections must be avoided in the larger interest of democratic system and political stability, the news release added.\nThe CED consists of civil society organizations including Centre for Peace and Development Initiatives (CPDI), Centre for Governance and Public Accountability (CGPA), Individual land (IL), Institute for Research, Advocacy and Development (IRADA), Parliamentarians Commission for Human Rights (PCHR) and Peace and Justice Network (PJN).\nThe CED has emphasized that, in many ways, the current political situation is unprecedented and, therefore, it requires a grand dialogue on an urgent basis without causing any delay in the ongoing electoral process. In this regard, it would be quite appropriate for the Election Commission of Pakistan (ECP) to take initiative for engaging political parties for dialogue to address complaints and grievances so that credibility of the general elections could be ensured in a befitting manner.\nThe CED further emphasised that dialogue must have results within days, without affecting timeline for the General Elections in February 2024. The CED also stressed the need for facilitating voters in the flood affected areas besides ensuring national identity cards for them or access to polling stations due to damaging roads and tracks. There is also need for robust security measures to protect citizens’ participation in the electoral process.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:21:51.617Z"
}
