{
  "title": "SIFC Committee reviews progress on various measures, approves policy level interventions to facilitate investors",
  "link": "https://www.app.com.pk/national/sifc-committee-reviews-progress-approves-policy-level-interventions-to-facilitate-investors/",
  "date_published": "2024-01-03T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 03 (APP): The Apex Committee of Special Investment Facilitation Council (SIFC) chaired by Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday reviewed progress on various measures being undertaken to improve the investment climate and approved various policy level interventions to further facilitate the investors including strengthening of domestic dispute resolution mechanism.\nThe committee reviewed various projects and initiatives being pursued through the platform of SIFC.\nIt reviewed progress on privatization and appreciated the collaborative approach of various stakeholders in timely completion of various critical benchmarks and gave directions to maintain the momentum, PM Office Media Wing said in a press release.\nThe meeting was attended by Chief of Army Staff General Syed Asim Munir, members of the caretaker federal cabinet, caretaker provincial chief ministers and high level officials.\nThe committee also developed consensus on fast tracking the infrastructural development to facilitate the investors, especially in remote areas of the country and appreciated the ongoing inclusive approach towards human resource development to support emerging needs in key sectors of economy.\nThe federal ministries presented progress on the projects being steered in key sectors and gave plans for timely realization of the envisaged investments.\nThe prime minister directed all the stakeholders to vigorously pursue various SIFC’s initiatives to ensure their accomplishment within stipulated timeframe.\nThe chief of army staff assured unwavering resolve of the Pakistan Army to support government’s initiatives aimed at economic recovery of the country.\nThe committee showed satisfaction on overall progress achieved in the key sectors under SIFC.\nIt appreciated the enhancing level of economic engagements with friendly countries including finalization of Bilateral Investment Treaty with Kingdom of Saudi Arabia and Qatar as well as signing of MoUs and Framework Agreements with the United Arab Emirates and State of Kuwait respectively.\nThe forum gave directions to convert these sovereign commitments into economic reality at fast pace.\nIt also showed firm resolve to take action against smugglers, hoarders and market manipulators that had impacted the economic trajectory and to provide immediate relief to the common citizens.",
  "retrievedAt": "2025-08-10T23:20:54.053Z"
}
