{
  "title": "Pakistani nation to fight challenge of coronavirus collectively: Qureshi",
  "link": "https://www.app.com.pk/national/pakistani-nation-to-fight-challenge-of-coronavirus-collectively-qureshi/",
  "date_published": "2020-03-18T01:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 18 (APP):Foreign Minister Shah Mehmood Qureshi on Wednesday said the Pakistani nation would fight the challenge of coronavirus collectively and with national zeal as it was not the time for criciticising each other.\n“I appeal all to remain united and if Sindh and Balochistan governments have taken good steps to control conronavirus we should appreciate it, and similarly if the governments of Khyber Pakhtunkhwa and Punjab are taking good decisions, they should also be praisedl,” he said at a press conference after his return from China’s visit.\nHe said they had gone to China to express solidarity with government and people of China after the outbreak of coronavirus in Wuhan province.\nHe said when the coronavirus broke out in China, citizens of many countries were evacuating from there but Pakistan, being a trusted friend of China, did not evacuate its students from there which was highly praised by the Chinese government.\nHe said yesterday they talked to Pakistani students studying there through video-link and were very pleased to know that all were fine and healthy.\nHe said the Pakistan students desired that they should be provided Pakistani dishes, adding cane foods would be dispatched to them soon.\nHe said Chinese President Xi Jinping and other leadership thanked the people and Pakistani leadership for standing with them at the critical time and assured their full support to Pakistan in this situation.\nShah Mahmood Qureshi said after the breakout of the virus, the Chinese people accepted their government’s precautionary measures in letter and spirit. He urged the people to adopt protective measures and fight the virus with unity.\nHe said Pakistani nation had emerged successful from various challenges and said: “We must adopt the precautionary measures about the coronavirus as suggested by the health department.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:58:16.916Z"
}
