{
  "title": "First Corona Virus patient detected in AJK",
  "link": "https://www.app.com.pk/national/first-corona-virus-patient-detected-in-ajk/",
  "date_published": "2020-03-17T23:37:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Mar 18 (APP):The first case of coronavirus has been detected in Azad Jammu Kashmir as National Institute of Health Islamabad tested one person positive for the disease out of nine suspected cases, the authorities said on Wednesday.\nAddressing a press conference , Mirpur Deputy Commissioner Raja Tahir Imtiaz and District Health Officer Dr. Fida Hussain here on Wednesday said that laboratory tests detected virus symptoms in a 45 year-old male patient. He belonged to Sudhanoti (Palandri) district of Azad Jammu Kashmir.\nHe had landed from Tuftan (Baluchistan) after travelling from Iran, along with eight others through the Dera Ghazi Khan few days back.\nThey said that all the nine suspect persons were kept in isolation centers at the Hospital in New Mirpur city and the Divisional Headquarter Hospital Mirpur under close monitoring for next 14 days under the stipulated Standard Operating Procedure of the hospitalization of such patients suffering the virus.\n“All the 9 samples were sent to the NIH Islamabad, of which only one was found positive and he too has not threat to his life as his treatment is in progress in the special Isolation Center set up in the State-run Hospital in New Mirpur city”, the DC said.\nTo a question, the DHO, Dr. Fida Hussain said that only the healthy person was kept in quarantine Center just after the doubt of emerging of symptoms of the virus.\nHe said that all four persons admitted in quarantine Center in Mirpur DHQ hospital had been discharged so far after their samples were declared negative by the NIH Islamabad.\nIt may be added that three quarantine centers have been established at the DHQ hospitals one each at the divisional headquarters of Mirpur, Rawalakot and Muzaffarabad to immediately deal with the virus.\nMirpur Deputy Commissioner Tahir Mumtaz said, while responding to a query said that adequate arrangements had been made on emergency grounds to make due checking of the people moving to and from this district at both the major entry and exit points of Mangla and Dadyal through the two 8-hour shifts of checking of the travelers for detecting the symptoms round-the-clock.\nHe said that quick response force had also been put on high alert to immediately deal with any eventuality if emerged.\nThe DC disclosed that a fully equipped latest Intensive Care Unit (ICU) was being established within next two to three days at the Mirpur DHQ Hospital to effectively deal with the patients if emerged.\nResponding to a question about disappearance of the masks of all kinds in the open market, the DC said that the AJK government had principally decided to manage the production of the masks on its own as reportedly decided by the top State authorities.\nTahir Mumtaz emphasized the need of adopting due pre-cautionary measures to avert the threat of the coronavirus.",
  "retrievedAt": "2025-08-11T18:58:18.444Z"
}
