{
  "title": "Health emergency declared as 28 tested positive for coronavirus in Punjab: CM Buzdar",
  "link": "https://www.app.com.pk/national/health-emergency-declared-as-28-tested-positive-for-coronavirus-in-punjab-cm-buzdar/",
  "date_published": "2020-03-18T01:37:00.000Z",
  "source": "APP",
  "content": "MULTAN, Mar 18 (APP)::Chief Minister Sardar Usman Buzdar Wednesday unveiled plans to fight coronavirus with an enhanced funding of Rs 5 billion stating that health emergency has been\ndeclared in Punjab and a 1000-bed temporary hospital would be built to treat the Coronavirus patients.\nTalking to media during his visit to country’s largest\nquarantine area in Multan Industrial Estate Area, Buzdar said\nthat there were 189 suspected patients out of whom 28 have so far\nbeen tested positive for coronavirus but another 143 were tested\nnegative in the province. He said that result of 38 suspected\npersons was awaited.\nHe said, it has been decided to ban the entry of tourists\ninto recreational areas, hill stations like Murree. He said,\nshopping malls would close businesses 10pm daily and only\nnecessary skeleton staff would attend offices.\nBuzdar said that provincial government was alert from the\nvery beginning and had started taking steps to contain the virus\nfrom Jan 3, 2020 adding that initially a Rs 236 million funding\nwas allocated which has now been enhanced up to Rs 5 billion.\nHe said that provincial government would also set up a camp\nnear Taftan border in Balochistan for the residents of Punjab\nadding that they were in contact with Balochistan government in\nthis connection.\nBuzdar said that 1200 more people would reach Multan\nquarantine area from Taftan border on Thursday, March 19.\nCM said that these new decisions were taken during Prime\nMinister Imran Khan’s visit to a quarantine facility in Dera\nGhazi Khan.\nHe said that factories and markets would, however, remain\noperational.\nPunjab Chief Minister said that government has set up 41\nHigh Dependency Units while three hospitals have already been\nallocated for treatment of the patients at Lahore, Rawalpindi and\nMuzaffargarh.\nCM said that provincial government was forming committees at\ndistrict level to attract larger community participation in\nsupport of anti-corona measures. The committees would comprise\nelected representatives, and representatives from Chambers of\nCommerce.\nHe said that government was also in talks with the industry\nto ensure availability of masks and hand sanitizers.\nConsultant on infectious diseases and CEO Shoukat Khanam\nCancer Hospital Dr. Faisal Sultan advised people to exercise\nsocial distancing to contribute to the efforts to slow down the\nvirus spread.\nHe urged people to avoid unnecessary travel and gatherings.\nHe said that N-95 masks show good results compared to\nordinary masks and government was ensuring that these masks were\navailable with all health workers.\nHe said that people should wash hands regularly and maintain\ngood hygiene.\nHe said that elderly people should be taken care of\nproperly.\nHe said that strategy to fight coronavirus would continue to\nbe modified in accordance with the needs step by step but\ncontinuously.\nLater, CM Sardar Usman Buzdar and Dr. Faisal also visited\nthe quarantine facility and highly appreciated the efforts of the\nadministration. CM said that Multan quarantine was a model which\ncan be replicated in other parts as and when required.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:58:19.027Z"
}
