{
  "title": "OGDCL injects 305,804 BBL oil, 3,677 MMCF gas in its production gathering system",
  "link": "https://www.app.com.pk/national/ogdcl-injects-305804-bbl-oil-3677-mmcf-gas-in-its-production-gathering-system/",
  "date_published": "2022-07-13T08:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP): The Oil and Gas Development Company Limited (OGDCL) has injected eight operated wells, producing 305,804 barrel (BBL) crude oil and 3,677 metric million cubic feet (MMCF) gas, in its production gathering system during the first nine months of the last fiscal year.\n“The injected wells include Tando Alam-21, Sial-1, Pasakhi-12, Mangrio-2, Togh Bala2, Gundunwari-1, Pandhi-1 and Siab-1 which cumulatively yielded gross crude oil and gas production of 305,804 barrels and 3,677 MMcf respectively,” according to a financial report for the third quarter of year 2021-22 available with APP.\nBesides, the company made four hydrocarbon discoveries, having expected cumulative daily production potential of 39 MMCF gas and 2,850 BBL of oil, during the period under review.\nThe discoveries include Wali-1 (Kawagarh), Wali-1 (Hangu) and Wali-1 (Lockhart) in district FR Lakki, KP province and Jandran West-1 in district Kohlu, Balochistan province.\n“Preliminary 2P reserves estimates attributable to these discoveries are 236 billion cubic feet of gas and 13 million barrels of oil, combined 58 million barrels of oil equivalent.”The OGDCL also carried out 70 work-over jobs comprising 12 with rig and 58 rig-less to arrest natural decline and sustain production from mature wells.\nMoreover, it completed pressure build-up survey jobs at various wells of producing fields including Mela, Pasahki, Nashpa, Qadirpur, Maru-Reti, Uch and Kunnar to induce improvement in the current well flow parameters.\nThe OGDCL contributed around 48 percent, 30 percent and 38 percent towards the country’s total oil, natural gas and LPG production respectively.\nThe company’s average daily net oil and gas production clocked in at 36,173 BBL and 828 MMCF, which was 36,836 BBL and 865 MMCF in the corresponding period of the last year, respectively.\nThe lower production was recorded on account of annual turn around (ATA) at six production fields including Qadirpur, Mela, Nashpa, Sinjhoro and Uch-I & II.\nLikewise, decline in production share from NJV fields also contributed towards lower output.\nThe company’s average daily net Liquefied Petroleum Gas (LPG) production clocked in at 822 tons, which was 802 tons in the same period of the corresponding year, due to higher production mainly from Mela, Nashpa and TAY fields.",
  "retrievedAt": "2025-08-11T15:14:28.955Z"
}
