{
  "title": "NHA striving for up-gradation, expansion  of federalized road network in Balochistan",
  "link": "https://www.app.com.pk/national/nha-striving-for-up-gradation-expansion-of-federalized-road-network-in-balochistan/",
  "date_published": "2020-11-23T08:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): National Highway Authority (NHA) has been striving for the realization of the present  government’s plan of modernization, up-gradation and expansion of nationalized road infrastructure in Balochistan to bring the province at par with the developed areas of the country.\nUnder the Public Sector Development Programme (PSDP) 2020-2021 an amount of   Rs 10,000 million has been allocated for Zhob to Kuchlak Road which forms part of China Pakistan Economic Corridor Western alignment. Estimated cost of the project is Rs 63081 million.\nAbout 106 km two-lane Highway from Basima to Khuzdar, has the estimated cost of Rs 19188.435 million with the allocation of Rs 4400 million in the current fiscal year.\nFor construction of black top road Yakmach-Kharan via Dostain-Wadh-Khurmagai, which has estimated cost of  Rs 13758 million,  Rs 1500 have been specified in the current PSDP, the document said.\nRs 900 million have  been allocated for Qila Saifullah Lora Lai Waigum Rud section  of N70, out of which Rs 750 million is foreign aid.  For 81 km  Zhob- Mughal Kot  section\nof N-500, Rs 900 million have been earmarked out of which Rs 750 million is foreign component.\nAs far as widening and strengthening of National Highway Rakhi Gajj-Bewata section of N-70 was concerned, Rs 1000 million have been allocated which also included Rs Rs 500 million  foreign aid. Estimated cost of the project is Rs 22994.660  million, according to the document.\nFor the construction of Dera Murad Jamali Bypass  having estimated cost Rs 2105.954, allocation of Rs 1000 million has been made in the current PSDP.\nRs 4000 millions have been earmarked for the construction of Hoshab-Awaran Section of M-8 (146 km), with the estimated cost of Rs 25835.893 million.\nConstruction of Ziarat Mor – Kech – Harnai Road (107.2 km) and Harnai- Sanjavi Road (55.1 km) (Deposit Work) would cost Rs 8379.075 million and in the current fiscal year an allocation of Rs 100 million has been made.\nDualization and  improvement project of  210 km existing N- 50 from Yarik – Sagu – Zhob including Zhob Bypass has estimated cost of Rs  76486.231, million.\nIn the present fiscal year Rs 1000 million have been allocated for the project out of which Rs 500 million is foreign aid.\nFor 82 km Jhal Jaho-Bela Section deposit work which has estimated cost of Rs 12343.400 million, Rs 1000 million have been allocated in current fiscal year.\nFor deposit work of Nokundi- Mashkhel Road, part of  China Pakistan Economic Corridor having estimated cost of Rs 7708.911million , Rs 1000 million have been specified this fiscal year. For 23 km Quetta Western Bypass, which has Rs 6890.569 million , Rs 1500 million have been allocated this year.\nRs 500 million have been earmarked for 118 km rehabilitation, upgradation and widening project of Quetta – Dhadhar Section of N-65 which has estimated cost of Rs 7115.760 million.\nFor widening, improvement and rehabilitation of 2m96 km remaining portion of\nKararo – Wadh Section of N 70, having estimated cost of Rs 1659.840 million, an allocation of  Rs 300 million has been made.",
  "retrievedAt": "2025-08-11T20:02:57.357Z"
}
