{
  "title": "Marriyum says Imran wants every institution head to act like Javed Iqbal, dares him to name ‘agencies’ involved in politics",
  "link": "https://www.app.com.pk/national/marriyum-says-imran-wants-every-institution-head-to-act-like-javed-iqbal-dares-him-to-name-agencies-involved-in-politics/",
  "date_published": "2022-08-19T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Friday alleged that Imran Khan wanted the head of every institution to act like former NAB chairman Javed Iqbal, and dared him to name the “agencies and their officials” who were involved in politics and had given him the guarantee that the incumbent chief election commissioner would toe his line.\n“Either point out the persons and agencies who have given you (Imran) a briefing about the corruption of PML-N and PPP or stop this drama once and for all if you lack the courage,” the minister said while addressing a news conference.\nThe minister said Imran Khan, while addressing a seminar the other day, had claimed that he was briefed about the opposition leaders’ corruption by the “agencies” and the incumbent chief election commissioner (CEC) was appointed by him on their guarantee.\n“Which guarantee was given to him (Imran) for the CEC? Which agency had given him the guarantee? And why he needed the guarantee at all?” she questioned.\nThe minister asked whether he wanted the assurance that the Pakistan Tehreek-e-Insaf (PTI) would not be declared a foreign-aided party and he himself as a “foreign agent” under that guarantee.\nShe said Imran Khan had made a claim that he received reports from the “agencies” about the leadership of Pakistan Muslim League-Nawaz (PML-N) and Pakistan Peoples Party (PPP). Whether he himself had sought the reports from the agencies, she wondered, advising the PTI chairman to better stop churning out lies.\nMarriyum alleged that Imran Khan was a “fascist who wants to impose fascism on the entire country”. He desired that persons like Javed Iqbal should head all the state institutions, including the Election Commission of Pakistan, Federal Investigation Agency, National Accountability Bureau and others.\nShe said,“Imran Khan is a conspirator and has the only expertise as how to hatch a conspiracy against Pakistan.” He was the root-cause of all the problems being faced by the country, she added.\nThe minister said during his so-called 22 years long political struggle, Imran Khan had always tried to pose himself as an “angel” and the others as “thieves” while giving an “Islamic touch”.\n“Lies, drama and hypocrisy” were the hallmarks of his politics, she added.\nMarriyum regretted that Imran Khan had refused to appear before the FIA in connection with the prohibited funding. “He said that he would not give any answer to the FIA about the prohibited funding. Whether it is the court, the opposition or the media, he has refused to answer to anybody about his wrongdoings.”\nShe said Imran Khan was not a “sacred cow” and would have to face the law. If three times prime minister Nawaz Sharif and his daughter Maryam Nawaz had presented themselves for accountability, then Imran Khan could not escape from the long arm of law.\nShe said though false cases were lodged against Nawaz Sharif and Maryam Nawaz, and the fact was later admitted by Judge Arshad Malik, but they appeared before the courts.\nNawaz Sharif, she added, presented himself for accountability by writing a letter to the top court (for formation of a commission to investigate the Panama Papers issue) as he knew that he had not committed the corruption of even a single dime.\nMarriyum said Imran Khan used all state institutions to victimize Nawaz Sharif and Shehbaz Sharif. He submitted false evidence against the PML-N leadership to the National Crime Agency of the United Kingdom and also provided the same material to foreign journalist David Rose, but could not succeed in his designs.\nNAB failed to produce even a single evidence in courts to prove corruption of the PML-N leadership, she added.\nShe said Imran Khan set up an asset recovery unit in the Prime Minister’s Office with his “tout” Shahzad Akbar as its head for victimizing the political opponents. He (Imran) should be ashamed of himself as he had made a mockery of the accountability process.\nThe minister said Imran Khan had wrongly assumed that he would got off scot free for his “sins”, by saying that the “agencies” had briefed him about the alleged corruption of then opposition leaders.\n“He should be ready to face action in the foreign funding case,” she remarked.\nMarriyum said there was no comparison of Imran Khan with Nawaz Sharif, who was ousted from power with the support of “black law dictionary”, as there was no law to remove the latter from the public office for not withdrawing salary from his son.\nNawaz Sharif, she said, had never talked about the country’s disintegration or “setting it on fire”, and launched a malicious campaign against the military’s martyrs. Instead he had always stressed on working of all the state institutions within constitutional domain, she added.\nOn the contrary, she said, it was Imran Khan who talked about the disintegration of Pakistan in three parts and even maligned the state institutions when ousted from the power.\nShe said Imran Khan himself admitted that he had called upon the state institutions to intervene when the no-trust motion against him was going to succeed in the National Assembly. Now, he again asked the state institutions to help him regain the power, she added.\nMarriyum said the “plotter” Imran Khan brought up the so-called regime change conspiracy drama on realizing his imminent ouster from power. If he was serious to hold fresh general election in the country, he should have dissolved the assemblies when the first National Security Committee meeting had ruled out the foreign conspiracy.\nShe said Imran Khan gave a call for mutiny in the rank and file of the armed forces through his chief of staff, ordered his trolls to malign the martyrs of Lasbella helicopter crash, and hired the people to raise slogans against his political opponents at the Masjid-e-Nabvi.\nConstitutional violations, media gagging and political victimization were at peak during the four-year rule of Imran Khan, she said, adding he (Imran) now refused to submit the record with the FIA of his corruption and foreign funding.\nThe minister said the malicious campaign against state institutions would not divert the public attention from the foreign funding which his party had received from India, Israel and the United States.\n“The drama of levelling allegations and telling lies should be stopped now,” she stressed.\nThe minister said Imran Khan would have to give answer for his “corruption, fascism, thievery and incompetency” as per law.\nTo a query, she alleged that Imran Khan had damaged the China Pakistan Economic Corridor by halting its projects. He even made the Chinese government controversial in exchange of the foreign funding.\nIt was the first time the Kashmir cause was traded off in exchange of foreign funding, she added.",
  "retrievedAt": "2025-08-11T15:25:47.921Z"
}
