{
  "title": "Taiwan issue related to China’s sovereignty: Speakers",
  "link": "https://www.app.com.pk/national/taiwan-issue-related-to-chinas-sovereignty-speakers/",
  "date_published": "2022-08-19T12:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): The speakers in a roundtable discussion have stated that Tiwan dispute was not about China’s policy instead it was the issue of its sovereignty.\nIslamabad Institute of Conflict Resolution (IICR) organized a Roundtable Discussion titled “US-China Rivalry at the Shores of South China Sea”, said a press release issued here on Friday.\nThe panelists included Senator Mushaid Hussain Syed, Naghmana Hashmi, Zamir Assadi, Dr. Zafar Nawaz Jaspal and Shakeel Ahmed Ramay.\nThe session was moderated by Founder IICR, Sabah Aslam.\nSpeaking on the occasion, Senator Mushaid Hussain Syed said that when US was busy in wars, China was busy investing and still doing it.\n“It is written on a wall that China has overtaken US in technology and it is even established in Harvard university’s report, it is not Chinese fact but report from US,” he added.\nZamir Assadi said that the global politics was shaping in South China Sea specially the recent incident of Nancy Pelosi’s visit to Taiwan.\nHe was of the view that US scrapped three joint communiques which were singed between US and China and it put pressure on developing countries who had working relations with Beijing.\nZamir observed that West’s investment in not only South China Sea but across the world were strategically and politically driven.\nNaghmana Hashmi said that Taiwan issue was not about one China’s policy, addingthe issue was related to its sovereignty.\nShe said that Taiwan historically was part of China and later it was administered as province and administrative unit of China.\nShe also said that one of the ambitions of China was the reunification of Islands.\nThere were guarantees given to Beijing by Washington that US would not exceed Arms sent to Taiwan and it was strategically not adhering with the pact, she added.\nShakeel Ahmad Ramay said that global policy of china began in 1980s and transformation of China was completed under Xi Jinping.\nRamay said that Beijing was globally helping nations to grow, adding it was ending food insecurity in regions like Africa.\nChina was also securing its security gaps through sea because of the insecurity it had from it, he added.\nHe said that China’s security had taken a paradigm shift from territorial security to individual security which was centered on assuring security to every Chinese individual.\nDr. Zafar Nawaz Jaspal said that when canons in Ukraine were fired it left a whole mark on world and Pakistan also faced it.\nSimilarly if the fire started in South China Sea that it would have direct impact on Pakistan, he added.\nMoreover, President Xi future would be decided in November CPC meeting, he said, adding the conflict was evolving between US and China.China’s rise was directly threatening the ideas of the west, he added.\nDr. Jaspal said that US was facing challenges to compete with China and Washington lacked behind in technological run with China.",
  "retrievedAt": "2025-08-11T15:25:48.691Z"
}
