{
  "title": "NADRA embraces massive digital transformation, gender parity: Chairman",
  "link": "https://www.app.com.pk/national/nadra-embraces-massive-digital-transformation-gender-parity-chairman/",
  "date_published": "2022-08-19T18:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP):National Database and Registration Authority (NADRA) Chairman Muhammad Tariq Malik on Friday said the authority embraced massive digital transformation through procedural and structural reforms during the last one year.\nHe, while talking to PTV, said some 43 initiatives were planned during the period to digitalise NADRA and to improve the service delivery, while 27 of them had been completed.\nWhile informing further about the reforms introduced in NADRA during the last one year, Malik said some 100 new centres were established in the far-flung areas of the country besides improving the facilities in the existing ones to provide hassle-free services to the people and to end the long queues that used be a routine outside almost every NADRA office.\nThe authority also set up public engagement programme and held open courts to resolve grievances of the public, he added.\nThe chairman further said NADRA had eased the registration process for women and allowed women to get themselves and their children registered with the national database without being escorted by a male member of the family.\nThe authority, he said, expedited the registration process that increased the number of daily registrations from 70,000 to 125,000, and majority of them were youngsters and women.\nMalik informed that there were around one billion people living in the world without any citizenship registration or document. He proposed that the country should focus on adopting universal database coverage to cover all its population under a unified national database.\nHe added that the authority, by recruiting additional number of women, reduced the gender gap among its employees from 4.3 to 1.9 per cent, and there were over 100 NADRA centers with a female in-charge.\nMalik said, “NADRA has made its employment procedure online to ensure transparency and merit. The authority has also disqualified 63 applicants for attempting to influence the recruitment process through political intervention.”\nNADRA introduced internal arrangement system to promote its 6,000 daily-waged workers by conducting skill tests biannually, and arranging training programmes to impart digital skills among the workers, he added.\nTariq Malik said NADRA verified family data of around 50 million people so effectively that only 28,000 of them asked to make changes in their family trees.\n“NADRA has also digitalise the councilor services abroad to facilitate 75,000 overseas Pakistani, who can now renew their identity cards online,” he said, adding that similar facility would also be made available for the locals. “I would request Prime Minister Shehbaz Sharif to inaugurate the newly-introduced option in the NADRA mobile app for online renewal of national identity card.”\nNADRA would also expand the National Immunization Certification Programme to yellow fever and polio inoculations, he added.\nMalik informed that NADRA had also gained international attraction and won biding for various projects related to database registration in various countries, including multilateral organizations and the United Nations.\nHe underlined that the authority subsidized the charges for the issuance of CNIC to citizens without taking budget from the government.\nNADRA, he said, had kicked out 377 people for illegally infringing the NADRA data which was one of the secured databases of the world. He mentioned that a total 21,000 employees were serving in NADRA.\nThe chairman said there were 1.4 million afghan refugees registered with NADRA and urged the unregistered ones to get them registered at earliest.\nHe underscored that Pakistan was the only country in the Muslin world to recognise transgender community.\nHe also mentioned that there were drawbacks in the death registration procedure as it\nwas connected with local governments, however NADRA was working out solutions to remove the hitches.",
  "retrievedAt": "2025-08-11T15:25:40.508Z"
}
