{
  "title": "SC directs parties to file written replies in NAB law amendments case",
  "link": "https://www.app.com.pk/national/sc-directs-parties-to-file-written-replies-in-nab-law-amendments-case/",
  "date_published": "2022-08-19T14:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): The Supreme Court on Friday while hearing Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan’s petition against amendments in the National Accountability Bureau (NAB) laws, directed the parties to file their written replies over the matter.\nA three-member SC special bench comprising Chief Justice of Pakistan Umar Ata Bandial, Justice Ijaz Ul Ahsan and Justice Syed Mansoor Ali Shah heard the petition filed by the PTI chairman challenging recent amendments to the NAB Ordinance.\nImran Khan, in his petition filed under Article 184 (3) of the Constitution, claims that the new bill amending the NAB Ordinance has virtually eliminated accountability of any public office holder for committing white-collar crime.\nDuring the course of proceedings, Advocate Makhdoom Ali Khan, counsel for the Federal Government, said under the NAB law, an accused could have been remanded for 90 days while the parliament corrected such imbalance.\nHe said,”We live in a society where even if an accused were acquitted of charges, his / her family have to live with this stigma.” There were also observations from the Supreme Court on errors in the NAB law, he added.\nThe CJP said the apex court had given observations on the provisions of NAB law. The 90 days remand could not be justified under any circumstances, he said, adding 14 days remand was mentioned in the criminal justice system.\nA maximum remand of two or three days was given and sentence should not be given (to an accused) based on suspicion but on solid evidence, he remarked.\nJustice Mansoor Ali Shah asked if the parliament had repealed the entire NAB law, and whether the people could approach the Supreme Court.\nMakhdoom Ali Khan replied that if the parliament were not doing its job then the court was there. In the parliamentary democratic system of government, if the parliament were functioning, then the judiciary should avoid interference. The main forum for discussion was the parliament, he added.\nThe chief justice asked whether the law could be amended to benefit oneself. There was an unusual situation in the country at the moment as a political party had boycotted the parliament.\nThe court remarked that it recognized the supremacy of parliament and it had also asked the petitioner to go to the parliament. It rejected the impression that the judiciary enjoyed while interfering in the affairs of parliament.\nSubsequently, the court adjourned the hearing till September 1, directing the parties to file their written replies.",
  "retrievedAt": "2025-08-11T15:25:42.554Z"
}
