{
  "title": "Pakistan rejects Indian attempts of pre-poll rigging in IIOJK",
  "link": "https://www.app.com.pk/national/pakistan-rejects-indian-attempts-of-pre-poll-rigging-in-iiojk/",
  "date_published": "2022-08-19T15:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Pakistan on Friday categorically rejected the deliberate Indian attempts of pre-poll rigging and overt manipulation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). The latest announcement of permitting even temporary residents in the occupied territory, including outside workforce and security personnel, to register as “voters” was a clear manifestation of the treacherous Indian design to influence the outcome of ‘so-called’ elections in the IIOJK. “Pakistan reiterates its complete rejection of India’s entire litany of steps aimed at turning the Muslim majority in IIOJK into a minority — including the formulation of the so-called ‘Delimitation’ Commission and its baseless report, the issuance of fake Kashmiri domiciles to millions of outsiders, and changes in the property laws,” a Foreign Office statement issued here said.\nDespite its reprehensible measures that have followed the illegal and unilateral actions of 5 August 2019, India will not be able to break the will of the Kashmiri people or to mislead the world community, it added. The government of India must desist from all actions in the IIOJK that violate the international law, the UN Charter, and the 4th Geneva Convention.\nIndia must also release all political prisoners detained on trumped-up charges, halt human rights violations in the IIOJK, lift the brutal military siege, and let the Kashmiris exercise their legitimate right to self-determination as stipulated in the relevant UN Security Council resolutions, the statement stressed. “Pakistan also calls upon the international community to take immediate cognizance of the blatant Indian attempts at effecting illegal demographic changes in the IIOJK and to hold India to account,” the statement concluded.",
  "retrievedAt": "2025-08-11T15:25:43.384Z"
}
