{
  "title": "Pakistan categorically rejects attempts of pre-polling rigging in IIOJK",
  "link": "https://www.app.com.pk/national/pakistan-categorically-rejects-attempts-of-pre-polling-rigging-in-iiojk/",
  "date_published": "2022-08-19T17:44:00.000Z",
  "source": "APP",
  "content": "Addressing a weekly press briefing here, the Foreign Office spokesperson said, “Kashmiris themselves have also completely rejected the Modi government’s decision to allow non-Kashmiri citizens and temporary residents in IIOJK, to vote in the so-called Kashmir Assembly elections.\n“The move reeks of a blatant attempt to undermine the disputed status of Jammu and Kashmir, and the sinister design of turning the Muslim majority in IIOJK into a minority,” he added.\nTalking about human rights violations by India, the spokesperson said, “In a blatant display of state terrorism, Indian police took a political prisoner Mohammad Ali Hussain from Kothbalwal Jail Jammu and brought him at Toph Arnia area and killed him in a staged encounter.\n“The killing of Mohammad Ali Hussain under mysterious circumstances at a location far away from the prison is yet another sickening chronicle and a dastardly practice of extra-judicial killing of prisoners in fake encounters by the Indian forces in occupied Kashmir.”\nHe said it was the second such extrajudicial killing of a prisoner. “As you would recall Zia Mustafa, from Rawlakot, was taken out of the Kothbalwal jail in Jammu and brought to forests in Poonch by the Indian troops and subsequently killed in firing in October 2021.\n“Since 2019, the BJP (Bharatiya Janata Party)-led government in India has unleashed unspeakable atrocities on the innocent people of Jammu and Kashmir. Over 660 Kashmiris have been martyred by Indian occupational forces, including over 145 innocent lives this year alone.”\nThe cold-blooded and blatantly unlawful acts, he added, included a ruthless policy of killing and arresting Kashmiris in fake cases, seizing their properties, and dismissing them from government jobs, with a view to suppress the ongoing freedom movement.\n“We salute the spirit of the oppressed people of IIOJK and their indomitable quest for the right to self-determination guaranteed to them by the UN Security Council. The people of IIOJK stand strong in the face of brutal acts and have categorically rejected the BJP government’s illegal actions post August 2019.\n“We believe it is time for the international community to bring its moral force to bear with the Hindutva inspired BJP government of India today and to call for immediate halt of reprehensible state-backed violence, and to play its due role in ensuring a just and peaceful resolution of the Jammu and Kashmir dispute in accordance with the relevant UN Security Council resolutions and the wishes of the Kashmiri people.”\nTo a question, the spokesperson said India had once again shown its treacherous designs to overtly manipulate the outcome of the ‘so-called’ elections that it intended to hold in the Indian Illegally Occupied Jammu and Kashmir.\n“The decision to permit temporary residents, including labour, security personnel and others will add nearly 2.5 million voters to the eligible voter rolls and this is almost 1/3 of the total number of registered voters in IIOJK. So this will definitely influence the outcome of any so-called elections and further suppress the Muslim vote in the valley.”\nPakistan, he said, categorically rejected “this measure, as well as India’s continued attempts to undermine the Muslim majority in IIOJK through reprehensible actions including illegal and unilateral actions of 5th August 2019, issuance of millions of fake domiciles, grant of property rights to non-Kashmiris, and above all, gerrymandering through the so called Delimitation Commission.”",
  "retrievedAt": "2025-08-11T15:25:40.504Z"
}
