{
  "title": "PM terms ‘polio-free Pakistan’ a national goal",
  "link": "https://www.app.com.pk/national/pm-launches-nationwide-anti-polio-drive-2/",
  "date_published": "2022-08-19T06:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): Prime Minister Shehbaz Sharif on Friday terming ‘Polio-free Pakistan’ a national goal urged the citizens to cooperate with polio teams for the complete eradication of the crippling disease from the country.\n“This is a testing time with the resurgence of recent polio cases and the related security incidents, but we can and will overcome it,” he said at the launch of the nationwide anti-polio drive.\nThe drive kicked off as the prime minister administered drops of polio vaccine to the children under five years of age, here at the Prime Minister’s House. The current anti-polio campaign for Karachi and six districts of southern Khyber-Pakhtunkwa started on August 15, while the National Polio Vaccination Drive will commence on August 22.\nThe prime minister vowed to get the country free from polio, which he said was affecting the children in some areas.\nHe regretted that polio was one of the few countries in the world where polio was still recognized as an endemic viral infection.\nHe urged the parents not to miss getting their children administered the polio drops and support the government’s goal to make Pakistan polio-free.\nThe prime minister expressed Pakistan’s commitment to ending polio and emphasised the role of the government leaders, health workers, and parents to ensure that the disease never paralyzed a child jointly.\nHe said by keeping up the momentum and staying vigilant, Pakistan would be able to win the challenge of polio eradication.\nPM Sharif called upon the federal, provincial and district managements to address the challenges of persistently missed children and also encourage the people by raising awareness about the gravity of the situation.\nHe paid tribute to the polio workers for relentlessly carrying out the drive in far-flung areas despite the challenges including resistance and refusals by some community members.\nChief Minister Sindh Murad Ali Shah, Federal Minister for Health Abdul Qadir Patel, Information Minister Marriyum Aurangzeb, and representatives of Bill & Melinda Gates Foundation attended the ceremony.\nPM Sharif, who also chaired the National Task Force meeting for polio eradication, expressed his government’s full commitment to taking practical measures for curbing wild poliovirus transmission in Pakistan.\nHe said the current climatic conditions posed great challenges to vaccination campaigns, however, lauded the services of polio teams that carried on despite floods in several parts of Khyber-Pakhtunkwa (KP) and torrential rains in Karachi.\nHe thanked the law enforcement agencies, especially Pakistan Army and Police for their support to polio teams across Pakistan. He mentioned that several officers and polio workers sacrificed their lives in the line of duty.\nThe participants of the meeting recited fateha for the police constables and soldiers who were martyred in Tank on Tuesday.\nThis was the third National Task Force Meeting on Polio chaired by Prime Minister Shehbaz Sharif since he took office.\nSoon after the first wild polio case of the year was reported in April, PM Sharif chaired an emergency meeting of deputy commissioners of all high-risk areas to discuss and address the challenges on the ground.",
  "retrievedAt": "2025-08-11T15:25:53.165Z"
}
