{
  "title": "PM meets Harvard University students, shares vision for Pakistan",
  "link": "https://www.app.com.pk/national/pm-meets-harvard-university-students-shares-vision-for-pakistan/",
  "date_published": "2022-08-19T16:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 19 (APP): A delegation of students from Harvard University, United States Friday called on Prime Minister Shehbaz Sharif here and discussed matters related to Pakistan.\nFederal Ministers Ahsan Iqbal, Marriyum Aurangzeb, SAPMs Ahad Cheema, Syed Fahad Hussain, Jahanzeb Khan, Coordinators to PM Bilal Azhar Kiyani, Rana Ihsan Afzal, Chairman HEC and officials from the concerned departments were also present.\nThe delegation comprised students of diverse origins and academic backgrounds.The prime minister welcomed the students and held a candid discussion about the contemporary challenges Pakistan is facing today.\nIn response to a question about Pakistan’s economy and IMF program, Prime Minister Shehbaz Sharif replied that Pakistan’s economic crisis stem from structural problems along with political instability in the recent decades.\nThe first few decades since the inception of Pakistan witnessed impressive growth across all sectors of the economy, he added.\nHe said “We had plans, national will and the implementation mechanism to produce outcomes. Overtime, we lost the edge in sectors in which we were ahead. The lack of focus, energy and policy action led to the reduction in national productivity.”\n“All efforts and resources have been deployed to stabilize the economy. Doing so is most crucial, but there is still a bumpy road ahead. We have a work ahead which involves prudent policies keeping the big picture in mind” he added.\nThe prime minister also shared that his economic action plan had three prongs; the revitalization of the economy, making information technology the pivot of national development and the exports leading the economy.\nHe also shed light on his futuristic programme of free laptops given to high achievers in PMLN’s previous tenure, which not only helped the students to continue their education in the times of COVID-19, but also helped the youth of Pakistan to get a strong foothold in the global freelance market.\n“For Pakistan to develop, we need to focus on vocational, scientific and skilled education. Knowledge-based economy is the buzzword and undeniable reality of our times”, he added.\nHe also said, “The government is working on a plan to unpack the country’s huge but untapped potential in the field of information technology. It is our resolve that we increase our IT exports from the existing $ 2 billion to $15 billion in coming years”.\nThe prime minister also reiterated Pakistan’s strong resolve to maintain peace in the region.\nHe emphasized on the fact that sustainable peace in South Asia was linked to the resolution of Jammu & Kashmir issue in line with the UN resolutions and wishes of Kashmiris, adding nothing short of it would work.\n“We want permanent peace with India through dialogue. War is not an option for either of the countries. Both Islamabad and New Delhi should have competition in trade, economy, and improve the conditions of their people. Pakistan is not an aggressor, but our nuclear assets and the professionally trained army is a deterrence”, he added.\nThe prime minister also emphasized on the importance of political stability in the country.\nHe said that since the economy was dependent on political stability, he had repeatedly offered grand dialogue, which had Charter of the Economy.\nIn a reply to a question about Sino-Pak relations, the prime minister replied that China, and Pakistan were time-tested friends and their friendship gained new heights with the signing of CPEC.\nThe relationship with China remained the cornerstone of our foreign policy, he said, adding that CPEC heralded the beginning of a new era of economic development.\n“Pakistan is ready to promote the spirit of CPEC, which is a win-win partnership for regional peace, security and development. The relationships in today’s world are not mutually exclusive. We look forward to engaging with the whole world at bilateral and multilateral levels, “ he added.\nResponding to a question about climate change, the prime minister reiterated the importance of the responsibility the developed world carried towards the developing countries like Pakistan which was less than 1% contributor in carbon emissions but was 5th most vulnerable country regarding the effects of climate change.\nHe also shared the government’s plans to shift from imported fuels to solar, wind and hydel energy as Pakistan had immense potential in these areas.\nThe students appreciated the prime minister’s progressive approach for uplifting Pakistan’s economy, bringing peace in the region and political stability in the country.\nThe delegation also spoke very highly of the hospitality extended to them by the government and people of Pakistan during their visit.",
  "retrievedAt": "2025-08-11T15:25:45.026Z"
}
