{
  "title": "Senior Indian diplomat summoned LoC violations",
  "link": "https://www.app.com.pk/national/senior-indian-diplomat-summoned-loc-violations/",
  "date_published": "2020-09-18T10:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): A senior Indian diplomat was summoned to the Ministry of Foreign Affairs on Friday to register Pakistan’s strong protest over ceasefire violations by the Indian occupation forces along the Line of Control (LoC) on September 17.\nDue to indiscriminate and unprovoked firing by the Indian occupation forces in Hotspring and Jandrot Sectors of the LoC, 15-year-old Irum Riaz s/o Muhammad Riaz, 26-year-old Nusrat Kausar w/o Abdul Rauf and 16-year-old Mukheel s/o Muhammad Hussain, residents of Andrala Nar Village, sustained serious injuries, a Foreign Office statement said issued here.\nCondemning the deplorable targeting of innocent civilians by the Indian occupation forces, it was underscored that such senseless acts were in clear violation of the 2003 Ceasefire Understanding, and also against all established humanitarian norms and professional military conduct.\n“These egregious violations of international law reflect consistent Indian attempts to escalate the situation along the LoC and are a threat to regional peace and security,” the FO statement said.\nIt was added that by raising tensions along the LoC and the WB, India cannot divert attention from the grave human rights situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nIndian side was called upon to respect the 2003 Ceasefire Understanding, investigate this and other such incidents of deliberate ceasefire violations and maintain peace along the LoC and the WB.\nThe Indian side was also urged to allow the United Nations Military Observer Group in India and Pakistan (UNMOGIP) to play its mandated role as per the United Nations Security Council (UNSC) Resolutions.\nThe Indian occupation forces along the LoC and the Working Boundary (WB) have been continuously targeting civilian populated areas with artillery fire, heavy-caliber mortars and automatic weapons.\nThis year, India has committed 2280 ceasefire violations to date, resulting in 18 martyrdom and serious injuries to 183 innocent civilians.",
  "retrievedAt": "2025-08-11T19:49:07.800Z"
}
