{
  "title": "Dr Faisal visits ICT’s schools to examine SOPs observance",
  "link": "https://www.app.com.pk/national/dr-faisal-visits-icts-schools-to-examine-sops-observance/",
  "date_published": "2020-09-18T08:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): Special Assistant to Prime Minister on National Health Services, Regulations and Coordination Dr Faisal Sultan on Friday visited various schools of Islamabad Capital Territory (ICT) to examine the observance of standard operating procedures (SOPs) related with protection from the COVID-19.\nDuring his visit to educational institutions, he also examined the arrangements made by the school and college administrations to ensure observance of SOPs issued by the government on coronavirus.\nOn the occasion, Dr Faisal Sultan said that the government has decided to have strict monitoring of schools and colleges after re-opening of educational institutions in the country.\nHe said that the government has already taken effective measures as per its strategy to control COVID-19. He added it is the responsibility of the government to protect school children from coronavirus.\nDr Faisal said that the schools administration, teachers and parents will have to adhere to the instructions. He said that in case of any violation of SOPS, such educational institution will be closed.\nHe made it clear that all schools would have to strictly follow the SOPs like social distancing, hands sanitizing or washing, wearing of face masks etc. Besides schools’ administration, the role of parents was also crucial to ensure implementation of the SOPs.\nHe said due to immediate closure of schools, a large number of population, particularly the students, were now safe and remained protected from the COVID-19.\nThe government had adopted an effective strategy to combat the pandemic that resulted reduction in corona cases in the country.\nDr Faisal said the present facts and figures showed declining trend of the coronavirus at all levels due to prompt response of the government. Expressing satisfaction over the current COVID-19 situation, he said it all was made possible due to team efforts and the efficient work.",
  "retrievedAt": "2025-08-11T19:49:08.668Z"
}
