{
  "title": "Turkmenistan assures Pakistan to address concerns about TAPI gas pipeline’s commercial, legal aspects",
  "link": "https://www.app.com.pk/national/tapi-gas-pipeline/",
  "date_published": "2020-09-18T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): Pakistan and Turkmenistan on Friday held a detailed discussion and reviewed progress achieved so far on the Turkmenistan-Afghanistan-Pakistan-India (TAPI) gas pipeline project.\nSpecial Assistant to Prime Minister (SAPM) on Petroleum Nadeem Babar led the discussion with the Turkmenistan delegation, which was headed by Chief Executive Officer and Chairman of the Board of Directors of TPCL (TAPI Pipeline Company Limited) on TAPI Muhammetmyrat Amanov. Turkmen Ambassador to Pakistan Atadjan Movlamov also attended the meeting, a news release said.\nThe Secretary Petroleum, Managing Director Inter State Gas Systems (Pvt) Ltd., other high officials from the Ministries of Energy (Petroleum Division), Foreign Affairs, Law & Justice, Finance and office of Attorney General of Pakistan also participated in the meeting.\nThe meeting reviewed progress on the project and expressed satisfaction over its pace despite the challenging coronavirus (COVID-19) situation.\nThe Turkmen delegation informed that it intended to start construction activities in Afghanistan by building the gas pipeline from Turkmen-Afghan border to Herat Off-take point in Afghanistan.\nThe commencement of construction work in Afghanistan would immensely boost the confidence of international investors to invest in the project.\nnPakistan is keenly interested in re-building international standard gas infrastructure in Afghanistan and extending full support at every level to commence such development activities in Afghanistan.\nThe two sides also discussed Pakistan’s concerns pertaining to commercial and legal aspects of the project. The Turkmen side assured that Pakistan’s concerns would be adequately addressed in the relevant agreements, and negotiations would start as soon as the COVID-19 virus is contained globally.\nThe Pakistan side expressed its readiness to finalize the matter in order to proceed to actual construction work in Pakistan in parallel with Afghanistan.\nThe two sides also agreed to finalize the Host Government Agreement by the end of this year.\nThe Turkmen delegation informed that its negotiations with international lending agencies and Export Credit Agencies were going well.\nPakistan informed that it would like to perform the TAPI’s groundbreaking in Pakistan at the earliest after the finalization of the pending issues.\nTurkmenistan appreciated the support extended by Pakistani authorities for timely and fast implementation of the project, expressing the resolve to complete the TAPI gas pipeline with mutual cooperation.",
  "retrievedAt": "2025-08-11T19:49:05.417Z"
}
