{
  "title": "WHO lauds Pakistan’s strategy to curtail COVID-19",
  "link": "https://www.app.com.pk/national/who-lauds-pakistans-strategy-to-curtail-covid-19/",
  "date_published": "2020-09-18T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): World Health Organization (WHO) Representative in Pakistan, Dr Palitha Mahipala on Friday lauded the government of Pakistan for strategically and efficiently curtailing the COVID-19 pandemic in the country and becoming an example in the Eastern Mediterranean region for other countries to follow.\nAddressing the ceremony held here in connection with World Patient Safety Day at WHO Country Office, Dr Palitha paid glowing tribute to the healthcare workers who take care of patients despite being exposed to numerous infections.\n“Your safety starts with you, take care of your physical and mental health.” In addition to this clear policies, organizational leadership capacity, data to drive safety improvements, skilled health care professionals and effective involvement of patients in their care, are all needed to ensure sustainable and significant improvements in the safety of health care, he added.\nOn the occasion, Special Assistant to PM on National Health Services Dr Faisal Sultan thanked Dr Palitha and WHO for commemorating and highlighting an important health area, especially in the times when the country is dealing with COVID-19 pandemic and opined that ensuring patient safety is very important.\nA scientific webinar conference on World Patient Safety Day was also organized by WHO Country Office, Islamabad where national and international speakers were invited, and they spoke about the importance of healthcare workers and patient safety which was inaugurated by Dr Palitha Mahipala.\nSouvenirs and shields were presented to health care workers in recognition of their meritorious services rendered in the field of health, especially during the COVID-19 where they worked selflessly and took care of patients suffering from COVID-19 virus. Similar events were organized at all provincial level.\nDr Palitha informed that Patient Safety Friendly Hospital Initiative is being implemented in 40 hospitals across the country by WHO in collaboration with Ministry of National Health Services and provincial departments of health.\nWHO Country Office also lighted up Parliament House, Pakistan monument Islamabad, Minar-e-Pakistan Lahore, and many of public places including hospitals which were illuminated in orange colour in collaboration with national and provincial authorities.\nThe symbolic gesture represents a very visible public recognition of health workers’ efforts globally to provide safe health care, every single day, for their patients.",
  "retrievedAt": "2025-08-11T19:49:07.697Z"
}
