{
  "title": "FBR publishes Tax Directory for year 2018",
  "link": "https://www.app.com.pk/business/fbr-publishes-tax-directory-for-year-2018/",
  "date_published": "2020-09-18T10:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP): The Federal Board of Revenue (FBR) Friday published tax directory for the year 2018, containing detailed information of tax filers including  elected representatives of the country.\nThe tax directory was formally launched by Adviser to Prime Minister on Finance and Revenue, Dr. Abdul Hafeez Shaikh and Chairman FBR Muhammad Javed Ghani in presence of media and business representative here at the FBR Headquarters.\nAccording to the data, among the senators, Federal Minister of Law and Justice, Senator DR. Muhammad Farogh Naseem paid the highest tax of Rs 35,135,459.\nHe was followed by Senator Muhammad Talha Mahmood paid Rs 29,210,399 while the Senator Taj Muhammad Afridi paid Rs 28,177,985, Senator Sajjad Hussain Turi Rs 17,028,389 while Senator Dr Ashok Kumar paid Rs 6,998,283.\nMeanwhile, among the lowest taxpayer Parliamentarians, Senator Mirza Muhammad Afridi paid the lowest tax of Rs 910 While Senator Kauda Babar Paid Rs 4,339. Senator Muhammad Tahir Bizinjo paid Rs 4,339, Senator Anwar Lal Dean Rs 5,350, Senator Muhammad Akram Rs 5,632 while the Senator Quratulain Marri paid Rs 6,265.\nOn the other hand, among the Members of National Assembly highest tax Rs241,329,362 was paid by MNA Shahid Khaqan Abbasi. He was followed by MNA Muhammad Najeeb Haroon who paid Rs 140,036,660 whereas MNA Omar Ayub Khan Paid Rs 26,055,517.\nSimilarly, MNA Shaukat Ali paid Rs 14,660,476 while MNA Sheikh Fayyaz Ud Din paid Rs 13,861,445.\nMeanwhile, among the low paying taxpayers, MNA Kanwal Shauzab paid taxes of Rs 165 followed by MNA Tahir Sadiq who paid Rs 214.\nLikewise, MNA Zulfiqar Bachani paid Rs 388, MNA Attaullah Rs 517 in tax, MNA Abdul Qadir Patel Rs 4,792whereas MNA Asad Mehmood paid Rs 7,000.\nMeanwhile, the Federal Board of Revenue also conducting Computerized Balloting for Audit 2018 and selected around 0.76% of cases for audit out of the total filers after exclusions in Income Tax for the Tax Year-2018.\nFor Sales Tax and Federal Excise Duty, the FBR selected 1.67 % and 5.65% cases for audit respectively out of the total filers after exclusions for tax periods corresponding to accounting period adopted for the purpose of returns of Income Tax, for Tax Year-2018.\nAs many as 10,441 Income Tax cases were chosen through balloting for audit whereas the board selected 2065 Sales Tax Cases and 27 Federal Excise Duty case for the audit through this process.",
  "retrievedAt": "2025-08-11T19:49:07.719Z"
}
