{
  "title": "Gaza ceasefire talks continue in Cairo as Israeli strikes kill 26 - World - DAWN.COM",
  "author": null,
  "content": "GAZA CITY: A Hamas delegation left for Cairo to discuss “new ideas” aimed at securing a Gaza ceasefire, an official from the group said, as Israeli air strikes killed 26 people across the territory on Tuesday.\n\nThe renewed effort follows Hamas’s rejection last week of Israel’s latest proposal to secure the release of Israeli prisoners still held in Gaza.\n\nTalks have so far failed to produce any breakthrough since Israel resumed its air and ground assault on Gaza from March 18, ending a two-month ceasefire.\n\n“The delegation will meet Egyptian officials to discuss new ideas aimed at reaching a ceasefire,” the Hamas official said, adding the team included the group’s chief negotiator Khalil Al-Hayya.\n\nUNRWA says hunger is spreading, humanitarian aid being used as a weapon of war in Gaza; UN-backed polio vaccination campaign suspended\n\nIsrael blocked all aid to Gaza on March 2, days before its renewed offensive began.\n\nQatar, with the United States and Egypt, brokered a truce in Gaza between Israel and Hamas which began on Jan 19 and enabled a surge in aid, alongside exchanges of prisoners.\n\nBut the truce collapsed after disagreements over the terms of the next stage.\n\nIsraeli strikes continue\n\nHamas had insisted that negotiations be held on a second phase of the truce, leading to a permanent end to the war, as outlined in the January framework announced by former US President Joe Biden.\n\nIsrael, however, sought to extend the first phase.\n\nFollowing the impasse, Israel blocked aid and resumed its military campaign.\n\nMost recently, Israel proposed a 45-day ceasefire in exchange for the release of 10 Israeli prisoners — an offer Hamas rejected last week.\n\nGaza’s civil defence agency said Israeli air strikes killed at least 26 people across the Gaza territory on Tuesday.\n\nAmong the fatalities were nine people when a house was struck in central Khan Yunis, senior agency official Mohammad Mughayyir said, adding that six others remain trapped.\n\n“We found people torn apart,” said Ahmad Shourab who witnessed the strike. “They were all women and children. What do they want from us?”\n\nCivil defence spokesman Mahmud Bassal said air strikes also destroyed bulldozers and other equipment belonging to the Jabalia municipality in northern Gaza.\n\n“We relied on them for rescue operations to clear debris and recover the bodies of martyrs from beneath the rubble,” he said. “Now, if a large-scale strike occurs and heavy machinery is needed, how will we obtain the equipment to save lives, pull people from the rubble, or evacuate them from buildings targeted in attacks?”\n\nPolio vaccination drive suspended\n\nPalestinian health ministry said the UN-backed polio vaccination campaign meant to target over 600,000 children had been suspended, putting the enclave at risk of the revival of a crippling disease that once had been all-but eradicated.\n\nIsrael’s 18-month bombing campaign has rendered nearly all buildings in the Gaza Strip uninhabitable, and Gaza’s 2.3 million people now mostly live in the open under makeshift tents. Since the total blockade was imposed last month, all 25 UN-supplied bakeries making bread have been shut.\n\nUN warns of hunger in Gaza\n\nThe United Nations warned on Tuesday that Gaza was facing deepening hunger 50 days into a total Israeli blockade on all aid entering the war-ravaged Palestinian territory.\n\n“Gaza has become a land of desperation,” Philippe Lazzarini, head of the UN agency for Palestinian refugees UNRWA, said on X.\n\n“Hunger is spreading and deepening, deliberate and manmade … Human­itarian aid is being used as a bargaining chip and a weapon of war,” he said.\n\nAfter 18 months of devastating war and an Israeli blockade on aid since March 2, the UN has warned of a dire humanitarian situation for the 2.4 million inhabitants of the Palestinian territory.\n\nThe heads of 12 major aid organisations warned last Thursday that “famine is not just a risk, but likely rapidly unfolding in almost all parts” of the territory.\n\n“You can see a clear tendency towards total disaster,” Jens Laerke, spokesman for the UN humanitarian agency OCHA told reporters in Geneva on Tuesday.\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/2312002520dd1ef.jpg",
  "retrievedAt": "2025-08-25T14:32:05.966Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905972/gaza-ceasefire-talks-continue-in-cairo-as-israeli-strikes-kill-26",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:13:47.000Z"
}
