{
  "title": "ECP has no power to interfere in parties’ internal affairs: PTI - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakistan Tehreek-i-Insaf (PTI) has said that the Election Commission of Pakistan (ECP) has no powers to interfere in the internal affairs of any political party\n\nPTI lawyer Aziz Bhandari took the position as a bench of the ECP headed by Chief Election Commissioner Sikandar Sultan Raja resumed hearing in the case pertaining to PTI’s intra-party election on Tuesday.\n\nThe argument came as ECP member from Khyber Pakhtunkhwa retired Justice Ikramullah pointed out that Barrister Gohar Ali had joined the Sunni Ittehad Council, and asked as to how did he become PTI chairman. The PTI lawyer said the ECP cannot regulate intra-party elections.\n\nPetitions challenging the PTI’s third intra-party election in less than two years was filed in March 2024 by one of PTI’s founding members Akbar S. Babar and four others.\n\nThe PTI lawyer emphasised that the Lahore High Court restrained the ECP from deciding the intra-party case, prompting the CEC to clarify that the electoral body would not pass a final order, concerning the case.\n\nCommission questions Barrister Gohar’s election as party chief after he ‘joined’ SIC\n\nLast week, through an order, the ECP had directed both sides to complete arguments on April 22. At the hearing, the ECP director general of law said that any party is bound to hold intra-party elections. The PTI, he said, was bound to hold intra-party elections in 2021. He contended that it got the constitution approved by the “general body” in the absence of the national council, asking if the party had a provision for a general body in its constitution. In the absence of an administrative structure, accounts were without check and balance, he said.\n\nPetitioner Akbar S. Babar requested the forum that PTI’s funds be frozen and asked how were the party elections held without an administrative structure. He also agrued that making Salman Akram Raja the secretary general was unconstitutional.\n\nBarrister Gohar said that details of the intra-party elections were available on party website. ECP member from Sindh Nisar Ahmad Durrani said the party polls were held against the law.\n\nThe PTI lawyer said elections were held on the ECP orders, yet it did not recognise the same. He said the Constitution says that general elections should be held within 90 days and asked if they were held on time.\n\nHe continued that if intra-party elections are not held, does the political party end. He insisted that the ECP had no authority to regulate or interfere in party matters due to irregularities in intra-party elections.\n\nThe ECP adjourned the hearing after the lawyers completed their arguments.\n\nAkbar S. Babar, while talking to reporters outside the ECP office, made serious allegations of financial and administrative irregularities within the party. He emphasised urgent need to protect the party funds due to alleged money laundering in the PTI. He said until the political party fulfills the legal requirements for intra-party elections, its accounts and assets should be frozen.\n\nMr Babar noted that the ECP admitted that the current office-bearers of PTI were “self-appointed”, and intra-party elections were held under an illegal general body.\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:41:11.552Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906060/ecp-has-no-power-to-interfere-in-parties-internal-affairs-pti",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:13:54.000Z"
}
