{
  "title": "Traders seek govt intervention as Sindh protests hit goods supply - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Oil companies warn of supply disruption as containers stuck at Sindh-Punjab border\n• KCCI president decries losses incurred by businesses\n\nKARACHI: The movement of goods has been disrupted due to protests in northern Sindh cities over the proposed canals on Indus river, according to exporters and trade organisations.\n\nThe sit-ins and roadblocks in Khairpur, Sukkur and Larkana have brought vehicular movement to a standstill on the National Highway.\n\nThe protest was called by the Karachi Bar Association and supported by the Sindh High Court Bar Association, nationalist groups and civil society.\n\nOil Companies Advisory Council (OCAC) Secretary General Syed Nazir Abbas Zaidi on Tuesday informed the Sindh chief secretary that approximately 800 tankers were stranded on roads due to roadblocks in Sindh, particularly in the Sukkur-Larkana division.\n\nHe said oil companies would not be able to supply fuel to northern parts of Pakistan and retail outlets in Sindh if the protests continued.\n\nAccording to Mr Zaidi, while sufficient fuel stocks were available, the protests on main roads and the absence of safe alternative routes were delaying deliveries and may potentially lead to fuel shortages across the province.\n\nThe Karachi-based Oil Tanker Contractors Association has informed Prime Minister Shehbaz Sharif that the National Highway was blocked in Sukkur, Sindh, for more than a week.\n\nThis has resulted in a long queue of vehicles on the Sindh-Punjab border and Moro, around 160km south of Sukkur.\n\nThe association said the stranded trucks were loaded with goods worth millions of rupees, while oil tankers were carrying dangerous products, posing safety risks.\n\nThe association urged the government to provide protection to the oil carriers till roads were closed.\n\nKarachi Chamber of Commerce and Industry (KCCI) President Jawed Bilwani said prolonged blockades of major trade routes, particularly those used for inter-city cargo and exports, have inflicted heavy losses on traders.\n\nWhile peaceful protest was a constitutional right of citizens, agitation on roads delays the delivery of time-sensitive export consignments, especially perishable goods, he added.\n\n“The entire supply chain stands paralysed due to the road closures and sit-ins, with long queues of containers and commercial vehicles stranded at Rohri, Ali Wahan and other key arteries,” Mr Bilwani added.\n\nThe protests followed a four-day strike by goods transporters last week, which, the traders claimed, disrupted trade activity as shipments were delayed and backlogs of imported containers piled up at ports.\n\nMs Bilwani said these protests not only disrupt internal commerce but also threaten Pakistan’s export commitments and damage its credibility in global markets.\n\n“The situation is not only hurting businesses and industries but also jeopardising employment and trade at a time when the country is already facing serious economic challenges.”\n\nHe added it was the government’s responsibility to ensure that national economic activity does not come to a halt.\n\nHe urged the federal and provincial governments to take urgent steps to restore the movement of traffic on the National Highway “to avert further economic damage”.\n\n“The economic repercussions of this blockade are growing by the hour. We appeal for an immediate resolution in the interest of the economy and the public at large”, he concluded.\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/68082715caee2.gif",
  "retrievedAt": "2025-10-12T02:41:35.256Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906025/traders-seek-govt-intervention-as-sindh-protests-hit-goods-supply",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:13:59.000Z"
}
