{
  "title": "Govt defends its wheat policy in Punjab Assembly - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Wheat growers’ issue continued to reverberate in the Punjab Assembly on Tuesday as Special Assistant to Chief Minister (SACM) on Price Control Salma Butt told the House the government’s wheat policy and the steps it was taking for the benefit of farmers.\n\n“The difficulties faced by the farmers and cultivators of Punjab are our difficulties,” she stated, highlighting the significant increase in the agriculture sector’s development budget, which had gone up from Rs29bn to Rs64bn.\n\nClarifying a shift in policy, she said following a federal government decision, the provincial governments would no longer determine wheat price or purchase wheat. Despite this change, she underscored the Punjab government’s proactive approach by providing two farmer support packages during the wheat sowing and harvesting seasons.\n\nExpressing her disappointment at the criticism, Salma Butt remarked that the government was being targeted despite announcing farmer packages, even amidst ‘political noise’. She pointed out the effectiveness of the Kisan Card programme, through which Rs55bn were used for the interest-free purchase of fertilizers, seeds and medicines by 5m farmers, countering claims that farmers would not cultivate wheat. She reported that wheat had been cultivated on 16 million acres, with an expected harvest of 21 million tonnes and a five-maund per acre increase in wheat yield.\n\nRecognizing Punjab’s annual consumption of 15 million tonne, she affirmed the government’s responsibility to facilitate the procurement of the surplus wheat.\n\nSACM says provinces are following Centre’s decision of free market of wheat\n\nIntroducing a new electronic warehouse system (EWS), Ms Butt explained that farmers would be able to store their wheat and receive 70pc of its value from banks. This system, she noted, would benefit the farmers of all scales as well as commission agents and flour millers. Importantly, no storage charges would be levied and the stored wheat would not be sold cheaply for four months.\n\nMs Butt also announced removal of inter-provincial and inter-district restrictions on wheat movement, reiterating the government’s commitment to protecting small farmers.\n\nHowever, Ms Butt’s address was met with strong protest from the PTI, which staged a demonstration against the government’s failure to announce a support price for wheat, leading to a boycott of the assembly session.\n\nSpeaker Malik Muhammad Ahmad Khan acknowledged the concerns, stating that farmers were not receiving adequate compensation at the current rate of Rs2,200 per maund.\n\nOpposition Leader Ahmad Khan Bhachar criticised Ms Butt, sarcastically suggesting that the farmers might have to resort to eating ‘double roti’ instead of regular bread. He claimed that 1.6m acres less wheat was cultivated this year and questioned the practicality of the warehouse system for farmers with only 25 acres.\n\nHe also disputed the number of Kisan Card recipients, asking whether only 0.6m farmers existed in the province.\n\nAddressing the speaker, Mr Bhachar, himself a farmer, pointed out that the farmers typically did not hold onto their wheat for more than a month and a Rs5,000 financial support was insufficient to address their issues.\n\nIn response, Parliamentary Secretary Malik Waheed delivered a strong rebuttal, challenging the PTI MPAs to first report the wheat rate in their own province (Khyber Pakhtunkhwa where PTI is in power). “If (CM Ali Amin) Gandapur has given any package to the farmers there and the (wheat) rate is lower than Punjab, then they should be ashamed to protest,” he asserted, stating that wheat was being sold for Rs1,800 per maund in Khyber Pakhtunkhwa.\n\nMeanwhile, the House passed The Nawaz Sharif Institute of Cancer Treatment and Research Bill 2025, The Punjab Acid Control Bill 2025, the Punjab Prevention and Control of Thalassemia 2024, the University of White Rock, The Next University, Sialkot and The Next Institute of Science and Technology Bills.\n\nThe House also adopted a resolution for the provision of the latest cancer treatment at public sector hospitals. It adopted another resolution to pay tributes to the Punjab Police for foiling an attack by the terrorists in the Punjab-KP border areas on March 2.\n\nLater, the session was adjourned for an indefinite period.\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:31:40.184Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905994/govt-defends-its-wheat-policy-in-punjab-assembly",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:14:27.000Z"
}
