{
  "title": "US will ‘walk away’ unless Russia and Ukraine agree deal: Vance - World - DAWN.COM",
  "author": null,
  "content": "United States Vice President JD Vance warned on Wednesday that the US would “walk away” unless Russia and Ukraine agree to a peace deal, as envoys from Washington, Kyiv and European nations gathered for downgraded talks in Britain.\n\n“We’ve issued a very explicit proposal to both the Russians and the Ukrainians, and it’s time for them to either say ‘yes’ or for the United States to walk away from this process,” Vance told reporters in India.\n\nUS media reported that President Donald Trump was ready to accept recognition of annexed land in Crimea as Russian territory, and Vance said land swaps would be fundamental to any deal.\n\n“That means the Ukrainians and the Russians are both going to have to give up some of the territory they currently own,” he added.\n\nThe reports said the proposal was first raised at a meeting with European nations in Paris last week.\n\nThe latest round of diplomacy comes amid a fresh wave of Russian air strikes that shattered a brief Easter truce.\n\nA Russian drone strike on a bus transporting workers in the southeastern city of Marganets killed nine people and wounded at least 30 more, the Dnipropetrovsk regional governor said on Wednesday. Ukrainian authorities also reported strikes in the Kyiv, Kharkiv, Poltava and Odesa regions.\n\nIn Russia, one person was reported wounded by shelling in the Belgorod region.\n\nUK Foreign Secretary David Lammy had been due to lead a meeting of foreign ministers in London on Wednesday, but his ministry said the talks had been downgraded, a sign of the difficulties surrounding the negotiations.\n\n“The Ukraine Peace Talks Meeting with Foreign Ministers today is being postponed. Official-level talks will continue,” the UK’s Foreign Office said.\n\nKremlin spokesman Dmitry Peskov told reporters that “as far as we understand, it has not yet been possible to reconcile positions on any issues, which is why this meeting did not take place”.\n\nUS Ukraine envoy Keith Kellogg is still expected to attend, along with Emmanuel Bonne, diplomatic adviser to French President Emmanuel Macron.\n\nAndriy Yermak, a top aide to Ukrainian President Volodymyr Zelensky, said he had arrived in London with Defence Minister Rustem Umerov and Foreign Minister Andriy Sybiga, who is “likely” to meet Lammy.\n\n“Despite everything, we will work for peace,” Yermak wrote on Telegram.\n\nA Ukrainian presidency source later told AFP that the delegation would meet with Kellogg, and that “there will be more meetings with Europeans, different meetings”.\n\nUS presidential envoy Steve Witkoff is to visit Moscow this week.\n\nAccording to The Financial Times, President Vladimir Putin told Witkoff he was prepared to halt the invasion and freeze the current front line if Russia’s sovereignty over the Crimean Peninsula, annexed in 2014, was recognised.\n\nPeskov responded by saying that “a lot of fakes are being published at the moment,” according to the RIA Novosti news agency.\n\nZelensky said on Tuesday that his country would be ready for direct talks with Russia only after a ceasefire, though the Kremlin has said it cannot rush into a ceasefire deal.\n\nTrump promised on the campaign trail to strike a deal between Moscow and Kyiv in 24 hours, but has since failed to secure concessions from Putin to halt his troops in Ukraine.\n\nHe said at the weekend he hoped an agreement could be struck “this week”.\n\nUS Secretary of State Marco Rubio said he had presented a US plan to end the war and discussed it with Russian counterpart Sergei Lavrov during a phone conversation after the Paris meeting last week.\n\nBoth Rubio and Trump have warned that the US could walk away from peace talks unless it sees quick progress.\n\nTrump “wants to see this war end … and he has grown frustrated with both sides of this war, and he’s made that very known”, his spokeswoman Karoline Leavitt said on Tuesday.\n\nRubio had said in Paris he would go to London if he thought his attendance could be useful. But Lammy wrote on X late Tuesday that he had instead had a “productive call” with Rubio.\n\nTrump proposed an unconditional ceasefire in March, the principle of which was accepted by Kyiv but rejected by Putin.\n\nThe White House welcomed a separate agreement by both sides to halt attacks on energy infrastructure for 30 days, but the Kremlin has said it considers that moratorium to have expired.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/23170118ad921e8.jpg",
  "retrievedAt": "2025-08-25T14:31:33.280Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906114/us-will-walk-away-unless-russia-and-ukraine-agree-deal-vance",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T12:14:06.000Z"
}
