{
  "title": "Four held in Balakot for smuggling bear cub - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: The Balakot police on Tuesday recovered a cub of black bear while being smuggled from Kaghan Valley to Peshawar in a car and arrested four inmates.\n\n“We have arrested four accused, including the car driver, who were smuggling a black bear cub from Kaghan Valley to Peshawar,” Balakot police station SHO Sadaqat Nisar told reporters.\n\nAccording to the FIR lodged with the police, the four accused, including Khan Mohammad, Javed Khan, Zubair Ali, and Shakeel Javed, were transporting the bear cub illegally. “Acting on a tip-off, we intercepted a car at the Balakot forest barrier and recovered a black bear cub wrapped in a piece of cloth during the search of the vehicle,” Mr Nisar said.\n\nHe said that the cub was later released into the Dodial pheasantry. “Those taken into custody were later released after the wildlife department received a fine of Rs210,000 from one of them,” Mr Nisar added.\n\nWild animals often abandon their natural habitats in the alpine forests of Kaghan Valley and other high-altitude parts of Mansehra district, and venture into the populated areas. The wildlife department, under the Biodiversity Act, 2015, strictly prohibits the smuggling of animals, especially endangered species.\n\nMeanwhile, the police department seized a huge cache of high-quality timber smuggled from forests to local markets and arrested two persons on Tuesday. A team led by Oghi deputy superintendent of police Waheed Khan intercepted two pick-up trucks on their way to Mansehra from Oghi on a tip-off and seized over 100 beams of high-quality timber.\n\nThe police handed over the seized timber to the forest department. The arrested men were later released after they paid a fine of Rs700,000 to the forest department.\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:31:38.874Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905950/four-held-in-balakot-for-smuggling-bear-cub",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:14:39.000Z"
}
