{
  "title": "Lahore cop held for drugs supply to university students - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Iqbal Town police on Tuesday arrested a policeman allegedly involved in selling drugs (crystal meth or ice) to students of the Punjab University.\n\nActing on an intelligence tip-off and surveillance, the police conducted an operation and arrested a drug dealer who turned out to be a police official.\n\nA case was registered against the policeman identified as Ejaz Ali and drugs (ice) were recovered from his possession.\n\nThe policeman, dressed in uniform, attempted to enter the university premises with the drugs when he was arrested. Ejaz Ali was previously posted at the Model Town investigation wing. He had been placed under “close line” due to absence from duty some time ago. Further investigation is underway and legal action will be taken accordingly.\n\nDIG Operations Faisal Kamran commended SP Iqbal Town Muhammad Umar and his entire team for the operation. He said a strong intelligence network has been established to curb drug trafficking. During the preliminary investigation, efforts are being made to identify other suspects involved in the network.\n\nEarlier, Nawab Town Police check post (L Block) team arrested a suspect involved in displaying firearms on social media and aerial firing. The suspect, Muhammad Muzammil, was identified near Mirdad Chowk. A 223-bore rifle and ammunition were recovered from his possession.\n\nSimilarly, Lohari Gate Police thwarted a robbery plan and arrested a two-member motorcycle theft gang hiding near a sewage canal. The arrested suspects include Saqib and his accomplice Zeeshan. Two motorcycles, illegal weapons, and master keys were recovered from them. The suspects were wanted by police in multiple street crime incidents.\n\nMustafabad Police, during patrolling, arrested two drug dealers. The suspects, Khalid and Ehtesham, were caught red-handed while supplying drugs. Three-hundred grams of ice (crystal meth), a pistol and ammunition were recovered from their possession. The suspects confessed to selling drugs around educational institutions, hostels and colleges.\n\nMeanwhile, Niaz Beg Police conducted a raid and arrested seven gamblers. The arrested suspects include Adnan, Mehmood, Simran, Imran, Almas, Haseeb, and Imran. Thousands of rupees stake money was recovered from their possession. The suspects were caught gambling at Naeem Snooker Club, located in Street No. 3, Shershah Town.\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/10/1510515350889af.png?r=105203",
  "retrievedAt": "2025-08-25T14:31:40.528Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905996/lahore-cop-held-for-drugs-supply-to-university-students",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:14:27.000Z"
}
