{
  "title": "Busy intersections in Lahore to have modern traffic signals - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Traffic Engineering and Transport Planning Agency (Tepa) has decided to modernise the city’s major intersections by installing international-standard traffic signals and signage.\n\nThe pilot project to modernise Faisal Chowk on The Mall is likely to complete soon as work is underway at a fast pace on the site, Dawn has learnt.\n\n“We are starting this major development scheme with a pilot project on The Mall (Faisal Chowk) — one of the busiest intersections in the city. All civil work has been completed and the only job which is yet to be accomplished is the installation of traffic signals, signage etc,” Tepa Chief Engineer Iqrar Hussain told Dawn.\n\n“In the next week or so, we will complete the signals/signage installation work,” he added.\n\nSharing details, he said the traffic signals and signage to be installed at Faisal Chowk are same as those in the United States and Canada. These are state-of-the-art gadgets, with automated operation both for the pedestrians as well as motorists, aimed at checking traffic accidents at this busy point, he added. Lights have also been installed on the road, he said.\n\nTo a question, he said the traffic signals planned for installation last year were later replaced with the most modern gadgets in the project proposal.\n\n“We will expand this initiative if the pilot project remains successful,” the Tepa chief said, adding the planning to equip other city intersections with modern signaling system is also underway side by side.\n\nOn the other hand, Lahore Development Authority (LDA) Director General Tahir Farooq paid a visit to the Tepa head office on Lytton Road to receive a briefing on various ongoing and future projects.\n\nDuring the briefing, the Tepa team headed by the chief engineer told the DG about various projects, including the Faisal Chowk project.\n\nThe DG directed the officers to also consult with the traffic police while planning and launching any project to ensure smooth traffic flow at choking points. He asked the Tepa administration to complete all ongoing projects according to the timeline.\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/68081be250e92.gif",
  "retrievedAt": "2025-08-25T14:31:40.632Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905997/busy-intersections-in-lahore-to-have-modern-traffic-signals",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:14:27.000Z"
}
