{
  "title": "Pahalgam attack: India suspends Indus Waters Treaty with immediate effect, closes Attari border crossing - Pakistan - DAWN.COM",
  "author": null,
  "content": "In a major escalation move, India on Wednesday suspended the Indus Waters Treaty (IWT) with Pakistan with immediate effect in the wake of an attack in occupied Kashmir’s Pahalgam a day ago. Pakistan, in response, has convened a meeting of the National Security Committee to deliberate the resulting situation.\n\nIn other announcements, it said the Attari border check post was closed; Pakistanis in India under the Saarc Visa Exemption Scheme had 48 hours to leave the country, while others could return by May 1; defence personnel at the Pakistani High Commission in India had a week to leave the country and staff at the high commissions would be reduced as well.\n\nThe attack took place in Pahalgam — a tourist hotspot in the scenic Muslim-majority territory that draws thousands of visitors every summer — and at least 26 people were killed, all men, while police said another 17 people were injured, when gunmen opened fire on visitors in the popular destination, AFP reported, citing a hospital list of the dead that was verified by police. It was the region’s deadliest attack on civilians since 2000.\n\nThe Indian government had vowed that a “loud and clear” response would be delivered to the attack. Meanwhile, Pakistan had expressed concern over the incident.\n\nWhat we know so far:\n\nAddressing a press conference on the matter today, Foreign Secretary Vikram Misri of India’s Ministry of External Affairs (MEA) said the Cabinet Committee on Security (CCS), India’s highest decision-making body on national security, held a meeting today under Prime Minister Narendra Modi on the incident.\n\n“In the briefing to the CCS, the cross-border linkages of the terrorist attack were brought out. It was noted that this attack came in the wake of the successful holding of the elections in the union territory and its steady progress towards economic growth and development. Recognising the seriousness of this terrorist attack, the CCS decided upon the following measures: the Indus Waters Treaty of 1960 will be held in abeyance with immediate effect until Pakistan credibly and irrevocably abjures its support for cross-border terrorism.”\n\nThe Indus Water Treaty is a water-sharing agreement between Pakistan and India, facilitated by the World Bank. It allocates the waters of the Indus River system between the two countries. It established the India-Pakistan Indus Commission, which is supposed to resolve any problems that arise.\n\nAs per Article XII subsection 4 of the Indus Waters Treaty, the provisions of the agreement will “continue in force until terminated by a duly ratified treaty concluded for that purpose between the two governments”.\n\nIndia blames Pakistan for pushing fighters across the heavily militarised Line of Control (LoC) between the two countries to launch attacks on Indian forces. However, Islamabad has repeatedly denied the allegation.\n\nDefence Minister Khawaja Asif had categorically ruled out Pakistan’s involvement in the incident in an interview earlier today.\n\nResponding to media queries concerning the attack earlier today, Foreign Office Spokesperson Shafqat Khan in a statement said: “We are concerned at the loss of tourists’ lives in an attack in Anantnag district of Indian Illegally Occupied Jammu and Kashmir. We extend our condolences to the near ones of the deceased and wish the injured a speedy recovery,” he added.\n\nIn his other announcements, the Indian foreign secretary said movement at the Attari border check post would be closed with immediate effect. “Those who have crossed over with valid endorsements may return through that route before May 1, 2025,” he added.\n\nThe border closure is hugely symbolic — it is on the Attari-Wagah crossing that crowds gather each evening to cheer on their nation’s soldiers as they goose-step in a chest-puffing theatrical ritual symbolising the countries’ rivalry. The daily border ritual, which began in 1959, has largely endured, surviving innumerable diplomatic flare-ups and military skirmishes.\n\n“Pakistani nationals will not be permitted to travel to India under the Saarc Visa Exemption Scheme,” the Indian foreign secretary said, adding that all such visas issued in the past were deemed cancelled and any Pakistani in India under the scheme had 48 hours to leave the country.\n\n“The defence, military, naval and air advisers at the Pakistani High Commission in New Delhi are declared persona non grata. They have a week to leave India. India will be withdrawing its own defence, navy and air advisers from the Indian High Commission in Islamabad,” he said, adding that the posts were deemed annulled and their support staff would be withdrawn as well.\n\nHe also said the overall strength of the high commissions would be curbed to 30 from the present 55 through further reductions to be implemented by May 1.\n\n“The CCS reviewed the overall security situation and directed all forces to maintain high vigilance. It resolved that the perpetrators of this attack will be brought to justice and their sponsors held to account.”\n\nHe said India would be “unrelenting in the pursuit of those who have committed acts of terror or conspired to make them possible”.\n\nDeputy Prime Minister and Foreign Minister Ishaq Dar announced that Prime Minister Shehbaz Sharif had convened a meeting of the National Security Committee on Thursday morning to respond to the Indian actions.\n\nA report by state broadcaster Radio Pakistan said the meeting would discuss in detail India’s “irresponsible actions after Pahalgam false flag operation” and would be chaired by the premier with senior civil and military leadership to deliberate upon the resulting internal and external situation.\n\n“It will review response to India’s hastily taken, impulsive and impractical water measures,” the report said.\n\nSpeaking on Geo News programme ‘Aaj Shahzeb Khandzada ke Saath’, FM Dar called the MEA’s announcements “inappropriate”.\n\n“There is no evidence … expressing their anger like this is inappropriate,” he said. “Tomorrow, we have convened the National Security Committee. We were in Turkiye when the incident happened, but we have been following the incident throughout and issued a statement.”\n\nAsked about the Foreign Office’s stance, Dar said, “It takes two to tango.\n\n“We cannot do anything alone. These announcements seem like a knee-jerk reaction and are immature and presumptuous,” he said, adding that Pakistan was blamed for any attacks in India.\n\n“We have had issues with India over the IWT before, and the World Bank has been involved,” he said. “I don’t want to pre-empt what the Foreign Office will do, but they will have my recommendations. During tomorrow’s NSC meeting, the FO will lay out its stance.\n\n“The quick reaction suggests that this may be a political ploy,” Dar said. “We will appreciate any evidence they present, but their actions are presumptive, politically motivated and the whole thing is undesirable.”\n\nDar added that Pakistan had “no relation” to the outfit that allegedly claimed responsibility for the attack when asked about how the Indian media was portraying the incident.\n\n“Rather than taking the opportunity to create hype, they could have presented evidence,” he lamented. “They are trying to play the blame game, which is an unserious approach.\n\n“We are currently a non-permanent member of the UN Security Council, and we have already put together a resolution on this. We will approach every forum, every bilateral engagement and the other non-permanent members of the Security Council,” he added.\n\n“We will respond as a mature nation should,” he said.\n\nResponding to the IWT announcement, Asif posted the final provisions of the treaty’s Article 12 on X, saying: “These are the relevant clauses of the IWT. There is no need for any interpretation of these clauses. The procedure for amending the treaty and adding new clauses is outlined in it. What India can do and what it cannot do is clearly specified. Pakistan is also bound by the same procedure. For many years, India has been attempting to deviate from this treaty through various pretexts and excuses. It is using this unfortunate incident of terrorism solely to fulfil an old desire.”\n\nSpeaking on Geo News programme ‘Aaj Shahzeb Khandzada ke Saath’, Asif said Pakistan should give a “considered” response, not an immediate one, to India’s serious allegations.\n\nHe said India had been attempting to escape the treaty’s bounds for a long time.\n\nIn his interview with Hum News earlier today, Asif termed the incident a “false flag operation”. “We cannot ever rule this out, the possibility [that it was a false flag] will be there,” he said.\n\nHe added that allegations levelled against Pakistan were unfounded.\n\n“There are plenty of homegrown organisations within India,” Asif said. “We condemn terrorism in all its forms, since Pakistan has been the most affected by terrorism. We are the last country that would support terrorism after the effect it has had on us.”\n\nWhen asked if Pakistan would be able to provide a military response, Asif recounted when Indian aircraft conducted a bombing in Balakot in 2019.\n\n“Everyone remembers what happened with Abhinandan,” Asif said, referring to an Indian pilot shot down and captured by Pakistani forces.\n\nNational Assembly Speaker Ayaz Sadiq also assailed India’s “baseless and false” allegations against Pakistan while condemning the attack and extending his condolences.\n\n“The immediate accusation against Pakistan after the incident shows Indian malice. The aim of India’s conspiracy is to divert attention from the atrocities in Kashmir … The suspension of the Indus Waters Treaty after the false flag operation is condemnable,” he said, demanding that the international community take notice of India’s “dramatic tactics”.\n\nHe alleged that India wanted to sabotage the IWT through such “vile propaganda”.\n\nPower Awais Leghari said India’s “reckless suspension” of the IWT was “an act of water warfare; a cowardly, illegal move. Every drop is ours by right, and we will defend it with full force — legally, politically, and globally.”\n\nFormer president Arif Alvi said that “any attempt to falsely accuse Pakistan or unjustly implicate my homeland will be thwarted by the united strength of the entire nation.”\n\nHe said there should be “no doubt or ambiguity that we stand resolute with our armed forces and people to counter any aggression from the Indian government with steadfast determination. We are united, speaking with one voice and one soul in defence of peace and sovereignty.”\n\nOn today’s announcements from the Indian MEA, South Asia analyst Michael Kugelman called them “highly consequential retaliations”, adding that “in 2019, India threatened to suspend IWT but didn’t follow through.”\n\nFormer high commissioner to India Abdul Basit told Geo News that suspending the agreement violated Article 12 of the IWT, but urged people not to panic.\n\n“It will take time for water to stop reaching the Indus and Chenab,” he said. “We are having a security committee meeting and should keep all options open.”\n\nBasit predicted that there would be “some sort of action” taken against Pakistan in the coming days and predicted the situation in Balochistan would worsen. “We could see a Balakot-type response, or an even worse one,” he warned.\n\n“They will do something, because they have raised such drama in Pahalgam. There are domestic issues in India: Muslims were protesting amendments to a law in India. They needed to divert attention and put Muslims on the back foot. They are framing this as a Hindu-Muslim issue,” he added.\n\nBasit said that relations between the nuclear powers would “never be normal” until the issue of Jammu and Kashmir was resolved.\n\nHe additionally warned that Afghanistan’s exports would be affected, since its goods were transported to India through the now-closed Wagah Border.\n\nSpeaking to Geo News, former federal minister and Senator Sherry Rehman said that it was surprising that India suspended the agreement, given that it was followed even during wars between both nations.\n\n“Now they have suspended it of their own accord. This is an anti-humanitarian action — they are weaponising water,” she said. “This looks like a knee-jerk reaction,” she added. “To date, they are unable to prove the identity of the attackers. They claim to have examined the bodies of the attackers and cannot prove anything.”\n\nShe said the incident was a “false flag operation”, although she said she “did not want to play the blame game”.\n\nPPP MNA Sharmila Faruqui said India could not unilaterally suspend the IWT since it was a binding international agreement brokered by the World Bank.\n\n“It has withstood wars and tensions. Water must not be weaponised. Such actions violate Articles IX & XII and undermine humanitarian principles.”\n\nVeteran politician Mushahid Hussain said India’s suspension of the treaty over “cross-border linkages” with terrorism was premeditated. “They were looking for a pretext to suspend it,” he told ARY News.\n\n“It is a violation of international law, the IWT and the UN charter.”\n\nCalling Modi a “bully”, he said he was not afraid of any military action by India. “They are setting up for a long-haul campaign to malign Pakistan,” he said. “We need a proactive, political-diplomatic response. We have a platform at the UNSC and we need to take India to court, because this is a violation of international law.\n\n“We also need to publish a factsheet showing India’s pattern of false flag operations, how they fail to provide evidence, facts or proof,” he added. “It is as if the Indian media is on autopilot — if there’s an attack, blame Pakistan.”\n\nHussain slammed Indian media personalities for being jingoistic, calling them “warmongers”. “Pakistan should call a UNSC meeting immediately,” he stated. “The security council’s purpose is to counter any threats to peace and security. Water is now being weaponised; this is water aggression.”\n\nFormer federal minister Fawad Chaudhry said suspending the IWT violated international law and the treaty itself.\n\n“This childish decision will affect only [the] poor farmers of Punjab and Sindh,” he wrote in a post on X.\n\nFormer federal minister Shireen Mazari said suspending the IWT was another “tantrum” by India.\n\n“India has in any case been violating [the] IWT ad nauseum and Pakistan had earlier already downgraded diplomatic relations, so no surprises!”\n\nShe called India’s behaviour “predictable”, stating that targeting Pakistan without evidence was an “easy and jingoistic ‘solution’”.\n\nModi had decried the “heinous act” in the summer retreat of Pahalgam, pledging the attackers “will be brought to justice”.\n\n“Those responsible and behind such an act will very soon hear our response, loud and clear,” Indian Defence Minister Rajnath Singh said in a speech in New Delhi today.\n\n“We won’t just reach those people who carried out the attack. We will also reach out to those who planned this from behind the scenes on our land.” Singh did not identify those he believes are responsible for the killings, but said that “India’s government will take every step that may be necessary and appropriate.”\n\nThe killings came a day after Modi met in New Delhi with US Vice President JD Vance, who is on a four-day tour of India with his wife and children.\n\nAll the dead were listed as residents of India — many from across the country — except one living in Nepal. The dead included a navy officer, The Hindu reported.\n\nSome of the victims were from distant regions of India, which included Tamil Nadu, Maharashtra and Karnataka.\n\nMany of their bodies were brought to Srinagar today by a fleet of ambulances, as military helicopters soared overhead, searching the forested mountain flanks for signs of the attackers.\n\nA hitherto unknown group, named by several Indian outlets as ‘The Resistance Front’, is said to have claimed responsibility for the attack.\n\nA similar incident took place ahead of former US president Bill Clinton’s visit to Delhi in the year 2000, when 36 Indians were killed, but there has been considerable dispute over who staged it.\n\nAt the time, India had bla­med Pakistan-based militants, but Indian and Kashmiri obse­rvers decried it as an alleged plot by the Indian army.\n\nFollowing the attack, several Indian media outlets and social media accounts began linking the attack to Pakistan, without any evidence to substantiate the claim.\n\nWhile pundits on Indian TV channels ratcheted up their customary anti-Pakistan rhetoric, there was no official finger-pointing towards Islamabad in the hours immediately following the attack.\n\nAccording to The Statesman, local police only reposted the X posts of the president, the prime minister, the home minister, and the local governor.\n\nSenator Rehman, while condemning the “shocking terror attack”, said: “Unfortunately, the reflexive finger-pointing already at play against Pakistan has become the boilerplate response for a New Delhi that is unable to contain its own spectacular failures amidst a fundamentalist meltdown.”\n\n“Voices of reason that urge strategic stability, responsible engagement across the LoC (Line of Control) are ignored, even ridiculed,” the former federal minister said.\n\nRehman stressed that “stridency-on-steroids is not a foreign policy”.\n\nFormer federal minister Khawaja Saad Rafique condemned Indian media’s attempt to blame Pakistan for the attack “without any evidence”, calling it “highly irresponsible, absurd and baseless”.\n\nFormer foreign minister Khurram Dastgir Khan had expressed his concern over the loss of life during the attack.\n\n“Condolences to families and near ones of the deceased and wish the injured a speedy recovery,” he said in a post on X.\n\nAFP journalists near the site of the attack in Pahalgam reported a heavy deployment of security forces.\n\n“The search operation is currently in progress, with all efforts focused on bringing the attackers to justice,” the Indian army said in a statement.\n\nHundreds of security forces rushed to the Pahalgam area soon after the attack and a massive combing operation was launched in the forests there, two security sources told Reuters.\n\nAbout 100 people suspected of having been resistance sympathisers in the past were called to police stations and questioned, they added.\n\nFollowing the attack, the Indian army claimed to have killed two fighters along with foiling an infiltration attempt in the Uri sector in occupied Kashmir’s north, The Indian Express said.\n\nModi held a meeting with National Security Adviser Ajit Doval and External Affairs Minister S. Jaishankar in the morning after he cut short his state visit to Saudi Arabia over the attack, The Indian Express reported.\n\nA special security cabinet meeting had been called for 6pm (5:30pm PKT), a defence ministry official said.\n\nIndia’s Home Minister Amit Shah also rushed to the region to coordinate with authorities and met the survivors, the outlet added.\n\nFinance Minister Nirmala Sitharaman was also cutting short her visit to the United States and Peru “to be with our people in this difficult and tragic time”, her ministry said.\n\nPahalgam lies 90 kilometres by road from the key city of Srinagar. It sits on a scenic meadow that has been used as a backdrop in Indian movies, most notably Bobby.\n\nIt also falls on the route of the annual Amarnath Yatra — a Hin­du pilgrimage to a cave shr­ine dedicated to Lord Shiva — which makes it one of the most protected regions of India-held Jammu and Kashmir.\n\nThe brazen attack in the hig­hly protected zone has raised eyebrows across the region.\n\nA tour guide in Pahalgam told AFP he reached the scene after hearing gunfire and had transported some of the wounded away on horseback.\n\nWaheed, who gave only one name, said he saw several men lying dead on the ground, while a witness who requested anonymity said the attackers were “clearly sparing women”.\n\nOne woman survivor described how men in uniform emerged from forests at a meadow where tourists were enjoying the peace of nature, The Indian Express newspaper reported.\n\nSurvivors said they had assumed they were policemen.\n\n“They were there at least for 20 minutes, undeterred, moving around and opening fire”, the newspaper quoted the survivor as saying.\n\n“The militants, I can’t say how many, came out of the forest near an open small meadow and started firing,” a witness who asked not to be identified told AFP.\n\n“They were clearly sparing women and kept shooting at men, sometimes a single shot and sometimes many bullets. It was like a storm,” said the man, who cares for horses that are popular with tourists in the area.\n\nThe witness said dozens of people fled as the gunmen opened fire. “They all started running around in panic,” he added.\n\nMedics at a hospital in Anantnag said they had received some of the wounded, including those with gunshot wounds.\n\n“The firing happened in front of us,” one witness told broadcaster India Today, without giving his name, according to Reuters.\n\n“We thought someone was setting off firecrackers, but when we heard other people [screaming], we quickly got out of there … saved our lives and ran.”\n\n“For four kilometres, we did not stop … I am shaking,” another witness was quoted as telling India Today.\n\nThe attack occurred in an off-the-road meadow and two or three gunmen were involved, the Indian Express newspaper reported, citing an unidentified senior police officer.\n\nWitnesses told The Wire that the meadow, which is not serviced by road and can be rea­ched on foot, horseback or by chopper, was buzzing with tou­rists on Tuesday as the weather had improved after many days of rain and thunderstorms.\n\nOver a dozen local organisations called for a shutdown in occupied Kashmir to protest against the attack on tourists, whose rising numbers are said to have helped the local economy.\n\nMany schools also suspended classes for the day in protest.\n\nAirlines were operating extra flights from Srinagar as visitors were rushing out of the region, officials said.\n\nThe main highway connecting Srinagar to the rest of the country had been damaged by heavy rain and was shut for repairs, pushing up demand for flights, they said.\n\nTelevision visuals showed tourists carrying their bags to taxis and filing out of a hotel in Srinagar.\n\n“How can we continue our trip in such a situation?” Sameer Bhardwaj, a tourist from New Delhi, told ANI. “We need to prioritise our safety. We can only travel if our minds are relaxed but everyone is tense here. So, we cannot continue to travel.”\n\nAviation Minister Rammohan Naidu Kinjarapu’s office said four special flights from Srinagar — two to Delhi and two to Mumbai — have been arranged, with additional flights kept on standby to cater to further evacuation needs.\n\n“Naidu also held an urgent meeting with all airline operators and … directed [them] to maintain regular fare levels, ensuring that no passenger is burdened during this sensitive time,” it said in a statement.\n\nIn Washington, the White House said US President Donald Trump had been briefed on what a White House spokesperson described as a “brutal terrorist attack”.\n\nIndia’s foreign ministry subsequently said Trump called Modi and “expressed full support to India to bring to justice the perpetrators of this heinous attack”.\n\nIn his message yesterday as well, Trump said India had the “full support” of the US. “The United States stands strong with India against terrorism.”\n\nVance offered condolences in a social media post, calling it a “horrific attack”.\n\nIn New York, a spokesman for UN Secretary General Antonio Guterres said he “strongly condemns” the attack.\n\nChina’s foreign ministry offered “sincere sympathies”.\n\n“We mourn the victims and extend our sincere sympathies to the families of the victims and the injured,” foreign ministry spokesman Guo Jiakun said, adding China “strongly condemns this attack”.\n\nEU chief Ursula von der Leyen pledged: “Europe will stand with you.”\n\nAmong other foreign leaders condemning the attack were Sri Lanka, the United Arab Emirates, Iran, and New Zealand.\n\nJammu and Kashmir Chief Minister Omar Abdullah said that “the attack is much larger than anything we’ve seen directed at civilians in recent years”, with the death toll still uncertain.\n\n“This attack on our visitors is an abomination,” he added in a statement. “The perpetrators of this attack are animals, inhuman and worthy of contempt.”\n\nCongress leader Rahul Gandhi, who is also Leader of the Opposition in the Lok Sabha, called the attack “extremely condemnable and heartbreaking,” while urging the government to move beyond what he termed “hollow claims” of peace in occupied Kashmir.\n\n“The whole country is united against terrorism,” Gandhi said.\n\nIndia has an estimated 500,000 soldiers permanently deployed in the territory, whose limited autonomy Modi’s government revoked in 2019.\n\n“Their evil agenda will never succeed. Our resolve to fight terrorism is unshakable and it will get even stronger,” Modi said in a statement.\n\nIn recent years, the authorities have promoted the mountainous region as a holiday destination, both for winter skiing and to escape the sweltering summer heat elsewhere in India.\n\nIn 2023, India hosted a G20 tourism meeting in Srinagar under tight security in a bid to show that what officials call “normalcy and peace” were returning after a massive crackdown.\n\nA string of resorts are being developed, including some close to the LoC.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/2320504004cbf52.jpg",
  "retrievedAt": "2025-08-25T14:31:37.183Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906075/pahalgam-attack-india-suspends-indus-waters-treaty-with-immediate-effect-closes-attari-border-crossing",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T05:34:18.000Z"
}
