{
  "title": "PPP feels ‘reassured’ after PM’s aide offers talks on canals - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Sharjeel says his party has consistently opposed project; CCI meeting not summoned despite requests\n• Rana Sanaullah woos Sindh nationalist leaders, JUI-F for dialogue\n\nKARACHI: As the federal government approached Sindhi nationalist parties for the resolution of the canals controversy through talks, Sindh Senior Minister Shar­jeel Inam Memon on Tuesday hinted the issue would be resolved soon as Prime Minister Shehbaz Sharif was personally taking interest in the issue at hand.\n\nThe remarks by the provincial minister came after PM’s aide Rana Sanaullah telephoned him for the third time in as many days, besides reaching out to leaders of the Sindh United Party, the Qaumi Awami Tehreek, and the Sindh chapter of the Jamiat Ulema-i-Islam (JUI-F) on Tuesday.\n\nThe PML-N leader invited them for consultations, telling them the government wanted to resolve this issue through consultations.\n\nSpeaking to media persons on Tuesday, Mr Memon stated that the prime minister was involved in sorting out the issue of the canals, adding the matter would be resolved soon.\n\nFlanked by Energy Mini­ster Nasir Hussain Shah and PPP’s Sindh Information Secretary Aajiz Dhamrah, the senior minister said PM’s political aide Rana Sana­ullah had called him to inf­orm him that the premier was willing to look into the issue.\n\nAccording to Mr Memon, the stance of the PPP had been clear since day one. “Wherever we held meetings, we consistently opposed the construction of canals,” he added.\n\nThe minister said that a water availability certificate was issued to Punjab at a session of the Indus River Sys­tem Authority (IRSA) held on Jan 25, 2024, during the term of the caretaker government.\n\n“However, Sindh’s representative, Ehsan Leghari, raised objections and noted that there was no water available, and therefore, the water availability certificate should be withdrawn,” he added.\n\nThe senior minister said that a summary was prepared by the Sindh government on June 13, 2025, clearly objecting to the canal project, adding that the CM signed it the very next day.\n\nHe said that, according to the Constitution, a meeting of the Council of Common Interests (CCI) must be held every 90 days, but it had not been despite several letters by CM Murad Ali Shah.\n\n“We have all the letters in which we have opposed the construction of canals, and the PPP has consistently maintained the same position at every forum—that the controversial canals should not be built,” he added.\n\nHe said President Asif Ali Zardari, while addressing a joint session of parliament, had also stated that the project could not be supported.\n\nThe senior minister said Punjab possessed a stock of fresh groundwater, which could be utilised for agriculture.\n\nHe claimed that even in the 1991 Water Accord, Sindh was not provided its due share of river water.\n\nBesides contacting Mr Memon, Rana Sanaullah also called Rashid Soomro, the JUI-F head in Sindh.\n\nA statement issued by the JUI-F said the federal government formally invited the party for dialogue on the subject and agreed to resolve the issue through talks.\n\nMr Soomro demanded the inclusion of nationalist parties in the consultation process, alongwith lawyers, the statement added.\n\n“Allama Soomro has also demanded that work on controversial canals must be halted immediately before any dialogue, as JUI Sindh has very clear stance that no compromise is acceptable on Sindh’s water,” according to the party’s statement.\n\nThe PM adviser faced a little tough time from the Sindh United Party (SUP) when he offered the nationalist party to become part of the dialogue process.\n\nIn a telephonic conversation with the PM adviser, senior SUP leader Syed Zain Shah said that he would get back to the government following consultation with all stakeholders protesting against the canal project.\n\nA SUP statement claimed Mr Sanaullah said PM Shehbaz Sharif wanted to meet Mr Shah. The latter said he will “consult with parties involved in the Save River Indus Movem­ent, the Lawyers’ Action Commi­ttee, growers, and their allies” before responding.\n\nThe PM’s adviser also contacted Ayaz Latif Palijo of the Qaumi Awami Tehreek and extended the invitation for dialogue on the subject.\n\nA statement issued by the party said that Mr Palijo told Mr Sanaullah there was unrest over the issue of canals and people saw it as a serious injustice to the province.\n\n“Rana Sanaullah responded that the prime minister wants to resolve the canal issue through dialogue. If a delegation is formed comprising representatives of different parties, discussions can also be held with them,” said the statement.\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:32:08.881Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905979/ppp-feels-reassured-after-pms-aide-offers-talks-on-canals",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:13:40.000Z"
}
