{
  "title": "CJCSC Gen Mirza seeks reciprocal steps from India for nuclear risk reduction - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Gen Sahir Shamshad Mirza, chairman of the Joint Chiefs of Staff Committee, on Tuesday called upon India to take reciprocal nuclear risk reduction measures and emphasised the need for maintaining geostrategic equilibrium.\n\n“Peace and stability in South Asia can only be achieved through reciprocal measures for nuclear risk reduction and instituting a balance in a wider geostrategic construct,” Gen Mirza said in his keynote address at a two-day international conference, ‘Nuclear Deterrence in the Age of Emerging Technologies’.\n\nThe event has been organised by the Centre for International Strategic Studies (CISS), Islamabad.\n\nPakistan has in the past made several proposals aimed at nuclear risk red­uction with India, focusing on enhancing mutual trust, transparency, and crisis communication.\n\nNotable pro­p­osals include those from 2012 and a broader Strategic Restraint Reg­i­me (SRR) since the 1990s covering nuclear restraint, missile race prevention, and risk reduction.\n\nIndia has consistently dismissed these proposals, citing its differing strategic priorities and claiming China as “the primary threat”.\n\nGen Mirza said Pakistan was committed to dialogue and cooperation with global stakeholders on the challenges posed by the adoption of new technologies in the military domain.\n\nAmbassador Ali Sarwar Naqvi, executive director of CISS, warned that the proliferation of emerging technologies such as artificial intelligence, cyber capabilities, and autonomous systems threatens to destabilise the global security order.\n\n“These technologies, particularly when integrated into military systems, risk eroding the delicate balance that has prevented nuclear conflict for decades,” Mr Naqvi said.\n\nHe noted that the increasing reliance on unmanned vehicles and AI-enhanced surveillance introduce a host of ethical, legal and humanitarian challenges.\n\n“Emerging technologies are not only transforming conflict at the tactical level,” Mr Naqvi added, “but are also eroding present deterrence frameworks.”\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:41:36.908Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905968/cjcsc-gen-mirza-seeks-reciprocal-steps-from-india-for-nuclear-risk-reduction",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:13:47.000Z"
}
