{
  "title": "China says door for US trade talks ‘wide open’ - World - DAWN.COM",
  "author": null,
  "content": "China said on Wednesday that it was willing to engage in trade talks with Washington, a day after US President Donald Trump signalled that hefty tariffs he imposed on the country would come down after the sides reach a deal.\n\nSince Trump began a second term in January, he has unleashed a tit-for-tat trade battle with Beijing that has seen US levies on many Chinese goods reach 145 per cent.\n\nThese include duties initially imposed over China’s alleged role in the fentanyl supply chain and later over practices Washington deemed unfair.\n\nBeijing has responded with sweeping counter-tariffs of 125pc on US goods.\n\nThe fierce trade war between the world’s top two economies has rattled markets and raised fears of a global recession.\n\nTrump acknowledged on Tuesday that the level of US tariffs on China was currently “very high”, saying that they would “come down substantially” after a deal is struck.\n\nAsked about the remarks, Beijing said that tariff and trade wars have “no winners”, repeated previous comments.\n\n“We do not wish to fight, nor are we afraid of fighting,” said foreign ministry spokesman Guo Jiakun at a regular press conference, adding that China would “fight to the end”, if necessary.\n\n“The door for talks is wide open,” he said.\n\nBut, he warned, “saying on the one hand that they want to reach an agreement with China, while on the other hand continuing to exert extreme pressure is not the correct way to have dealings with China”.\n\nA day earlier, Trump said he had no intention of firing the chair of the United States Federal Reserve. His recent outbursts against Fed boss Jerome Powell had fanned concern that he would oust him, sending jitters through markets.\n\nThe president had criticised Powell for warning that the White House’s sweeping tariffs policy would likely reignite inflation.\n\n“I have no intention of firing him,” Trump said. “I would like to see him be a little more active in terms of his idea to lower interest rates — it’s a perfect time to lower interest rates.\n\n“If he doesn’t, is it the end? No.”\n\nTrump also signalled that China’s tariffs will come down.\n\n“They will not be anywhere near that number,” but “it won’t be zero,” the US president said.\n\n“Ultimately, they have to make a deal because otherwise, they’re not going to be able to deal in the United States.”\n\nHis comments came after Treasury Secretary Scott Bessent told a closed-door event on Tuesday that the tariffs amounted to a reciprocal trade embargo.\n\nBut he said he expected a de-escalation in the near future, according to a person who was in the room.\n\nSuch a development should bring markets some relief, he added at the JPMorgan Chase-hosted event, which was not open to media.\n\nWall Street’s major indexes jumped after a report on Bessent’s comments, which came on the sidelines of the International Monetary Fund and World Bank’s Spring Meetings. Asian markets rallied across the board on Wednesday.\n\nBessent said there was much to be done at the end of the day with Beijing but he noted the need for fair trade and said China needed to rebalance its economy.\n\nThe Treasury chief stressed that the goal is not to decouple with China, noting that container bookings between both countries have slumped recently as trade tensions heated up.\n\nAlso on Tuesday, White House Press Secretary Karoline Leavitt told reporters that Washington is “doing very well in respect to a potential trade deal with China.”\n\n“The president and the administration are setting the stage for a deal,” she added, noting that “the ball is moving in the right direction.”\n\nAs global finance ministers and central bankers converge in Washington this week, all eyes are on the progress of trade talks on the sidelines of the spring meetings as countries grapple with Trump’s new and wide-ranging tariffs.\n\nChina’s foreign minister Wang Yi, meanwhile, urged Tuesday in phone calls with his British and Austrian counterparts for the UK and European Union to work with Beijing on safeguarding international trade.\n\nJapan was reportedly eyeing a second visit to Washington by tariffs envoy Ryosei Akazawa next week, with local media saying Tokyo is mulling concessions to assuage Trump.\n\nJapan’s Sumitomo Rubber, which recently bought the Dunlop brand, said it would from May hike tire prices for cars and small trucks in the United States and Canada by up to 25pc.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:31:37.786Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906079/china-says-door-for-us-trade-talks-wide-open",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T05:46:01.000Z"
}
