{
  "title": "Police bust two ‘honey-trap gangs’ in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The police busted two honey-trap gangs and arrested 16 members, including a group of five police officials and a Malawian woman of Pakistani origin, who allegedly lured men through social media and later extorted money from through blackmail.\n\nThe group of five police officials who had been posted at Sadiqabad police station had been dismissed from service as the senior police officials believed that they would never be reinstated again due to their involvement in serious crime. The police officials used to threaten the victims with arrest and public exposure, forcing them into paying large sums to get rid of the fabricated charges.\n\nTwo gangs – one called the Marina Khan gang led by a Malawian woman of Pakistani origin, comprised six people and the other, ten-member gang called Aftab alias Tabi gang, included five police officials.\n\nSharing details of the arrest during a press conference on Tuesday, Senior Superintendent of Police Operations Kashif Zulfiqar revealed that the two gangs were arrested by the Saddar Beroni and Sadiqabad police.\n\n16 suspects, including five police officials, arrested; policemen dismissed from service\n\nThe SSP further said that the gangs include a woman of Pakistani origin, police personnel and other members and Rs750,000 and weapons were recovered from both gangs.\n\nSSP Kashif said that the members of both gangs used to lure men through social media, luring them to meetings and depriving them of money by blackmailing them. He said that more revelations and recovery were expected following the investigation.\n\nSSP Operations Kashif Zulfiqar said that the Rawalpindi police carried out a major operation and rounded up two big gangs for robbing citizens through honey traps. A total of 16 suspects from both gangs were arrested, he said, adding that further progress and recovery were expected from the gangs.\n\nThe members of both gangs used to trap and rob citizens through social media and later blackmail them.\n\nSaddar Beroni police arrested six people, including an East African woman of Pakistani origin, SSP Kashif said.\n\nBesides Marina Khan, the gang included her husband Bilal, who had friendly terms with Afzal (police official) and other members. Farooq, Tayyab, Kamran and Abdul Jabbar are included.\n\nThe SSP said that Rs250,000 and weapons were recovered from the Marina Khan gang. Marina Khan used to contact citizens on social media platforms and invite them for a meeting, and then the gang members used to snatch money and valuables from them at gunpoint. During the investigation, the Marina Khan gang revealed several incidents.\n\nSadiqabad operation\n\nSimilarly, the Sadiqabad police arrested a 10-member Aftab alias Tabi gang and recovered Rs500,000 and weapons from the Aftab alias Tabi gang. Aftab alias Tabi is the ringleader of the gang that had formed a gang with women, other associates, and police personnel.\n\nThe arrested accused include Aftab, Hamza, Shan, Hajra, Uzma, Mubashir, Raza Abbas, Fazl Abbas, Noman and Afzal.\n\nHajra used to trap citizens through a particular social media app, and citizens would be called on the pretext of a meeting and blackmailed by them through indecent videos and pictures.\n\nThe gang was involved in several incidents of blackmailing and robbing citizens of the twin cities through honey traps. Police officers involved in the gang used to back (support) other gang members and help them blackmail citizens by threatening them, the SSP said.\n\nA police official said that the Malawian woman had been in Pakistan and operating for the last eight months.\n\nThe police officials used to threaten the victims with arrest and public exposure, pressuring them into paying large sums to get rid of the fabricated charges.\n\nPolice believed that there would be many such cases which had not been reported due to social stigma by the victims and after the bust of these honey-trap gangs, many such cases will come to light in the near future.\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:31:40.197Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905966/police-bust-two-honey-trap-gangs-in-rawalpindi",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:14:33.000Z"
}
