{
  "title": "Two dozen dead as tourists targeted in held Kashmir - World - DAWN.COM",
  "author": null,
  "content": "• Gunmen target visitors to Pahalgam meadow; hitherto unknown group claims responsibility\n• Attack comes during US vice president’s trip to India; Trump says Delhi has their full support\n• Disinformation on social media tries to link incident to Pakistan\n\nNEW DELHI / ISLAMABAD: At least two dozen people were killed on Tuesday when gunmen opened fire on tourists in the tourist hotspot of Pahalgam, in Indian-held Kashmir.\n\nThe attack, which left dozens injured, coincided with a visit to India by US Vice President JD Vance.\n\nThe dead in Tuesday’s attack included a navy officer and foreign tourists, The Hindu reported.\n\nSome of the victims were from distant regions of India, which included Tamil Nadu, Maharashtra and Karnataka.\n\nPahalgam sits on a scenic meadow that has been used as a backdrop in Indian movies, most notably Bobby.\n\nIt also falls on the route of the annual Amarnath Yatra — a Hin­du pilgrimage to a cave shr­ine dedicated to Lord Shiva — which makes it one of the most protected regions of Indian-held Jammu and Kashmir.\n\nThe brazen attack in the hig­hly protected zone has raised eyebrows across the region.\n\nCondemning the attack, Indian PM Narendra Modi said that those behind the heinous act will be brought to justice.\n\nModi, who was on a visit to Saudi Arabia at the time of the incident, ordered Home Minister Amit Shah to take all necessary measures in response to the incident. Subsequently, Indian media reported that Shah was set to arrive in Srinagar to hold an urgent security review meeting with all relevant agencies.\n\nA hitherto unknown group, named by several Indian outlets as ‘The Resistance Front’, is said to have claimed responsibility for the attack.\n\nA similar incident took place ahead of former US president Bill Clinton’s visit to Delhi in the year 2000, but there was been considerable dispute over who staged it.\n\nAt the time, India had bla­med Pakistan-based militants, but Indian and Kashmiri obse­rvers decried it as an alleged plot by the Indian army.\n\nFollowing the attack, several Indian media outlets and social media accounts began linking the attack to Pakistan, without any evidence to substantiate the claim.\n\nWhile pundits on Indian TV channels ratcheted up their customary anti-Pakistan rhetoric, there was no official finger-pointing towards Islamabad in the hours immediately following the attack.\n\nAccording to The Statesman, local police only reposted the X posts of the president, the prime minister, the home minister, and the local governor.\n\nEyewitness accounts\n\nWitnesses told The Wire that the meadow, which is not serviced by road and can be rea­ched on foot, horseback or by chopper, was buzzing with tou­rists on Tuesday as the weather had improved after many days of rains and thunderstorms.\n\nA tour guide told AFP he reached the scene after hearing gunfire and transported some of the wounded away on horseback.\n\n“I cannot say how many, but the militants came out of the forest near an open small meadow and started firing,” an eyewitness, who provides ponies for tourists, told AFP.\n\nThe witness, who spoke on condition of anonymity as authorities had barred them from speaking to the media, said the gunmen “very clearly spared women and kept shooting at men”.\n\n“Sometimes single shot and sometimes many bullets”, they said. “It was like a storm.”\n\nThe witness said dozens of people fled as the gunmen opened fire. “They all started running around in panic,” he added.\n\n“We tried to comfort them but they were just screaming… we helped carry some injured out of there on ponies.”\n\nPallavi, from India’s southern Karnataka state, said the attack “felt like a bad dream” as her husband was killed in front of her and their son.\n\nThey were attacked by “three to four people,” India Today quoted her as saying.\n\n“I told them — kill me too… One of them said, ‘I won’t kill you. Go tell this to Modi’.”\n\nCondemnations\n\nJammu and Kashmir Chief Minister Omar Abdullah said the death toll was still being ascertained, and would be announced officially later. “This attack is much larger than anything we’ve seen directed at civilians in recent years,” he said on X.\n\nAll Parties Hurriyat Conference Chairman Mirwaiz Umar Farooq also condemned the attack.\n\n“Deeply disturbing news from Pahalgam of a cowardly attack on tourists that has resulted in tragic loss of life,” he said in a message.\n\n“Such violence is unacceptable and against the ethos of Kashmir which welcomes visitors with love and warmth. Condemn it strongly. Thoughts and prayers with the families of victims and wishing speedy recovery to the injured.”\n\nCongress leader Rahul Gandhi, who is also Leader of the Opposition in the Lok Sabha, called the attack “extremely condemnable and heartbreaking,” while urging the government to move beyond what he termed “hollow claims” of peace in held-Jammu and Kashmir.\n\n“The whole country is united against terrorism,” Gandhi said.\n\n“Instead of making hollow claims of the situation being normal in Jammu and Kashmir, the government should now take accountability and take concrete steps so that such barbaric incidents do not happen in the future and innocent Indians do not lose their lives like this.”\n\nUS Vice President Vance, in a message from Jaipur, condoled with the victims.\n\n“Usha and I extend our condolences to the victims of the devastating terrorist attack in Pahalgam, India. Over the past few days, we have been overcome with the beauty of this country and its people. Our thoughts and prayers are with them as they mourn this horrific attack,” he wrote on X.\n\nMeanwhile, US President Donald Trump said that India had the full support of the US.\n\n“Deeply disturbing news out of Kashmir. The United States stands strong with India against Terrorism. We pray for the souls of those lost, and for the recovery of the injured. Prime Minister Modi, and the incredible people of India, have our full support and deepest sympathies,” he wrote on Truth Social.\n\nOur correspondent in New Delhi also contributed to this report\n\nPublished in Dawn, April 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/230856218ad7dd1.jpg",
  "retrievedAt": "2025-08-25T14:32:05.946Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905973/two-dozen-dead-as-tourists-targeted-in-held-kashmir",
  "dateList": "2025-04-23",
  "date_published": "2025-04-23T00:13:40.000Z"
}
