{
  "title": "Caretaker FM underlines need to invest in youth’s potential for a prosperous Commonwealth",
  "link": "https://www.app.com.pk/global/caretaker-fm-underlines-need-to-invest-in-youths-potential-for-a-prosperous-commonwealth/",
  "date_published": "2023-09-12T10:40:00.000Z",
  "source": "APP",
  "content": "LONDON, Sept 12 (APP): Caretaker Foreign Minister Jalil Abbas Jilani on Tuesday stressed upon creation of an enabling environment for the young people to succeed and said that a path for a more sustainable, peaceful, prosperous and fairer Commonwealth could be achieved by 2030.\nIn his opening remarks at the 10th Commonwealth Youth Ministerial Meeting Plenary Session as chairperson, the foreign minister said that the meeting was significant as youth ministers have not met since 2017 and so much had happened in the world since that time.\nHe appreciated the vision of the Commonwealth members leaders in making this the year, a year dedicated to youth-led development.\nThe foreign minister said that they had recommended the theme ‘Aiming Higher, Delivering More for young people in the Commonwealth’ for the current meeting.\nhttps://x.com/ForeignOfficePk/status/1701537834702914001?s=20\nThe theme expressed the combined aspiration and commitment of the Commonwealth family to invest in and promote young people’s development, particularly through the creation of opportunities for youth employment and entrepreneurship, recognising that the future success of the Commonwealth rested with the continued commitment and contributions of young people in promoting and sustaining the Commonwealth, and its values and principles as enshrined in Article 13 of the Commonwealth Charter, Foreign Office Spokesperson, in a press release, quoted the foreign minister as saying.\nThe foreign minister said “We live in a ‘Young Commonwealth’. (In my own country, Pakistan, almost 70 percent of our citizens are under 30 years of age. I believe we have one of the youngest populations in the Commonwealth).  Our work here, in the next few days, would have made a difference in the world.”\nForeign Minister Jilani highlighted that that all Commonwealth member states had taken significant steps to educate and train youth, empower girls and raise awareness about the climate change.\nFrom Pakistan’s perspective, he said the Prime Minister’s Youth Programme (PYMP) was a flagship program of the government prioritizing youth empowerment.\nIt strove to mainstreaming and inclusion of marginalized youth; particularly girls, religious and ethnic minorities; persons with disabilities and transgender community, he said and shared the key steps taken in this regard.\nThese included trained free of cost some 400,000 youth in both high-tech skills and conventional trades, with a special emphasis on catering to foreign markets, instituted a National Innovation Award to encourage young people to come up with innovative and out-of-box solutions to the most pressing challenges of the day, launched the Green Youth Movement for environmental conservation, through some 137 University based Green clubs, engaged youth in meaningful policy making through initiatives such as the National Youth Council and development of a Digital Youth Hub, providing an online portal for securing job opportunities.\nThe foreign minister said that as Commonwealth member states, they would discuss and implement a robust set of polices and programmes which would help them achieve the targets and goals set out in the SDGs.\nFor this meeting, he said four sub-themes for were identified for consideration including engagement, education, employment and environment.\nThe minister said that education was the cornerstone of personal growth and national development. Investing in quality education (formal and non-formal) equipped young individuals with the knowledge, skills, and critical thinking abilities required to tackle the challenges of the modern world.\nCreating the conditions for economic empowerment of young people through diverse and inclusive opportunities that aligned with the changing global economy, would assist young people fulfil their talents and abilities, he added.\nHe further stressed that engagement was the catalyst for building active and responsible citizens. Encouraging youth participation in decision-making processes and civic activities enhanced their sense of belonging and ownership within society.\n“The environment is the legacy we leave for current and future generations. As custodians of the planet, it is our responsibility to address climate change and promote sustainable practices. Young people are at the forefront of climate activism, demonstrating a profound commitment to environmental preservation,” he added.",
  "retrievedAt": "2025-08-11T09:35:51.174Z"
}
