{
  "title": "FIH announces officials for Olympic Games Paris 2024",
  "link": "https://www.app.com.pk/national/fih-announces-officials-for-olympic-games-paris-2024/",
  "date_published": "2023-09-12T10:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 12 (APP): The International Hockey Federation (FIH) on Tuesday confirmed the names of the technical delegates, technical officials, umpire managers, umpires and medical officers who are appointed to the Olympic Games Paris 2024.\nThe selection has been made by the FIH Technical Officials and Umpiring Committees, chaired by Sheila Brown (South Africa) and Roger St. Rose (Trinidad and Tobago) respectively, the FIH said in a media release.\nContinuing hockey’s drive towards maintaining gender equality in the sport, there will again be a 50-50 split of the officials at the Games across Umpires and Technical Officials.\nThis is a key target for the International Olympic Committee (IOC) which aims to achieve this across all sports at the Olympic Games Paris 2024.\nSpeaking on the announcement of officials for the Olympic Games Paris 2024, FIH President Tayyab Ikram said: “Officials play a fundamental role and give a very substantial part of their free time to their passion for the sport! This is remarkable and I’d like to thank every hockey official, anywhere in the world. To all those who’ve been selected for the Olympic Games in Paris next year: huge congratulations! This is a fantastic achievement.\nOn behalf of FIH, I want to assure you of our full confidence, support and respect. And I’m particularly pleased that the split of all officials across both genders will be an exact 50-50, in line with the overarching gender equality principle which prevails in our sport.”\nIntroduced at the Olympic Games London 1908, hockey at the Olympic Games Paris 2024 will mark its 25th appearance in the quadrennial sporting event.\nBoth men’s and women’s events at the Olympic Games will involve 12 of the world’s best hockey nations.",
  "retrievedAt": "2025-08-11T09:35:52.131Z"
}
