{
  "title": "Dr. Ramesh terms establishment of Gandhara Corridor as indispensable for country’s prosperity",
  "link": "https://www.app.com.pk/national/dr-ramesh-terms-establishment-of-gandhara-corridor-as-indispensable-for-countrys-prosperity/",
  "date_published": "2023-09-12T10:46:00.000Z",
  "source": "APP",
  "content": "SKARDU, Sep 12 (APP): Minister of State, Chairman Prime Minister’s Task Force for Gandhara Tourism, Dr Ramesh Kumar Vankwani Tuesday termed the establishment of Gandhara Corridor as indispensable for the development and prosperity of the country.\nHe was talking to the media during his visit to the ancient Manthal Buddha Rock, Gilgit Baltistan along with a delegation of Japanese experts, and local citizens.\nSpeaking on the occasion, Dr. Ramesh Vankwani said that the mesmerizing natural beauty of Gilgit-Baltistan is a great source of attraction for tourists from across the world.\nRegarding his proposed Gandhara Corridor project, Dr. Ramesh Vankwani said that the air corridor being established between the federal capital Islamabad and the capitals of Buddhist-majority countries will facilitate a large number of international Buddhist tourists to land at the Islamabad International Airport will later facilitate their visits to the Gandhara spots in coordination with the provincial authorities.\nHe said that hundreds of years ago, the followers of Gautama Buddha used to cross the high rocky cliffs of Gilgit-Baltistan to go to China, Japan Korea etc.\nThe site of the Buddha Manthal Rock has also been a place of worship for the Tibetans. Historically Skardu has been an important part of Buddhist Tibet in the past and even today Skardu is called Little Tibet (Tibet Khurd), he added.\nThe image and carvings of the enshrining Buddha from ancient times on the rocky cliffs of Gilgit-Baltistan are evidence of religious devotion to Gautama Buddha.\nOn this occasion, the Japanese delegation and the followers of Buddha supported the stance of Dr Ramesh and said that it is a heartfelt desire of the citizens of Buddhist-majority countries to visit Gandhara spots located in Gilgit-Baltistan.\nLater during an informal meeting with the Chairman Senate Sadiq Sanjrani, Dr. Ramesh Vankwani discussed the way forward to promote Gandhara tourism in Gilgit-Baltistan and promotion of Gandhara art across the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:36:12.299Z"
}
