{
  "title": "Ethiopian embassy celebrates Ethiopian New Year with fervor",
  "link": "https://www.app.com.pk/national/ethiopian-embassy-celebrates-ethiopian-new-year-with-fervor/",
  "date_published": "2023-09-12T12:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 12 (APP): The Embassy of the Federal Democratic Republic of Ethiopia (FDRE) in Pakistan has celebrated Ethiopian New Year 2016 with traditional zeal and fervor.\nIn this regard, a colorful reception was hosted here for the Government of Pakistan’s officials, media, civil society, diplomatic corps, and Ethiopian Diaspora.\nMinister for Commerce Dr. Gohar Ejaz graced the occasion as a chief guest, while other important guests including Ambassador of Turkmenistan and Dean of Diplomatic Corps to Pakistan Atadjan Movlamov, Ambassador of Kingdom of Morocco to Pakistan Mohammed Karmoune, Former President of Islamabad Chamber of Commerce and Industry Zafar Bakhtawari and others also attended the ceremony.\nEthiopian Ambassador to Pakistan Jemal Beker Abdula accorded a warm welcome to all the guests upon their arrival at the celebration ceremony.\nSpeaking on the occasion, he said every year on September 11, Ethiopia celebrated its new year in accordance with its own ancient calendar which was an identity of the FDR Ethiopia.\n“Our calendar consists of 13 months, with 12 months comprising 30 days each and a 13th month consisting of 5 days. Every four years, this 13th month counts 6 days to account for a leap year. Hence, we find ourselves celebrating this public holiday on September 11, unless it is a leap year in the Ethiopian calendar, when we celebrate it on September 12,” he explained.\nHe said the seven to eight-year gap between the Ethiopian and Gregorian calendars stemmed from an alternative calculation used to determine the date of the Annunciation.\nAt one moment, the gathering broke into a loud applause when Jemal Beker said “Whoever presents in this gathering today becomes seven years younger of his age.”\nHe said on this day, all Ethiopians reaffirmed their unwavering faith in the core values that defined Ethiopia including love, forgiveness, unity, and harmony.\nThe ambassador said Ethiopia had a unique place in human history as the land of origin, with the discovery of Lucy—the human fossil believed to be one of our earliest ancestors. It was also the birthplace of coffee, with the village of Keffa\ngiving coffee its name.\n“Visiting Ethiopia is akin to reconnecting with your ancestral roots,” he noted.\n“Moreover, Ethiopia is renowned as the source of the Nile, the longest river in the world. Our nation also takes pride in producing some of the world’s most exceptional athletes, and I am excited to announce plans to foster knowledge exchange between our athletes and our dear brotherly country in the realm of sports,” the ambassador stressed.\nHe said the Ethiopian New Year of this year also marked the completion of the first Ethiopian Embassy in Islamabad which was a testament to the strengthening of the diplomatic ties between the two countries. The Ethiopian Government inaugurated its Embassy in Pakistan last year, coinciding with the diamond jubilee of Pakistan, he added.\nThe ambassador thanked the people and the Government of Pakistan for extending hospitality, generosity, and sincerity to him and the FDRE Embassy for one year.\nHe also highlighted major initiatives of the FDRE Embassy in its inaugural year which included the formal establishment of the Embassy, the visit of a historic trade delegation of 75 Pakistani businessmen to Ethiopia in March 2023, the arrival of high-powered officials and business delegation of 50 persons from Ethiopia in Pakistan in May 2023 and commencement of Ethiopian Airlines operations in Karachi and signing of agreements with Pakistan in the areas of trade, investment, science, and technology.\nFederal Minister for Commerce, Dr. Gohar Ejaz expressed gratitude to Ambassador Jemal Beker Abdula for inviting him to the celebration ceremony and emphasized the close relationship between the two nations in trade, investment, tourism, and technology transfer.\nHe highlighted the promising trade prospects between Pakistan and Ethiopia during the Ethiopian New Year celebration ceremony.",
  "retrievedAt": "2025-08-11T09:35:38.176Z"
}
