{
  "article_id": "2025-01-10_cd2cf095b2e81ec6968f1f13407397c8",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884314/los-angeles-wildfire-deaths-at-10-as-national-guard-called-in",
    "retrieved_at": "2025-08-26T07:35:01.195Z"
  },
  "metadata": {
    "title": "Los Angeles wildfire deaths at 10 as National Guard called in - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T10:34:39.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/10151819e1ba772.jpg",
    "categories": [],
    "word_count": 772,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "Massive wildfires that engulfed whole neighbourhoods and displaced thousands in Los Angeles have killed at least 10 people, authorities said, as California's National Guard soldiers readied to hit the streets to help quell disorder. News of the growing toll, announced late on Thursday by the Los Angeles County Medical Examiner, came as swaths of the United States' second-largest city lay in ruins. A vast firefighting operation continued into the night, bolstered by water-dropping helicopters thanks to a temporary lull in winds, even as new fires continued to spring up. With reports of looting, Los Angeles County Sheriff Robert Luna said a nighttime curfew was planned, and the state's National Guard was on hand to patrol affected areas. Governor Gavin Newsom said the service members were part of a thousands-strong deployment of state personnel. \"We're throwing everything at our disposal - including our National Guard service members - to protect communities in the days to come,\" he said. \"And to those who would seek to take advantage of evacuated communities, let me be clear: looting will not be tolerated.\" Luna said his officers were patrolling evacuation zones and would arrest anyone who was not supposed to be there. But with such a huge area scorched by the fires, evacuees feared not enough was being done and some were taking matters into their own hands. Nicholas Norman mounted an armed vigil at his home after seeing suspicious characters in the middle of the night. \"I did the classic American thing: I went and got my shotgun and I sat out there, and put a light on so they knew people were there,\" he told AFP. The biggest of the multiple blazes has ripped through almost 20,000 acres (8,800 hectares) of the upscale Pacific Palisades neighbourhood, while another fire around Altadena has torched 13,700 acres. Firefighters said they were starting to get a handle on the Pacific Palisades blaze, with six per cent of its perimeter contained - meaning it can't spread any further in that direction. But after a lull, winds were returning and new fires continued to erupt. One flared near Calabasas and the wealthy Hidden Hills enclave, home to celebrities like Kim Kardashian, late on Thursday. The Kenneth Fire exploded to almost 1,000 acres within hours, forcing more people from their homes, with over 180,000 now displaced. US President Joe Biden told a White House briefing he had pledged extra federal funds and resources to help the state cope with \"the most ... devastating fire in California's history\". Unlike Tuesday when the multi-pronged disaster roared to life and 160-kilometer-an-hour winds grounded all aircraft, firefighters were able to keep up a steady stream of sorties. But one Super Scooper - an amphibious aircraft that dumps hundreds of gallons of water at a time - was grounded after colliding with a drone. Although no one was hurt, the Federal Aviation Authority said it was probing the incident, and warned anyone flying drones in fire areas could be jailed for a year. Some of those forced out of their homes began to return Thursday to find scenes of devastation. Kalen Astoor, a 36-year-old paralegal, said her mother's home had been spared by the inferno's seemingly random and chaotic destruction. But many other homes had not. \"The view now is of death and destruction,\" she told AFP. \"I don't know if anyone can come back for a while.\" Meanwhile, an AFP overflight of the Pacific Palisades and Malibu - some of the most expensive real estate in the world and home to celebrities like Paris Hilton, Anthony Hopkins and Billy Crystal - revealed desolation. On highly coveted Malibu oceanfront plots skeletal frames of buildings indicated the lavish scale of what has been destroyed. Multi-million dollar mansions have vanished entirely, seemingly swept into the Pacific Ocean by the force of the fire. In the Palisades, grids of roads that were until Tuesday lined with stunning homes now resemble makeshift cemeteries. For millions of others in the area, life was disrupted: schools were closed, hundreds of thousands were without power and major events were cancelled or, in the case of an NFL playoff game between the Los Angeles Rams and the Minnesota Vikings, moved somewhere else. Meteorologists warn that \"critical\" windy and dry conditions, though abated, are not over. A National Weather Service bulletin said \"significant fire growth\" remained likely \"with ongoing or new fires\" into Friday. Wildfires occur naturally, but scientists say human-caused climate change is altering weather and changing the dynamics of the blazes. Two wet years in Southern California have given way to a very dry one, leaving ample fuel dry and primed to burn.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}