{
  "article_id": "2025-01-10_0de97d0648d584d5cab00374ea4fd2be",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884185/four-killed-15-passers-by-injured-in-firing-near-sargodha",
    "retrieved_at": "2025-08-26T07:35:44.316Z"
  },
  "metadata": {
    "title": "Four killed, 15 passers-by injured in firing near Sargodha - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T01:39:53.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 432,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "SARGODHA: At least four men were killed and 15 others injured in a shooting incident near Aziz Bhatti Town area in the limits of Jhal Chakian police station on Thursday. According to police, armed assailants opened indiscriminate fire on a car in front of a petrol pump near Aziz Bhatti Town, resulting in instant death of four men identified as Shafi, Fazlur Rehman, Zaheer Abbas and Abdul Sattar. In the firing that continued for around five minutes, passersby, including Haider, Shahbaz, Zafar Shah, Faizan Lai, Shahid, Usman, Ali, Ramzan, Azam and Akram, were injured. The bodies and the injured persons were shifted to the district headquarters hospital. Victims were returning after court appearance According to initial police investigation, the incident took place because of enmity between two groups of Chak 54-NB. Police sources say that the victims were returning home after appearing in a local court. According to the police spokesperson, on being informed of the incident, district police officer (DPO), investigation wing SP and teams of crime scene and forensic units reached the spot. FLOUR PRICES: Local flour mill owners are being pressurised by the Punjab government toby the wheat stocks lying in its godowns at the officially fixed price, that will result in an increase in the flour prices in the coming days. This is apprehended by local flour mill owners, who say that last year, due to the significant reduction in the wheat prices by the government, the farmers could not even recover their input costs. They said that due to the bitter past experience, this year a majority of farmers have avoided cultivating wheat, which may increase the prices of wheat flour in the coming days. A leader of flour mills association,Rao Sajid Mahmood, has urged the government to take immediate steps to avid hike in flour prices. He said that though the government temporarily benefited from the \"policy\" of forcing farmers to sell their wheat at lower rates last year, but the growers were badly hit, and this season many of them did not cultivate wheat, which would push flour prices up. RAILWAYS: Area residents have demanded that a direct train should be run from Sargodha to Karachi so that more people could avail the facility of cheap train travel. Because of the non-availability of this facility, locals have to book their seats from Faisalabad and other cities to travel to Karachi and other destinations on the route. Meanwhile, the Pakistan Railways has abolished the seat quotas for the parliamentarians, judges and bureaucrats in the Millat and Hazara Express from Sargodha. Published in Dawn, January 10th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}