{
  "article_id": "2025-01-10_0051b42704b41ffab1e2a77280a082ed",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884329/5-terrorists-killed-in-intelligence-based-operation-in-kps-di-khan-ispr",
    "retrieved_at": "2025-08-26T07:34:55.171Z"
  },
  "metadata": {
    "title": "5 terrorists killed in intelligence-based operation in KP’s DI Khan: ISPR - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T16:13:13.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 453,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "Five terrorists were killed in an intelligence-based operation (IBO) in Khyber Pakhtunkhwa's Dera Ismail Khan on Friday, according to the military's media wing. A statement issued by the Inter-Services Public Relations (ISPR) today said security forces conducted an IBO in DI Khan's general area of Maddi on the \"reported presence\" of terrorists. It said security forces \"effectively engaged\" the terrorists at their location due to which, five, including ringleader Shafiullah alias Shafi were \"sent to hell\". It added that they were actively involved in terrorist activities against security forces and targeted killings of innocent civilians. The ISPR said weapons and ammunition were recovered from them. Sanitisation operations were being conducted to eliminate any other terrorists, the statement said. \"Security forces of Pakistan are determined to wipe out the menace of terrorism from the country and such sacrifices of our brave soldiers further strengthen our resolve,\" the ISPR concluded. President Asif Zardari and Prime Minister Shehbaz Sharif on Friday paid tribute to the security forces for the operation. In separate messages received here, the president and prime minister appreciated the bravery of the security forces. The president said, \"The security forces are conducting operations to eliminate the menace of terrorism. The entire nation is united against terrorism.\" He also reiterated the commitment to the complete elimination of terrorism from the country. PM Shehbaz praised the professional skills of the officers and personnel participating in the operation. \"We will continue the war against the scourge of terrorism until its complete elimination from the country. The entire nation stands in support of its brave forces in the war against terrorism. The people of Pakistan also pay tribute to the security forces who participated in the war against the enemies of the country without caring for their lives,\" the prime minister said. On Tuesday, the ISPR said three soldiers were martyred and 19 terrorists were killed in three separate engagements in KP. Pakistan has recently witnessed an uptick in terror activities, especially in KP and Balochistan. Terror attacks have increased since the banned Tehreek-i-Taliban Pakistan broke a fragile ceasefire agreement with the government. With at least 685 members of security forces losing their lives amid a total of 444 terror attacks, 2024 turned out to be the deadliest year for the civil and military security forces of Pakistan in a decade. Equally alarming were the cumulative losses of civilians and security personnel: 1,612 fatalities, accounting for over 63 per cent of the total recorded the past year and marking 73pc more losses compared to 934 outlaws eliminated. The overall fatalities recorded last year were a record nine-year high, and over 66pc more than in 2023. On average, nearly seven lives were lost daily. Additional input from APP.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}