{
  "article_id": "2025-01-10_a72b91d42fa976ce19822cd12a17d5d5",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884259/double-decker-buses-to-hit-karachis-sharea-faisal-this-year-sharjeel-inam",
    "retrieved_at": "2025-08-26T07:35:15.002Z"
  },
  "metadata": {
    "title": "Double-decker buses to hit Karachi’s Sharea Faisal this year: Sharjeel Inam - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T02:41:07.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678088a7c95c8.gif",
    "categories": [],
    "word_count": 597,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "KARACHI: Sindh Senior Minister Sharjeel Inam Memon has announced that the provincial government is set to bring double-decker buses during the current year. Speaking at a programme organised by the Korangi Association of Trade and Industries (KATI) in his honour here on Thursday, he said that efforts were underway to ensure plying of the double-decker buses on Sharea Faisal within the same time frame. The minister spoke at length about the achievements of the Pakistan Peoples Party government in Sindh in improving law and order, transport, healthcare and other civic facilities in Karachi and other parts of the province. He stated that a representative of KATI will be especially invited to the board meeting of the Bus Rapid Transit Yellow Line project. \"Efforts are underway to complete the construction of the Jam Sadiq Bridge within eight months.\" Says PPP leadership committed to providing facilities to industrialists to foster economic growth He clarified that there has been no delay in the Red Line project on the part of the government; the delays occurred due to the transfer of utilities, said a press release. Regarding law and order, he said that the situation in Karachi is very good, although some concerns remain. He emphasised that the country is now safe for investment and that Karachi's situation, in terms of street crimes, is much better compared to other cities around the world. He stated that water shortage is a significant issue in Karachi, and efforts are underway to address it through the K-IV and Hub Canal projects. Highlighting the allocation of billions of rupees to the Solid Waste Management Board for garbage collection, he said in cities like Hyderabad and Larkana, garbage was being collected directly from people's doorsteps as part of these efforts. The minister declared that strict action would be taken to improve the traffic system. '10-year tax exemption at Dhabeji economic zone' The minister assured the industrialists and traders that the provincial government is committed to addressing the challenges faced by traders. He said that President Asif Ali Zardari, PPP Chairman Bilawal Bhutto-Zardari and Chief Minister Syed Murad Ali Shah wanted to provide maximum facilities to the business community to foster economic growth and create more employment opportunities. \"The government has extended an open invitation to private entrepreneurs to establish their own industrial zones, aiming to strengthen the country's economy, attract maximum investment, and create employment opportunities,\" he added. He said the Dhabeji Special Economic Zone presents a golden opportunity for traders as it offers zero import duties and a 10-year tax exemption and its connection to the China-Pakistan Economic Corridor (CPEC) further enhances its value, providing significant benefits to traders and industrialists. Speaking on the occasion, KATI President Junaid Naqi informed Mr Memon about the issue of heavy traffic on the roads. He highlighted that accidents occurred as a result of the congestion and emphasised the need for strict enforcement of traffic laws and the implementation of an effective strategy to address the problem. He said: \"Korangi Industrial Area spans 12,000 acres and, over the past 12 years, has grown to become the largest industrial area in Pakistan, now covering 12,500 acres. Exports have increased significantly, with a major contribution to leather exports coming from Korangi. Additionally, around 60 to 70 per cent of the country's oil, petrol, and diesel are refined in this area. The Korangi industry provides employment to approximately 1.5 million people.\" Earlier, KATI leaders SM Tanveer, Junaid Naqi, Syed Johar Ali Kandahari and others held a meeting with Mr Memon and briefed him on their concerns. Published in Dawn, January 10th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}