{
  "article_id": "2025-01-10_1918fbc61e97ccc653c2095790ad52aa",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884194/govt-scraps-10000mw-projects-to-curb-costs",
    "retrieved_at": "2025-10-12T00:47:00.554Z"
  },
  "metadata": {
    "title": "Govt scraps 10,000MW projects to curb costs - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T01:54:40.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/100923075f60695.jpg",
    "categories": [],
    "word_count": 946,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "- Power minister stresses need for bold decisions to address inefficiencies - Says govt has right to terminate projects that haven't reached financial close - Competitive electricity market to be operationalised in March ISLAMABAD: Claiming over Rs1.1 trillion in savings in revised contracts with existing independent power producers (IPPs), the government on Thursday announced a series of major decisions for reducing electricity rates, including the rejection of about 10,000MW of upcoming IPPs for being expensive and unaffordable. Speaking at a seminar on hydroelectric power in Islamabad, Power Minister Awais Leghari emphasised the need for bold decisions to address inefficiencies in the energy sector. He criticised K-Electric's proposal for a Rs10.5 per unit tariff increase over the next seven years and ruled out power generation from projects such as the $14 billion Diamer-Bhasha Dam, citing their high costs to consumers. The minister also hinted at changing the taxation structure on electricity bills and eliminating the uniform tariff regime across the country to \"incentivise everyone to do much better\" instead of encouraging inefficiencies in the sector. \"We are seriously looking at bringing down prices by changing taxation structure,\" he said. \"All stakeholders must take bold decisions for a better future,\" the minister said, adding that this also included the parliamentarians and the politicians who may suffer for one year or two. \"No country in the world has a uniform power tariff,\" he said. The minister said the government has the \"legal right\" to terminate 10,000MW of projects from a planned 17,000MW that have not reached financial close. \"We will exercise this right\", whether any company had been given a letter of support (LOS) or not. \"We will not take any pressure in any form, whether it is for 1,000MW, 3,000MW or a G2G [government-to-government] offer,\" he added. However, projects with 40 to 50 per cent physical progress and those that have achieved financial close would go ahead, he said. Likewise, provincial projects where financial commitments were already in place will also remain intact. Mr Leghari said all future energy contracts would prioritise least-cost electricity, where demand would dictate the technology and power supply lines would dictate the space in which the next plant should be accepted for the power system. Competitive bidding will decide the final selection, with private investors taking on associated risks. Impact on Diamer-Bhasha dam He said the power ministry had taken several initiatives and challenged all the projects lined up for the next 10 years, including the Diamer-Bhasha Hydropower Project, nuclear power projects, and even renewables, based on their feasibility for consumers and the economy. He said that only 87MW of power plants out of 17,000MW committed under the indicative generation expansion plan for the next 10 years qualified for induction into the system on the least-cost principle. \"Our country and consumers can no longer afford this expensive energy,\" he said, adding that any project considered for strategic reasons should be funded by the government through the development programme without burdening the consumer. While acknowledging the storage and flood control benefits of the Diamer-Bhasha Dam, Mr Leghari said the associated $3 billion transmission costs and power generation expenses would be too burdensome for consumers. If integrated into tariffs, electricity from the dam would raise the national power rate by Rs5 per unit, he said, stressing that the government is currently fighting with IPPs for Rs1 or 1.5 per unit savings. The minister also flagged the unaffordability of other projects, such as the Gwadar Coal project, and Azad Pattan and Kohala hydropower projects. \"So, a basic decision has been taken\" that only technology, demand, transmission line and tariff would dictate the future capacity addition. He said the government or its agency - the Central Power Purchasing Agency (CPPA) - would not buy all the energy and take all the risks. Competitive electricity market He said the competitive electricity market would be operationalised in March, and this revolution would facilitate the private sector in making decisions. \"Imagine the situation if the IT minister had to make decisions for Telenor, Ufone or Mobilink,\" he said, adding that no government or power minister could make efficient decisions like the private sector. The minister also announced that the government was working on changing the rate for net-metering \"rich and elite\" consumers currently being paid at the rate of Rs21 per unit, which also included a capacity charge. They would be given only energy price, which would change their full cost recovery from the current 18 months to about four-and-a-half years. He said the energy costs had become unaffordable and the people were shifting to other sources because of high costs. In the next five years, net-metered consumers would be selling their battery-based electricity to other consumers and the grid, he added. The minister said the governance reforms in the power sector were paying dividends. He said boards of eight out of 10 distribution companies were changed with no political interference, which resulted in their losses going down to Rs170bn in July-November this year against Rs223bn last year. Had the remaining two boards changed, the loss would have gone further down to Rs140bn as these two companies actually added Rs30bn more than last year. Mr Leghari said his ministry intervened at the last moment before Nepra was about to issue a multi-year tariff for K-Electric, which was seeking Rs10.5 per unit increase for the next seven years. \"We peeled off\" all the components and concluded that its tariff increase should be less than Re1 per unit instead of Rs10.5. \"It was the job of the regulator\" that was done by the power division, the minister said and hoped the regulator would realise actual factors. Published in Dawn, January 10th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}