{
  "article_id": "2025-01-10_345422941d1f0f5e0e04cbf93a12e8fe",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884188/lahores-air-quality-turns-hazardous-yet-again",
    "retrieved_at": "2025-08-26T07:35:44.968Z"
  },
  "metadata": {
    "title": "Lahore’s air quality turns hazardous yet again - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T01:39:52.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/67804079becbc.jpg",
    "categories": [],
    "word_count": 851,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "LAHORE: The air quality in the provincial capital on Thursday again reached alarming levels, with its Air Quality Index (AQI) soaring to 529, that is categorised as hazardous. This places Lahore as the second most-polluted city globally, just behind Delhi (India) with an AQI of 641. The primary pollutant, PM2.5, has reached a concentration that is 35.6 times higher than the World Health Organisation (WHO) standards. In Lahore AQI at Polo Ground, Cantonment was 896, Honda Gateway 814, NPPMCL 812, Powerzone head office 752, Zacky Farms 674, Tufail Road near Rahat Bakery 631, Valancia Town 605, Block A, Johar Town, 599, and Askari-X 569. The hazardous air quality has sparked widespread concern among city residents and health experts alike. Many of the residents are experiencing severe respiratory issues, eye irritation and other health problems. Experts group says smog towers proved ineffective in China, India \"The air feels like a thick blanket of smoke,\" says Fatima, a resident. \"My children are coughing constantly, and it's hard to breathe,\" she adds. Health experts warn that prolonged exposure to such high pollution levels could lead to respiratory diseases, heart conditions and even premature death. \"We are seeing an increase in hospital admissions due to respiratory issues,\" says Dr Ahmed, a pulmonologist at the Lahore General Hospital (LGH). \"Immediate measures are needed to protect public health,\" he suggests. In response to the crisis, the Punjab government has implemented several measures to curb pollution. Chief Minister Maryam Nawaz has introduced a plan to install water sprinklers at 1,500 construction sites across Lahore to suppress dust. Additionally, the government has mandated the use of green coverings at construction sites to contain dust and debris. The Environmental Protection Agency (EPA) claims to have installed emission control systems in 96 percent of Lahore's industries. \"We are taking strict actions against violators of environmental laws,\" says Senior Minister Marriyum Aurangzeb. \"Our goal is to provide a clean and healthy environment for all residents,\" she says. Meanwhile, the Pakistan Air Quality Experts (PAQE) group on Thursday issued an advisory on air quality management measures that could help mitigate extremely high PM2.5 air pollution levels in Punjab, particularly in Lahore. The group utilised government data and source apportionment studies to recommend the closure of brick kilns and smelters, and banning entry of unnecessary heavy vehicles into cities when pollution levels are forecast to be higher. A similar closure policy has been used in the cities like Beijing and New Delhi, preventing the worst possible scenario, it says. However, these are only ad-hoc measures and could be implemented for a few days, it adds. PAQE had also highlighted that the 'Smog Mitigation Plan' of the Punjab government did not adequately address the key sources of pollution, suggesting that the proposed actions should be backed by evidence. On December 14, 2024, the Punjab government had announced that a 'Smog Tower' - similar to those used in China and India - has been installed in Lahore's Mehmood Booti area, in collaboration with the National University of Science and Technology (NUST). The group argues that such towers in China and India have been shut down for being an \"impractical\" method to reduce pollution. Based on an expert assessment of the tower in New Delhi, it was estimated that 47,000 such towers were needed to reduce PM2.5 to healthy levels. In the case of Lahore, which has relatively lesser sources of pollution, the city will need at least 20,000 such towers. Moreover, the energy consumed to run such towers makes them an extremely costly and inefficient measure, more expensive than controlling pollution at point sources, such as industry stack emissions, kilns and vehicle tailpipes, the group says. Previously, 'artificial rain' had also been promoted as a possible solution to reduce smog in Lahore. However, as was observed this year, this approach proved ineffective in unfavourable meteorological conditions and was not a sustainable intervention. Furthermore, analysis of AQI reports from Punjab EPA shows that the tower installed in Mehmood Booti area had a negligible impact. Data taken from EPA monitoring stations installed in Mehmood Booti area for the period between Dec 15 to Dec 31, 2024 shows that the AQI levels in the area remained above Lahore city-level average AQI for 9 out of 14 days of the available data, while it was lower in other areas of the city where no intervention was made. This suggests that AQI levels did not improve at all due to the tower and variations were due to local activities and meteorology. The group suggests that given the extremely detrimental public health and ecosystem impacts of air pollution, governments must prioritise interventions that are effective and provide significant returns. It proposes that the Punjab government should use research and expert knowledge to benchmark its existing plans, and then further implement interventions which have been successful in other similar economic and governance contexts. It says that interventions such as smog-free towers have been scientifically studied and proved ineffective. Therefore, solutions that prevent or reduce emissions at source should be the focus of government interventions, the group says. Published in Dawn, January 10th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}