{
  "article_id": "2025-01-10_d8610110839e9499bdce943c3142c21b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884233/import-delays-push-lint-prices-to-record-rs20000-per-maund",
    "retrieved_at": "2025-08-26T07:35:17.727Z"
  },
  "metadata": {
    "title": "Import delays push lint prices to record Rs20,000 per maund - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T02:22:32.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 302,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE: The local cotton market was showing a bullish trend as white lint rates on Thursday touched the highest mark of Rs20,000 per maund for the ongoing season. On the other hand, the Federal Board of Revenue (FBR) has called a special meeting on Monday to discuss whether to maintain sales tax exemption on imported cotton and yarn. Local cotton prices are rising because of an unexpected delay in the arrival of imported yarn, a drastic cut in domestic crop production, and large textile products' export orders. Total domestic cotton production fell short of the projected target by 51 per cent and 32pc over the last year's output. While the textile industry has received big export orders, reports suggest that the arrivals of imported cotton shipments have been delayed to May from March. These factors have helped push the local cotton prices as the textile industry has been actively purchasing domestic lint. Cotton prices for one-month deferred payment have reached the highest level of the current season, up to Rs20,000 per maund, while for routine payment they have reached Rs19,000 to Rs19,500 per maund. Market watchers are expecting a further increase in the prices. Cotton Ginners Forum Chairman Ihsanul Haq says that cotton import was delayed due to the Brazilian authorities' failure to timely fumigation their cotton. He adds that some say the country ran short of the chemical used for fumigation. Meanwhile, on the instructions of Prime Minister Shehbaz Sharif, the FBR called an important meeting in Islamabad on Jan 13, in which an important decision will be made on whether to maintain the 18pc sales tax exemption for imported cotton and yarn. The prime minister's directive came on the appeal of cotton growers and ginners who protested disparity in the local and imported cotton. Published in Dawn, January 10th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}