{
  "article_id": "2025-01-10_f3be9412790bdac9bdb714442632990d",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884240/musk-discussed-ways-to-oust-starmer-before-next-election-ft",
    "retrieved_at": "2025-08-26T07:35:16.555Z"
  },
  "metadata": {
    "title": "Musk discussed ways to oust Starmer before next election: FT - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T02:30:11.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 240,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LONDON: Billionaire Elon Musk has held private discussions with allies about removing British Prime Minister Keir Starmer from his position before the next general election, the Financial Times reported on Thursday. Musk, the world's richest person and a close ally of US President-elect Donald Trump, last month endorsed a German anti-immigration party ahead of elections slated in February, and has repeatedly commented on British politics, demanding Prime Minister Keir Starmer resign. Musk has been weighing how he and his allies can destabilise the Labour government and has sought information about building support for alternative British political movements to force a change in government, the report said, citing people familiar with the matter. \"His view is that Western civilisation itself is threatened,\" one of the people was quoted as telling the FT. Musk earlier accused Starmer of what he said was a failure to prosecute gangs of men who raped young girls when he was director of public prosecutions between 2008 and 2013. Starmer subsequently defended his work as Britain's top prosecutor. Separately, Musk is scheduled to host Alternative for Germany party leader Alice Weidel in a live interview on X on Thursday. The Musk-endorsed German party has been labelled as right-wing extremist by the German security services. Earlier this week, Norwegian Prime Minister Jonas Gahr Stoere expressed his concern over Musk involving himself in the political issues of countries outside of the United States. Published in Dawn, January 10th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}