{
  "article_id": "2025-01-10_5285bf01064e7d3ca05bb3c4e23b9806",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884151/islamabad-igp-orders-inquiry-after-officials-extort-money-from-citizen",
    "retrieved_at": "2025-10-12T00:47:17.251Z"
  },
  "metadata": {
    "title": "Islamabad IGP orders inquiry after officials ‘extort’ money from citizen - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T01:40:00.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 394,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: The Islamabad police chief has ordered a departmental inquiry after a resident of Tarlai informed the Inspector General of Police Ali Nasir Rizvi that police officials extorted money from him by threatening to implicate him in a false case. Haji Liaquat Ali Mughal, who identified as chairman of a local community organisation, approached the police chief at an open court held at the IGP office to share his ordeal and demand the money back from the police. He also submitted a written complaint to the police chief for legal action against the officials involved in the illegal act. Over the allegation, the IGP ordered an inquiry to fix the responsibility, a police official told Dawn. The complainant said that in December last year, he was summoned by the ASI of the Shahzad Town police station in connection with a case he had registered at the police station. However, he claimed the ASI asked him to deposit his phone and cash and put him in detention. According to the complainant, the ASI told him that he had been summoned to the police station on the directives of the SHO and he would be booked in a case registered against the PTI supporters. The complainant said he told the ASI that he was not affiliated with any political party, but the ASI detained him in a room. Eventually, he was allowed to contact his nephew, who visited the police station to meet the SHO. The SHO, however, demanded Rs200,000 for the release of the complainant. Mr Mughal said he was released after six hours of detention, and the police officials threatened him with dire consequences at the time of the release. Complainant alleges police threatened to implicate him in case against PTI if he did not pay up The SHO and the ASI extorted money from him, abusing their power, the complainant said, urging the police chief to initiate legal action against them. He also feared that the police would arrest him in false cases. In light of November 26 protests, the capital police registered 23 cases against the PTI supporters at 14 police stations, but in most of the FIRs, the suspects had remained unidentified. Now, the police are allegedly arresting innocent citizens and extorting money from them using these cases in which over 56,800 suspects are unidentified. Published in Dawn, January 10th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}