{
  "article_id": "2025-01-10_4dd86b7fa2a5629d78771846b3f7f05d",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884223/senate-panel-concerned-over-riverside-encroachments",
    "retrieved_at": "2025-08-26T07:35:29.148Z"
  },
  "metadata": {
    "title": "Senate panel concerned over riverside encroachments - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T02:16:46.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 528,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD: A parliamentary panel on Thursday expressed serious concern over widespread riverside encroachments in four provinces that caused repeated loss of lives and properties during flood seasons and called for urgent steps for their removal and ensure constant surveillance in future. A meeting of the Senate Committee on Water Resources, presided over by Chairman Senator Shahadat Awan, also expressed displeasure over continuous absence of Chairman of Wapda retired Lt Gen Sajjad Ghani and deferred discussions on audit paras relating to alleged irregularities in Wapda. While discussing the issue of land encroachments near rivers and canals, Minister for Water Resources Dr Musadik Malik and Secretary Syed Ali Murtaza reported an alarming extent of encroachments across various provinces. The committee emphasised the urgent need for action to prevent potential disasters triggered by floods in future. Lawmakers urge steps to prevent potential future disasters triggered by floods The committee was presented with details on encroachments, which have been a major concern for the country's flood management efforts. The meeting was told that occupation of lands near rivers and canals had been increasing in Sindh, Punjab, Khyber Pakhtunkhwa and Balochistan, raising fears of exacerbated flooding during monsoon seasons. Mr Awan suggested there should be clarity as to what was considered encroachment and then how to deal with them to ensure there was uniformity across all rivers, canals and provinces. \"We need to know how many cases of land occupation are pending in courts and where exactly these encroachments have occurred,\" he said, adding that flood situation would not have been so alarming had there been no encroachments. The meeting was told that 153 encroachments were reported in KP, of which 87 had already been removed. Punjab also has 153 encroachments near rivers, while Sindh has reported 26 cases, of which 11 have been removed. However, the committee was concerned that details from Balochistan were still not available. To enhance monitoring, the federal minister for water resources said the government was seeking involvement of the Space and Upper Atmosphere Research Commission (Suparco) for satellite surveillance to track encroachments more effectively. \"Suparco would help us monitor encroachments more accurately, providing a clear view of the situation,\" said Malik. The committee directed the provincial governments to provide full details on the location and extent of encroachments, ensuring that such information was presented at the next meeting. Despite receiving a briefing, the committee members expressed concern over the insufficient information provided, particularly regarding the specification of where the encroachments have occurred. Senator Faisal Saleem highlighted severe implications, noting that \"hotels in Swat were washed away by floods, and only then did we realise that encroachments were a key factor\" adding that \"even this information was gathered via satellite; we did not visit the sites ourselves.\" Members called for adequate data and proper measures needed to be taken to prevent further flooding and land encroachments. The committee called for a detailed response from all provincial governments to ensure proper monitoring and removal of illegal encroachments. With the help of satellite data, the issue of encroachments can now be tracked and managed more effectively to mitigate future flood risks, the panel noted. Published in Dawn, January 10th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}