{
  "article_id": "2025-01-10_0c846b7a666c441dea7e3b12b5216b7a",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884326/2024-was-the-first-year-above-15oc-of-global-warming-scientists-say",
    "retrieved_at": "2025-08-26T07:34:55.219Z"
  },
  "metadata": {
    "title": "2024 was the first year above 1.5oC of global warming, scientists say - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T15:19:23.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/101925089184a07.jpg",
    "categories": [],
    "word_count": 644,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "As the death toll climbed from wildfires raging in California, scientists confirmed on Friday that the world has just experienced the first year in which temperatures exceeded 1.5 degrees Celsius above pre-industrial times. The milestone was confirmed by the European Union's Copernicus Climate Change Service (C3S), which said climate change is pushing the planet's temperature to levels never before experienced by modern humans. \"The trajectory is just incredible,\" C3S director Carlo Buontempo told Reuters, describing how every month in 2024 was the warmest or second-warmest for that month since records began. The planet's average temperature in 2024 was 1.6oC higher than in the 1850-1900 pre-industrial period, C3S said. Last year was the world's hottest since records began, and the past ten years were the ten warmest. Wildfires are one of the many disasters that climate change is making more frequent and severe. Fires menacing Los Angeles have killed at least ten people and devoured nearly 10,000 structures. But while the impacts of climate change now affect people from the richest to the poorest on earth, the political will to address it has waned in some countries. US President-elect Donald Trump, who takes office on January 20, has called climate change a hoax, despite the global scientific consensus that it is caused by humans. Matthew Jones, a climate scientist at the University of East Anglia, said fire-prone weather such as that affecting California will keep increasing, \"so long as progress on tackling the root causes of climate change remains sluggish\". The main cause of climate change is CO2 emissions from burning fossil fuels. Recent European elections have also shifted political priorities towards industrial competitiveness, with some European Union governments seeking to weaken climate policies they say hurt business. EU climate commissioner Wopke Hoekstra said the 1.5oC breach last year showed climate action must be prioritised. \"It is extremely complicated, in a very difficult geopolitical setting, but we don't have an alternative,\" he told Reuters. The 1.5oC milestone should serve as \"a rude awakening to key political actors to get their act together\", said Chukwumerije Okereke, a professor of climate governance at Britain's University of Bristol. Britain's Met Office confirmed 2024's likely breach of 1.5oC while estimating a slightly lower average temperature of 1.53oC for the year. US scientists will also publish their 2024 climate data today. Governments promised under the 2015 Paris Agreement to try to prevent average temperatures exceeding 1.5oC, to avoid more severe and costly climate disasters. The first year above 1.5oC does not breach that target, which measures the longer-term average temperature. Buontempo said rising greenhouse gas emissions meant the world was on track to soon also blow past the Paris goal - but that it was not too late for countries to rapidly cut emissions to avoid warming from rising further to disastrous levels. \"It's not a done deal. We have the power to change the trajectory,\" Buontempo said. In 2024, Bolivia and Venezuela suffered disastrous fires, while torrential floods hit Nepal, Sudan and Spain, and heatwaves in Mexico and Saudi Arabia killed thousands. Climate change is worsening storms and torrential rainfall because a hotter atmosphere can hold more water, leading to intense downpours. The amount of water vapour in the planet's atmosphere reached a record high in 2024. Concentrations in the atmosphere of carbon dioxide, the main greenhouse gas, reached a fresh high of 422 parts per million in 2024, C3S said. Zeke Hausfather, a research scientist at US non-profit Berkeley Earth, said he expected 2025 to be among the hottest years on record, but likely not top the rankings. \"It's still going to be in the top three warmest years,\" he said. That's because while the biggest factor warming the climate is human-caused emissions, temperatures in early 2024 got an extra boost from El Nino, a warming weather pattern which is now trending towards its cooler La Nina counterpart.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}