{
  "article_id": "2025-01-10_e2e51485716b8606054de3ce6e261b5d",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884198/pia-resumes-flights-to-paris-today-following-four-year-hiatus",
    "retrieved_at": "2025-08-26T07:35:32.420Z"
  },
  "metadata": {
    "title": "PIA resumes flights to Paris today following four-year hiatus - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-10T01:54:45.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 405,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "RAWALPINDI: Pakistan International Airlines (PIA) is set to resume its direct flights to Paris today (Friday), marking the end of a four-and-a-half-year suspension. The first flight, PK-749, operated by a Boeing 777 (AP-BGK), will depart from Islamabad International Airport (IIAP) at 12:10pm, carrying 330 passengers and 14 crew members. The inaugural flight will be seen off by Aviation Minister Khawaja Muhammad Asif, secretary aviation, PIA CEO Air Vice Marshal Amir Hayat, the directors general of the Civil Aviation Authority and Pakistan Airport Authority, and other senior officials. To celebrate the relaunch, PIA has decorated the aircraft with a model of the Eiffel Tower on its tail and the slogan \"I Love Paris\" on the nose. The Boeing 777 has been prepared in line with European Union aviation standards. A PIA spokesman said the airline is now expanding its wings to Europe and will operate direct flights between Islamabad and Paris twice a week, on Fridays and Sundays. He said the new service has been well-received, with full bookings for the first two flights. \"We anticipate strong demand for this route in the coming months,\" he said. The spokesman insisted that this direct route to Paris addresses a long-standing demand from the Pakistani community in France and Pakistan, offering affordable fares and time savings. The airline has introduced a wireless in-flight entertainment system on the route, allowing passengers to access entertainment on their own devices. Additionally, PIA has partnered with Air France to provide onward connections to 21 destinations across Europe and the UK via Paris Charles de Gaulle Airport (CDG). \"PIA is committed to enhancing connectivity and ensuring convenient travel options for its passengers, both domestically and internationally,\" the spokesman said. The relaunch follows the European Aviation Safety Agency's (EASA) decision to lift the ban on Pakistani airlines operating in EU countries. The ban, which has been in place for over four years, was lifted recently, enabling PIA to resume services in Europe and the UK. As part of its ongoing fleet rejuvenation, PIA has reintroduced an ATR aircraft that had been in long-term storage. With the addition of this aircraft, PIA has strengthened its domestic operations, particularly on routes to Gilgit, Sukkur, Turbat and Gwadar. The airline is also focused on improving punctuality, with a target of achieving a 90 per cent on-time performance rate. The spokesperson claimed that PIA consistently meets this target on a daily basis. Published in Dawn, January 10th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}