{
  "title": "Emergency helpline launch to be one-stop relief point for people: PM",
  "link": "https://www.app.com.pk/national/emergency-helpline-launch-to-be-one-stop-emergency-relief-for-people-pm/",
  "date_published": "2022-03-02T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 2 (APP): Prime Minister Imran Khan Wednesday said that the launch of a universal emergency helpline in the country would be a one-stop emergency relief point for people in crisis.\nThe prime minister was chairing a review meeting on Pakistan Emergency Helpline (PEHEL)-911.\nThe prime minister was briefed that all the 36 individual emergency numbers for the provision of emergency services like fire brigade, police, health assistance, disaster recovery and motorway police etc; would be integrated into Pakistan Emergency Helpline (PEHEL)-911.\nA needy person will have to dial just 911 and the call center would forward the call to the relevant government agency.\nDuring the meeting, the prime minister observed that securing life and property of the people was their utmost priority.\nHe also directed the authorities concerned to take all necessary measures to ensure hiccup-free operations of the helpline through trial run and soft launch before its actual launch in the holy month of Ramazan.\nThe meeting was attended by SAPM on Political Communication Dr Shehbaz Gill, Chairman National Telecommunication Corporation (NTC) Engr. Miraj Gul, ED National Information Technology Board (NITB) Syed Hussnain Abbas Kazmi and other senior officers concerned.\nChief secretaries of Punjab, Sindh, Kyber Pakhtunkhwa, Balochistan, Gilgit Baltistan and Azad Jammu and Kashmir joined the meeting via video link.\nAs a part of Digital Pakistan Initiative, the project is a joint venture of Ministry of Information Technology & Telecommunication and Ministry of Interior.\nNational Telecommunication Corporation (NTC) and National Information Technology Board (NITB) of IT Ministry will provide necessary technical assistance and back-end infrastructure for the smooth execution of the project, whereas Interior Ministry is responsible for coordination among various emergency response services at the federal and provincial levels.",
  "retrievedAt": "2025-08-11T14:27:07.312Z"
}
