{
  "title": "Murad Saeed slams opposition over negative reaction on mega relief package",
  "link": "https://www.app.com.pk/national/murad-saeed-slams-opposition-over-negative-reaction-on-mega-relief-package/",
  "date_published": "2022-03-02T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP): Minister for Communications and Postal Services Murad Saeed on Wednesday said that the mega relief package announced by the Prime Minister has put the opposition in a fix as they have made a practice of criticizing the people friendly government for the sake of criticism.\nAddressing press conference regarding Pakistan People’s Party long march and current political situation, he said that government had announced historical mega relief package for the poor despite inflation at the global level.  The minister said that soon after announcement of the relief, the implementation process was started.\nThe minister said he was quite surprised on statements of opposition which was criticizing the government on reduction in oil and electricity prices instead of commending the initiative.   He said that there was difference in the priorities of Prime Minister Imran Khan and Opposition, adding that PM Khan has been focusing on facilitating the poor while the agenda of the opposition was to safeguard their money earned through unfair means.\nHe said that there was increase in the petrol prices at the global level but the government decided to slash the prices by Rs 10 with sole objective to accommodate and provide relief to the masses.  Murad Saeed said that similarly the prices of electricity were also reduced while the jobless graduates would also be facilitated through paid internships across the country.\nHe said that now people of Punjab province were being provided free treatment facility in phases under Sehat Insaf Card. He said that the provision of free medical  facilities is the prime responsibility of the state and the government will ensure this facility across the country without any discrimination.  He said that previous government had left economy in the ICU which was recovered by the present government and rescued from the default.\nHe said that the tax targets were also achieved successfully.  Murad Saeed said that Prime Minister Imran Khan’s initiatives including Sehat Insaf Card, Ehsaas, Panagahs and Kamayab Jawan programme were the actual pain for the opposition parties.\nHe said that unnecessary expenditures incurred from the public exchequer by former president Asif Zardari, ex-prime minister Nawaz Sharif and ex-prime minister Yousuf Raza Gilani.  The minister said that former President Asif Ali Zardari and former Prime Minister Nawaz Sharif spent millions of rupees on official visits from the national exchequer besides making private visits.\nHe said that Zardari undertook 48 private visits and Nawaz Sharif made 25 private visits from the national exchequer.  He said that apart from the Presidency and Prime Minister’s residences, they also turned private houses into camp offices and the national treasury was misused. He said that Prime Minister Imran Khan had no camp office, he made no private visit and was not staying at the Prime Minister House.\nHe said that money was spent from the national kitty for the Jati Umrah road, security, fencing and other things. The minister said Pakistan People’s party which has been ruling the Sindh province for the last 13 years had completely ignored development and betterment of masses and they failed to provide any relief to their people.\nHe said this all happens because mismanagement, corruption and in efficiency of current rulers of the province particularly PPP Co Chairman Asif Ali Zardari who is staunch supporters of corruption and is known as Mr. 10 per cent.Murad Saeed appealed the people to reject such people who had destroyed Sindh for their personal gains.\nHe said the PPP government had turned Karachi and other urban centres of Sindh into gutters and piles of heaps were being seen everywhere and cities’ roads were filled with sewage water.PPP government had destroyed education, health, law and order and all other institutions in Sindh, he added.He said that all the departments including educational institutions and health facilities were destroyed by the present Sindh government.",
  "retrievedAt": "2025-08-11T14:27:11.049Z"
}
