{
  "title": "Islamabad police become pioneer to provide facilities to public under one roof",
  "link": "https://www.app.com.pk/national/islamabad-police-become-pioneer-to-provide-facilities-to-public-under-one-roof/",
  "date_published": "2022-03-02T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP): Islamabad police have become the pioneering force in providing state-of-the-art facilities to the public under one roof round the clock which is being appreciated widely by the public.\nFor the first time in policing history of Pakistan, Islamabad police have been providing multiple services to people and a modern facilitation center at sector F-6/1 is functioning round the clock to provide state-of-the-art facilities to the public. The center remains open for the whole week and is serving round the clock. It provides various services to people related to police and traffic.\nFollowing the directions of Inspector General of Police (IGP) Islamabad Muhammad Ahsan Younas, this center has been made functional while women are being provided police-related services on priority. An entire floor at the Police Facilitation Center has also been allocated for women.\nThe public is availing 28 services including Character Certificate, General Police Verification, Tenant Registration, Missing/Lost Report, Foreigner Registration, Volunteer Registration, Servant Registration, Driving License Verification, Copy of FIR, and Vehicle Verification at any time of the day from their vehicle.\nPolice said that all of the already-provided services are available to the citizens round the clock and they are also able to avail new services including renewal of driving license through the drive-through facility.SSP (Traffic) Rai Mazhar Iqbal said that this facilitation center has been set up for the convenience of citizens.\nHe said that all resources would be utilized to provide better services to people and ensure the protection of their lives and property.",
  "retrievedAt": "2025-08-11T14:27:18.694Z"
}
