{
  "title": "PM wins hearts of poor by giving historical relief package: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/pm-wins-hearts-of-poor-by-giving-historical-relief-package-sheikh-rashid/",
  "date_published": "2022-03-02T11:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP): Minister for Interior, Sheikh Rashid Ahmed here on Wednesday said that Prime Minister Imran Khan has won the hearts of the poor people by giving historical relief package.\nAddressing the participants at World Civil Defence Day celebrations held at National Institute of Fire Technology, the minister said that Pakistan was pursuing a neutral foreign policy under the leadership of Imran Khan.\nHe said that the importance of civil defense was undeniable, adding that Civil defense had always been at the forefront of relief work particularly in natural calamity.\nThe minister said that the authorities of civil defense deserve tribute for their outstanding services, adding that civil defense now needs to be innovated and adapted to modern requirements.\nCongratulating Civil Defence, he said that the role of the organization in October 8 earthquake, and 1965 war was commendable.\nThe minister said that the Department should regularly conduct training sessions to impart training to the students in educational institutions of the provinces, adding that NGOs should also be trained in this regard.  He said that Australian team was threatened by sending fake messages and tried to sabotage its tour to Pakistan like they had done with New Zealand cricket team.\nTo a question about Pakistan Peoples Party’s Long March, the minister said that the opposition parties could not succeed to achieve their set goals and the PTI government would complete its constitutional term. He said, the government was trying to provide relief to the people and all available resources would be utilized to address poverty and inflation.\nThe Interior Minister said that three women universities were set up in Rawalpindi, adding, all-out efforts were made to promote female education in Rawalpindi.\nIn terms of education, Rawalpindi had also got the honor as the city which was earlier at 37th had reached at first position, he added.",
  "retrievedAt": "2025-08-11T14:27:09.758Z"
}
