{
  "title": "Farrukh hints at more relief to public in coming days",
  "link": "https://www.app.com.pk/national/farrukh-hints-at-more-relief-to-public-in-coming-days/",
  "date_published": "2022-03-02T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 2 (APP): Minister of State for Information and Broadcasting Farrukh Habib on Wednesday hinted that the government would provide more relief to the masses in coming days to mitigate their sufferings.\n“Inflation has risen around the world, big economies like the United States are bearing the brunt of Covid-19, but Prime Minister Imran Khan is committed to provide relief to masses,” he said while addressing a press conference here.\nFlanked by Minister for Industries and Production Khusro Bakhtiar, he said the prime minister announced a mega relief package for public, reducing the prices of petrol and diesel by Rs 10 per litre and electricity by Rs 5 per unit as he felt the pain of common man.\nFarrukh rejected the opposition’s claim that the PM’s relief package was an attempt to woo voters ahead of the 2023 general elections, insisting that the move was a part of the government’s strategy to roll out relief measures for different segments in phases.\nHe slammed the PML-N senior leader Shahid Khaqan Abbasi, for point scoring over the government relief measures instead of extending appreciation.\nThe minister said due to prudent policies of Imran Khan, the economy of the country was still flourishing even after being hit by the pandemic of Covid-19.\nHe said Federal Board of Revenue (FBR) had collected taxes amounting to Rs 3799 billion during the first eight months of the current fiscal year (July-February), posting a 30 per cent increase in tax collection as compared to the same period of the last year.\nPakistan Muslim League-Nawaz (PML-N) government, during its last year in power (2018), had collected taxes of Rs 3800 billion, he added.\nFarrukh said opposition parties had lost their reputation at home and abroad due to their alleged corruption, adding it posed no genuine threat to the elected government of Pakistan Tehreek-i-Insaf (PTI).",
  "retrievedAt": "2025-08-11T14:27:11.152Z"
}
