{
  "title": "37 Sri Lankan students arrive in Pakistan for Undergraduate, Postgraduate studies",
  "link": "https://www.app.com.pk/national/37-sri-lankan-students-arrive-in-pakistan/",
  "date_published": "2021-12-14T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): Thirty seven Sri Lankan students, out of a total of 340 students selected for scholarships under Pak-Sri Lanka Higher Education Cooperation Programme of the Higher Education Commission (HEC) have arrived in Pakistan to study at undergraduate and postgraduate levels.\nThe students have reached Pakistan in two separate groups, comprising 19 and 18 students respectively.\nBesides, 200 other Sri Lankan students have applied for visas and will join their respective universities in Pakistan soon.\nThe scholarships are part of the Pakistan-Sri Lanka Higher Education Cooperation Programme.\nThe programme is aimed to further strengthen the relations between the two countries and bring people of both the nations closer.\nThe selected students will pursue their BS, MS or PhD studies in public sector universities of Pakistan. Scholarships are offered in all major disciplines including Medicine, Engineering, Business Studies, Natural Sciences, and Social Sciences, etc.\nHEC, in collaboration with Pakistan High Commission Colombo and University Grants Commission (UGC) of Sri Lanka, held the tests in different cities of Sri Lanka. Over 700 students had appeared in written tests from across Sri Lanka.\nAll Sri Lankan students, having the minimum qualification required to take admission in undergraduate and postgraduate studies, are eligible for these scholarships. A high school diploma or equivalent is required for admission in BS programmes.\nAnd, for MS programmes, students should have a four-year undergraduate degree or Bachelor’s and Master’s degree (16 years of education).\nSimilarly, for PhD studies, students should have a Master’s or MPhil degree (18 years of education).",
  "retrievedAt": "2025-08-11T21:42:53.489Z"
}
