{
  "title": "PNS ALAMGIR visits Ghana’s Port Tema; established free medical camp",
  "link": "https://www.app.com.pk/national/pns-alamgir-visits-ghana-established-free-medical-camp/",
  "date_published": "2021-12-14T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): Pakistan Navy Ship (PNS) ALAMGIR on Tuesday visited Tema, Ghana and established free Medical Camp as goodwill gesture from people of Pakistan.\nUpon arrival at Tema port, the Ship was received by Defence Attaché of Pakistan at Ghana and senior officials from Ghana Navy, said a Pakistan Navy news release here received.\nDuring the port visit, Mission Commander along with Commanding Officer of PNS ALAMGIR called-on Ghana Military leadership including Chief of Defence Staff, Chief of the Naval Staff and Eastern Naval Commander.\nDuring the interactions, matters of mutual interests were discussed and enhancement of bilateral ties in all spheres were re-affirmed.\nTaking the opportunity, Mission Commander conveyed good wishes of Chief of the Naval Staff for the people of Ghana in general and the Ghana Navy in particular.\nMission Commander also extended gratitude for the whole-hearted support provided by Ghana authorities for visit of Pakistan Navy Ship ALAMGIR.\nAs a goodwill gesture and to extend humanitarian assistance, free Medical Camp was established by Pakistan Navy.\nA specialized team of Pakistan Navy doctors and paramedics provided medical treatment and medicines to over 3000 patients.\nThe implementation of COVID-19 SOPs was ensured during the Medical Camp. Establishment of free Medical Camp by Pakistan Navy was widely appreciated by the local populace.\nUpon completion of port visit, PNS ALAMGIR conducted bilateral passage exercise with Ghana Navy Ship to enhance interoperability between the two navies.\nThe on-going deployment is aimed at fostering friendly ties with African countries, enhancing naval collaboration, extending humanitarian assistance and developing interoperability with the host navy.",
  "retrievedAt": "2025-08-11T21:42:55.055Z"
}
