{
  "title": "Pakistan set to welcome OIC FMs",
  "link": "https://www.app.com.pk/national/pakistan-set-to-welcome-oic-fms/",
  "date_published": "2021-12-14T11:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): Pakistan is looking forward to welcoming the foreign ministers to Islamabad for the 17th Extraordinary Session of the  Organization of Islamic Cooperation (OIC) Council of Foreign Ministers on Afghanistan on December 19, Foreign Minister Shah Mahmood Qureshi said Tuesday.\nThe foreign minister, in a tweet, extended a welcome to the foreign ministers of OIC states who will be arriving in Pakistan for the upcoming meeting.\nPakistan is in high gear to host the foreign ministers of the OIC countries, with preparations underway in the capital ahead of the main event of December 19.\nAs Pakistan continues with its efforts to uphold Muslim solidarity, the 17th Extraordinary Session of the OIC Council of Foreign Ministers (CFM) will focus on the urgent need to avert a humanitarian crisis and the economic collapse of Afghanistan.Islamabad is set to welcome the foreign ministers of OIC countries to discuss the Afghan humanitarian situation on December 19. (Video by Ministry of Foreign Affairs, Pakistan)\nFor the OIC CFM meeting, the Parliament House has been selected as the venue, where the plenary sessions will be held.\nOn December 19, Prime Minister Imran Khan will inaugurate the event, to be attended by the OIC Secretary-General, foreign ministers of the Islamic countries and other international delegates.\nThe representatives from the United Nations system, international financial institutions, foreign and regional organizations and the non-OIC members have also been invited to attend the event.\nEarlier on December 18, Foreign Minister Shah Mahmood Qureshi will host dinner for the visiting OIC foreign ministers.\nThe print and electronic media, both local and foreign, have also paced up their momentum to highlight the importance of the upcoming OIC CFM’s Extraordinary Session, being held in the wake of a serious humanitarian situation in Afghanistan.\nFor the facilitation of local and foreign journalists, the government has established two media centres, i.e., at the main venue and at the hotel of stay of foreign media persons.Pakistan has played an active role for Muslim solidarity being the founding member of OIC since 1969.(Video by Ministry of Foreign Affairs, Pakistan)\nAccording to UN estimates, 60 percent of Afghanistan’s 38 million people face “crisis levels of hunger” and that situation is getting worse every day.\nThe World Food Programme has warned that 3.2 million children are at risk of acute malnutrition. According to UNHCR, 665,000 people have been newly displaced within Afghanistan between January and September 2021 – in addition to the 2.9 million people already internally displaced in that country.\nThe experts believe that the advent of winter is further exacerbating the situation, which if left unattended, could aggravate a major humanitarian crisis.\nAfter Saudi Arabia convened the 17th Extraordinary Session on November 29 on the Afghan situation, the decision of Pakistan to host the event was bound by fraternal bonds of amity and brotherhood with the people of Afghanistan.\nIn recent years, Pakistan has facilitated Afghanistan by opening new border crossing-points and operationalizing Torkham border on 24/7 basis, and waiving visa processing fee for Afghan applicants till December 31, 2021.\nAfter the US withdrawal from Afghanistan, Pakistan has facilitated the evacuation of 80,000 individuals of 42 nationalities including diplomats, representatives of international NGOs, and media.\nAt the OIC CFM meeting, the OIC and member states will galvanize other international actors to come forward and extend a helping hand to the Afghan people.\nThe upcoming Extraordinary Session in Islamabad is expected to provide an opportunity to consider practical arrangements and concrete steps to help address the humanitarian needs of the Afghan people.",
  "retrievedAt": "2025-08-11T21:42:56.004Z"
}
