{
  "title": "Govt taking pragmatic steps for welfare of overseas Pakistani: Rana Sanaullah",
  "link": "https://www.app.com.pk/national/govt-taking-pragmatic-steps-for-welfare-of-overseas-pakistani-rana-sanaullah/",
  "date_published": "2022-08-16T18:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP): Minister for Interior Rana Sanaullah on Tuesday said that Pakistan Muslim League (PML-N) led government was taking pragmatic steps for welfare of overseas Pakistani.\nAddressing Pakistani Community at Jeddah, the minister said oversea Pakistani were our great national asset who played key role in strengthening of country’s economy through their remittance.\nPML-N always provided best facilities to the overseas Pakistani during its tenure, he added.\nHe said modalities were being finalized to enable overseas Pakistan to cast their votes in the next general elections. All Pakistani residing in Saudi Arabia were eligible to cast their vote adding that necessary legislation would be carried out in this regard, he said.\nHe said E-Passport facility was also being extended to the ordinary Pakistani. The E-Passport would help facilitate ordinary Pakistani in immigration and getting visa, he added.\nHe said the government would soon fetch out the country out of economic crisis under the leadership of Prime Minister Shehbaz Sharif. The government has to take tough and unpopular decision in national interest while putting its politics at stake, he said.\nThe minister said the coalition government rescued the country from the imminent economic bankruptcy. Saudi Arabia was Pakistan’s best friend and brethren country which always helped Pakistan generously at all odd times.\nHe said PML-Q Quaid Nawaz Sharif would lead the party in the electioneering campaign in next general elections.\nComing hard on Imran Khan, he said country could not afford ‘Imrani Fitna’ chaos and political anarchy. The government would complete its constitutional term adding that the next general elections would be held as per the schedule, he added.\nHe said the government was taking practical steps to reduce the inflation gradually besides provide relief to the masses.\nThe minister thanked the Saudi government for providing employment to Pakistani workers and professional.\nPakistani Ambassador to Saudi Arabia Amir Khurram Rathore and others also spoke on the occasion.",
  "retrievedAt": "2025-08-11T15:24:40.568Z"
}
