{
  "title": "Govt takes corrective measures to stabilize economy: Shazia Marri",
  "link": "https://www.app.com.pk/national/govt-takes-corrective-measures-to-stabilize-economy-shazia-marri/",
  "date_published": "2022-08-16T13:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP):Federal Minister for Poverty Alleviation and Social Safety, Shazia Marri on Tuesday said that the government was taking correct measures to stabilize the economy.\nAddressing a conference on economy, the federal minister said that despite several interventions in the political system of Pakistan and the war against terrorism and extremism, we as a nation were strong enough to stand for our country and put it on the path of progress and stability.\nQuoting the famous sayings, Shazia Marri said someone rightly said that “strong economy is a source of national strength”. “Economy is the start and end of everything and you cannot bring any reform unless you have a strong economy”, she said.\nShe said, “We are member of global comity. I am very happy to express gratitude to our international friends who always extended help to us in difficult times like disasters or calamities”.\nBriefing about her ministry, Shazia Marri said that her ministry is working diligently to improve the socio-economic status of the poor. “All the shocks that economy has to face ultimately affect the living conditions of poor segments of the country the most”.\nMentioning the alarming indicators faced by the country, the minister said that Pakistan is ranked among 43 countries which are most exposed to poverty while 54 percent of its population is vulnerable to poverty due to health shocks.\nShe mentioned that around 52 million people in the country are living below poverty line while 30 percent of the households experience food insecurity so the whole state of economy impact the population of the country as well as poverty ratio.\nThe minister elaborated that Benazir Income Support Program, initiated in 2008, was the brain child of Shaheed Mohtarma Benazir Bhutto.\nThe program provides financial support and other facilities to the eight million families. The basic criterion of this program is to register the women member of the household for extending the benefits.\nShe said that since the country inherited a destabilized economy from the previous government and recorded 38.2 billion dollar trade deficit when came into power, we have to take correct measures to ensure stability of economy and ensure the poor people graduate out of poverty.\nShazia Marri observed that IMF study estimates that Pakistan’s GDP can increase nearly 33 percent if women contribution towards the labour force is close towards the men participation.\nQuoting a study of International Labour Organization, she said that if Pakistan reduces gender gap in female participation and labour force by 25 percent, its GDP can increase up to nine percent.\nThe federal minister also emphasized the need to incentivize the agriculture sector to increase the production level.",
  "retrievedAt": "2025-08-11T15:24:44.952Z"
}
