{
  "title": "Agthia’s net profit surges to 74% on strong H1’22 results",
  "link": "https://www.app.com.pk/national/agthias-net-profit-surges-to-74-on-strong-h122-results/",
  "date_published": "2022-08-16T08:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP):The Agthia Group PJSC, one of the region’s leading food and beverage companies, has announced that its first half (H1) of 2022 net revenues grew to United Arab Emirates Dirham (AED) 2 billion that recorded a 51% year-on-year growth in net revenues compared with the same period in 2021.\nThe group net profit attributable to shareholders grew to AED 118 million for the period, a 74% increase relative to H1 2021 which reflected the impact of the Group’s recent acquisitions as well as its cost optimization efforts as part of its five-year growth strategy, a news release received here on Tuesday said.\nIn his comments, Chairman of Agthia Group, Khalifa Sultan Al Suwaidi said, “Agthia’s first half results demonstrate the increasing benefits of our growth strategy to strengthen our Food and Beverage (F&B) leadership in the Middle East and beyond. The acquisitions we have completed over the past year have not only delivered strong top-line growth but also contributed to enhanced profitability. Our confidence in Agthia’s capability to continue delivering tangible value for shareholders and stakeholders remains steadfast.”\nSimilarly, commenting on the achievement, Chief Executive Officer of Agthia Group, Alan Smith said, “We have made significant progress in H1 2022. In the first quarter, our focus was on the consolidation of acquired entities, and in the second quarter we turned our attention towards accelerating synergy extraction and Group integration, which helped us offset higher direct costs and M&A (mergers and acquisitions) related expenses, while minimizing the impact of supply chain disruption and tackling market volatility and inflation, all without compromising on the quality of our products.”\nIt added that from a financial perspective, Agthia’s Consumer Business Division continued to display substantial growth of 71% compared with the previous year, now accounting for 73% of total group sales at AED 1.5 billion. The Protein and Frozen segment contributed AED 570 million, of which AED 493 million was collectively added to the top line through the strategic acquisition of protein businesses in Jordan and Egypt last year.\nSnacking added AED 417 million to the top-line, being the first period to include BMB Group sales which contributed AED 149 million. Water & Beverage, and Other Food items, recorded revenues of AED 475 million. Revenue in the Agri-business division for the quarter stood at AED 534 million, a 15% gain relative to 2021.\nThe Group’s total assets stood at AED 6.3 billion as of 30th June 2022, while total shareholders’ equity for the period stood at AED 2.8 billion.\nAgthia’s Board of Directors is recommending a cash dividend equivalent to 8.25 fils (AED) per share for the first half of 2022, subject to shareholder and regulatory approvals.\nAgthia is a leading Abu Dhabi-based food and beverage company. Established in 2004, the Company is listed on the Abu Dhabi Securities Exchange (ADX) and has the symbol “AGTHIA”. Agthia Group PJSC is part of ADQ, one of the region’s largest holding companies with a broad portfolio of major enterprises spanning key sectors of Abu Dhabi’s diversified economy.",
  "retrievedAt": "2025-08-11T15:24:49.543Z"
}
