{
  "title": "HEC organises orientation session",
  "link": "https://www.app.com.pk/national/hec-organises-orientation-session/",
  "date_published": "2023-08-30T12:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP):The Higher Education Commission (HEC) held an orientation session for the first batch of 30 focal persons from 23 universities to provide them with a training on the Undergraduate Education Policy (UEP) V1.1.\nOrganised by HEC Curriculum Division, the training session was attended by Executive Director HEC Dr. Shaista Sohail as chief guest. Advisor (Academics & Curriculum) Engr. Muhammad Raza Chohan chaired the session.\nIn his briefing on the policy, Advisor (Academics & Curriculum) HEC highlighted the transformation process linking the previous policies and frameworks used by HEC for undergraduate degree programmes from 2002-2020.\nHe briefed about the participatory approach carried out in revamping the UEP 2020 by involving all the universities and relevant stakeholders including accreditation councils in the feedback process while finalising the UEP Ver 1.1.\nDeputy Director HEC Hidayatullah Kasi shared a detailed presentation on the policy items related to admission, nomenclature of the degree programme, academic advisory to students, purpose and offerings of General Education courses, credits dedicated for Major, Inter-disciplinary and minor courses, degree offerings with Single Major, Single Major with One Minor, Single Major with Double Minor and Double Major, the mandatory components of Capstone project and credited field experience.\nBesides, the structure of Associate Degrees and lateral entry in BS/equivalent programmes was discussed in detail.\nFinally, the policy item related to Exit from four-year degree programs in the form of Associate Degree under certain circumstances were briefed to the participants.\nThe participants put forth their points to the team of Curriculum Division regarding different aspects of the policy for clarifications.\nAll the queries were addressed one by one after thorough discussion.\nDirector Curriculum, Ms. Dur e Shahwar briefed the house that a pool of Frequently Asked Questions has already been developed by HEC, which will be placed on HEC website for guidance of the Institutions, faculty, students, and employers.\nThe same shall be expended as and when new queries are received needing guidance from HEC. All the participants fully participated in the interactive session.\nAddressing the closing ceremony, Dr. Shaista Sohail appreciated the role of all participating universities who provided their feedback while giving final shape to the UEP V1.1.\nShe particularly emphasised the fast-changing market demand in terms of skills and discussed how the undergraduate education policy could help the students in this regard.\nShe appreciated the efforts of all the participants and asked them to play their key role in implementing the policy across all departments in their respective universities.",
  "retrievedAt": "2025-08-11T09:23:01.178Z"
}
