{
  "title": "First Lady hails positive role of media in promoting awareness for ‘Breast cancer’",
  "link": "https://www.app.com.pk/national/first-lady-hails-positive-role-of-media-in-promoting-awareness-for-breast-cancer/",
  "date_published": "2023-08-30T08:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): First Lady of Pakistan, Begum Samina Arif Alvi Wednesday hailed the supporting role played by the media in promoting awareness drives to educate and motivate women in remote areas for self-examination voluntarily seek early diagnosis of breast cancer.\nIn an exclusive interview with PTV news channel, she underlined the need for continuous mass awareness campaigns through print, electronic and social media, especially for sensitization of women and girls in far-flung areas of the country about its symptoms, self-examination, diagnosis and treatment options.\n“If women are being diagnosed with breast cancer, they do not even share the news with their family members”, she added.\nWomen in Pakistan lacked appropriate awareness about diagnosis and treatment for breast cancer due to a range of multifaceted barriers, however now women are much more confident and approach doctors in the early stages, she mentioned.\nShe stressed that the healthcare system should also pay more attention to socio-psychological and cultural factors impeding women’s access to available health facilities in rural areas.\nReplying to a question, she regretted that women are still neglecting society’s priorities, adding, that unaware women in remote areas of Pakistan are the main target group in awareness drives as they are the ones who are at a higher risk of developing breast cancer because they neglect the symptoms due to lack of awareness which leads to progression of the disease and may prove lethal.\nTo another question about mental health, she stressed the need for raising awareness about mental health and the need to increase the number of mental health professionals, besides strengthening the capacity of general health professionals by training them to address the challenge of rising mental health disorders.\nThe total number of psychiatrists available in Pakistan ranges between 500 and 600 which is not satisfactory, she added.\n“The government started an initiative to provide consultative services of relevant practitioners and groups for cure purposes to citizens having psychological issues such as self-harming thoughts and depression”, she added.\nShe also stressed adopting the joint family system to address mental health issues.\nTo another question, she warned that accessive use of social media platforms is a main contributor to depression, anxiety and other problems in the nation’s young population.\nTalking about special persons awareness drives she said the government’s vision is focused on improving the conditions of weaker people in society or those unfortunate who have been suffering from various issues, adding that, the welfare of special persons is a big challenge and all segments of the society need to work for it collectively.",
  "retrievedAt": "2025-08-11T09:22:52.200Z"
}
