{
  "title": "ECP assures ANP of mid-February elections, chance for earlier date",
  "link": "https://www.app.com.pk/national/ecp-assures-anp-of-mid-february-elections-chance-for-earlier-date/",
  "date_published": "2023-08-30T12:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): The Election Commission of Pakistan (ECP) Wednesday assured representatives of Awami National Party (ANP) that the general elections could be held by mid-February, and if the constituency delimitation was completed earlier, the elections might take place sooner.\nIn a consultative meeting with the ECP to outline the election roadmap, the ANP has requested that if conducting the election within 90 days was not feasible, they be provided with the election date and schedule.\nAfter a meeting with the ECP, Mian Iftikhar conveyed that the Election Commission affirmed its readiness for mid-February elections and expressed its commitment to fast-track constituency delimitation to potentially enable earlier elections.\nANP leaders Mian Iftikhar Hussain and Zahid Khan conveyed that they had expressed the party’s viewpoint.\nThey highlighted that, in accordance with the constitution, holding the election within 90 days was obligatory.\nThey mentioned that the ANP was not extended an invitation to the Council of Common Interests (CCI) meeting.\nIn response, the ECP highlighted that once the census is sanctioned, the creation of new constituencies becomes unavoidable.\nMian Iftikhar pointed out that the assembly’s premature dissolution, occurring shortly before its tenure completion, led to a month-long delay in fresh elections.\nMian Iftikhar said that the dissolution of the assembly, a few days earlier before completion of tenure was the reason to delay by one month.\nMian Iftikhar said that the Election Commission had assured that they were ready for the elections by mid-February and it was told that they would try to complete the constituencies delimitation quickly so that the elections could be held earlier.\nHe stressed the need for a level playing field among all parties.\nZahid Khan communicated to the Election Commission their reservations regarding the digital census, citing a decline in Peshawar’s population following its introduction.",
  "retrievedAt": "2025-08-11T09:23:02.987Z"
}
