{
  "title": "Six out of ten deaths in Pakistan due to NCDs caused by sugary drinks: Experts",
  "link": "https://www.app.com.pk/national/six-out-of-ten-deaths-in-pakistan-due-to-ncds-caused-by-sugary-drinks-experts/",
  "date_published": "2023-08-30T12:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP):The experts on Wednesday said the country was suffering from a very high percentage of non-communicable diseases (NCDs), most of them caused by food and beverages that were not fit for human health and according to a 2016 World Health Organization (WHO) study, six out of ten deaths in Pakistan happen due to NCDs, including three out of ten deaths by cardiovascular diseases (CVDs).\nSimilarly, according to the National Diabetes Survey conducted in 2016-17, every 4th adult in Pakistan was suffering from Type-2 diabetes, whereas the International Diabetes Federation (IDF) estimated in 2021 that Pakistan had the 3rd highest burden of type-2 diabetes worldwide with more than 33 million cases with additional I0 million termed as pre-diabetic. Unhealthy food supply and consumption also contribute to the growing number of overweight people. It was especially worrying that the number of overweight children had doubled between 2011 and 2018, and the problem might have worsened in recent years due to a lack of effective regulations or their enforcement by respective authorities.\nThese disturbing statistics were shared by experts during a training workshop for journalists on “Understanding TFAs, Policy, Human Health, and Reporting”, which was organized by the Centre for Peace and Development Initiatives (CPDI) with the support of Global Health Advocacy Incubator (GHAI), a news release said.\nThe training was conducted by prominent health experts and journalists including Munawar Hussain from GHAI, Dr. Khawja Masood, National Coordinator, Food Fortification Alliance, Zeeshan Haider, and  Waqar Bhatti.\nThey informed the participants about the major dietary risk factors such as the high percentage of trans fatty acids (TFAs), sugar, and sodium in the food supply and dietary practices. For example, Pakistan’s TFA intake is estimated to be the 2nd highest in the WHO’s EMRO (Eastern Mediterranean) region, as it is about 6% of daily energy intake. The experts shared findings of numerous research studies, which highlight that the consumption of industrially produced trans-fatty acids (iTFAs) significantly contributes to the incidence of NCDs. It was also highlighted that inappropriate and unhealthy dietary practices, including higher consumption of TFAs, are responsible for increasing rates of NCDs such as diabetes, hypertension, cardiovascular diseases, cancers, and other chronic diseases in Pakistani population.\nThe participants were informed that the Government of Pakistan has recently taken steps to regulate production and supply of certain types of unhealthy food. For example, the Government has notifiedthat the limit of TFAs cannot be more than 2g per 100g of fat in Vanaspati, shortenings, bakery fats, bakery ware, rusk, and breads. It is a significant step forward, although certain gaps remain, as all types of food are still not covered by this regulation. It is also yet to be seen if the notified standard will be effectively implemented across Pakistan without any delay. More effective regulations and policy measures are also needed to reduce the consumption of sodium and sugar.\nThe workshop was attended by over 20 journalists from Islamabad, Rawalpindi, Karachi Quetta, Peshawar, and Lahore who got the opportunity to not only learn about the health-related challenges and the relevant major dietary risk factors but also about effective ways of reporting on such issues.\nIn his opening remarks, Executive Director of CPDI, Mukhtar Ahmed Ali emphasised the importance of more media attention to unprecedented health related challenges being faced by the people of Pakistan. He said that all stakeholders including media, government departments and civil society organizations must establish cooperative mechanisms to jointly work for public health, especially through public awareness, appropriate policies and regulations, and effective enforcement of food supply standards. Afshaar Iqbal from PYCA emphasized on the importance of local languages to communicate messages of TFA free food and good health. At the closing of the workshop,  Zaigham Khan said that journalists can influence attitudes on the one hand and policy on the other. They can also be a check on corporate greed”. “Therefore, they must remain alert about diseases and methods of prevention in the case of non-communicable diseases”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:23:23.167Z"
}
