{
  "title": "Pakistan’s economic uplift linked with IT development: President",
  "link": "https://www.app.com.pk/national/pakistans-economic-uplift-linked-with-it-development-president/",
  "date_published": "2023-08-30T09:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP):President Dr Arif Alvi on Wednesday stressed the need to equip the youth with skills of latest technology saying that the Pakistan’s economic uplift was linked with the development of Information Technology in the country.\nHe said Pakistan had become the second largest free lance market in the world, however the people were facing issues related to financial transactions.\nHe underlined that by easing the financial movement and financial transactions in Pakistan, the country’s economy could further boost and its GDP growth rate could increase by 2-3%.\nAddressing the closing ceremony of Huawei ICT (Information and Communication Technologies) competition 2022-23 here, the president said IT had now become unavoidable part of almost every filed of life. He informed that Huawei was going to open its global service center in Pakistan which would create employment opportunities besides ensuring technology transfer to the youth of the country.\n“This ICT Competition Program from Huawei speaks volumes of the efforts made in the past decade and how this Industry-Academia Relationship has been thriving towards providing the solid backbone towards the ICT Industry of Pakistan”, he added.\nThe president stressed that the universities should arrange boot camp in the campuses to train the university graduates and make them ready for the market.\nHe also urged the universities to start two-year undergraduate associate degree programs for the students as the growing technology around the globe does not need degrees but skills.\nHuawei Technologies held the closing ceremony of Huawei ICT Competition 2022-23 here at the Aiwan-e-Sadar, celebrating the success of the Pakistani teams that brought home prizes in the regional competitions.\nThe students from Pakistan had won second and third prize in the Network Track and third prize in the Innovation Track at the Huawei ICT Competition 2022-2023 Global Final concluded at Huawei Headquarters in Shenzhen, China. The first to be held in person since 2019, the event’s culmination was a competition between finalists in 146 teams from 36 countries.\nThe president said in today’s time, every person irrespective of which filed he or she was in, should be familiar with the basics of modern technology including Artificial Intelligence, IT, and clouding etc.\nHe said the political and bureaucratic leadership must also be equipped with the basic skills of IT and modern technology.\nHe said a program was initiated by the government to train 1000 bureaucrats in IT field but despite several years, only 800 received the required training due to lack of will by the officers.\nExpressing disappointment over a high rate of out of school children in the country, the president said 27 million or 32% children were out of school. The government, he said would need to build 55000 new schools to accommodate all the children which would need huge resources.\nTherefore, he said the online education system should be launched to address the issue on emergency basis. He said knowledge was no more in the books but it was in the clouds that did not need any specific infrastructure.\nHe said the government had launched Prime Minister Digital Skills Programme under which 2.2 million people got the free IT training.\nPresident Alvi said the youth should not be worried about the country’s weak economic situation as it would get better soon but they should continue focusing on developing their skills. “Use your talent and grow up in the world”, he advised the youth.\nHe said women in Pakistan were culturally not very active in outdoor activities, so this platform was an ideal way for them to earn money while sitting at home.\nEarlier, Dr. Alvi presented the second prize certificate in the Network Track to Muhammad Faeez Ali, Asad Anwer from Mehran University of Engineering and Technology, Jamshoro and Maryam Fareed from Lahore College for Women University.\nCaretaker Minister for IT and Telecommunication Dr Umar Saif said Pakistan was blessed with immense potential and talent in the shape of youth that comprised of around 67% of total population.\nHe said the South and East Asia was now becoming center of gravity in science and technology, and Pakistan was considered as the rising power in the region.\nDr. Saif commended Huawei for its exemplary contributions, saying, “Huawei is one of the leading technology giants in the world and has a large footprint in Pakistan. We all agree that artificial intelligence, big data etc. is the future. With technical support from state-of-the-art companies like Huawei, we can train our youth to introduce digitization in Pakistan, this training having been a crucial step in that direction.”\nPresident Public Affairs and Communication Huawei Technologies Middle East and Central Asia Wang Shunli said the Huawei ICT Competition 2022-2023 attracted 120,000 students from over 2,000 universities and colleges across the globe.\nThe objectives of the competition, he said were to encourage knowledge transfer in latest technology such as 5G, Artificial Intelligence and Clouding etc to the Pakistani talented youth. He said the competition also helped promoting digital transformation and sustainable development for both business and the society in Pakistan.\n“The achievements of Pakistan students and teachers have made, reflect on the great vision and determination of Pakistan government towards ICT talent nurturing, innovation and technology adaptation”, he added.",
  "retrievedAt": "2025-08-11T09:22:49.628Z"
}
