{
  "title": "No country allows stay of illegal immigrants: Solangi",
  "link": "https://www.app.com.pk/national/no-country-allows-stay-of-illegal-immigrants-solangi/",
  "date_published": "2023-10-07T16:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 07 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi reiterated on Saturday said that no government would permit the stay of illegal immigrants in their country.\nTalking to a private TV channel, the minister clarified that individuals with legal rights could only reside in Pakistan.\nHe mentioned three categories of Afghan residents residing in Pakistan currently. The first group comprised of individuals who arrived in Pakistan in 1978 and had Proof of Registration cards. While the second category included those Afghans who had been in Pakistan since 2016 and had Afghan citizen cards verified by the previous government of Afghanistan.\nThe third group, totaling approximately 1.7 million people, entered Pakistan after August 15, 2021, he said, adding among them, some possessed expired visas, while others had entered the country illegally.\nTo a query, he said most of the illegal immigrants in Pakistan were from Afghanistan.\nSolangi emphasized that the illegal immigrants must voluntarily leave Pakistan by October 31, as the caretaker government was committed to implementing the law.\nHe stressed that the national interest could not be compromised for the sake of bilateral relations, underscoring that action would be taken indiscriminately against illegal activities.\nThe minister said a recovery amounting to Rs16 billion was made in the government’s crackdown against electricity theft.\nHe also highlighted the positive impact of administrative actions, leading to a significant reduction in the prices of essential commodities such as oil, sugar, wheat flour, and fertilizer.\nSolangi reassured the public that the caretaker government was dedicated to the betterment of the country and affirmed their responsibility to continue taking necessary actions.\nIn response to another query about the upcoming elections, the minister said that the Election Commission of Pakistan bore the responsibility for conducting free, fair, and transparent elections in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:59:24.843Z"
}
