{
  "title": "IPP announces worker conventions, public gatherings from October 13",
  "link": "https://www.app.com.pk/national/ipp-announces-worker-conventions-public-gatherings-from-october-13/",
  "date_published": "2023-10-07T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 07 (APP):Istehkam-i-Pakistan Party (IPP) Central Information Secretary, Dr. Firdous Ashiq Awan on Saturday announced that the party will hold worker conventions and public gatherings across the country from October 13.\nAddressing a press conference, she said, “Under the leadership of Jahangir Khan Tareen and party president Abdul Haleem Khan, IPP has decided to organize worker conventions and public gatherings from October 13 throughout the country. These public gatherings will demonstrate that IPP represents the public at the grassroots level.”\nFollowing the party’s registration with the Election Commission of Pakistan (ECP), she said IPP is embarking on a journey dedicated to serving the people of Pakistan.\nDr. Awan emphasized that with the support of the masses, IPP aimed to fulfill the dreams of Allama Muhammad Iqbal and Quaid-e-Azam Muhammad Ali Jinnah for a prosperous Pakistan.\nShe regretted that while some parties have promoted the slogan of “respect the vote,” for their interest IPP will give “respect to the voters,” who are the real stakeholders in the progress, prosperity, and development of the country.\nShe further emphasized that the country required leadership that serves public and national interests rather than advancing personal agendas.\nIPP is determined to lead the nation towards progress, prosperity, and development. Dr. Awan added.\n“The objective of IPP’s politics is to unify politics and the state and bring the public together on one platform for the betterment of the country.”\nShe said, IPP aimed to unite a nation divided along religious and political lines, harnessing the power of the people for the progress and prosperity of Pakistan. She said the party’s manifesto revolves around working towards the country’s progress while seeking the trust and input of the public.\nDr. Awan stressed that the nation currently needed parties focused on delivering services rather than those relying solely on slogans. She welcomed and endorsed the decisions of the Special Investment Facilitation Council (SIFC), and said, “We support and endorse all the policies and initiatives of SIFC.”\nAccording to her, SIFC holds the potential to attract both foreign and domestic investment into Pakistan, contributing significantly to the country’s development and economic strengthening.\nDr. Awan believed that SIFC is a national initiative aimed at promoting Pakistan’s development and progress, with the potential to strengthen the country’s economy.\nAccording to Dr. Awan, a strong economy is essential for ensuring the nation’s security. She expressed her confidence that the decisions made by SIFC will contribute to the country’s progress.\nAdditionally, Dr. Awan endorsed the decisions of the apex committee on the National Action Plan regarding action against illegal immigrants, asserting that these immigrants have consistently worked against Pakistan’s interests. She emphasized the need to utilize all available resources for the well-being of Pakistanis rather than serving other’s interests\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:59:55.885Z"
}
