{
  "title": "PAC to hold an exclusive meeting on Railways issues",
  "link": "https://www.app.com.pk/national/pac-to-hold-an-exclusive-meeting-on-railways-issues/",
  "date_published": "2021-07-05T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 5 (APP): The Public Accounts Committee (PAC) on Monday decided to hold an exclusive meeting on the matters related to Pakistan Railways’ overall performance, functioning and initiatives.\nThe committee meeting held here at Parliament House under the chairmanship of Rana Tanveer Hussain, MNA.\nThe committee also examined the audit report for the year 2019-20 of Ministry of Railways.\nChairman of the committee expressed concerns over the recent fatal accident and directed Pakistan Railways to conduct a detailed inquiry in this regard.\nHe said that Railways should bring improvement in its overall system to reduce such tragic accidents.\nDuring audit of the Railways Estate Development and Marketing Company (REDAMCO) in June 2019, it was observed that a piece of land measuring 13,599 Sq.ft (1511 SqYd) at Wazir Mansion Station, Marri Pur Road, Karachi was offered for commercial exploitation on 33 years on rental basis during April 2009.\nAudit was of the view that the rental ceiling had been ascertained by Pakistan Banking Association accredited valuator, PR Management could have generated more revenue.\nThis resulted in irregular leasing of Railway land amounting to Rs. 612.99 million for 33 years.\nThe committee referred the audit para to National Accountability Bureau (NAB) regarding irregular lease of land by overriding the decision of Executive Committee.\nThe committee also examined the audit para related to irrational consumption of electricity on service buildings.\nDuring audit, it was observed that 71,970,988 electric units valuing Rs. 1,416.67 million were charged to the service buildings without justification for the period from 2016 to 2018.\nThe management replied that electricity was purchased on bulk tariff and was sold to the consumers (residential colonies) on domestic tariff which resulted in loss amounting to Rs. 202.17 million in Karachi Division Rs.29.88 million in Sukkur Division due to difference in tariff.\nAfter detailed deliberation on the issue, Departmental Accounts Committee (DAC) directed the Pakistan Railways that a detailed reference covering all aspects be made to Ministry of Finance, Finance Division, Islamabad through Ministry of Railways, Railway Board, for getting advice for the regularization of the expenditure.\nChairman of the committee directed Pakistan Railways to renegotiate the bulk tariff about the irrational consumption of electricity and installation of electric meters in service buildings.\nThe committee also examined the audit para regarding unauthorized leasing of Railways land by Railway Police.\nThe committee also discussed the issues related to the encroached land of Pakistan Railways.\nThe meeting was attended by members of the committee including Leader of the House in the Senate Dr. Shahzad Waseem, Senator Mushahid Hussain Syed, MNA Noor Alam Khan, MNA Ms. Munaza Hassan, MNA Sheikh Rohale Asghar, MNA Syed Hussain Tariq, MNA Shahida Akhtar Ali, MNA Iqbal Muhammad Ali Khan and MNA Ms. Hinna Rabbani Khar attended the meeting.",
  "retrievedAt": "2025-08-11T20:56:17.585Z"
}
