{
  "title": "Afghan students to undergo mandatory 10-day quarantine on arrival: NCOC",
  "link": "https://www.app.com.pk/national/afghan-students-to-undergo-mandatory-10-day-quarantine-on-arrival-ncoc/",
  "date_published": "2021-07-05T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP): The National Command and Operation Center (NCOC) on Monday announced safety protocols for 3,000 Afghan students who started arriving in the country and would undergo 10-day mandatory quarantine.\nThe NCOC session was chaired by Federal Minister for Planning, Development and Special Initiatives Asad Umar.\nThe Forum was informed that these Afghan students were studying in different educational institutions of the country. There have been effective Coronavirus testing arrangements made on the arrival of students, the Forum was told.\nIt added that the students with positive tests would be sent back to Afghanistan while the rest of the students would be kept in compulsory quarantine for 10 days.\nAs per the safety protocols, at the culmination of their quarantine, students would be vaccinated with Covid-19 vaccine, the Forum was briefed.\nThe Forum during the meeting expressed grave concerns over the violation of Covid-19 standard operation procedures (SOPs).\nThese violations were observed in restaurants, indoor gymnasiums, wedding halls, transport, markets, tourism and other sectors, the Forum was informed.\nThe Forum decided that strict restrictions might be imposed if SOPs were not implemented and properly followed by the masses.\nA special meeting of the NCOC comprising all the provincial Chief Secretaries would be convened to review the violations of SOPs. However, in this regard, a strict mechanism for the implementation of SOPs and measures to expedite the vaccination process in all units would also be reviewed, the Forum said.\nThe Forum announced that the vaccination verification portal was functional and its purpose was to make the verification process possible in places where vaccination confirmation was required prior to enter the premises of particular place or jurisdiction.\n“All vaccinating staff and the public are urged to ensure that their vaccination record was entered in the National Immunization Management System (NIMS) during inoculation process,” the Forum appealed the general public.\nThe NCOC, in consultation with all federating units, has increased the number of vaccination centers where Moderna vaccine would be administered.\nAs many as 59 new vaccination centers were established across the country, out of which 15 were in Punjab, 10 in Sindh, 14 in Khyber Pakhtunkhwa, 4 in Balochistan, 5 each in ICT and Azad Jammu and Kashmir, and 6 in Gilgit Baltistan, the Forum was told.",
  "retrievedAt": "2025-08-11T20:56:17.576Z"
}
