{
  "title": "President confers Nishan-i-Imtiaz (military) on Turkish military commander",
  "link": "https://www.app.com.pk/national/president-confers-nishan-i-imtiaz-military-on-turkish-military-commander/",
  "date_published": "2021-07-05T11:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 5 (APP): President Dr Arif Alvi Monday conferred Nishan-i-Imtiaz (Military) award on Commander of Turkish Land Forces General Umit Dundar here.\nThe conferment was made at a special investiture ceremony held at Aiwan-e-Sadr to recognize of the meritorious services of General Umit Dundar in strengthening of Pakistan-Turkish defense ties.\nStarted with national anthem and recitation of verses from the Holy Quran, the ceremony was attended by First Lady Samina Alvi, senior civil and military officers besides Turkish Ambassador in Pakistan İhsan Mustafa Yurdakul.\nAs per the citation read out at the ceremony, General Umit Dundar graduated from the Army War College in 1985, from Royal Army Staff College (United Kingdom) in 1991, and from the Armed Forces College in 1994.\nHe served as the Chief of Construction, Real Estate and NATO Infrastructure Department of the Ministry of National Defense from 2001 to 2004 and as the Commander of 28th Mechanized Infantry Brigade from 2004 to 2005. During this period he also served as the Commander of the Multinational Brigade in Afghanistan.\nHe was promoted to the rank of major general in 2005, lieutenant general in 2009 and general in 2013.\nHe served as the Commander of the 3rd Army for two years and subsequently he served as the Commander of the 1st Army. He served as the Acting Chief of the General Staff for a brief period in 2016.\nGeneral Ümit Dündar served as the Deputy Chief of the General Staff from 2016 to 2018.\nHe was appointed as the Commander of the Turkish Land Forces by the Turkish President in July 2018.\nThe ceremony was told that General Ümit Dündar was a sincere and close friend of Pakistan who played role in strengthening of Pakistan-Turkish ties.",
  "retrievedAt": "2025-08-11T20:56:22.630Z"
}
