{
  "title": "Development schemes to change fate of Balochistan people: Jam Kamal",
  "link": "https://www.app.com.pk/national/development-schemes-to-change-fate-of-balochistan-people-jam-kamal/",
  "date_published": "2021-07-05T18:08:00.000Z",
  "source": "APP",
  "content": "GAWADAR, Jul 05 (APP): Balochistan Chief Minister Jam Kamal Khan Monday said various development schemes had been planned and launched in the Balochistan province which would bring a change in the life of a common man.\n“We are thankful to Prime Minister Imran Khan, who has extended his full support to these schemes”, he said while addressing a gathering of elders here.\nThe prime minister, who was on a day-long visit to the port city, to launch the development projects, including inaugurating the first phase of Gwadar Free Zone besides performing the groundbreaking of its second phase, also addressed the meeting.\nJam Kamal said no prime minister in the past had taken any interest in resolving the issues of the people of Balochistan. It was Prime Minister Imran Khan who had made many visits to the province to have firsthand account of its people’s problems.\nBefore planning the schemes, he said, extensive consultations were held and for the purpose visits of the province were carried out by officials and lawmakers. Such a practice had never been witnessed in the past.\nHe said the development projects when completed would change the fate of people, he added. Under the schemes, basic facilities like water and electricity would be provided to the people of Balochistan, particularly of Gwadar. Moreover, schools, colleges, hospitals and roads would be built, besides Internet connectivity would also be enhanced in the province, he added.\nThe chief minister said the Gwadar University was being established here, while the construction of a girls’ college was also underway to empower the women.\nUnder the master plan of Gwadar Development Authority (GDA), he said, locals would not be forced to sell their property if they were not willing.\nFurthermore, he said, health cards were being given to the people of Balochistan to avail treatment facility of upto Rs one million per year for each family.\nMoreover, Jam Kamal said, new schemes had been announced in the current fiscal year’s budget of the province. An amount of Rs 4.5 billion had been allocated for the Public Sector Development Programme (PSDP), he added.\nHe said all the legislators belonging to the province had been allocated funds for development projects in their areas.",
  "retrievedAt": "2025-08-11T20:56:17.582Z"
}
