{
  "title": "Pakistan, Saudi businessmen hope Saudi-Pak Investment Forum to help strengthen bilateral trade relations",
  "link": "https://www.app.com.pk/national/pakistan-saudi-businessmen-hope-saudi-pak-investment-forum-to-help-strengthen-bilateral-trade-relations/",
  "date_published": "2021-10-24T17:34:00.000Z",
  "source": "APP",
  "content": "RIYADH, Oct 24 (APP): Prominent Pakistani and Saudi businessmen and entrepreneurs Sunday stressing for converting Pakistan-Saudi straregic partnership into strong trade and business relations hoped that Saudi-Pak Investment Forum being held here on Monday will help achieve the goal.\nPrime Minister Imran Khan, who arrived in Saudi Arabia on Saturday on a three-day official visit, will also participate in the Forum and interact with investors from Saudi Arabia and Pakistan to encourage trade and investment at bilateral level.\nA delegation of leading Pakistani entrepreneurs and investors including from housing and construction sector reached the Saudi capital on Sunday to attend the Investment Forum being organised in cooperation with Saudi Ministry of Investment.\nMuhammad Arif Habib, a renowned Pakistani businessman and Chairman Arif Habib Group, while talking to APP said that with over 2 million Pakistani expatriates working in the Kingdom and contributing in its economic development, there was a need to enhance business to business relations between the two brotherly countries.\nHe said that as Saudi Arabia’s vision 2030 provided ample employment and investment opportunities, Prime Minister Imran Khan also desired the Pakistani businessmen, entrepreneurs and investors especially from construction sector to exploit the opportunity for a win-win situation.\nSimilarly, he said, during their B2B level interaction with Saudi businessmen and entrepreneurs at B2B, they will apprise them of the potential of investment in different sectors of Pakistan including, housing, construction, real estate, oil and gas etc.\nSohail Tabba, another one of the leading businessman and Chairman ICI Pakistan, told APP that 2030 vision of Saudi Arabia had opened a gate for increased trade and investment relations between the two countries.\nHe said that enhanced employment opportunities in Saudi Arabia due to vision 2030 in diverse areas including Information Technology will also help Pakistani skilled and educated youth in getting jobs.\nSohail Tabba said that as Pakistan had already registered significant increase in workers’ remittances, which had reached around US $ 31 billion, Saudi Arabia was one of the major contributors.\nHe credited the present government’s policies and enhanced facilitation to Overseas Pakistanis for increased inflow of remittances and said the remittances could increase to US $ 40 billion.\nSalah Sheikh, a Saudi Industrialist dealing in sports and leather goods, stressed for joint ventures in sports and leather products for mutual benefit.He appreciated the world class quality of Pakistani sports goods especially football and said it was used worldwide and in the World Cup.\nSabah Sheikh said that as Prime Minister Imran Khan was a sportsman and sports-lovers, his government will encourage bilateral cooperation and joint ventures in the manufacturing of sports and leather products.\n“Instead of looking towards other countries brands, we can develop our own brands for mutual benefit”, he said adding that the Saudi-Pak Investment Forum on Monday will provide opportunity to the businessmen and entrepreneurs from both the countries to discuss such joint venturers.",
  "retrievedAt": "2025-08-11T21:30:36.830Z"
}
