{
  "title": "Interior Minister commends KP Police for foiling terrorist attack in Lakki Marwat",
  "author": null,
  "content": "ISLAMABAD, Mar 22 (APP):Federal Interior Minister Mohsin Naqvi has lauded the bravery and swift action of the Khyber Pakhtunkhwa (KPK) Police for successfully thwarting a terrorist attack on a police station in Lakki Marwat.\nIn an official statement, Naqvi praised the courageous officers who confronted the attackers, preventing what could have been a devastating incident. “The brave personnel of the Khyber Pakhtunkhwa Police courageously confronted the Khawarij terrorists and repelled the attack,” he remarked. “We salute the heroic efforts of these officers, whose quick response foiled the nefarious intentions of the assailants.”\nThe Interior Minister highlighted the police force’s unwavering commitment to safeguarding the nation, noting that the KPK Police have a proud history of standing on the frontlines against terrorism. “I am immensely proud of the valiant officers of the Khyber Pakhtunkhwa Police, who have time and again displayed extraordinary courage in repelling terrorist attacks,” Naqvi added.\nHe reiterated the federal government’s full support for law enforcement agencies, acknowledging the sacrifices made by police officers in the ongoing fight against terrorism. The minister also expressed solidarity with the people of Khyber Pakhtunkhwa, who have endured the brunt of extremist violence in recent years.\nThe attempted attack in Lakki Marwat is the latest in a series of incidents targeting security forces in the region. However, the police’s prompt action in averting this attack serves as a testament to their preparedness and dedication to maintaining peace and stability.\nFurther details regarding the incident and any casualties have not yet been released. Security forces have launched a thorough investigation to track down any remaining elements involved in the foiled attack.\nThe nation continues to stand in solidarity with its security forces, honoring their sacrifices in the pursuit of a safer Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:56:56.365Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/interior-minister-commends-kp-police-for-foiling-terrorist-attack-in-lakki-marwat/",
  "dateList": "2025-03-22",
  "date_published": "2025-03-22T11:19:00.000Z"
}
