{
  "article_id": "2025-07-27_2dd12751dd9d212b6a7ce91593c9d7c0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fia-launched-crackdown-on-human-traffickers-illegal-currency-networks-10-arrested/",
    "retrieved_at": "2025-08-27T10:11:44.297Z"
  },
  "metadata": {
    "title": "FIA launched crackdown on human traffickers & illegal currency networks, 10 arrested",
    "author": null,
    "date_published": "2025-07-27T15:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 368,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 27 (APP):In a series of coordinated operations across multiple regions, the Federal Investigation Agency (FIA) has arrested 10 suspects involved in human trafficking, visa fraud, and illegal currency exchange. The crackdown was carried out on the directives of FIA Director General Rafat Mukhtar Raja, as part of an intensified campaign to dismantle smuggling and financial crime networks operating across the country FIA Multan Zone arrested three individuals, including Feroze Qaiser Sagu, a most-wanted human smuggler. Other arrested suspects include Muhammad Azam and Muhammad Wazir. The trio allegedly defrauded citizens by promising employment abroad, extracting large sums of money without delivering Feroze Qaiser, apprehended in Khanewal, has nine cases registered against him in the Multan Zone and additional charges in Faisalabad. He reportedly scammed over Rs. 8.2 million from victims by offering fake job placements in Dubai and Saudi Arabia Muhammad Azam is accused of defrauding Rs. 600,000 under the pretense of employment in Azerbaijan Muhammad Wazir allegedly extorted Rs. 2.36 million from citizens for promised jobs in the UAE FIA Lahore Zone conducted raids in Lahore and Islamabad, arresting Naveed Tahir and Zubair Muhammad, both charged with visa fraud Naveed Tahir allegedly took Rs. 1.68 million from a citizen, promising a job in Lithuania Zubair Muhammad is accused of swindling Rs. 700,000 under the guise of securing a U.S. visa Both suspects failed to provide the promised visas and had gone into hiding before being apprehended In another significant operation, FIA Balochistan Zone arrested five individuals - Akmal Khan, Saifullah, Basheer Ahmed, Abdul Qayoom, and Abdullah - involved in illegal currency exchange and Hawala/Hundi operations in Quetta and Chaman Authorities seized a large sum of currency during the raids, including: Rs. 684,000 in Pakistani rupees 230.5 million Iranian Rials Over 135,000 Afghanis 700 U.S. Dollars, 200 Saudi Riyals, and 150 Australian Dollars. Investigators also recovered cheque books, receipts, and bank slips linked to Hawala operations. The suspects were allegedly operating without proper licenses and failed to explain the source of the recovered funds All suspects have been taken into custody and investigations are ongoing. According to the FIA spokesperson, the agency remains committed to a zero-tolerance policy against human trafficking, visa fraud, and illegal financial operations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}