{
  "article_id": "2025-07-27_08601d1c50960304e45de3a163b98e29",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-launch-national-culture-policy-to-promote-heritage-and-soft-image-worldwide/",
    "retrieved_at": "2025-08-27T10:12:54.946Z"
  },
  "metadata": {
    "title": "Pakistan to launch National Culture Policy to promote heritage and soft image worldwide",
    "author": null,
    "date_published": "2025-07-27T09:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 872,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 27 (APP): In a major step toward redefining Pakistan's cultural narrative and global image, the federal government is set to unveil a landmark National Culture Policy after August 14. The comprehensive policy aims to revive the nation's cultural identity, preserve its diverse heritage, and project Pakistan's soft image on the world stage. This was disclosed by Federal Minister for National Heritage and Culture, Aurangzeb Khan Khichi, in an exclusive interview with APP, where he described the policy as \"a national commitment to our roots, creativity, and civilizational pride.\" \"This is not just a policy document but a national commitment to our identity through which we seek to unify the cultural landscape of Pakistan and proudly present our heritage on the global stage\", the minister stated. The policy, currently in its final stages, is being shaped through a broad consultative process involving all provinces, cultural experts, writers, artists, and relevant stakeholders. Highlighting the main focus of the policy, he said it will work to counter negative perceptions and project Pakistan's true image. \"We want to reject narratives that associate our country with bullets and guns. Our land is home to ancient civilizations like Mehrgarh, which is over 12,000 years old, along with Harappa, Mohenjodaro, and Taxila. We have one of the richest cultural heritages in the world.\" He said the policy will offer institutional backing to artists and literary communities and introduce reforms in outdated structures. \"For too long, our culture has been ignored or underutilized and now is the high time to rejeuvanate our cultural identity and heritage.\" The federal minister shared that Pakistan currently has cultural cooperation agreements with 86 countries and is working to increase that number to 125. A dozen ambassadors have visited us in recent weeks, showing keen interest in cultural collaborations, he noted. Highlighting the global presence of Pakistani artists, he noted that a group of young performers recently visited China, where they received overwhelming acclaim, while another delegation is set to leave for Uzbekistan shortly. Referring to the growing international engagement, the minister said that last year, six countries participated in the Lok Mela. \"This year, around 12 countries are expected to participate by setting up their pavilions\". Khichi said the government is also taking concrete steps to promote religious and heritage tourism. A national plan in this regard is being pursued following a high-level meeting chaired by the Prime Minister with participation of culture and tourism representatives. As part of this initiative, Pakistan is establishing the first-ever Buddhist Cultural and Information Center at Lok Virsa, Islamabad, while infrastructure at key Buddhist sites such as the Shah Allah Ditta Caves is being upgraded. \"These efforts will help Pakistan emerge as a destination for pilgrims, researchers, and tourists interested in Buddhist heritage,\" he said. He shared that after the 18th Amendment, most archaeological sites are now managed by provincial governments. However, the federal ministry has written to the provinces to upgrade facilities at Buddhist sites, as these attract international visitors. \"We've received a positive response from provinces and efforts are underway to ensure better infrastructure, including meditation areas and access roads.\" Highlighting the country's stagnation on the UNESCO front, the minister said no new Pakistani site has been added to the World Heritage List since 1998. \"We've now submitted four nominations, and the response from UNESCO's country head has been very encouraging.\" In parallel, the ministry is digitizing leading cultural institutions including the National Library of Pakistan, Pakistan Academy of Letters (PAL), and National Language Promotion Department (NLPD) to preserve literary and cultural heritage for future generations. He disclosed that digital mapping of archaeological sites is also underway to enhance global access and awareness. Listing another initiative to project cohntry's cultural significance, the minister said that a documentary series showcasing Pakistan's archaeological wonders is also being developed and will be disseminated globally through embassies and diplomatic channels. Discussing institutional reforms, Khichi said many of the country's cultural bodies were established 50 to 60 years ago and are now outdated. A committee led by Senator Irfan Siddiqui, Parliamentary Leader of Pakistan Muslim League-Nawaz (PML-N) in the Senate, is currently revising their mandates and terms of reference to align with present-day cultural needs. He appreciated Prime Minister Shehbaz Sharif's support for the cultural sector. \"When there were proposals to downsize some departments, the Prime Minister firmly stated: 'A nation doesn't downsize its identity- it protects and promotes it.'\" The minister also announced that Pakistan's first-ever degree-awarding institution in the arts will be launched by the end of this year. \"Right now, we don't have a recognized degree in the arts. This institution will allow students to pursue higher studies abroad and secure better opportunities,\" he said. In the meantime, art classes for people of all ages have started at Lok Virsa to develop interest and appreciation for creative fields. \"To support emerging artists, we are also offering free or minimal-cost exhibition space at the Pakistan National Council of the Arts to help showcase young talent,\" he added. Summing up the government's cultural vision, Federal Minister Muhammad Aurangzeb Khan Khichi said, \"With the National Culture Policy, Pakistan is preparing to tell its real story-one of history, creativity, beauty, and a timeless civilization rooted in peace and human expression.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}