{
  "article_id": "2025-07-27_24277981455b17e95cd450f8b4563cf4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/al-shifa-trust-treats-1-8-million-yearly-bringing-light-and-hope-to-underprivileged/",
    "retrieved_at": "2025-08-27T10:12:28.247Z"
  },
  "metadata": {
    "title": "Al-Shifa Trust treats 1.8 million yearly, bringing light and hope to underprivileged",
    "author": null,
    "date_published": "2025-07-27T13:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 542,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 27 (APP):Major General (Retd) Rehmat Khan, President of Al-Shifa Trust, said on Sunday that Pakistan faces a significant eye health crisis, with nearly two million people exposed to preventable blindness, 80 percent of which is curable. Addressing the media at the National Press Club, he stated that last year, Al-Shifa Trust treated more than 1.8 million patients, including 100,000 surgeries. Approximately 83% of patients received treatment at no cost. \"Every day we carry out about 450-500 surgical procedures,\" Khan said, adding that Al-Shifa Trust carries out about 1,000 corneal transplants every year, which is approximately 50% of the total corneal transplants in the country. He stated that Al-Shifa Trust is the only chain of eye hospitals that treats eye cancer patients at no cost. Regarding future endeavours, the president of Al Shifa Trust stated that a modern and the largest eye hospital in the country is being built in Lahore. An American architectural firm is designing the hospital, and the ground-breaking is scheduled to take place in September 2025. What began as a modest initiative in 1985 has evolved into Pakistan's most comprehensive humanitarian eye care network, transforming countless lives and restoring hope, he underlined. Khan noted that an estimated 12.64 million people, 61 percent of whom are women, struggle with reading and close-up tasks. Limited access to simple reading glasses severely hinders education, work, and overall well-being for many. Major General Rehmat Khan explained that Refractive errors and diabetic retinopathy significantly contribute to vision loss. He also cited poor hygiene, polluted air, adverse environmental conditions, financial hardships, lack of awareness, insufficient facilities, and entrenched cultural barriers as critical factors. He stated that the Trust's humanitarian mission extends beyond conventional care, encompassing accessible healthcare that transcends economic barriers. Its growth, from treating 25 to 5,000 patients daily over three decades, reflects unwavering commitment. Technological advancements have enhanced Al-Shifa's capacity to serve underserved communities. The Chakwal hospital expansion, for instance, dramatically increased daily patient capacity from 150 to 650 individuals, reflecting an adaptive approach to meeting growing demand. Khan emphasized that while many patients cannot afford treatment, those with resources can support the mission. By combining advanced technology with compassionate care, Al-Shifa continues to transform lives, proving that even the most challenging crises can be effectively addressed with proper dedication and community support. He stated that Trust's hospital in Haweli Lakha is nearing completion, while GB Hospital is under construction, and a temporary arrangement is fully operational for treatment and surgeries. Dr. Najam, General Manager of the Outreach Program, also spoke on the occasion. He shared the details of free eye camps established in far-flung areas of the country. He said that our vision to fight against blindness is beautifully augmented by an outreach program that provides eye care treatments, including surgeries, directly to the underprivileged community. Last year, our outreach department established approximately 1,500 eye camps in all provinces, including AJK and GB, benefiting over 650,000 patients. We are fully committed to the vision to reach the unreached. Before the press briefing, officials from the National Press Club informed the President of Al-Shifa Trust that hundreds of journalists had received treatment, and dozens had undergone operations in a state-of-the-art mobile operation clinic, where free glasses and medicines were also provided.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}