{
  "title": "120th NMC, 35th SMC courses for civil servants’ promotion conclude",
  "link": "https://www.app.com.pk/national/120th-nmc-35th-smc-courses-for-civil-servants-promotion-conclude/",
  "date_published": "2024-07-12T11:17:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 12 (APP):The closing ceremony of 120th National Management Course (NMC) and 35th Senior Management Course (SMC) was held here at the National School of Public Policy (NSPP) on Friday.\nSome 49 participants of the National Management Course and 46 of the Senior Management Course were awarded certificates at the ceremony.\nAddressing the ceremony, chief guest former federal secretary Tasneem Noorani said that the government officials were aware of the challenges facing the country. It was important for them to be in tune with the best international policies to compete, and hopefully the courses will guide them in that regard.\nHe congratulated the participants on completion of their courses.\nNSPP Rector Dr Ejaz Munir, in his remarks, said that the NSPP was a reliable institution for training of civil servants in Pakistan.\nIt helped enhance their capacities for making policies and their implementation at different levels, and prepared  them to face the challenges of good governance and public service delivery, he added.\nBy promoting house research and think tanks, the NSPP was playing an important role in public policy research in the country, DR Ejaz said.\nIt may be mentioned that the National School of Public Policy is a prominent institution for public policy in Pakistan, which provides training to provincial and federal government officers of Grade 18, 19 and 20 at three levels: tactical, operational and strategic.\nThe NSPP has an independent board of governors, headed by the President of Pakistan.\nThe National Management College offers an 18-week National Management Course (NMC) for Grade 20 officers, which is a prerequisite for their promotion to Grade 21 scale. It is held twice a year.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:53:03.620Z"
}
