{
  "title": "Hezbollah rejects disarmament ahead of US-Lebanon talks - World - DAWN.COM",
  "author": null,
  "content": "• Netanyahu offers ‘phased’ withdrawal if Lebanon disarms the armed group\n• UN Security Council vote on embattled peacekeepers delayed\n\nBEIRUT/UNITED NATIONS: Hezbollah’s chief on Monday doubled down on his refusal to give up the group’s weapons ahead of talks between Lebanese officials and visiting US envoys after Lebanon’s government opted to disarm the Iran-backed fighters.\n\n“We will not give up the weapons that protect us from attack,” Naim Qassem said in a televised address.\n\n“These weapons are our soul, our honour, our land, our dignity, our children’s future,” he said, adding: “Whoever wants to take away these weapons wants to take away our souls.”\n\nUnder heavy US pressure and fears of Israel expanding its military action, Lebanon’s government this month tasked the army with drawing up a plan to disarm Hezbollah by the end of the year.\n\nHezbollah was the only faction that kept its weapons after Lebanon’s 1975-1990 civil war, doing so in the name of “resistance” against Israel, and has repeatedly rejected the decision.\n\nThe move came after the balance of power in Lebanon shifted following more than a year of hostilities between Israel and Hezbollah that left the group badly weakened.\n\nQassem urged the Lebanese government to reverse the decision, saying “it was made under US-Israeli dictates”, and accused Washington of wanting to “wreck Lebanon”.\n\nUS envoys Thomas Barrack and Morgan Ortagus are to meet Leb­an­e­se officials on Tuesday.\n\nLebanon has been waiting for Israel’s response to a US proposal that includes details on a timetable and mechanism for dismantling Hezbollah, as well as Israel’s withdrawal from areas it occupied during the recent conflict.\n\nQassem rejected comments by Barrack earlier this month when the US envoy spoke of a “step-by-step approach” to commitments under the Nove­mber truce. “There is no step for step,” the Hezbo­ll­ah chief said. “Let them implement the (ceasefire) agreement… then after that we will discuss the def­­­e­nce strategy,” he added.\n\nHezbollah insists Israel must withdraw, stop its ongoing attacks on Lebanon, release Leba­nese prisoners it captured during the hostilities and allow reconstruction to begin before the group can discuss the fate of its weapons.\n\nNetanyahu’s condition\n\nPrime Minister Benjamin Netanyahu on Monday said Israel was ready to back Lebanon’s efforts to disarm Hezbollah and offered “a phased” pullout of its troops if Beirut followed through with plans to seize the group’s weapons.\n\nFollowing the war between Israel and Iran-backed Hezbollah last year, the Lebanese army has been deploying in the country’s south and dismantling the militant group’s infrastructure there. Lebanon has been grappling with the thorny issue of disarming Hezb­ollah, with the cabinet this month tasking the army with developing a plan to do so by the end of the year.\n\nDespite the November ceasefire that ended the war, Israel has continued to strike Lebanon, saying it will do so until Hezbollah is disarmed.\n\nIsraeli forces also continue to occupy five areas of the south that they deem strategic.\n\n“Israel stands ready to support Lebanon in its efforts to disarm Hezbollah and to work together towa­rds a more secure and stable future for both nations,” said Netanyahu, according to a statement released by his office.\n\nIsrael also acknowledged “the significant step taken by the Lebanese government”, according to the statement. If the Lebanese government follows through with the plan, Netanyahu said Isr­ael was prepared to “eng­a­ge in reci­pr­ocal mea­sures, inclu­ding a phased reduction of IDF (military) presence in coordination with the US-led security mechanism”.\n\n‘First step’\n\nLater on Monday the Israeli military said in a statement it had “eliminated” a Hezbollah member in southern Lebanon and would “continue to operate to remove threats posed to the citizens of Israel”. Earlier this month, Hezbollah leader Naim Qassem promised to push back against the Lebanese government’s plans to disarm his group. Last week, US envoy Tom Barrack called on Israel to honour commitments un­der a ceasefire that end­ed its war with Hezbollah.\n\n“There’s lways a step-by-step approach but I think the Lebanese government has done their part. They’ve taken the first step. Now what we need is Israel to comply,” Barrack said during meetings with Lebanese officials in Beirut. Israeli media over the weekend reported that Barrack had visited Israel.\n\nLebanon’s official Nati­onal News Agency on Monday reported US deputy envoy Morgan Ortagus had arrived in Beirut ahead of planned meetings with officials.\n\nSecurity Council vote delayed\n\nAn expected United Nations Security Council vote on the future of the blue helmet peacekeeping mission in south Lebanon, which has faced US and Israeli opposition, was pushed back on Monday as negotiations continued.\n\nThe Council is debating a French-drafted compromise that would keep the United Nations Interim Force in Lebanon (UNIFIL), deployed in 1978 to separate Israel and Lebanon, in place for one more year while it prepares to withdraw.\n\nTalks began last week and it had been thought a vote could come as soon as Monday, but diplomatic sources indicated that a vote would now come by the end of the week. The force’s mandate ends Sunday. In the latest draft text, the Council would signal “its intention to work on a withdrawal of UNIFIL with the aim of making the Lebanese Government the sole provider of security in southern Lebanon.” Under a truce that ended a recent war between Israel and Iran-backed Hezbollah, Beirut’s army has been deploying in south Leba­n­on and dismantling the militant group’s infrastructure there.\n\nThe resolution would extend until August 31, 2026 the mandate of the 10,800-strong force made up of Indonesian, Indian, Italian, Ghanaian, Nepa­lese and other nationalities. It was not clear if Washington, which wields a veto on the Security Council, would accept the compromise language, with a State Department spokesman previously telling this news agency it would not comment on Council deliberations.\n\nThe text also contained language “condemning the incidents that affected United Nations Interim Force in Lebanon premises and forces, injuring several peacekeepers” — a reference to strikes by US ally Israel on UNIFIL positions that have caused injuries and damage.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ace03821b08.jpg",
  "retrievedAt": "2025-08-26T11:20:16.383Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937240/hezbollah-rejects-disarmament-ahead-of-us-lebanon-talks",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:24:47.000Z"
}
