{
  "title": "Israel kills 5 journalists in strikes on Gaza hospital - Newspaper - DAWN.COM",
  "author": null,
  "content": "GAZA: Five journalists were among at least 20 people killed on Monday when Israeli strikes hit a hospital in the south, prompting a global outcry.\n\nReuters, the Associated Press and Al Jazeera all issued statements mourning their slain contributors, while the Israeli military said it would investigate the incident.\n\nThe war on Gaza has been one of the deadliest for journalists, with aro­u­nd 200 media workers kil­led over the course of the nearly two-year Israeli assault, according to media watchdogs.\n\nCivil defence spokesman Mahmud Bassal said “the toll so far is 20 martyrs, including five journalists and one member of the civil defence”, after strikes hit Khan Yunis’s Nasser Hospital — a large medical complex that has been targeted several times by Israel.\n\nBassal said an Israeli exp­losive drone hit a buil­d­ing at the hospital, followed by an air strike as the wounded were being evacuated.\n\nReuters reported that vi­­d­­eo journalist Hussam al-Masri — a contractor who was working for the agency — was operating a live feed at the hospital, “which suddenly shut down at the mo­­ment of the initial strike”.\n\nA Reuters spokesperson said the agency was “devastated” to learn of Masri’s death “and injuries to another of our contractors, Hatem Khaled” in the strikes.\n\n“We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,” the statement added.\n\nA spokesperson for Qatar-based TV network Al Jazeera said one of its photojournalists and cameramen, Mohammad Sala­­ma, was also killed in the attack.\n\n“Al Jazeera Media Network condemns, in the strongest possible terms, this horrific crime committed by the Israeli occupation forces, who have dir­ectly targeted and assassinated journalists as part of a systematic campaign to silence the truth,” the broa­dcaster said in a statement.\n\nThe Associated Press said in a statement that it was “shocked and sadde­ned” to learn of the death of Mariam Dagga, 33, a visual journalist who had freelanced for the agency since the start of the war.\n\nThe Palestinian Journa­lists Syndicate named two other victims as Moaz Abu Taha and Ahmad Abu Aziz.\n\nLater Monday, a sixth journalist, Hassan Douhan, was killed by Isra­eli fire in the Al-Mawasi area of Khan Yunis, according to the Palestinian Journalists Syn­dicate and Nasser Hospital.\n\nAFP footage from the immediate aftermath of the attack showed smoke filling the air and debris from the blast on the floor outside the hospital.\n\nPalestinians rushed to help the victims, carrying bloodied corpses and severed body parts into the medical complex. One body could be seen dangling from the top floor of the targeted building as a man screamed below.\n\nA woman wearing medical scrubs and a white coat was among the injured, carried into the hospital on a stretcher with a heavily bandaged leg and blood all over her clothes.\n\nLater in the day, a crowd carried the bodies of some of the slain journalists at a funeral in Khan Yunis, with the dead wrapped in white burial shrouds and their press flak jackets resting on top.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ace455b49f8.jpg",
  "retrievedAt": "2025-08-26T11:20:08.237Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937258/israel-kills-5-journalists-in-strikes-on-gaza-hospital",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:24:11.000Z"
}
