{
  "title": "NCCIA summons fashion designer Maria B in transperson tirade case - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The National Cyber Crime Investigation Agency (NCCIA) has summoned fashion designer Maria B for Tuesday (today) for defaming the transgender community on social media.\n\nThe NCCIA, in a notice to her, asked her to appear before an inquiry team on a complaint that she defamed the transgender community on social media. It said that in case of non-appearance, it would be assumed that she had nothing to present or state in her defence.\n\nLahore police last week booked around 60 transgender persons and others and arrested some of them for allegedly organising an “objectionable” private party after Maria B uploaded photos and videos of it on her social media accounts.\n\nLater, a magistrate dismissed the case against transgender persons after no incriminating material was available on record which connected the accused persons with the commission of alleged offences.\n\nFashion designer Maria B initially posted videos on her social media accounts, demanding action against “transgender activists” that she claimed featured in the clips, terming such gatherings “against the moral values of the country.”\n\nIslamabad-based transgender rights activist Nayyab Ali said in a post on X that individuals seen in the video were “not trans activists” and had “nothing to do with our movement.”\n\nAli also alleged that the video was shot at a private party and only went viral after Maria B posted it, saying, “If it’s fahashi (vulgarity), then who spread it to millions? Maria B did. That’s a crime itself.”\n\nHuman rights activists raised concerns over the potential misuse of morality laws on social media. “While obscenity laws exist, their vague wording often leads to arbitrary enforcement, disproportionately targeting marginalised communities,” said a legal expert, requesting anonymity.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/26110057bb89f49.webp",
  "retrievedAt": "2025-08-26T11:20:03.849Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937306/nccia-summons-fashion-designer-maria-b-in-transperson-tirade-case",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T03:37:29.000Z"
}
