{
  "title": "Trees down, homes flooded as typhoon batters Vietnam - World - DAWN.COM",
  "author": null,
  "content": "CUA LO: Typhoon Kajiki brought torrential rains to Vietnam’s north central coast on Monday, felling trees and flooding homes, despite wind speeds tapering off from earlier in the day.\n\nAs of 0900 GMT, Kajiki was on the coast of Nghe An and Ha Tinh provinces, with wind speed easing to 118-133 kph from as strong as 166 kph, according to the country’s weather agency.\n\n“It’s terrifying,” said Dang Xuan Phuong, a 48-year-old resident of Cua Lo, a tourism town in Nghe An province directly hit by the storm. “When I look down from the higher floors I could see waves as tall as 2 metres, and the water has flooded the roads around us,” Phuong said.\n\nState media reports said power in several areas in Ha Tinh province had been cut off, roofs were blown out and floating fishing farms were washed away. Vietnam had earlier shut airports, closed schools, and begun mass evacuations as it prepared for the most powerful storm so far this year.\n\nThe government warned earlier of “an extremely dangerous fast-moving storm,” adding that Kajiki would bring heavy rains, flooding and landslides. With a long coastline facing the South China Sea, Vietnam is prone to storms that are often deadly and trigger dangerous flooding and mudslides.\n\nThe weather agency said rainfall could reach 500 millimetres from Monday afternoon until the end of Tuesday in several parts of northern Vietnam. The Vietnamese government said earlier on Monday about 30,000 people had been evacuated from coastal areas. More than 16,500 soldiers and 107,000 paramilitary personnel had been mobilised to help with the evacuation and stand by for search and rescue.\n\nTwo airports in Thanh Hoa and Quang Binh provinces were closed, according to the Civil Aviation Authority of Vietnam. Vietnam Airlines and Vietjet cancelled dozens of flights to and from the area on Sunday and Monday.\n\nKajiki skirted the southern coast of China’s Hainan Island on Sunday as it moved toward Vietnam, forcing Sanya City on the island to close businesses and public transport on Sunday.z\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ace06b442eb.jpg",
  "retrievedAt": "2025-08-26T11:20:17.188Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937247/trees-down-homes-flooded-as-typhoon-batters-vietnam",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:24:47.000Z"
}
