{
  "title": "Dar vows to boost Pakistan’s ties with Egypt, Algeria through broader cooperation - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister Ishaq Dar vowed to strengthen Pakistan’s ties with the North African countries of Egypt and Algeria as he met their foreign ministers on Tuesday in Saudi Arabia.\n\nDar arrived in Jeddah on a two-day visit yesterday, where he spoke on Israel’s ongoing Gaza onslaught during the 21st extraordinary session of the Organisation of Islamic Cooperation’s (OIC) Council of Foreign Ministers.\n\nToday, on the sidelines of the OIC meeting, Dar met with Egypt’s Foreign Minister Badr Abdelatty and Algeria’s FM Ahmed Attaf.\n\nTerming his discussion as a “meaningful interaction”, Dar said: “I reaffirmed Pakistan’s commitment to further strengthening ties with our brotherly countries in North Africa, Algeria and Egypt, through enhanced connectivity and broader cooperation across diverse fields.”\n\nThe foreign ministers discussed the “grave situation in Palestine”, Dar said on X.\n\nThe trio stressed the “urgent need for humanitarian access, a ceasefire, and lasting peace, while underscoring the importance of unity within the Muslim Ummah in these challenging times”.\n\nAt the OIC session yesterday, Dar slammed Israel’s “annexationist and rogue mindset” and condemned Tel Aviv’s plan to take control of Gaza City as threatening regional peace.\n\nHe also presented seven “urgent and essential steps” for the international community and Muslim nations to halt Israel’s war on Gaza — already termed a genocide by Amnesty International and Human Rights Watch — and secure enduring peace in Palestine.\n\nPakistan also fully endorsed and joined the statement issued by 31 Arab-Islamic countries and the secretaries general of the OIC, the League of Arab States and the Gulf Cooperation Council, condemning Israeli Prime Minister Benjamin Netanyahu’s comments about ‘Greater Israel’.\n\nAlgeria’s Ambassador to the UN Amar Bendjama has called for sanctions on Israel in response to its Gaza City plan.\n\nPakistan has brotherly ties with Egypt and Algeria, bonded in shared religion and culture.\n\nIn April, Islamabad and Cairo agreed to enhance bilateral collaboration in the health sector, with a specific focus on eliminating Hepatitis C. It was also reported earlier this year that Egypt’s renowned Al-Azhar University had plans to set up its campus in Pakistan.\n\nThe deputy PM also met with Turkiye’s FM Hakan Fidan today, expressing his “deep appreciation” to Turkiye for its leadership role in the capacity of chairing the OIC ministerial session.\n\n“We affirmed firm solidarity with Palestine, noting the worsening humanitarian crisis and famine, and the urgent need for humanitarian aid and relief,” Dar noted.\n\nThe two ministers also “reaffirmed the brotherly Pakistan-Türkiye relations, and looked forward to further strengthening our multifaceted cooperation”.\n\nDar had also met with the top diplomats of several other friendly countries yesterday on the sidelines of the OIC meeting. They included Saudi Arabia’s FM Faisal Bin Farhan, Iran’s FM Abbas Araghchi, Malaysia’s Mohamad Haji Hasan, and Bangladeshi Adviser for Foreign Affairs Md Touhid Hossain.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/261450582afe678.webp",
  "retrievedAt": "2025-08-26T11:19:57.079Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937356/dar-vows-to-boost-pakistans-ties-with-egypt-algeria-through-broader-cooperation",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T10:54:29.000Z"
}
