{
  "title": "CM Bugti vows to defend people’s rights at NFC meeting - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Chief Minister Mir Sarfraz Bugti has said that a joint stand will be taken through consultations with all parliamentary and other political parties to defend rights of the people of Balochistan in the National Finance Commission meeting.\n\nThe NFC meeting will be held on August 29. The meeting will be presided over by Federal Finance Minister Muhammad Aurangzeb.\n\nSpeaking at a pre-NFC meeting on Monday, he said that the National Finance Commission (NFC) Award is an important opportunity for promoting harmony between a strong federation and provinces.\n\nIt was decided in the meeting that opinions of all political parties and experts will be included on the NFC Award.\n\nOn the occasion, Mr Bugti clarified that by expanding the scope of consultations, opinion would also be sought from those political parties which have no representation in the parliament so that the province’s position is strong, comprehensive and unanimous.\n\nHe said that the suggestions of economic and financial experts and experts from other fields would also be sought so that interests of the people of the province could be comprehensively defended in the NFC meeting.\n\nThe chief minister expressed the hope that expectations of the people of Balochistan would be included in the 11th National Finance Commission Award because the award would end backwardness of the province and ensure prosperity and progress of the province.\n\nHe said that fair distribution of resources of provinces and transparency are guarantors of development of provinces and a strong federation.\n\nProvincial Finance Minister Mir Shoaib Nosherwani briefed the meeting on the economic situation and financial needs of the province and highlighted various aspects of the upcoming National Finance Commission Award.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/2220061990c817e.jpg",
  "retrievedAt": "2025-08-26T11:20:23.512Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937250/cm-bugti-vows-to-defend-peoples-rights-at-nfc-meeting",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:24:26.000Z"
}
