{
  "title": "Utility Stores Corporation closure puts 11,000 jobs on the line - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Assembly Standing Committee on Privatisation was informed on Monday that the government will ensure the payment of Rs27 billion in dues to employees and vendors of the Utility Stores Corporation (USC) in two phases following its closure.\n\nChaired by Dr Muhammad Farooq Sattar, the committee was told that the closure of USC had been finalised, but safeguarding the rights of the app­roximately 11,000 workers was the government’s top priority. The committee sought a detailed breakdown of the outstanding dues to be paid to employees and vendors, which the Privatisation Commission was asked to submit at the next meeting.\n\nThe committee was also briefed that while USC had operated profitably when subsidies were being provided, the withdrawal of these subsidies had led to operational losses. Committee members expressed serious concerns over the privatisation of USC, emphasising that continuing with the closure process despite the committee’s recommendations was highly alarming.\n\nIn response, the Privatisation Commission’s secretary inf­ormed the committee that the due diligence process for the privatisation of Pakistan Inter­national Airlines Corporation Ltd (PIACL) had already begun, with several business houses expressing interest. The privatisation process for PIA is expected to be completed by the last quarter of 2025.\n\nGovt commits Rs27bn in dues clearance to employees, vendors\n\nThe committee directed that the process be conducted transparently and asked the Privatisation Commission to present a list of members of the privatisation board at the next meeting.\n\nOn the ongoing issue of electricity loadshedding, the committee expressed concern over the situation across the country. The committee was informed that there is no electricity shortfall, but load management is being carried out. Feeders experiencing electricity theft or excessive line losses are subjected to load management.\n\nThe committee advised that instead of imposing load-shedding on entire feeders, electricity should be disconnected only for those areas or consumers found involved in theft or causing excessive losses.\n\nAdditionally, the committee recommended that the Minister for Power hold regional meetings with members of the National Assembly to address public issues in their constituencies and take concrete actions to resolve them.Following a briefing on Pakistan Engineering Company (PECO), the committee instructed the government to resolve the company’s issues.\n\nThe committee advised that efforts should first focus on restoring PECO, but if that proves unfeasible, privatisation should be considered. The committee also directed an inquiry into the irregularities during the tenure of former Managing Director Mairaj Anees Ariff and requested a detailed report on the matter.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68acde4fe65c8.jpg",
  "retrievedAt": "2025-08-26T11:20:20.550Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937232/utility-stores-corporation-closure-puts-11000-jobs-on-the-line",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:24:34.000Z"
}
