{
  "title": "Cervical cancer - Newspaper - DAWN.COM",
  "author": null,
  "content": "AT an awareness session hosted by the Idara Bait-ul-Quran in Lahore, the room buzzed with a rare and powerful mix of science, faith and community spirit. Over 30 participants — religious leaders and community advocates from diverse backgrounds — gathered to champion the health and protection of young girls and to work together to raise awareness about the human papillomavirus (HPV) vaccine to protect girls from cervical cancer.\n\nOne speaker noted: “Taking care of your health is a responsibility in Islam.” Others talked of how healthcare was supported by respected religious scholars in countries like Saudi Arabia, Indonesia, Malaysia and Libya, where this vaccine is part of routine immunisation programmes. It is the only vaccine that prevents cervical cancer — just a jab safeguards girls’ future. Civil society representatives, both men and women, answered questions, offering convincing responses to reassure community members.\n\nCervical cancer is the fourth most common cancer among women globally; alarmingly, it was found to be the second most common one among women in Pakistan. Though preventable, it claims the life of women every two minutes — 94 per cent of these deaths occur in low- and middle-income countries, according to the WHO. In Pakistan alone, over 5,000 women are diagnosed each year, and nearly 3,000 lose their lives to this silent killer. But the vaccine gives hope: HPV vaccination can potentially avert 17.4 deaths for every 1,000 girls vaccinated.\n\nThe HPV vaccine brings hope to Pakistan.\n\nRecognising the urgent need for action, Pakistan has approved the introduction of this vaccine following recommendations of the National Immunisation Technical Advisory Group. The vaccine, supported by Gavi, the Vaccine Alliance, will be delivered to girls aged nine to 14 through a school-based strategy. To reach the estimated 18 million girls in this age group, the rollout will begin in a phased manner with a 12-day campaign, starting Sept 15 this year in Sindh, Punjab, Azad Kashmir and Islamabad Capital Territory. Then, the vaccine will be integrated into routine immunisation alongside other childhood vaccines.\n\nHPV’s introduction is a significant step for Pakistan. In June this year, at the Global Forum on Cervical Cancer Elimination, Pakistan reaffirmed its alignment with the WHO’s 90-70-90 targets for 2030: 90pc of girls fully vaccinated with the HPV vaccine by age 15, 70pc of women screened with a high-performance test and 90pc of women diagnosed with cervical disease receiving appropriate treatment.\n\nProgress in vaccination, screening and treatment is critical to ending cervical cancer as a public health threat. But achieving these goals requires more than policy. It requires people, particularly civil society organisations, to serve as the bridge between health systems and communities. CSOs have a pivotal role in addressing vaccine hesitancy, especially in underserved and marginalised areas. By engaging directly with communities, they can help unpack the root causes of hesitancy, co-design culturally sensitive communication plans and deliver messages through interpersonal communication to gain trust.\n\nA major challenge is reaching out-of-school girls, who make up nearly 45pc of this age group in Pakistan. Many of their caregivers are unaware of the risks of HPV and the benefits of the vaccine. A recent survey by Jhpiego revealed that only 17.2pc of caregivers had heard of cervical cancer, 4.4pc had heard of HPV, and less than 3pc knew about the HPV vaccine.\n\nThis knowledge gap makes the role of trusted community figures — religious le­­aders, teachers, he­­a­­-\n\nlth workers and lo­­cal influencers — all the more critical. These voices can de­­mystify the vaccine, dispel myths and encourage uptake, particularly among hesitant parents and hard-to-reach families. At a recent national immunisation workshop, experts noted that misinformation, lack of reliable information and unclear communication were among the top drivers of vaccine hesitancy — particularly around HPV.\n\nThat’s where CSOs come in — to help localise solutions, spark conversations, and amplify messages through those the communities trust most. Their involvement ensures that vaccine introduction efforts are not only scientifically sound but socially embraced.\n\nReligious and traditional leaders are already stepping up. Their support, combined with a robust stakeholder engagement plan, will be key to boosting HPV vaccine acceptance.\n\nAll children have the right to health. Ensuring equitable access to lifesaving vaccines — regardless of race, religion and socioeconomic background — is central to that right. The introduction of the HPV vaccine into Pakistan’s national immunisation programme is a landmark investment. It is not just a win for public health but a promise to protect future generations of girls from preventable cancer.\n\nThe writer is a journalist.\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ab9dd19150d.jpg",
  "retrievedAt": "2025-08-26T11:20:25.128Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937053/cervical-cancer",
  "dateList": "2025-08-26",
  "date_published": "2025-08-25T00:30:50.000Z"
}
