{
  "title": "Pakistan, Morocco discuss visa facilitation, bilateral cooperation - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan–Morocco Parliamentary Friendship Group on Monday pledged to deepen bilateral cooperation through regular people-to-people connectivity and exchange of visits.\n\nA meeting of the Group was held at the Parliament House. Senator Bilal Ahmed Khan chaired the meeting. Ambassador of the Kingdom of Morocco, Mr Mohamed Karmoune, along with senior Moroccan officials and members of the Senate, attended the meeting.\n\nIn his opening remarks, Senator Bilal underscored the importance of fostering closer parliamentary, economic and diplomatic ties between the two countries.\n\nKarmoune reaffirmed Morocco’s commitment to advancing bilateral relations with Pakistan. He stressed the importance of balancing trade by encouraging greater imports from Pakistan.\n\nDuring the meeting, challenges faced by Moroccan nationals in obtaining Pakistani visas were also discussed. Ambassador Karmoune added that Morocco has already extended the facility of e-visa for Pakistani citizens and requested reciprocal facilitation to ease the process for Moroccan applicants.\n\nBoth sides expressed mutual interest in expanding cooperation in key sectors such as education, health, trade, and agriculture.\n\nThe group emphasised that regular parliamentary exchanges can serve as a strong foundation for long-term collaboration and people-to-people connectivity.\n\nSupporting these views, Ms Misbah Khar highlighted the need for institutional collaboration within bilateral and constitutional policy frameworks. She also identified trade, tourism, and cultural exchange as key areas for building a long-term partnership.\n\nSenator Faisal Saleem Rahman identified several promising areas for future collaboration, including education, medical equipment, sports, tourism, and defence training.\n\nHe emphasised that a bilateral agreement should be established between Pakistan and Morocco to promote tourism. He also stated that scholarships should be awarded to Students in Pakistan on a province-wise basis.\n\nThe meeting concluded with both sides reaffirming their commitment to further deepen Pakistan–Morocco relations through sustained parliamentary diplomacy and enhanced institutional cooperation.\n\nMembers underscored that continued dialogue, regular exchanges and practical initiatives will catalyse fostering stronger bilateral ties and greater people-to-people connectivity.\n\nThose who attended the meeting included Senators Faisal Saleem Rahman, Mir Dostian Khan Domki, Umer Farooq and Advisor to the Chairman Senate, Ms Misbah Khar.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/26112402d5687ed.webp",
  "retrievedAt": "2025-08-26T11:20:12.317Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937200/pakistan-morocco-discuss-visa-facilitation-bilateral-cooperation",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:25:08.000Z"
}
