{
  "title": "Ties that bind - Newspaper - DAWN.COM",
  "author": null,
  "content": "RELATIONS between Pakistan and Bangladesh, which had hit a low point during Sheikh Hasina Wajed’s rule, are on the mend under the interim administration in Dhaka.\n\nForeign Minister Ishaq Dar recently wrapped up a trip to Bangladesh — the first time a Pakistani foreign minister has visited Dhaka in 13 years. He received a warm reception, with six “instruments” signed to bolster ties in various sectors, while Chief Adviser Muhammad Yunus and Bangladesh’s adviser on foreign affairs both expressed a wish to deepen relations. There was also talk of reviving Saarc, though both states differed on how to approach the tragic events of 1971.\n\nDhaka insists on an apology for the violent upheaval that led to the break-up of united Pakistan as well as reparations, while Islamabad feels these questions have already been settled.\n\nSheikh Hasina’s regime used the 1971 war to justify its hostile attitude towards Pakistan and warm ties with India. But there have been changes in Bangladesh since then.\n\nFor example, after the ouster of the Awami League government last year, there have been violent attacks on statues and institutions linked to Sheikh Mujibur Rahman — once virtually deified as ‘Bangabandhu’ — and the interim set-up has removed his visage from Bangladeshi currency.\n\nThese reactions have occurred largely because Sheikh Hasina’s government had promoted a personality cult around Sheikh Mujib, and unleashed a ruthless crackdown on all opposition forces. Therefore, while both Islamabad and Dhaka should continue their discussions on how to approach the 1971 events, this issue should not become an obstacle to better ties, as both capitals have common grounds for friendship.\n\nIn this context, there is merit in the Pakistani state’s argument that differences over the separation of East Pakistan and the creation of Bangladesh have been addressed by Pakistan’s 1974 recognition of Bangladesh, and Gen Pervez Musharraf’s expression of “regret” during his 2002 visit for the excesses of 1971.\n\nThere is indeed a need for all sides to come to terms with the tragedy of 1971, but this does not mean that Islamabad-Dhaka ties should remain forever hostile.\n\nMeanwhile, while the suggestion to revive Saarc may be well-intentioned it is impractical at this point because of India’s intransigence — even if it is worth a try. There is already a trilateral cooperation mechanism involving China, Pakistan and Bangladesh.\n\nThis forum can be further explored to deepen ties between the three states, and other regional countries who wish to work together for progress can be invited to join. Pakistan and Bangladesh share a common history and culture, and despite the painful events of 1971, they can become partners in regional progress through trade and people-to-people ties. It is hoped that the next elected government in Dhaka will also work to improve ties.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T11:20:05.480Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937278/ties-that-bind",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:34:43.000Z"
}
