{
  "title": "Berlin urged to help Afghans stranded in Pakistan - World - DAWN.COM",
  "author": null,
  "content": "BERLIN: Dozens of organisations on Monday urged the German government to act “before it’s too late”, to help thousands of Afghans threatened with deportation from Pakistan whom Berlin had previously offered sanctuary.\n\nIn an appeal organised by the German Bar Asso­ciation, more than 50 gro­ups and institutions said swift action was needed to save the more than 2,000 stranded Afghans from being sent back to their Taliban-run homeland.\n\nThe Afghans are part of a group previously offered refuge in Germany but now caught between Chancellor Friedrich Merz’s tougher immigration policy and a wave of expulsions from Pakistan.\n\nThe organisations, inc­luding Amnesty Interna­tional, Reporters Without Borders and the Caritas charity, said the government must “drastically speed up” the process of security checks for those who had been accepted under the scheme.\n\nIn addition, those who have been approved must be “immediately evacuated”, they argued. The groups stressed that those at risk included “lawyers, judges, human rights activists, journalists and members of particularly endangered minorities”.\n\n“Germany bears a special responsibility towards the people who have placed their trust in us and whose commitment to democracy, human rights and the rule of law has now made them targets in Afghanistan,” the organisations said.\n\nLast week, the German government said 450 Afghans waiting to come to Germany had been arrested in recent raids by Pakistani authorities, which have been carrying out a crackdown on Afghans without legal residency.\n\nThe German foreign ministry said on Monday it was in contact with more than 200 of those arrested who had been deported to Afghanistan.\n\nThe reception scheme was initially set up under the previous chancellor Olaf Scholz after the Taliban’s 2021 takeover.\n\nIt was intended to provide refuge to those who had worked with German forces in Afghanistan or who were at particular risk from the Taliban.\n\nHowever, Merz made restrictions on immigration one of his key promises when taking office in May and his government has put the scheme under review.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T11:20:16.195Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937246/berlin-urged-to-help-afghans-stranded-in-pakistan",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:24:47.000Z"
}
