{
  "title": "Aleema rejects reports of tense exchange with PTI’s Salman Akram Raja - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI founder Imran Khan’s sister, Aleema Khanum, on Tuesday rejected rumours of a tense exchange with PTI Secretary General Salman Akram Raja that allegedly led to his decision to resign.\n\nThere seems to be a tug of war within the PTI over whether to participate in the upcoming by-elections for national and provincial assembly seats — vacated after the recent disqualifications of a number of key lawmakers. Insiders had told Dawn the party’s political committee — in its meeting on Monday — had a change of heart after a majority of members voted against the decision to boycott by-polls. This contravenes the opinion reportedly expressed by Imran, transmitted by Aleema on a couple of occasions, to steer clear of by-elections so that the party isn’t seen as legitimising the process.\n\nPTI Central Information Secretary Sheikh Waqqas Akram had shared the party’s decision on social media and triggered a wave of criticism from across the globe. When approached, Akram confirmed that he, Raja and a few others were against the decision, but they had to go with the majority. In a dramatic turn of events, however, Raja announced his intention to step down from the post of secretary general. Although he did not specify what prompted him to take this decision, the timing of his X post indicated that the “incident” he referred to was — in all probability — the political committee’s decision to contest by-polls.\n\nQuestioned about reports of a tense exchange with him being the cause of his decision, Aleema said while talking to the media outside Adiala Jail today: “I had no bitter exchange of words with him. He is our lawyer and like a family [member] with all of us, but I think it is more so [a matter] of his own [decision] and that of the political committee. It is an issue [of participation] in the by-election and you should ask him (Raja).”\n\nPushed on the reports of a disagreement in the party over whether to contest the by-elections or not, Imran’s other sister, Uzma Khanum, interjected and said: “The party will tell what conflict it was. As per our last family meeting, Khan sahib very firmly, repeatedly and clearly said not to contest the elections but to boycott them because there will be no benefit, it will harm the party and the [movement] for actual freedom and the illegitimate disqualifications would be legitimised.”\n\nAddressing the media later, Aleema said Imran had directed PTI lawmakers to resign from parliamentary committees and to inform him about the political committee’s decision regarding the by-elections tomorrow morning after holding a meeting later today on the issue based on his instructions.\n\nMeanwhile, Raja said while talking to the media that Imran had not accepted his decision to resign.\n\nHe added that the political committee would have a meeting again today to discuss the issue of participating in the by-elections based on Imran’s “clear instructions”.\n\nRaja further said that the PTI had a clear stance that Omar Ayub and Shibli Faraz were still the opposition leaders in the National Assembly and Senate, adding that they were still contesting their cases and would fulfil all legal requirements.\n\n“If there is a need after that, then the name that Imran has repeated today for the NA opposition leader is that of Mehmood Khan Achakzai.”\n\nRaja explained that Imran gave his “clear directions” about participating in the by-polls after listening to all those allowed to meet him today, including his sisters.\n\nMeanwhile, PTI Chairman Barrister Ali Gohar said he had not read Raja’s statement on resigning as secretary general, nor had he received any resignation in writing.\n\n“Imran will decide whether he decides to continue or not. It is unfortunate. I’ve always said that something always comes up from inside the party and people make it an issue. Imran said that no party leader would mention their resignation in public.”\n\nThe PTI has already obtained stay orders against the de-seating of key opposition leaders. It has also, albeit reluctantly, nominated replacements while the party pursues legal options.\n\nBut faced with threats on multiple fronts — including the possible loss of maj­o­rity in the Khyber Pakhtunkhwa Assembly due to future disqualifications, a push to reclaim political space in Punjab, and a showdown between two opposing camps within the party — it seems as if the PTI may throw its hat in the ring, despite all misgivings about the by-elections. According to sources privy to proceedings, Monday’s meeting of the political committee had voted 12-9 in favour of fielding candidates for the upcoming by-elections.\n\nAdditionally, Akram had announced that all candidates would be issued tickets under the banner of the Sunni Ittehad Council, which appears to be an insurance policy of sorts, to offset chances of them being declared ‘independent candidates’, since the dispute around PTI’s intra-party elections and the matter of its electoral symbol are still in limbo.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/261815045e38b5d.webp",
  "retrievedAt": "2025-09-06T09:48:25.225Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937376/aleema-rejects-reports-of-tense-exchange-with-ptis-salman-akram-raja",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T12:51:16.000Z"
}
