{
  "title": "New Zealand fast bowler Will O’Rourke out for three months as injuries mount - Sport - DAWN.COM",
  "author": null,
  "content": "Fast bowler Will O’Rourke will be out for at least three months with a stress fracture in his lower back, New Zealand Cricket said onb Tuesday, adding to a mounting injury list.\n\nThe 24-year-old was injured while bowling in the first Test against Zimbabwe this month and returned home, where scans revealed the extent of the damage.\n\n“We’re really feeling for Will at the moment and wishing him speedy recovery,” New Zealand head coach Rob Walter said.\n\nO’Rourke will miss the home white-ball series against Australia in early October, England later that month and the West Indies in November.\n\nAll-rounder Glenn Phillips was also ruled out of the Australia series as he recovers from the groin injury that saw him miss the Zimbabwe tour.\n\nAnd opening batsman Finn Allen will be out for a minimum of three months after having surgery on his right foot.\n\n“It’s disappointing to lose the services of Glenn and Finn, who have played important batting roles in our T20 set-up in recent times,” said Walter.\n\nWhite-ball captain Mitchell Santner returned home from England’s The Hundred tournament at the weekend after feeling groin pain.\n\nWalter said the spinning all-rounder will now have abdominal surgery with an expected recovery time of a month, but would be given every chance to prove his fitness before the three T20s against Australia.\n\n“Mitch is a world-class player and a crucial part of our T20 side from a skills and leadership point of view,” said Walter.\n\n“With that in mind we expect to name him in our squad. From there we can assess how his rest and rehabilitation progresses following surgery, before making a call on the eve of the series.”\n\nPace bowler Ben Sears has recovered from a side strain that saw him miss the Zimbabwe tour and is expected to be available.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/26180145718daca.webp",
  "retrievedAt": "2025-09-06T09:48:26.065Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937378/new-zealand-fast-bowler-will-orourke-out-for-three-months-as-injuries-mount",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T13:06:27.000Z"
}
