{
  "title": "‘Early monsoon, extreme heat behind widespread devastation’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A climate expert said on Monday that Pakistan’s monsoon set in around July 1 this year, two weeks earlier than usual and parts of the country experienced above-normal rainfall and searing heat that hastened glacial melt and unleashed glacial lake outburst floods (Glofs).\n\n“This year, monsoon onset was early from July 1 instead of July 15,” said Dr Shehzada Adnan, a senior meteorologist, at a virtual roundtable hosted by the Sustainable Development Policy Institute (SDPI).\n\n‘Depressions from the Bay of Bengal converged over both northern and southern regions, while westerly systems shif­ted unusually far north,’ he explained.\n\nRainfall was 13 per cent above the seasonal norm in north-eastern Punjab and Kashmir, he added, while temperatures rose by as much as 6-7°C, accelerating glacier melt and triggering Glofs.\n\nDue to poor storage capacity in major river catchments, Mr Adnan said flooding in eastern rivers continues to devastate farmland.\n\nHowever, it is worth mentioning that the National Disaster Management Authority (NDMA) began reporting monsoon-related fatalities in late June, indicating that the season’s effective onset had occurred even earlier.\n\nThe roundtable — Unprecedented Monsoon Impacts in Pakistan: Climate Extremes and Humanitarian Challenges — drew together researchers, humanitarians and policy specialists as the country faced what several participants called a climate-induced crisis.\n\nA devastating monsoon season marked by record rainfall, glacier melt and widespread flooding has exposed Pakistan’s extreme vulnerability to climate change, they said, demanding urgent investment in climate-resilient plans to preempt future disasters.\n\n“Pakistan contributes less than one percent of global emissions but remains among the world’s top 10 most climate-vulnerable countries,” said Dr Shafqat Munir, Deputy Executive Director at SDPI. “This is no longer just a natural hazard — it is a climate-induced humanitarian crisis.”\n\nMr Munir highlighted that the NDMA has presented 2025 contingency plans for four risk scenarios: heavy inflows merging into the Indus from mountain rains, flash floods in northern mountains, urban flooding in Karachi, and glacier melt; three have already occurred this season.\n\nExperts stressed that a key failure is the public’s behavioural response.\n\n“Pakistan’s greatest weakness was lack of preparedness and community drills,” said Dr Sofia Khalid, Chairperson of the Department of Environmental Sciences at Allama Iqbal Open Univer­sity. “Despite repeated warnings from NDMA, people often ignore alerts. Our behavioural response remains reactive.”\n\n“Communities in flood-prone areas must be trained on safe evacuation points, emergency contacts, and disaster drills. Preparedness can save lives,” she added.\n\nThe humanitarian fallout from these disasters disproportionately harms the most vulnerable, another speaker highlighted.\n\n“Floods and climatic shocks disproportionately affect women, children, and minorities,” said Dr Andaleeb Koasar Jhatial, a lecturer at the International Islamic University Islamabad.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/260955000cfe69a.webp",
  "retrievedAt": "2025-08-26T11:20:05.299Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937252",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:24:26.000Z"
}
