{
  "title": "Pakistan buys initial 30,000 tonnes sugar in tender, traders say - Business - DAWN.COM",
  "author": null,
  "content": "The Trading Corporation of Pakistan (TCP) has purchased an initial 30,000 tonnes of white sugar in an international tender seeking around 200,000 tonnes, European traders said on Tuesday.\n\nOn July 8, the government had approved plans to import 500,000 tonnes of sugar to help maintain price stability. Market analysts said that retail sugar prices in the country have risen sharply since January.\n\nThe validity of other price offers submitted in the tender, which closed last week, has been extended until tomorrow, so more purchases are seen as possible, traders said.\n\nThe initial 30,000-tonne purchase was believed to have been made from Al Khaleej Sugar for medium-grade sugar at an estimated $582.50 a ton, cost and freight (c&f) included, they said.\n\nReports reflect assessments from traders, and further estimates of prices and volumes are still possible later. The tender sought sugar from worldwide origins, excluding India and Israel.\n\nThe TCP is believed to have purchased about 55,000 tonnes of white sugar in a previous international tender seeking up to 100,000 tonnes. The recent purchase will bring the total amount of sugar bought to 85,000 tonnes.\n\nThe government has vowed strict monitoring of sugar stocks and also placed some unidentified mill owners on the Exit Control List in a bid to stabilise rates.\n\nA cartelisation case involving 79 sugar mills and the Pakistan Sugar Mills Association (PSMA) is also being heard by the Competition Commission of Pakistan (CCP).",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T11:19:57.142Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937349/pakistan-buys-initial-30000-tonnes-sugar-in-tender-traders-say",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T08:54:51.000Z"
}
