{
  "title": "SECP rejects auditor’s findings of unlawful pay, perks - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Securities and Exchange Commission of Pakistan (SECP) on Monday challenged the Auditor General of Pakistan’s (AGP) audit report 2024-25, which alleged that pay and allowance increases for its senior management were made unlawfully and without due process.\n\nIn challenging the report, the commission also claimed that the auditor general’s office lacked the authority required to conduct the financial scrutiny.\n\nThe move by the SECP follows similar pushback against the auditor general from the Pakistan Telecommunication Company Ltd and the Pakistan Telecommuni­cations Authority.\n\nThe audit objections noted that the salary and perks of the SECP chairman and commissioners were raised for the two previous fiscal years. The report also mentioned that the SECP failed to deposit revenues and surplus balances into the Federal Consolidated Fund.\n\nChallenges AGP’s authority to conduct financial scrutiny\n\nIn a statement, the SECP maintained it was a “statutory body with administrative, financial, and functional independence,” as provided under the SECP Act of 1997 and international standards for capital market regulators.\n\n“All decisions and actions cited above, by the Commission, have been taken strictly in accordance with the SECP Act, 1997, and with the due approval of the competent authority,” the SECP said.\n\nThe commission argued the audit report is preliminary and will be reviewed by the Departmental Accounts Committee (DAC), where its position will be formally presented.\n\n“The report is currently based on observations only and it will be taken up at the DAC level, where opinions from both AGP and SECP will be sought before concluding on the matter,” the statement said.\n\nThe SECP said similar observations raised by the AGP in the past were settled in its favour by the Public Accounts Committee (PAC) in July 2025.\n\n“It is regrettable that despite the decision, the issue has been raised again without seeking the opinion from Finance or Law Ministry,” the SECP said, expressing confidence that the matter would be settled based on the existing precedent.\n\nThe commission stated that its Policy Board, which includes secretaries from the finance, commerce and law divisions, the deputy governor of the State Bank of Pakistan, and private sector experts, has final approval of all budgetary decisions.\n\nTo attract and retain professionals with “exceptional expertise and integrity,” the SECP said it periodically reviews remuneration packages with the Policy Board’s approval, using market surveys to ensure competitiveness.\n\nThe SECP also expressed dismay at what it called “imbalanced reporting” in the media, stating that its responses included in the audit report were not shared publicly. It also said a claim that it did not respond to a DAC meeting invitation was “factually incorrect,” as no such invitation was received.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T11:20:22.445Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937249/secp-rejects-auditors-findings-of-unlawful-pay-perks",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:24:26.000Z"
}
