{
  "title": "PSX loses 677 points on IMF concerns - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakis­tan Stock Exchange (PSX) took a dip on Monday, as investors opted to take profits amid growing concerns over the release of the third tranche of the International Monetary Fund (IMF) loan. The market saw a volatile session, with the benchmark KSE-100 index fluctuating sharply before closing down.\n\nAhsan Mehanti of Arif Habib Corporation attributed the bearish market performance to institutional profit-taking in an overbought market. He highlighted the impact of flat government bond yields, foreign outflows, concerns over external debt, and losses in state-owned enterprises (SOEs). Furthermore, uncertainty surrounding the outcome of the IMF’s next review, particularly the unmet conditions for provincial tax collection, added to investor anxiety.\n\nTopline Securities reported that the bourse began the “rollover week” on a volatile note. After hitting an intraday high of 586 points, the index dropped sharply by 735 points, closing at 148,815—down by 677 points, or 0.45 per cent. Investors opted for cautious trading, booking gains amid the uncertainty.\n\nOn the sectoral front, stocks like Bank Alfalah, National Bank, The Searle Company, and Pakistan Aluminium Beverage Cans Ltd helped support the index, contributing a combined 92 points. However, losses in key stocks such as Bank Al-Habib, Systems Ltd, Meezan Bank, Habib Bank, and Lucky Cement dragged the index lower by 394 points.\n\nInvestor participation showed a marked decline, with trading volume falling 13.55pc to 693.3 million shares. The trade value also decreased significantly by 34.87pc to Rs26.3 billion. Kohinoor Spinning Mills OM led the volume chart, with 113.8 million shares changing hands.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, noted that the market had started the session with strong momentum, as the KSE-100 index briefly touched 150,080, up 587 points. However, investor sentiment soured following comments from the finance minister regarding Pakistan’s risk of slipping back into the FATF grey list. The warning came as nearly 15pc of the population engages in unregulated digital transactions, which could invite global scrutiny and affect the country’s financial credibility.\n\nAs the KSE-100 index consolidates around the key psychological level of 150,000, analysts predict that selling pressure may continue due to the rollover week. A healthy correction could be on the horizon, with the 148,000 mark seen as a major support level.\n\nPublished in Dawn, August 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68acde38f015a.jpg",
  "retrievedAt": "2025-08-26T11:20:19.034Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937229/psx-loses-677-points-on-imf-concerns",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T02:24:34.000Z"
}
