{
  "title": "Engineer Muhammad Ali Mirza detained under MPO, also booked under blasphemy charges - Pakistan - DAWN.COM",
  "author": null,
  "content": "Jhelum police said on Tuesday that they have detained cleric Engineer Muhammad Ali Mirza for 30 days under the Maintenance of Public Order (MPO) ordinance for alleged controversial remarks and later booked him under blasphemy charges.\n\nMirza, a resident of Machine Mohallah of Jhelum city, frequently uploads his lectures and speeches on his social media accounts and has amassed 3.1 million followers on his YouTube channel.\n\nEarlier today, Jhelum Deputy Commissioner Muhammad Meesam Abbas and District Police Officer (DPO) Ahmed Mohiyuddin confirmed Mirza’s arrest under MPO to Dawn.com.\n\nSection 3 of the MPO ordinance gives authorities the power to arrest and detain suspected persons to prevent “any person from acting in any manner prejudicial to public safety” or to maintain public order.\n\nA religious group had yesterday filed an application, seen by Dawn.com, requesting legal action against Mirza for alleged controversial remarks made during an interview that “went viral on social media”.\n\nSeparately, a first information report (FIR) was registered at the Jhelum city police station on August 26 under Section 295 C (use of derogatory remarks, etc, in respect of the Holy Prophet) of the Pakistan Penal Code and Prevention of Electronic Crimes Act (2016).\n\nMirza “has severely hurt the religious sentiments of Muslims by making blasphemous remarks”, the FIR read. The complainant said that legal action must be taken against Mirza under Section 295C of the blasphemy laws.\n\nMirza was also among 17 clerics whose speeches were banned by then-Jhelum DC during Muharram last year to prevent any potential sectarian violence.\n\nThe popular cleric survived an assassination attempt at a religious academy in March 2021. The suspect was taken into custody, and a case of attempted murder was registered against him.\n\nThe cleric had also been booked and arrested by the Jhelum police in May 2020 for derogatory remarks against some religious figures. However, he was later released on bail.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/261159341c8649c.webp",
  "retrievedAt": "2025-09-06T09:48:28.172Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937333/engineer-muhammad-ali-mirza-detained-under-mpo-also-booked-under-blasphemy-charges",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T07:27:12.000Z"
}
