{
  "title": "FIA arrests 2 traffickers in Gwadar for sending Pakistanis to Iran via illegal routes - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two human traffickers were arrested in Balochistan’s Gwadar for attempting to send citizens to Iran via illegal sea routes, the Federal Investigation Agency (FIA) said in a statement on Tuesday.\n\nHuman smuggling from Pakistan to Iran has been a persistent issue, with many migrants attempting to cross through perilous land and sea routes in search of better economic opportunities or to reach onward destinations in the Middle East and Europe, according to a report by the National Initiative against Organised Crime. Gwadar and other parts of Balochistan are frequently used as key transit points, where traffickers exploit vulnerable citizens by charging hefty sums for the dangerous journeys.\n\nPer the FIA’s statement, “major operations” were carried out by the agency’s Composite Circle Gwadar, through which the suspects were arrested from different areas of the district.\n\n“The arrested suspects are involved in sending citizens from Pakistan to Iran through illegal sea routes,” it said. “The suspect extorted Rs10,000 each from the victims.”\n\nThe suspects were arrested after being identified by the victims, the statement further said, adding that an investigation into the matter had been initiated.\n\nLast week, FIA Balochistan arrested five traffickers in Taftan and Loralai for allegedly facilitating illegal travel abroad using fake documents and charging millions of rupees from the victims.\n\nThe group was sending people to Iran and Turkiye through illegal routes and fake documents, according to the FIA spokesperson.\n\n“Three of the suspects were listed as most wanted by Pakistani embassies in Iran and Turkiye,” the spokesperson said, adding that they had already sent large numbers of people abroad illegally.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/26123139ed8adad.webp",
  "retrievedAt": "2025-08-26T11:19:57.440Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937335/fia-arrests-2-traffickers-in-gwadar-for-sending-pakistanis-to-iran-via-illegal-routes",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T08:14:31.000Z"
}
