{
  "title": "Pakistan, Iran army chiefs affirm readiness to eradicating terrorism for secure borders - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff Field Marshal Asim Munir and his Iranian counterpart, Major General Abdolrahim Mousavi, affirmed their readiness on Tuesday to eradicate terrorism for securing the borders of both countries.\n\nPakistan and Iran, earlier this month, agreed that peace and prosperity in their border regions hinged on effectively combatting terrorism. The nearly 900-kilometre border between the two countries has long faced security threats from proscribed groups, such as Jaish al-Adl and the Balochistan Liberation Army. Persistent issues, including terrorism, smuggling, and mutual accusations of harbouring militants, have periodically strained ties.\n\nA statement issued by the Iranian embassy said Field Marshal Munir and Gen Mousavi, the chief of staff of the Iranian Armed Forces, held a telephonic conversation today.\n\n“The two sides are ready to eradicate terrorism to secure common borderlines,” it read.\n\nA statement carried by Iranian state news agency IRNA said Gen Mousavi mentioned that Iran was prepared to eradicate terrorism and secure its borders with Pakistan, pointing to growing cross-border movements of terrorist groups and calling for joint efforts to eliminate terrorism.\n\nIt added that Field Mashal Munir echoed the call for securing common borders, saying the two sides must “jointly turn the Pakistan-Iran border into a border of friendship, brotherhood, and economic development”.\n\n“Field Marshal Munir expressed his gratitude for Mousavi’s sympathy for the Pakistani nation and expressed his condolences for the families of the victims of the recent terrorist attack in Iran’s Sistan and Baluchestan Province.”\n\nGen Mosavi also expressed his sympathy with the flood-affected victims in Pakistan, saying that “Iran would proudly provide any assistance within its power to dear brothers in Pakistan”.\n\nHe further expressed his satisfaction over bilateral ties, saying both countries were interacting and cooperating at various levels, particularly commending Pakistan’s stance and support for Iran during the 12-day war with Israel.\n\nIn his visit earlier this month, Iranian Presi­dent Masoud Pezeshkian had said that development of economic and trade ties would be achieved through peace, stability and tranquillity.\n\n“Given the threats from terrorist groups in border areas, both sides emphasised the need to increase cooperation to ensure border security and safeguard the peace and well-being of citizens in border cities,” the Iranian president had added.\n\nPrime Minister Shehbaz Sharif had acknowledged that security was paramount for progress in bilateral relations. “There will be zero tolerance for all forms of terrorism. If anyone falls victim to terrorism in Iran, it is the same as someone being affected by terrorism in Pakistan,” he had said.\n\n“For peace and development in our region, and along our hundreds of kilometres-long shared border, we must cooperate against terrorism and take effective steps to eliminate the scourge of terrorism once and for all,” the PM had added.\n\nWhile the two leaders voiced their commitment to deepening cooperation, specific operational details were reportedly discussed in President Pezeshkian’s meeting with Field Marshal Munir.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:48:24.829Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937384/pakistan-iran-army-chiefs-affirm-readiness-to-eradicating-terrorism-for-secure-borders",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T15:29:44.000Z"
}
