{
  "title": "Country’s economy heading towards right direction: Miftah Ismail",
  "link": "https://www.app.com.pk/national/countrys-economy-heading-towards-right-direction-miftah-ismail/",
  "date_published": "2022-09-02T16:04:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 02 (APP): Federal Minister for Finance and Revenue Miftah Ismail on Friday said the country’s economy was moving in the right direction due to prudent policies of the incumbent government.\nAddressing a discussion on “Current State of Pakistan’s Economy” at IBA Karachi, he said revival of the IMF programme was top most priority of the government after coming into power.\nMiftah Ismail said going to IMF was a hard political decision, but it was the last resort.\nHe justified the IMF programme by stressing that it was only to save the country that harsh measures were undertaken. The agreement with IMF was violated which caused difficulties in revival of its program.\nHe also criticized the measures taken by previous government which created challenges for the economy, pushing the country towards the brink of bankruptcy.\nLoans of about Rs. 20,000 billion were taken during the tenure of Imran Khan’s government.\nHe said the government imposed ban on the import of luxury items for three months. “We need to understand that we have cut down our expenses. The previous government spent more than the loan it borrowed,” said Miftah Ismail.\nThe minister said the government by adopting prudent policies had saved the country from default.\nHe informed the audiences that government was well aware of the issues being faced by common man and was making all out efforts to provide relief to the citizens.\nHe said the PML-N government had doubled the electricity production in the country. He expressed the hope that electricity prices would decline in the coming months.\nMiftah Ismail also highlighted some areas that need immediate attention, including the need for improving agricultural productivity; improving the current account balance by restricting imports and increasing the export base; improving quality of education; and improving economic governance.\nThe Minister also shed light on the damages in terms of life and infrastructure caused by the recent floods.\nHe said the flash floods had caused devastation on a large scale in the country. The flood-affected people would not be left alone in this testing times and they would be compensated by utilizing all available resources, even diverting PSDP funds for their rehabilitation. The government through Benazir Income Support Programme (BISP) had disbursed about Rs. 28 billion for provision of relief to the flood victims, he said.\nHe said initially an amount of Rs. 25, 000 was being paid to affected families so that they could meet their ration needs.\nThe discussion was moderated by the Executive Director IBA, Dr. S Akbar Zaidi. The event was attended by IBA faculty, students, external guests, and media, and a full-house ensued on campus.",
  "retrievedAt": "2025-08-11T15:30:28.222Z"
}
