{
  "title": "Rescue 1122 timely response saves one year old pulseless baby",
  "link": "https://www.app.com.pk/national/rescue-1122-timely-response-saves-one-year-old-pulseless-baby/",
  "date_published": "2022-09-02T17:42:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Sep 2 (APP): The Rescue 1122 on Friday successfully saved the life of one year old baby boy in critical condition while promptly responding to an emergency call for help and ambulance service.\nA Rescue 1122 official told APP that a couple from Mardan brought their one year old boy –Hamza son of Nasir Shah in critical condition to the Military Hospital (MH) for treatment without knowing the fact that it had no paeds department to treat children.\nThe parents of the child lacked information about the concerned healthcare facility and that’s why went to that hospital. However, the MH provided necessary first aid to the child and referred him to a public hospital for further treatment, he added.\nThe parents called 1122 for ambulance service to shift their child in severe condition to a public hospital, he said.\nThe ambulance was moved to the spot and on arrival it was found that the child had low pulse and sugar level, he added.\nThe official mentioned that when the team reached the child was found critical and upon shifting him into ambulance alongwith hospital staff he lost his pulse and respiratory rate.\n“I immediately started a professional CPR and after completing two cycles also attached oxygen that helped the child revive his pulse and respiratory rate.”\nHe added that he also checked the child’s sugar level and was observed low and administered him dextrose 25% ampoules and continued monitoring the child.\nThe child was brought at the Holy Family Hospital successfully in living condition where the parents chanted slogans with joy for Rescue 1122 and thanked the entire staff for their timely assistance.\nThe Rescue 1122 official noted that the doctor who inspected the child also gave commendatory remarks for efficient and professional rescue service, he said.",
  "retrievedAt": "2025-08-11T15:30:28.218Z"
}
