{
  "title": "Marriyum urges Imran Khan to shun politics as country reels under ‘unprecedented floods’",
  "link": "https://www.app.com.pk/national/marriyum-urges-imran-khan-to-shun-politics-as-country-reels-under-unprecedented-floods/",
  "date_published": "2022-09-01T19:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 01 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Thursday asked PTI chief Imran Khan to join the government’s rescue and relief efforts in different parts of the country which were under water after torrential rains and unprecedented floods.\n“This is not the right time for politicking and dividing the people instead there is a need to show solidarity and unity for the sake of those who have been passing through difficult times due to flash floods which caused heavy loss of life and property,” the minister said while addressing a news conference.\nFlanked by Coordinator to the Prime Minister on Energy and Economy Bilal Kiyani, she said it was not the right time to hold public gatherings as the people were in dire need of help at the moment.\n“Shun politics and join us in helping the people who have lost their family members, homes, livestock and crops in the floods,” she added.\nThe minister said, 60 per cent of the country was under water and 1,200 people had lost their lives, while 4,000 got injured so far whereas some 400 children were also among the dead.\n“This is an evolving situation and the National Disaster Management Authority (NDMA) is monitoring the situation and sharing the flood related updates regularly,” she noted.\nMarriyum said the country was in the grip of climate change phenomena despite contributing less than one per cent in the carbon emission. It had faced intense heat wave in the summer and the intensity of flood was also “unprecedented” due to massive rains which were recorded 450 per cent more than the previous monsoon seasons.\nShe said Prime Minister Shehbaz Sharif had visited the flood affected areas in Balochistan, Sindh and Khyber Pakhtunkhwa, and would visit other areas to assess the on-ground situation.\nThe prime minister was personally monitoring the flood situation and holding meetings with international donor agencies to bring normalcy in the affected areas by ensuring timely provision of relief goods to the people, she added.\nThe minister said the federal government, NDMA, Pakistan Army and civil administration were vigorously carrying out rescue and relief operations in the flood hit areas.\nHeli operations were also underway in those areas where the connectivity had been disrupted due to the flash floods, she said.\nMarriyum siad an amount of Rs 15 billion had been disbursed among 600,000 families from the Prime Minister Emergency Relief Fund. Rs 25,000 was being given to each family through the Benazir Income Support Programme.\nShe said funds amounting to Rs 15billion were given to Sindh, while Balochistan and Khyber Pakhtunkhwa received Rs 10 billion for providing relief to the people.\nThe minister said the prime minister had constituted the National Flood Response and Coordination Centre which had representation of all the provincial governments, armed forces and experts. The centre, headed by the prime minister, would help give institutional response to the flood calamity.\nShe said surveys were being conducted in the flood hit areas to ensure education and health of the people.\nA rehabilitation and reconstruction plan was being worked out by a committee headed by Minister for Planning Ahsan Iqbal, which would be presented to the prime minister soon, she added.\nMarriyum said communication infrastructure was being repaired and restored in the flood hit areas, while Minister for Power Khurram Dastagir was visiting different parts of Sindh and KP where the electricity transmission was suspended due to the floods.\nPakistan Muslim Nawaz (PML-N) leader Nawaz Sharif was personally monitoring the rescue and relief operations, and was being briefed on the flood situation regularly, she said.\nThe minister lauded the media for guiding the government in the rescue and relief operations, and running a massive campaign for the PM’s relief fund. The role of international donor agencies and friendly countries which were sending relief goods to Pakistan was commendable.\nShe also appreciated the corporate sector role and efforts of Pakistan Army soldiers and officials of civil administrations for carrying out rescue and relief activities across the country.\nShe urged the Punjab and KP governments to fully focus on the flood affected areas.\n“If these provincial governments indulged themselves in organizing Imran Khan’s jalsas (public gatherings) then who will take care of the people who have been facing the flood devastation?” she questioned.\nImran Khan should visit the flood hit areas instead of holding public gatherings as it was not the time for politics, she stressed.\nShe came down hard on Imran Khan for rejecting PM Shehbaz Sharif’s call for cooperation amidst the floods. He (Imran) was hurling abuses on his political opponents and blaming them all the time.\n“Imran Khan cannot blame others now as it was he who had ruled the country for the last four years and now the Pakistan Tehreek-e-Insaf has its governments in two provinces,” she remarked.\nShe regretted that Imran Khan had conspired against the country by making botched attempts to sabotage the International Monetary Fund deal with the country. He was the “enemy” of the country, she alleged.\nThe minister said Imran Khan himself admitted today that he was a dangerous person. “Yes, he is truly dangerous for the national security, media and economy.”\nShe alleged that Imran Khan was a “fascist” and “Machiavellian” as he threatened the incumbent chief election commissioner and a female magistrate for giving decisions against him.\nMarriyum said she had written to the Bank of Punjab and others for determining how much funds had been collected by Imran Khan on account of flood donations as it was the government’s responsibility to ensure transparent utilization of funds received in the name of a natural calamity.\nAs per his track record, she said, Imran Khan had used all the funds which he collected in the name of natural disasters for his politics.",
  "retrievedAt": "2025-08-11T15:30:40.068Z"
}
