{
  "title": "PAF short documentary showcases soldiers’ valour in September 2 air battle",
  "link": "https://www.app.com.pk/national/paf-short-documentary-showcases-soldiers-valour-in-september-2-air-battle/",
  "date_published": "2022-09-02T10:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 2 (APP): The Pakistan Air Force (PAF) Directorate General Public Relations on Friday released a short documentary highlighting the courage and bravery of valiant PAF heroes that showcased details of the air battle fought on September 02, 1965.\nThe two minutes and 34 seconds documentary prologue began narrating, “September 1965 bears a unique status in the history of our motherland, when PAF proved its mettle as an invincible force in war against India despite its limited resources.”It said that the PAF being on high alert inflicted heavy damages on India and that’s why on September 2nd the Indian Air Force (IAF) did not dare to intrude in Pakistan’s airspace.\nThe then Indian Prime Minister confirmed those damages in these words: “Yesterday on September 1 PAF destroyed four IAF aircraft.”\nOn September 2nd, four F-86 PAF aircraft flew from Sargodha at 5:30am led by Squadron Leader Muhammad Mahmood Alam famously MM Alam.\nThe documentary unfolded the battle scenes mentioning that the aircraft during sunrise targeted the main defence point of India namely Chamb and Jourian Sectors and incurred huge damages on the Indian ground forces. “Right after this formation, three more PAF aircraft reached the area for the same purpose. A military convoy of medium size Indian tanks was proceeding from Akhnoor towards Jourian. The formation of Squadron Leader Alam and Flight Lieutenant Younus Hussain launched a full-fledged attack on the Indian forces on ground .”\nThe PAF falcons remained for 30 minutes on the target and destroyed four Indian tanks and 20 vehicles successfully. On September 2nd amid an expected Indian ground attack from Northern Sector, No. 17 Squadron’s 10 Sabre aircraft were sent from Maripur to Sargoda under the leadership of Squadron Leader Waqar Azeem.\nAfter bearing the loss of four aircraft on September 1st the IAF decided to ground its Vampire and Ouragan against the PAF Sabre aircraft.\nHowever, due to the courage and chivalry of the PAF Falcons 35% IAF fighter fleet remained ground in the remaining war.",
  "retrievedAt": "2025-08-11T15:30:36.749Z"
}
