{
  "title": "President calls for focusing on flood-relief efforts",
  "link": "https://www.app.com.pk/national/president-calls-for-focusing-on-flood-relief-efforts/",
  "date_published": "2022-09-02T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 2 (APP): President Dr. Arif Alvi Friday called upon all stakeholders to launch a nationwide drive to mobilize the people of Pakistan, businesses, civil society and humanitarian organizations to assist civil and military administrations in their rescue and relief efforts to rehabilitate the flood victims and for the reconstruction of damaged infrastructure.\nThe President made these remarks during a meeting with senior media-persons, who called on him here at the Aiwan-e-Sadr.\nMujeeb-ur-Rehman Shami, Suhail Warraich, Gauhar Zahid Malik, Awais Rauf and Nawab Kaifee attended the meeting, a press release issued by the President’s Media Wing here said.\nTalking to the senior journalists about his visit to the flood-hit areas of Khyber Pakhtunkhwa, Southern Punjab, and the low-lying areas of Sindh and Balochistan, the President said that this unprecedented catastrophe had been induced due to global warming and climate change whereas Pakistan contributed less than 1% to the global carbon emissions.\nHe further said that the developed world, being the major contributor to global warming and climate change, should proportionally bear the burden of rescue and relief operations, reconstruction of damaged communication infrastructure, rebuilding the destroyed houses and compensating the people for lost property, livestock and standing crops.\nThe President highlighted that the climate catastrophe had affected more than 33 million people; 1,100 people including over 350 children had lost their lives; more than 1,600 people had been injured; over 1 million houses had been partially or completely destroyed; entire villages had been wiped out; over 735,000 livestock had perished; 2 million acres of crops had been inundated, and the communications infrastructure had been severely damaged.\nHe also emphasized the need for launching a nationwide drive for increasing the forest cover in the country, shifting from fossil fuels to alternative means of energy and building delay-action and large dams to minimize the effects of climate change.\nReplying to a question, he said that although as the President he did not have a constitutional obligation to play a role to defuse the current political polarization, however, if all the stakeholders agreed, he would volunteer in his personal capacity to mediate among the stakeholders on major questions faced by the country, including the date of next elections, consensus-based economic charter, and the way forward on making key appointments.\nWhile replying to another question, the President reiterated that all the institutions, including judiciary and the army, should not be used for political point scoring, as such comments were not in the greater national interest.\nHe said there was a need to understand that any comment, narrative or analysis, having the potential to create division within the institutions or between the institutions and people of Pakistan, could never be in national interest.\nThe President called upon all the political parties, opinion leaders, eminent members of the civil society and the media persons to remain within the confines of Article 19 of the Constitution and relevant laws and regulations while discussing or commenting on institutions.\nHe said that almost 90% of social media was providing knowledge, information, education and entertainment to the masses at no or nominal cost which was a healthy trend.\n“Certain individuals or groups who are followers of certain political parties or a leader use social media for trolling and starting insulting and derogatory trends against certain individuals and institutions without the knowledge or consent of the political party or the leader but such trends are attributed to them without any evidence”, he added.\nHe said that such unverified attributions add to the existing political polarization, which should be avoided.\nDuring the discussion on foreign policy of Pakistan, the President said that Pakistan had always pursued friendly and cordial relations with all countries of the world and had been playing its due role in promoting the internationally recognized norms of interstate relations.\nHe said that Pakistan strongly believed in mutual respect for sovereignty and territorial integrity of all states, non-interference in the internal affairs of other states, non-aggression and peaceful settlement of disputes, and in return demanded the same treatment from other countries.\nThe President said that due to the unique strategic and geo-economic location of Pakistan, it had always been considered important by regional and international powers, adding that keeping the national interest supreme, they should maintain cordial relations with all the countries while ensuring dignity and sovereignty of the country and the people of Pakistan.\nIn reply to a question, he endorsed the statement of the Ministry of Foreign Affairs and expressed his concern on the allegations by the Acting Defence Minister of Afghanistan regarding the use of Pakistan’s air space in the U.S. counter-terrorism drone operation in Afghanistan.\nThe President said that in the absence of any evidence, as acknowledged by the Afghan Minister himself, such conjectural allegations were highly regrettable and reaffirmed Pakistan’s belief in the sovereignty and territorial integrity of all states.",
  "retrievedAt": "2025-08-11T15:30:31.039Z"
}
