{
  "title": "Cabinet committee on missing persons reiterates commitment to resolve matter",
  "link": "https://www.app.com.pk/national/cabinet-committee-on-missing-persons-reiterates-commitment-to-resolve-matter/",
  "date_published": "2022-09-02T14:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 02 (APP): The Cabinet’s sub-committee on missing persons on Friday reiterated its commitment to resolve the issue of missing persons as soon as possible, keeping in view the seriousness of the issue.\nThe fifth meeting of the Cabinet sub-committee to deliberate a policy relating to enforced disappearances was held here under the chairmanship of Federal Minister for Law and Justice Senator Azam Nazir Tarar.\nSenator Kamran Murtaza, Federal Minister for Science and Technology Agha Hasan Baloch and Federal Minister Shazia Murri attended the meeting.\nSenior journalist Hamid Mir also attended the meeting on special invitation.\nAdditional Chief Secretary Home Punjab, Secretary Law Punjab, Additional IG CTD Punjab and Special Secretary Home Sindh also attended the meeting.\nThe participants of the meeting presented their suggestions for solving the issue.The committee members once again reiterated their determination to submit their proposals to the federal cabinet for an early resolution of the missing persons issue, keeping in mind the seriousness of the matter.\nDuring the meeting, the federal Law Minister contacted Secretary Health Balochistan by telephone and asked them to provide effective medical aid to the sit-in participants.\nThe federal law minister promised to visit Quetta soon to personally meet the sit-in participants.\nAgha Hassan Baloch said that the problem of missing persons was the biggest problem of Balochistan. It should be addressed on a priority basis and practical steps were needed in this regard, he added.\nHe said that the committee members should go there and meet the people.Benazir Income Support Programme (BISP) Chairperson Shazia Marri said that the committee would work hard to solve the issue of missing persons.\nThe committee decided to visit Quetta in the next three to four days to meet the participants of the ongoing sit-in regarding the missing persons.\nIn the last meeting of the committee, Senator Tahir Bizenjo, President of Supreme Court Bar Association Ahsan Bhoon, Member Pakistan Bar Council Abid Saqi had also submitted their suggestions.\nIn the previous meetings of the committee, former senator Farhatullah Babar and chairperson rights group Defense of Human Rights Pakistan Amina Masood Janjua had also presented their suggestions in the committee on special invitation. In the previous meetings, federal ministers Mian Riaz Hussain Pirzada, Faisal Sabzwari had also presented their suggestions before the committee.",
  "retrievedAt": "2025-08-11T15:30:31.118Z"
}
