{
  "title": "SC sets aside LHC verdict in fuel price adjustment case",
  "link": "https://www.app.com.pk/national/sc-sets-aside-lhc-verdict-in-fuel-price-adjustment-case/",
  "date_published": "2023-10-16T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): The Supreme Court (SC) on Monday set aside the decision of Lahore High Court (LHC) for declaring the fuel price adjustment in electricity bills as illegal and sent the matter to the NEPRA Appellate tribunal.\nThe apex court observed that the LHC verdict was not practicable as per the Constitution and law, allowing the power transmission companies to receive fuel price adjustment from today, which, however, would be subject to the approval of the NEPRA Appellate Tribunal.\nThe court said that the consumer companies would file appeals against the fuel price adjustment with the Appellate Tribunal within 15 days, which would fix the appeals within 10 days for hearing and decide within the statutory period.\nDuring the course of proceedings, Chief Justice of Pakistan Qazi Faez Isa asked whether there was any objection to the admissibility of the appeal, and if no one had any objection then give arguments on merit.\nThe appeals contained different pleas, he noted.\nThe petitioners’ lawyer Salman Akram Raja said that at the time of FPA’s imposition in May 2022, the formation of NEPRA (National Electric Power Regulatory Authority) was unconstitutional.\nThe CJP observed that if NEPRA’s formation were unconstitutional then the high court should have given a decision on it. The high court’s single member bench had given the verdict beyond its scope, which could not be maintained, he said adding the LHC had given the decision which was even not prayed in the petitions.\nCJP Isa observed that it would be better to take up the technical issues before NEPRA.\nJustice Athar Minallah said that no court could look into the technical issues of NEPRA.\nAttorney General for Pakistan Masnoor Usman Awan said NEPRA and power distribution companies had no objection on challenging the matter in the tribunal.\nIt should be noted that the LHC’s single bench had declared the fuel price adjustment illegal.",
  "retrievedAt": "2025-08-11T10:06:30.115Z"
}
