{
  "title": "People welcome relief in POL prices; ask for inflation-ease",
  "link": "https://www.app.com.pk/national/people-welcome-relief-in-pol-prices-ask-for-inflation-ease/",
  "date_published": "2023-10-16T09:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): People from different walks of life on Monday welcomed the government’s decision to substantially reduce petroleum prices, viewing it as a much-needed relief to counter the adverse effects of high inflation on their daily routines.\nIn the past, they said whenever petroleum prices increased it resulted in a surge in the prices of essential commodities, public transportation fares, and shipping costs, negatively impacting the common man.\nNow, with the government’s ample reduction of Rs40 per liter in petrol prices and Rs15 in high-speed diesel, people expect this to have a trickle-down effect on the prices of everyday items, goods transport, and public transportation fares.\nKhurram Shahzad, a government employee who commutes daily from Qasim Market Rawalpindi to Islamabad, expressed his concern that public transporters had not lowered their fares despite a significant reduction in petroleum prices.\nThey had increased fares by almost 300 percent over the past six months, which he said should be revised and brought down.\nHe urged the Regional Transport Authority to revise and regulate the public transport fares to align them with the reduced petroleum prices.\nHe also called for the display of revised fare charts in public transport vehicles to provide maximum relief to the common commuters between the twin cities of Rawalpindi and Islamabad.\nThe business community also commended the government’s decision to reduce petroleum prices, considering it a positive step in combating inflation and providing much-needed relief to the common man throughout the country.\nThey attributed the positive indicators to the government’s zero-tolerance policy against the illicit trade and smuggling of essential commodities and the dollar mafia.\nThese measures led to the strengthening of the local currency against the dollar, which also facilitated local trade and businesses.\nPresident of the Islamabad Industrial Association, Muhammad Ahmad, appreciated the government’s move to significantly reduce Motor Spirit Oil (Petrol) and High-Speed Diesel prices; anticipating it to help reduce transportation costs for industrial goods and essential commodities.\nHe pointed out that as the local currency gained momentum against the dollar, steel prices decreased by Rs 60,000 per ton, and edible oil prices also considerably dropped. However, he cautioned that speculations about further reductions in the dollar-to-rupee exchange rate might cause a temporary slowdown in local businesses.\nHe emphasized the need to boost economic activities in the country and facilitate traders and industrialists in reviving the national economy, which he believed would help in reducing the high inflation rate, currently hovering around 38 percent.\nActing President of the Islamabad Chamber of Commerce and Industry (ICCI) Faad Waheed also praised the government for reducing petroleum product prices, expecting this move to provide relief to the common man in the country.\nThe decision, he hoped would bring down logistic costs and the prices of everyday items would also decrease as expected by the general public.\nFor the current fortnight, the government has revised petroleum prices to provide much-awaited relief to the common man, reducing the per liter price of Motor Spirit Oil (Petrol) by Rs 40 and High-Speed Diesel (HSD) by Rs 15.\nThe Finance Division notification stated, “Owing to the decreasing trend of petroleum prices in the international market and the appreciation of the rupee against the US$, the government has decided to reduce the existing consumer prices of petroleum products in the country.”\nAs per the notification, the reduced prices of petrol and HSD would be applicable from October 16, 2023, and remain in effect for the next fortnight, with petrol available at Rs283.38 per liter and HSD at Rs303.18.",
  "retrievedAt": "2025-08-11T10:05:56.583Z"
}
