{
  "title": "Pakistan needs indigenous knowledge-based, local solutions for enhanced climate resilience: Speakers",
  "link": "https://www.app.com.pk/national/pakistan-needs-indigenous-knowledge-based-local-solutions-for-enhanced-climate-resilience-speakers/",
  "date_published": "2023-10-16T12:20:00.000Z",
  "source": "APP",
  "content": "KARACHI, Oct 16 (APP): The Speakers on Monday at a panel discussion on climate action urged the government and departments concerned to join hands for collating and collaborating indigenous knowledge-based solutions for enhanced resilience of the country against adverse impacts of climate change and environmental degradation.\nThe Sustainable Development Policy Institute convened a panel discussion titled Climate Action Panel discussion at the launch of Four thematic Policy Position Papers with members of the academia, civil society, journalists and business community.\nOpening the panel discussion, Deputy Executive Director, SDPI, Dr. Shafqat Munir Ahmad briefed the participants on the Four Thematic Policy papers discussing the country’s position on climate finance, institutional capacities for climate action, policy frameworks and the Loss and Damage that had been created at the global to provide a platform for reparations to the most impacted countries through climate catastrophes.\nDr Shafqat Munir said the crisis of climate change had no boundaries and it impacted all the nations without any distinction.\nHowever, the country was lagging in terms effective implementation of its convincing policy instruments established to cope with the climate disasters.\nHe underlined that the country had separate ministries of subjects that were equally impacted due to climate change and demanded an intricate and integrated approach.\n“We need to align and develop coherence in existing system and ministries to address climate change. The country will also have to maintain technical climate human resource expert on the subject,” he added.\nHe also pointed out that amid growing vulnerability of the country due to climate change it was needed to revise the national disaster risk reduction (DRR) Policy to set targets and key areas like risk understanding, governance, financing and overall framework for collaboration.\nFormer VP FPCCI, Member Board of Governors SDPI, Eng MA Jabbar felicitated the institute for successfully compiling the policy papers.\nHe mentioned that the increase in migration towards urban centers was burdening the existing capacities of those cities leading to economic impact driving climate and financial crisis.\nClimate change affecting tools in the country, he said were the power generation plants that had the capacity of 41,000 megawatts (MW) whereas India got 413,000 megawatts plant installed yesterday.\nHe compared the India and Pakistan coal to energy potential and mentioned that Pakistan had $183 billion coal reserves which was one of the highest in the world.\n“But India was mining 1.2 billion tonnes of coal a year. It is producing 78% energy in terms of units and 60% in terms of installation from coal fired power plants. India has developed its capacity to come out of poverty to make cheaper energy from coal back from the times when there was no limitation on coal globally.The UN Secretary General had demanded India to stop producing energy from coal but it added 6,000 MW more coal energy projects in its system,” he added.\nHe suggested that if the country’s public sector collate the recommendations from the civil society and think tanks for guiding its endeavours then its future is not bleak but rather promising.\nSenior Environmental Journalist, Afia Salam also mentioned that there was no synergy in the ministries and departments of the country, alongwith that there had been no implementation of the planning decisions and policies formulated post-2010 floods.\nShe added the government and the relevant departments would have to adopt a transparent and coherent mechanisms and strategies to win international community’s trust.\nShe recommended that the fundamental responsibility of the civil society and media was to play the role of a watch dog, adding, “We as media and civil society need to play our watchdog role on every government because it is ultimately the people who will have to face the crisis.”\nAssociate Professor at the Department of International Relations, University of Karachi, Prof Dr Naeem Ahmed said the climate change was a complex global issue transcending boundaries and damaging ecosystems and biodiversity.\nHowever, he said there was need to adopt natural methods to address natural disaster emerging due to environmental degradation like Miyawaki forests but it should not remain restricted to posh areas of the urban centers but rather should be provided to the underprivileged as well.\nHe suggested that children training on nature and biodiversity conservation could be helpful to achieve the goal of accelerated climate action and it should be started from educational institutions.\nProfessor, Dept of Psychology University of Karachi, Dr Anila Amber Malik said climate change was a very wicked problem for the academia. She added that it was a threat to the global security that meant its creating conflict, insecurity and instability in the world.\nDr Malik mentioned that indirect effects of climate change were emotional threats to the wellbeing of an individual creating anxiety, fear and uncertainty due to extreme weathers, non-supportive government attitude that promotes emotion of selflessness and empathy.\nCEO V&H Consultants, Dr Viqar Hussain said Pakistan lied in the high temperature zones near equator, but it had very poor databases that lacked scholarships for data projects whereas data scholarships were common globally.\nHe mentioned that there was a non-serious attitude towards data mining and research in the public sector whereas the corporate social responsibility (CSR) was not contributed by major private entities for environmental cooperation.\nAnum Hijab participant view from the participants underlined that the country’s system was still colonized like the current canal system established by the British which needed to be modified or replaced with local knowledge-based solutions.\nGroup Captain Riyasat said the country had reactive approach, zero CSR, no public awareness and corrupted data that hinders international cooperation with Pakistan on climate related interventions.",
  "retrievedAt": "2025-08-11T10:05:55.082Z"
}
