{
  "title": "CPEC major milestone in shape of successful projects in several sectors: Solangi",
  "link": "https://www.app.com.pk/national/cpec-major-milestone-in-shape-of-successful-projects-in-several-sectors-solangi/",
  "date_published": "2023-10-16T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP):Caretaker Federal Minister for Information Murtaza Solangi said on Monday that China Pakistan Economic Corridor (CPEC) was a major milestone in shape of successful projects in Pakistan including road infrastructure, power sector, and industrial zones worth 62 billion dollars.\nDelivering his speech at the CPEC Art Exhibition jointly organized by Behria University and China Media Group here he said he was glad to note that relations between Pakistan and China were getting stronger with every passing day.\nThe minister said that above all people were the heart and soul of every thing and they were focus of every initiative that the government launched. The minister said it was well established fact that arts and culture had a deeper impact on human lives. He said it was encouraging that  in this event not only art pieces were being exhibited but  interactive media was also included in this exhibition.\nHe hoped that new interactive media would attract more young people and make them aware of the importance of Pakistan,China friendship and how this was reflected through the CPEC projects. He stressed that the present government was vigorously continuing its efforts to facilitate CPEC projects by ensuring the implementation of the policies.\nSolangi said that Caretaker Prime Minister Anwaarul Haq had left for  China to represent Pakistan in the  Third Belt and Road Forum.\nAs the 10 year celebrations of CPEC were being observed, there would be good news regarding road infrastructure, green initiative, technology, export processing zones, special economic zones and ML-1, said Murtaza Solangi.\nHe said it was the pledge of the present caretaker regime to provide relief to the people and steps were being taken for the welfare of the people.  “Due to the reduction in the prices of petroleum products, many people are happy today”, Murtaza Solangi remarked.\nThe government, he added had brought the benefit of petroleum products to the masses as the effects of reduction in the prices of petroleum products should be passed on to the people.\nHe said the caretaker dispensation in collaboration with the provincial governments and district administration was striving to ensure that transport fares were reduced after a cut in petroleum products prices. The minister said it was the commitment of the caretaker government to leave the country in a better state than it was handed over.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:06:17.037Z"
}
