{
  "title": "New air security unit to be launched in capital this week: Sheikh",
  "link": "https://www.app.com.pk/national/new-air-security-unit-to-be-launched-in-capital-this-week-sheikh/",
  "date_published": "2021-10-04T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 04 (APP):Minister for Interior Sheikh Rashid Ahmad on Monday said that a new air security unit would be launched this week with having 12 drones to provide a faultless security system to the citizens of the federal capital.\nAddressing a press conference, he said that in order to ensure foolproof security and controlling crime rate, 1,000 additional personnel were being inducted in Islamabad Police besides purchasing two locators.\nThe minister said that the government had decided to start a crackdown against those involved in issuing Corona fake vaccination certificates or other illegal documents as there was a zero-tolerance policy against these elements.\nHe said with the renovation of the existing Food Park a new food park was being launched in Melody Market while another food street was also being started in Art and Craft Village Shakarparian.\nHe said that the ministry had fixed a fee of Rs 10,000 for a one-day emergency passport service which would be issued within a day for those who were in need while the ordinary fee would be Rs 5000 to Rs 8000.\nHe added now citizens could get passports on an immediate basis within 24 hours.The minister said that there were several complaints about fake national identity cards on which while taking action 136 officials involved in this matter had been suspended while 90 inquiries and around 300 charge sheets were being issued.\nSheikh Rashid said that a new amnesty scheme had been sent to the cabinet for approval for those having more than one passport or CNIC.\nHe said that the online visa system for Afghanistan replacing on-arrival visas would be started within three weeks while there was also planning to waive off eight dollar fees to facilitate the people.\nHe added since August 15 to date around 20,000 people had entered Pakistan from Afghanistan while 6,000 people went to Afghanistan from Pakistan.\nThe minister said around 10,000 people were foreigners who reached their countries from Afghanistan.\nHe said that the government had started International Border Management System (IBMS) with 16 terminals at the Chaman border which was for the first time in the history of Pakistan while further five terminals would be added.\nHe said that NADRA mobile vans had been placed at Torkham and Chaman areas to facilitate at checking points.\nThe minister said that the government had been working on a policy to extend CNIC facilities for far-flung areas of Skardu.\nHe said that a new College for Satellite Town Rawalpindi had been approved while the Prime Minister had issued directions on Naula Lai’s construction work.",
  "retrievedAt": "2025-08-11T21:23:08.215Z"
}
