{
  "title": "CM Punjab inaugurates fleet of 64 new buses",
  "link": "https://www.app.com.pk/national/cm-punjab-inaugurates-fleet-of-64-new-buses/",
  "date_published": "2021-10-04T15:25:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 04 (APP):Punjab Chief Sardar Usman Buzdar on Monday inaugurated a fleet of 64 new environment-friendly buses for Lahore metro bus service.\nWhile addressing the inaugurating ceremony held at metro bus depot Ferozepur Road here, the CM said the present government was striving hard to resolve the problems of Lahorities on priority basis,adding that underpasses and overhead bridges were being constructed to overcome the traffic problems, besides improving the transport system.\nHe said the Lahore Masstransit Authority would provide best travelling facility to 125,000 passengers daily.\nUsman Buzdar said the PTI-led government had saved resources worth more than Rs 2 billion in contract with VEDA, adding that the earlier deal was signed with a foreign company, while the current contract had been signed with a Pakistani company to save foreign reserves, besides encouraging local businesses.\nHe said the incumbent government had completed and made the orange line metro train project operational in the best national interest.\nThe CM disclosed that electric buses project would be started in Lahore to overcome the environmental pollution and new environment friendly buses would also be launched in major cities of the province.\nHe further said that there was a shortage of passengers in feeder buses but launching of cash fare system had resulted in a hundred per cent and 26 per cent increase in the number of commuters in Lahore and Multan feeder buses, respectively.\nHe said the enforcement of Punjab Vehicle Inspection and Certification System (VICS) in 27 districts were important in overcoming the road accidents and environmental degradation.\nThe CM said the government had also extended the duration of VICS fitness certificates for six months, and an axle load management system would be introduced in nine districts to save roads.\nUsman Buzdar said the decision had been made to expand the scope of Lahore Transport Company (LTC) by renaming it as Punjab Transport Company (PTC) to provide modern transport facilities in Faisalabad, Bahawalpur, Mianwali and DG Khan.\nHe said that a modern bus terminal would be constructed at Thokar Niaz Baig at a cost of Rs 3 billion.\nThe government was committed to launch a modern mass transit system in major cities to provide the best transport facilities to the general public, he maintained.\nThe Chief Minister said public service was a priority agenda of the PTI government and would keep serving the masses with commitment and zeal.\nThe CM formally handed over buses to Punjab Masstrasit Authority and inspected the facilities after unveiling the plaque.",
  "retrievedAt": "2025-08-11T21:23:09.387Z"
}
