{
  "title": "India out to malign Pakistan through fake news in Tajik media",
  "link": "https://www.app.com.pk/national/indian-out-to-malign-pakistan-through-fake-news-in-tajik-media/",
  "date_published": "2021-10-04T15:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 4 (APP): After suffering frustration to fulfill its designs in Afghanistan, India is now trying to malign Pakistan in Tajikistan by sponsoring fake news stories and articles.\nAccording to security analysts, it is creating a negative image of Pakistan among the Tajik people like it didin Afghanistan during the former governments of Karzai and Ghani.\nBy blaming Pakistan for Taliban’s surge in Afghanistan, it tried to influence Tajik people by propagating that Taliban posed threat to India and Tajikistan alike.\nIt is now an established fact that Indian government’s backed media has been frequently opposing Taliban government and their return to power.\nIndia is trying to misguide the world community about the situation in Afghanistan as it does not want peace in the region, they added.\nInternational affairs experts were of the opinion that after Tajikistan raised certain concerns over Taliban’s rule, it is now trying to find an opportunity in such concerns by adding fuel to undermine Tajik-Afghan ties, besides creating a divide between Pakistan and Tajikistan by sponsoring anti-Pakistan news.\nIts frustration has increased manifold as its ploys to exert influence in the Central Asia through palpable presence in Afghanistan came to an end. It is also cashing on historic events between Tajikistan and Taliban as the former had certain reservations over latter’s return to power, they opined.\nIn the past, they said, the anti-Taliban resistance in Afghanistan was put up by Tajik and Uzbeks minorities and India is now trying to build an anti-Taliban and anti- Pakistan narrative on that basis.\nThe international media very analytically exposed India’s conspiracies to mill fake news by falsely implicating Pakistan over fall of Panjshir valley, they observed.\nOne of these tactics, in its media campaign, was to portray to Tajik people that Pakistan had been supporting Pashtuns in Afghanistan by compromising the rights of Tajik and other minorities.\nThey said, contrary to its it, other regional countries including Russia, China, Iran, and Pakistan have been positively engaged with Taliban.\nTaliban are now a reality and the only capable entity in Afghanistan who could possibly bring peace and stability in Afghanistan. The international community, particularly the regional countries should support Taliban’s regime to fulfill their commitments, they added.\nPrime Minister Imran Khan recently met and discussed with Tajik President the current situation in Afghanistan and informed him about Pakistan’s emphasis upon all-inclusive government in Afghanistan.\nPakistan has time and again reiterated that an inclusive Afghan government would be helpful in securing a lasting peace and stability in the war-weary country.\nThe experts hoped that Tajikistan and Taliban would address their concerns in a prudent manner without being misled by India’s false propaganda, whose spoiler’s role in the region is no longer a hidden secret.",
  "retrievedAt": "2025-08-11T21:23:08.182Z"
}
