{
  "title": "Gaza’s horror - Newspaper - DAWN.COM",
  "author": null,
  "content": "EVEN in a world with no shortage of suffering and bloodshed, the violence meted out to the people of Gaza by the Israeli regime has few parallels.\n\nSo depraved is Tel Aviv’s extermination war machine in the occupied Palestinian territory that even the UK, Canada and France — members of the Western bloc that have often rushed to Israel’s defence in the global arena — have termed the situation in Gaza “intolerable”.\n\nAnd it appears that despite the murder of over 53,000 people by Israel, including women and children, since the slaughter began following the Oct 7, 2023, attacks, things may actually get worse. After all, Tel Aviv’s chief warmonger Benjamin Netanyahu has just said that Israel “will take control of all the territory” of Gaza.\n\nIt is clear that under the cover of rescuing hostages and avenging the Oct 7 events, Israel is carrying out the ethnic cleansing of Gaza to reoccupy the savaged Strip.\n\nThe on again-off again peace talks are going nowhere, and after starving Gaza since March 2, a trickle of aid has just been let in by Palestine’s occupiers. One UN official has described this delivery of aid as a “drop in the ocean”.\n\nThere are many within the Israeli political establishment that continue to call for mass starvation of Gaza’s people. Unfortunately, Israel has failed to realise that despite its monstrous crimes against Gaza’s population, the Palestinian people refuse to yield.\n\nThis is indeed a classic case of a native population resisting a ruthless occupier — a population that is willing to die rather than leave their land. History has proved that in many such cases, the occupiers have had to retreat in ignominy, while the people of the occupied land have succeeded in raising the banner of freedom. The price the Palestinian people are paying for their resistance is immense, but they have proven that even genocide cannot break their will.\n\nYet the fact that the Palestinians are resisting a brutal occupation does not absolve the international community of the responsibility of stopping Israel’s mass murder. Specifically, the US — Tel Aviv’s chief foreign patron — has a lot to answer for.\n\nDonald Trump has in his second presidential term taken on the avatar of peacemaker. His intervention is believed to have been crucial in ending the recent Pakistan-India hostilities. He is working the phones to end the Ukraine war. He is even — despite some bluster — interested in a peaceful resolution to the Iran nuclear dispute.\n\nNow these peace-making tendencies must be extended to Gaza. The quickest way to stop the bloodshed would be for the US to immediately halt all military and financial aid to Israel. The world, particularly Gaza’s battered people, will be waiting for Mr Trump to do the right thing.\n\nPublished in Dawn, May 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:21:11.199Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912346/gazas-horror",
  "dateList": "2025-05-21",
  "date_published": "2025-05-20T23:56:45.000Z"
}
