{
  "title": "Peshawar High Court declares valid extension in term of provincial ombudsman - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court has declared extension in tenure of provincial ombudsman, Khyber Pakhtunkhwa, and relevant amendments made in the concerned law as valid and in accordance with the Constitution.\n\nA bench consisting of Justice Syed Arshad Ali and Justice Fazal Subhan rejected two connected petitions, challenging the provincial government’s order extending the tenure of present ombudsperson Syed Jamaluddin Shah in 2022 and making further amendments in KP Provincial Ombudsman Act, 2010, related to the tenure of ombudsman and also giving retrospective effect to the said amendments.\n\nThe petitioner, Ali Azim, had challenged the vires of KP Provincial Ombudsman (Amendment) Act, 2024, through which the fixed ‘three-year’ term of ombudsman was replaced with an ‘extendable four-year’ term.\n\nHe had also challenged section 4 (1A), inserted in the law, wherein it was provided that the amendments would be applicable to the present ombudsman, who was appointed prior to the commencement of the present amendments.\n\nRejects plea challenging amendments in relevant law\n\nThe petitioner contended that certain provisions of the said Act of 2024 had been given retrospective effect to specifically accord protection to the incumbent ombudsman and this rendered the legislation ‘person-specific’ and thus liable to be struck down.\n\nThe petitioner had initially challenged a notification issued by the government on Aug 26, 2022, through which his tenure was extended in accordance with amendments made in the law in 2022.\n\nWhile the ‘three-year’ tenure of the incumbent had to expire in July 2024, the said amendments were made in the law in 2024 wherein the tenure for an ombudsman was given as four years and retrospective effect was also given to it making it applicable to the present ombudsman.\n\nBarrister Asadul Mulk represented the ombudsman in his personal capacity and argued in favour of the legislative competence of provincial assembly.\n\nHe contended that the amendments made in the law were in accordance with the Constitution.\n\nThe additional advocate general, Taimur Haider, represented the KP government and contended that those petitions were liable to be dismissed.\n\nDiscussing the matter threadbare, the bench ruled: “In view of the above, it becomes apparent that the legislature acted within its constitutional domain in amending the parent statute and that the incumbent ombudsman’s continuation in office, under the amended framework, is legally tenable. Hence, we find no merit in the instant as well as connected petition.”\n\nThe high court in its judgement has observed that “at the heart of this inquiry lies the legislative authority of the Provincial Assembly of Khyber Pakhtunkhwa, which undoubtedly possesses the constitutional competence to enact amend or repeal provincial statutes including the Provincial Ombudsman Act, 2010”.\n\n“The 2022 and 2024 amendments were passed in exercise of this legislative power and reflect policy shifts with respect to the eligibility criteria, procedure for appointment, and tenure of the office of the provincial Ombudsman,” the bench ruled.\n\n“As regard the petitioner’s contention concerning retrospective legislation, it is settled principle of law that there is no constitutional bar on the legislature to enact laws with retrospective effect, provided such legislation falls within its legislative competence. This position has long been settled in our jurisprudence,” the bench maintained.\n\nThe court further observed: “It is well-established principle that subject to constitutional limitations, the legislature possesses plenary powers to make, amend or repeal laws, including the authority to enact legislation with retrospective effect. It is within the legislative domain to fix the date of commencement of a law, even prior to its enactment.”\n\nThe bench maintained that in the present case, the express language of the Amendment Act of 2024 left no scope for doubt that the tenure-related provisions were to be applied retrospectively, thereby covering the case of the incumbent provincial ombudsman.\n\nPublished in Dawn, May 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:11:29.274Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912242/peshawar-high-court-declares-valid-extension-in-term-of-provincial-ombudsman",
  "dateList": "2025-05-21",
  "date_published": "2025-05-20T23:56:22.000Z"
}
