{
  "title": "Auto financing rises - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Amid falling lending costs, auto financing increased by 2 per cent month-on-month and 12pc year-on-year to Rs263 billion in April.\n\nThis was the fifth straight monthly rise. However, auto financing remains 28pc below its peak of Rs368bn in June 2022, observed Topline Securities Chief Executive Mohammed Sohail.\n\nThe benchmark interest rate stands at 11pc after staying at an unprecedented level of 22pc for over a year until June 2024, which encouraged buyers towards auto leasing in new and used vehicles.\n\nThe auto industry is expressing concern over the government’s plan for tariff rationalisation, which includes significant reductions in import duties across various sectors under the National Tariff Policy for 2025-2030. This comes when sales and auto financing are experiencing strong growth.\n\n“I think the tariff rationalisation plan is yet not clear. Considering low foreign exchange, it will be interesting to see how economic managers reduce tariffs that will increase the import bill,” said Mr Sohail.\n\nPaapam’s concern\n\nPakistan Association of Auto Parts Manufacturers (Paapam) chairman Usman Aslam Malik said the implementation of the National Tariff Policy 2025–30 could lead to the closure of a majority of local auto parts manufacturing firms while the peak 15pc tariff threatens to destabilise the industrial sector by exposing domestic manufacturers to an influx of lower-cost imports.\n\n“The abrupt tariff rationalisation could result in the loss of up to 500,000 jobs, severely impacting livelihoods and weakening the country’s manufacturing base,” he warned.\n\nPublished in Dawn, May 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:10:49.711Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912305/auto-financing-rises",
  "dateList": "2025-05-21",
  "date_published": "2025-05-20T23:55:33.000Z"
}
