{
  "title": "Balochistan Public Accounts Committee slams industrial bodies over unpaid dues - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Assembly’s Public Accounts Committee (PAC) on Tuesday expressed anger over the failure of Gwadar and Lasbela industrial development authorities to recover billions of rupees in outstanding dues from allottees of industrial plot, warning of strict action against officials and cancellation of allotment.\n\nThe PAC meeting, chaired by Asghar Ali Tareen, was also attended by Zabid Ali Reki, Ghulam Dastagir Badini, Fazal Qadir Mandokhail, Obaidullah Gorgag, Industries Secretary Khalid Ahmed Sarparah, DG Audit Shuja Ali, PAC Additional Secretary Siraj Lehri, Additional Accountant General Noorul Haq, Additional Secretary Law Saeed Iqbal and Chief Accounts Officer Syed Idress Agha\n\nIn a review of financial, administrative and performance issues of Gwadar Industrial Estate Development Authority (GIEDA), a critical audit para revealed the body had allotted plots worth Rs3.77 billion but recovered only Rs 2.21bn, leaving a Rs1.56bn in unpaid dues.\n\nThe committee warned GIEDA that if full recovery is not made within one month, allotments will be cancelled, and “strict disciplinary action against the responsible officers” will follow for inaction.\n\nThe PAC also directed the Balochistan auditor general to immediately conduct a special audit of plot allotments in Gwadar to ascertain the identity of allottees and the terms under which plots were granted.\n\nChairman Tareen reiterated support for industrial growth but cautioned that “financial irregularities and negligence under its guise will not be allowed”. “Institutions must reform themselves.”\n\nIn its review of Lasbela Industrial Estate Development Authority (LIEDA), the committee expressed alarm over the authority’s continued reliance on government funds despite being an autonomous entity.\n\nLIEDA received Rs 7.61bn in development funds during 2021-22 but utilised only Rs 5.82bn with unsatisfactory development outcomes.\n\nRegarding power dues, LIEDA is owed Rs 44.53m by various industries. The PAC ordered immediate electricity disconnection to defaulter units.\n\nLIEDA also incurred a Rs 17.14m loss by not charging additional rates on instalment payments for plots, with a one-month recovery deadline set.\n\nFurthermore, Rs 69.73m in dues remain outstanding from various industrial and government units, which the committee directed be recovered immediately. The committee instructed that machinery of closed factories with unpaid dues be confiscated to ensure payment.\n\nLate, the PAC set a final one-month deadline for all outstanding dues recovery, emphasising that institutions must enhance performance, ensure transparency and stop misusing public resources.\n\nPublished in Dawn, May 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:10:27.497Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912321/balochistan-public-accounts-committee-slams-industrial-bodies-over-unpaid-dues",
  "dateList": "2025-05-21",
  "date_published": "2025-05-20T23:55:26.000Z"
}
