{
  "title": "Citizens united to safeguard country’s sovereignty, says CM Bugti - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Chief Minister Sarfraz Bugti has said that India’s conspiracies against Pakistan will never succeed and the nation stood united to safeguard the country’s sovereignty, integrity, and independence.\n\n“We are ready to offer every sacrifice for the sake of Pakistan. If needed,” the chief minister declared while addressing a public gathering in Barshore area close to Pak-Afghan border in Pishin district on Tuesday.\n\n“India cannot harm Pakistan. No power on earth can break the unity of this nation,” he asserted, adding that the people of Balochistan, Pishin and across Pakistan stood firmly with their armed forces and their leadership.\n\nCM Bugti criticised those involved in propaganda against the army, stating such elements have failed in their designs.\n\nDevelopment initiatives\n\nCM Bugti expressed his gratitude for the love and respect shown by the people of Barshore, calling it “the greatest asset” of his life.\n\nAnnounces development initiatives for Barshore in public rally\n\nHe announced several development initiatives for the region, including the activation of the Barshore grid station, establishment of a cold storage facility, and recruitment of 50 new Levies personnel.\n\nHe also highlighted that out of 73 non-functional schools in Pishin, 72 had been restored and he had directed the deputy commissioner to ensure the last school becomes functional before his return to Quetta.\n\nThe chief minister took responsibility for the education of children whose parents were martyred in the terrorist attack in Barshore during general elections.\n\nHe announced a special development package for Barshore, Karezat, and Bostan, including a new Levies police station named after Shaheed Hanif, the construction of a girls’ college and a hospital in Toba Kakari and the establishment of a municipal committee in Barshore.\n\nHe further announced that the Barshore-Toba Kakari road would be constructed to the highest standard under his direct supervision and vowed there would be zero tolerance for corruption. “No contractor will be allowed to misappropriate funds,” he emphasised.\n\nThe chief minister also said no illegal mining would be tolerated in the region, and the rights to mineral resources would first be given to local residents.\n\nPublished in Dawn, May 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:21:30.234Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912323/citizens-united-to-safeguard-countrys-sovereignty-says-cm-bugti",
  "dateList": "2025-05-21",
  "date_published": "2025-05-20T23:55:26.000Z"
}
