{
  "title": "HBL PSL 2025: In-form Quetta Gladiators face Islamabad United in top-shelf qualifier - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: High-flying Quetta Gladiators face defending champions Islamabad United in the first qualifier of the HBL Pakistan Super League X here at the Gaddafi Stadium on Wednesday.\n\nThough United have won three PSL titles — in 2016, 2018 and 2024 — ever since the league was launched in 2016 while Gladiators have clinched the title only once (2019), the latter have shown great form and consistency in the ongoing edition to top the table with 15 points (seven wins, two losses, one no result) in the league stage of the six-team competition.\n\nMoreover, Gladiators’ victories in both their league-stage games against United signify the Saud Shakeel-led squad’s profile ahead of the top-shelf clash.\n\nGladiators had to fight hard against United to win the first match in Lahore, they won their second duel in Rawalpindi by a massive 109 runs after amassing a record-equalling 263. So impressive was Gladiators’ recent form that they won six of their last seven league-stage matches while one against Lahore Qalandars was washed out at the Gaddafi Stadium.\n\nFor second-placed United (12 points; six wins, four losses), they must forget the past when they enter the field today.\n\nIn contrast, United started off in this edition like a true champion team winning the their first five games. Then they nosedived lose four matches on the trot, before returning to the winning ways in Rawalpindi where they crushed Karachi Kings by 79 runs.\n\nTalking to media on Tuesday, Saud said that his team would try to maintain their form in the playoffs.\n\n“We entered the playoffs stage after playing good cricket and we will try our best to maintain that momentum in this final stage of the league,” Saud said while talking to media after his team held a practice session at the LCCA Ground.\n\n“Though there is always room for improvement, the priority in the playoffs stage is to make minimum mistakes as there are very few chances to bear the losses of mistakes.”\n\nHe said Khawaja Nafay and Hasan Nawaz got opportunities and they made the most of them. “With the return of Rilee Rossouw, out batting line-up has been boosted further.”\n\nSaud further said that the playing XI would be decided after watching the pitch on Wednesday.\n\nThe Shadab Khan-captained United did practice on Tuesday, perhaps preferring to rest after playing their last league-stage match in Rawalpindi on Monday.\n\nMystery spinner Abrar Ahmed — with 15 wickets in the ongoing edition — is a potent weapon possessed by Gladiators who are reinforced by pacers Faheem Ashraf (14), Khurram Shahzad (12) and Mohammad Amir (10).\n\nPlayers including Hasan Nawaz (317 runs), Rossouw (234), Saud (221) and Finn Allen form a strong batting line-up.\n\nOn the other hand, United’s bowling attack looks a bit more dependable in the presence of fast bowlers Jason Holder (15 wickets), Naseem Shah (nine wickets), Salman Irshad (five wickets), Ben Dwarshius (four), and spinners like Shadab (13) and Imad Wasim (12).\n\nUnited formidable batting line-up includes the league’s top-scorer Sahibzada Farhan (394), Alex Hales, who replaced Colin Munro made a blistering 88 against Karachi Kings in the last match, Rassie van der Dussen, Shadab, Imad and Azam Khan.\n\nSpeaking to media after the last league match on Monday, Salman said that he was enjoying his time at United.\n\n“This is my seventh PSL I guess. I have played a lot of games in this league. The team combination and environment of Islamabad United are nice. Moreover, there was no pressure from the captain or the coach as all our players got breaks [during the league stage] and got equal opportunities,” the pacer told reporters. “Therefore, I as a player enjoy the games.”\n\nAnswering a question on the impact of foreign players on United’s performance, Sal­man said that the return of the overseas professionals was certainly benefitting his team.\n\n“[Alex] Hales played a fine knock in the only match he played so far [in this edition] plus Van Der Dussen is there. Our foreign players are very good and valuable for the team,” he said.\n\n“[Moreover] we have the [team] combination which we wanted to form before the playoffs.”\n\nTeams (from):\n\nQUETTA GLADIATORS: Saud Shakeel (captain), Finn Allen, Rilee Rossouw, Hasan Nawaz, Khawaja Nafay, Faheem Ashraf, Khurram Shahzad, Mohammad Wasim Jr, Mohammad Amir, Usman Tariq, Danish Aziz, Abrar Ahmed.\n\nISLAMABAD UNITED: Shadab Khan (captain), Sahibzada Farhan, Salman Agha, Azam Khan, Haider Ali, Imad Wasim, Rassie van der Dussen, Naseem Shah, Jason Holder, Ben Dwarshius, Tymal Mills, Salman Irshad, Saad Masood.\n\nPublished in Dawn, May 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682d08e09d78f.gif",
  "retrievedAt": "2025-08-23T14:21:29.306Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912288/hbl-psl-2025-in-form-quetta-gladiators-face-islamabad-united-in-top-shelf-qualifier",
  "dateList": "2025-05-21",
  "date_published": "2025-05-20T23:55:45.000Z"
}
