{
  "title": "Protester killed, others injured as police resorts to baton charge to disperse canals protest in Sindh’s Moro - Pakistan - DAWN.COM",
  "author": null,
  "content": "A person was killed while a few others, including a deputy superintendent of police (DSP), were injured after police resorted to a baton charge to disperse protesters in Sindh’s Naushahro Feroze district against the construction of proposed canals over the Indus River, according to officials.\n\nThe police attempted to disperse the protesters in the city of Moro to restore traffic on the motorway by-pass road but faced resistance. Consequently, the police resorted to a baton charge and gunshots were also fired.\n\nPeoples Medical Hospital Medical Superintendent Haider Jamali told Dawn.com that one protester was killed and brought to the hospital, while three others and two pedestrians were injured. DSP Ghulam Hussain Dahiri was also injured after being beaten with sticks.\n\nThe protesters allegedly turned violent and set two trailers on fire after news of the death reached the site of the protest.\n\nThey also barged into the house of Sindh Home Minister Ziaul Hassan Lanjar, ransacked it and set some portions of it on fire, while some motorcycles were also torched.\n\nTraffic remained suspended on the road leading to Moro.\n\nA police statement said Benazirabad Deputy Inspector General of Police Pervez Chandio and Naushahro Feroze Senior Superintendent of Police (SSP) Sanghaar Malik rushed to the spot while personnel from different stations were also called to bring the situation under control.\n\nPPP Sindh Information Secretary Ajiz Dhamra condemned the incident, terming it a terrorist activity in a statement.\n\nHe said that there was no ban on protests by people, but attacking the house of a political opponent was reflective of some conspiracy.\n\nThe Sindh home minister also released a statement and asked the Naushahro Feroze SSP to submit a detailed incident report.\n\nHe said nobody would be allowed to challenge the writ of state, adding that police should take action against those who disrupt peace.\n\nChief of Army Staff Gen Asim Munir and Punjab Chief Minister Maryam Nawaz inaugurated the ambitious Cholistan project to irrigate south Punjab’s lands on February 15 amid public uproar and strong reservations in Sindh. The Sindh Assembly also passed a unanimous resolution against the project in March.\n\nThe past few months have seen nationwide protests from political parties, including the ruling coalition ally PPP, and residents against the proposed project.\n\nIn response, amid tensions from India’s unilateral suspension of the Indus Waters Treaty after the Pahalgam attack, the government last month announced that it was halting the contentious project until a consensus on the issue was reached in the Council of Common Interests.\n\nHowever, the legal fraternity decided to continue their sit-ins across Sindh till they receive a “clear” notification regarding the permanent cancellation of the plan.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/2100293882b49ad.png",
  "retrievedAt": "2025-10-12T03:10:26.937Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912209/protester-killed-others-injured-as-police-resorts-to-baton-charge-to-disperse-canals-protest-in-sindhs-moro",
  "dateList": "2025-05-21",
  "date_published": "2025-05-20T19:30:02.000Z"
}
