{
  "title": "Rabies: a preventable tragedy - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAST month, a man from Qambar district in Sindh died a slow and agonising death — not from a rare or untreatable illness, but from rabies, which can be prevented with timely intervention.\n\nAfter being bitten by a stray dog, he and his family searched frantically for an anti-rabies vaccine in their district, but their attempts were futile. By the time they reached Karachi, he had already developed the symptoms. It was too late. His death, like so many others, was the result of a systemic failure.\n\nThis tragedy reflects a growing public health crisis across Sindh. Rabies cases are on the rise amidst a critical shortage of life-saving vaccines and an increasing population of stray dogs.\n\nAccording to reports, at least nine people have died from rabies since the beginning of the year, and more than 8,000 dog-bite cases have been reported at major hospitals such as JPMC, the Dr Ruth Pfau Civil Hospital and Indus Hospital.\n\nMany rural areas face graver challenges, with some districts having no supply of vaccines at all. For residents in remote regions, accessing treatment often means travelling long distances — a logistical and financial burden few can bear. For too many, the delay proves fatal.\n\nThe increase in dog-bite incidents correlates with the growing number of stray dogs, especially in urban areas and on the outskirts of cities where urban and rural life intersect.\n\nPublic health officials cite the lack of effective dog population control programmes and insufficient vaccination campaigns as the main barriers to addressing the rabies threat. The disease is almost universally fatal once symptoms begin, making prevention the only viable strategy.\n\nThe Rabies Free Karachi initiative by Indus Hospital has demonstrated that coordinated vaccination and sterilisation campaigns can drastically reduce dog-bite incidents and rabies-related deaths. However, such initiatives remain limited in scale and coverage.\n\nPakistan’s struggle is in sharp contrast to the progress made by several other Asian countries. Sri Lanka, for example, once recorded over 300 rabies deaths per year in the 1970s.\n\nToday, that number has dropped to fewer than 20 annually. This success is the result of sustained investment in mass dog vaccination, free human post-exposure prophylaxis and widespread public education.\n\nThailand has seen similar success. By 2019, rabies fatalities in Thailand had been reduced to fewer than five per year, thanks to long-term efforts under the Rabies Free by 2020 initiative, which included dog registration, mass vaccination, school-based education and effective cold-chain logistics even in rural areas.\n\nPakistan’s struggle against rabies is in sharp contrast to the progress made by several other Asian countries.\n\nThese examples show that the elimination of rabies is achievable. What successful countries share is not just a strategy but long-term commitment: sustained funding, interdepartmental collaboration and public engagement. Pakistan, however, continues to record an estimated 2,000 to 5,000 rabies deaths per year, according to the World Health Organisation — numbers that refl­e­­ct chronic neglect rather than a lack of solutions.\n\nThe Sindh government’s response has been inadequate. While there have been efforts to address the issue — such as the launch of DowRab, an anti-rabies vaccine developed by Dow University of Health Sciences in Karachi — these measures have fallen short of meeting the growing demand.\n\nDespite the availability of this locally produced vaccine, shortages persist, and many district hospitals remain without the necessary supplies to treat dog-bite victims promptly.\n\nThe vaccine distribution system is fragmented and marred by bureaucratic hurdles, poor coordination between health departments and local governments, and logistical inefficiencies in maintaining cold chains. There is no province-wide emergency framework to ensure timely restocking or referral support for rural patients.\n\nThis situation calls for immediate and comprehensive action. Priority must be given to the procurement and equitable distribution of anti-rabies vaccines, ensuring their availability at all healthcare facilities, particularly in high-risk and underserved areas. In parallel, public health agencies must commit to coordinated, humane strategies to control the stray dog population — through sterilisation drives and dog vaccination programmes.\n\nThe current approach leans heavily on emergency treatment rather than prevention. By the time a patient arrives at a hospital showing symptoms of rabies, there is no cure. Prevention — through dog vaccination and sterilisation, prompt post-bite treatment and education — is the only effective strategy. Community awareness remains dangerously low.\n\nMany victims still turn to traditional remedies or delay hospital visits due to misinformation. Public education campaigns must address this gap. Schools, mosques, media outlets and local councils can help spread accurate information. Rabies education should be integrated into school curricula and broadcast through local media in regional languages.\n\nAnother major shortfall is the lack of accurate data. Rabies cases are chronically underreported, which makes planning and resource allocation difficult. A centralised digital system to record dog-bite cases and vaccination status would allow health authorities to identify hotspots and deploy resources more effectively. Real-time data could become the foundation for a smarter, more responsive health strategy.\n\nThis crisis is not only about public health infrastructure, it is also a reflection of governance and collective priorities. Rabies is a disease we know how to prevent. Every death is a result of inaction. Solutions exist, not just in theory but in practice, in countries with similar economic and administrative challenges. What remains is for Pakistan to implement them with the urgency and seriousness they demand.\n\nEvery individual can make a difference by supporting local vaccination campaigns, promoting awareness within their community, and donating to organisations working on the ground. Civic engagement — whether through volunteering, advocacy, or financial contributions — can create momentum that drives institutional change. This public health challenge demands the combined efforts of policymakers, healthcare providers, and the public. Civic engagement can create a ripple effect that brings about lasting change.\n\nEnding Sindh’s rabies crisis is a test of our political will, public responsibility and moral resolve. We cannot resurrect those who have already died, but we can prevent the next death. What we need is decisive, coordinated, and compassionate action.\n\nThe writer is a medical doctor.\n\nPublished in Dawn, May 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:21:12.775Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912343/rabies-a-preventable-tragedy",
  "dateList": "2025-05-21",
  "date_published": "2025-05-20T23:56:31.000Z"
}
