{
  "title": "Sindh cabinet okays ‘stringent laws’ to improve road safety in province - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Centre allocates Rs9bn to Sindh govt for setting up two SIUTs in Punjab, houses for flood-hit people in Balochistan, KP, Murad tells cabinet\n• Rs1bn approved for Karimabad underpass project\n• ‘Traffic courts’, e-challan system on the cards\n• Repeat offenders to face up to Rs300,000 fines for having tinted glasses, fancy number plates\n\nKARACHI: The Sindh cabinet on Tuesday approved stringent laws to improve road safety across the province and decided to set up special traffic courts to deal with violators.\n\nIn the cabinet meeting, chaired by Sindh Chief Minister Syed Murad Ali Shah and attended by provincial ministers, advisers, special assistants, the chief secretary and secretaries, it also decided to establish seven anti-narcotics courts across the province to try cases against drug suspects.\n\nBriefing journalists about the decisions, Local Government Minister Saeed Ghani and Excise Minister Mukesh Kumar Chawla said that the cabinet decided to launch a crackdown on fancy number plates, tinted windows, and fake government plates, doubling of fines for violations committed by official vehicles, the introduction of an e-challan system, use of surveillance cameras, and stricter enforcement mechanisms.\n\nThey said that the cabinet formed a special committee comprising ministers for law, transport and excise to develop a comprehensive traffic management and enforcement strategy.\n\nA press statement released by the CM House said that the cabinet decided that all commercial vehicles operating in Sindh must obtain fitness certificates. A fine of Rs10,000 would be imposed in case of non-compliance of the directive.\n\nThe cabinet introduced new restrictions on permits for older vehicles, banning those over 20 years old on interprovincial routes, and those exceeding 25 years on intercity routes.\n\nIt decided to impose a complete ban on substandard rickshaws and loaders.\n\nIt was also decided that heavy transport vehicle (HTV) drivers must complete at least 30 hours of certified pre-licence education from a government-recognised school.\n\nThe age for obtaining a HTV licence has been lowered from 24 to 22, provided the driver has one year of light transport vehicle (LTV) experience.\n\nTo tackle violations, an automated detection system will be implemented.\n\nThe cabinet members were informed that if a vehicle was parked in a no-parking zone, a fixed penalty notice will be issued, either placed on the car or handed to the driver if he/she are present.\n\nFurthermore, fines for unauthorised vehicle features, like tinted windows, can reach up to Rs300,000 for repeat offences. The statement said that the provincial government was also setting up exclusive “Traffic Courts” to handle cases of violations effectively.\n\nAnti-narcotics courts\n\nThe cabinet was informed that a staggering 9,676 narcotics cases had been reported in Sindh and 7,769 of them were currently pending in Karachi Division alone.\n\nTo tackle this challenge, a proposal to set up special courts was presented in the cabinet.\n\nThe suggestion is to have three courts in Karachi, and one each in Hyderabad, Sukkur, Larkana and Mirpurkhas divisions.\n\nThis initiative aims to streamline the judicial process and ensure that justice is served swiftly in the face of increasing demand.\n\nThe cabinet approved the proposal.\n\nAt the media briefing, Excise Minister Chawla said that a crackdown on sheesha parlours would begin within a week, citing their role in promoting drug use among youth.\n\nHe said that committees involving parents had been formed in private schools, and random drug testing had commenced to curb drug spread in educational institutions.\n\nThe local government department requested the cabinet for approval of additional funds to support the construction and improvement of roads, water supply, and drainage systems along Allama Rasheed Turabi Road and for the Karimabad underpass.\n\nThe cabinet approved Rs532.310m for Allama Rasheed Turabi Road project and Rs1bn for the underpass at Karimabad.\n\nPlan to set up SIUT chapters in Punjab\n\nDuring the meeting, the CM informed the cabinet that the federal government, in view of the exceptional performance of provincial government institutions, allocated Rs9 billion to the Sindh government for the establishment of the Sindh Institute of Urology and Transplantation (SIUT) in Rahimyar Khan and Rawalpindi, and for the reconstruction of houses for flood-affected people in Balochistan and Khyber Pakhtunkhwa.\n\n“This initiative aims to enhance public health services across Pakistan, with a particular focus on serving the people of Punjab and the neighbouring regions of Sindh and Balouchistan,” the CM said.\n\nA transparent monitoring framework will be implemented, including quarterly progress reports, third-party audits, and site visits by Sindh government officials to ensure responsible fund utilisation.\n\nThe CM said that this initiative was expected to significantly boost Sindh’s national image, demonstrating a commitment to equitable development and showcasing provincial generosity and national solidarity.\n\nThe cabinet was told that Rs2bn would be allocated for reconstruction of houses in flood-hit areas of Sohbatpur, Jaffarabad, and Dera Murad Jamali in Balochistan, while Rs1bn would be spent on houses in Dera Ismail Khan in Khyber Pakhtunkhwa.\n\nAt the briefing, ministers Ghani and Chawla categorically denied claims that the Sindh government was using provincial funds for development projects in Punjab, Balochistan and KP.\n\nThey clarified that institutions such as SIUT and housing schemes for flood victims in other provinces were being funded by the federal government and only executed by Sindh-based entities.\n\nPublished in Dawn, May 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:10:22.847Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912258/sindh-cabinet-okays-stringent-laws-to-improve-road-safety-in-province",
  "dateList": "2025-05-21",
  "date_published": "2025-05-20T23:56:00.000Z"
}
