{
  "title": "Asia region’s synergy to achieve sustainable development sans great power contestation imperative: Speakers",
  "link": "https://www.app.com.pk/national/asia-regions-synergy-to-achieve-sustainable-development-sans-great-power-contestation-imperative-speakers/",
  "date_published": "2023-05-11T13:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP):Speakers at the 3rd Islamabad Security Dialogue (ISD) 2023 – an initiative of the National Security Division – on Thursday underlined the need that synergy among the countries of Asia to achieve sustainable development and enduring peace in the region abstaining from great power contestation was imperative in the prevailing testing times.\nIt was the key highlight of the opening session of the “National Security Advisers Forum Reimagining Security Cooperation in Asia” on the concluding day of the two-day Islamabad Security Dialogue 2023.\nFormer National Security Advisor (NSA) Lieutenant General (R) Nasser Khan Janjua delivered the keynote address in the session followed by the recorded statements of the NSAs of the Asian countries, including China, Uzbekistan, Kyrgyzstan and Kazakhstan.\nGeneral (R) Janjua said the 21st century belonged to the Asia region that was home to 59.36 percent of the global population, with consumer markets, human resource, natural resources, development scope and connectivity potential.\nHe mentioned that as per global reports, by 2030 the United States’ economy would lag behind China which would be leading the world. “China is the second largest economy of the world and possesses maximum foreign currency reserves with the largest trade volume in the world.”\nThe US, he said, in that situation had to meet a triple crisis comprising its economy buildup and maintenance against China, mitigating all its challenges and retaining a reliable superpower status.\nHe proposed that Asian countries, particularly Pakistan, should reimagine their security cooperation in the prevailing scenario.\nGen (Retd) Janjua said after realizing its contestation with the US, China had smartly planned and rolled out the Belt and Road Initiative (BRI) as an alternative to its sea routes to expand economy and trade through mutual cooperation and collaboration. The second step was the formation of the Shanghai Cooperation Organization (SCO) to strengthen the region, he added.\nThe former NSA mentioned that in order to reimagine security cooperation it was necessary to rethink the economic well-being of the masses and stay unprovoked, rather integrating and consolidating as regional partners and stakeholders.\nHe further suggested that the BRI should be completed and expanded beyond the proposed regions as it had so far touched the major regions of the world and had effectively strategized to connect Asia to Europe and Africa.\nHe also recommended that the SCO forum should also be extended for intra-regional cooperation whereas if India wanted to join the BRI initiative then it should have dispute resolution with Pakistan first.\nGeneral (R) Janjua said the Asia region would have to create an Asia Trade Center as it had the Asian Development Bank, and its own currency to ensure economic fusion and enhanced trade options to strengthen the region.\nHe mentioned that Pakistan to rise beyond the China-Pakistan Economic Corridor (CPEC) project as an important country due to its pivotal role in connecting the African, European and Asian regions together through trade connectivity.\n“We will have to be friends with everyone while thinking economically and should circumvent great power contestation to belong to the better the world,” he ended..In his video message, Minister for Public Safety of China Wang Xiaohong said China appreciated Pakistan’s efforts for actively creating security consultations for regional collaboration through the ISD forum.\nHe added that the world picture was changing post-Covid-19 pandemic that had been managed and mitigated to a greater extent whereas the Kingdom of Saudi Arabia and Iran had reached reconciliation.\nHowever, he said, major states’ power contestation had intensified with the Ukraine crisis worsening, and the hotspots of violence in Afghanistan and Syria further deteriorating as both non-traditional and traditional security threats posing risks to the international community.\nXiaohong said Chinese President Xi Jinping had proposed the Global Security Initiative (GSI) and China was willing to join hands with the countries to promote GSI for a more peaceful and prosperous world.\nHe said all countries, regardless of their size, wealth and power, were equal members of the international community. He proposed that the region must firmly stick to multilateralism and basic norms of international relations.\nThe Chinese minister proposed that cooperation was the only way to meet challenges faced by the world and all the countries should support win-win cooperation and reject unilateralism.\nSecretary of the Security Council of Kazakhstan Gizat Nurdauletov said,”This forum demanded us to share information and use mutually beneficial solutions to the problems faced by the region.”\nHe said the new approach needed to be based on challenges faced by the region whereas according to the UN 2008 Report, the conflicts around the world had increased by three folds.\nKazakhstan, he said, was on the stage of reforming its state security which was only possible through regional cooperation. The problems faced by a country could be resolved by developing economic linkages and infrastructure.\nSecretary of the Security Council of Kyrgyzstan Marat Imankulov said the forum would be helpful in working out strategies to further strengthen political and security ties.\nHe underlined that the emerging prevailing situation in the region depended on the developments to take place in Afghanistan whereas a prudent approach and quick engagement with the Afghan government could help resolve the issue.\nHead of the Secretary of Security Council under the President of the Republic of Uzbekistan, Lieutenant General Viktor Makhmudov said the ISD had emerged as a vibrant forum in a very short time allowing the exchange of discourse on regional issues and matters of the region beyond.\nHe added that the competition in terms of military and economic might among great powers was on the rise whereas a lack of trust and dialogue between them was further aggravating the situation.\nHe underlined that with the emergence of the Ukraine crisis, Afghanistan faded into the backdrop whereas Afghanistan was in need of emergency help whereas tightening of sanctioning policy and further isolation increased the crisis.\nThe Uzbek President had proposed to create an international negotiating team under the patronage of the United Nations to hold talks with the Afghan government that would help resolve the crisis.\nHe also suggested introducing new measures to contain drug trafficking and mechanised cross-border crimes and developing a green corridor that would help address cross-border issues and enhance mutual coordination among the regional states.\nSecretary, National Security Division, Engineer Aamir Hassan extended the vote of thanks and expressed his gratitude to the Chinese and Central Asian Republics’ NSAs for participating in the dialogue.",
  "retrievedAt": "2025-08-11T08:28:30.091Z"
}
