{
  "title": "New Ethiopian embassy, airlink to provide limitless opportunities to boost bilateral ties: Hina",
  "link": "https://www.app.com.pk/national/new-ethiopian-embassy-airlink-to-provide-limitless-opportunities-to-boost-bilateral-ties-hina/",
  "date_published": "2023-05-11T11:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP): Minister of State for Foreign Affairs Hina Rabbani Khar on Thursday said that the new Ethiopian Embassy and the airlink would provide limitless opportunities to boost bilateral ties through enhanced trade and investment as well as people-to-people connections.\nAfter inaugurating the Ethiopian Embassy here along with the Ethiopian Minister of State for Foreign Affairs Mesganu Arga, the minister of state said this would also provide opportunities to the youth for learning.\nShe said witnessing the achievement of the following important milestone in the journey of Pak-Ethiopia relations was pleasing.\nShe said a country’s diplomacy must be geared towards opening doors and opportunities for its people, trade, and investment.\nHina Rabbani Khar said the economic and developmental challenges of the two countries were similar but also, there was commonality in the resilience of the two people to achieve these goals.\nShe said Pakistan has always supported Africa throughout history.\nHina Rabbani Khar said Pakistan wished to engage with Africa meaningfully and partner in its growth and prosperity journey.\nHighlighting the significance of direct flight operations by Ethiopian Airlines to Karachi, she said opening direct flights between the two countries would boost trade and people-to-people contacts.\nShe expressed the hope that the new Embassy would be instrumental in materializing that potential for the mutual benefit of our countries.\nShe told the6 audience that 70 years back, the then Pakistani Prime Minister Zulfikar Ali Bhutto had inaugurated Pakistan’s Embassy in Ethiopia.\nShe lauded the services of a new Ethiopian ambassador in Islamabad Jemal Beker Abdula, who made a mark in his short eight months.\nShe said throughout history, Pakistan supported African peace through peacekeepers, as hundreds of them also sacrificed their lives for the cause.\nIn his remarks, Ethiopian Minister of State for Foreign Affairs Mesganu Arga said that the opening of the Ethiopian Embassy marked a new history in the diplomatic, political, economic, and social cooperation between the two countries.\nHe said the commencement of Ethiopian Airlines flight to Karachi would connect Pakistan with the “Land of Origins-Ethiopia” and more than 60 destinations in the continent of Africa and 130 more globally.\nThe state minister said the opening of the Embassy was a concrete example of the importance the Ethiopian government attached to its bilateral relations with Pakistan.\nHe said Ethiopia considered Pakistan as a strategically important and strong partner in Asia, and the signing of the Political Consultation guided the aspiration of the two governments and peoples to play their appropriate role in international issues like climate change, terrorism, migration, and peace and security.\nSimilarly, the bilateral trade agreement signed on February 14, 2023 would open a new window of opportunity for investment, trade, and tourism, transforming the trade volume to a high level.\nThe state minister added that the Science, Technology and Innovation agreement is also expected to enhance productivity in agriculture, manufacturing and ICT sectors by enhancing technological transfer and encouraging the exchange of innovation and experience sharing.\nAmbassador of Ethiopia to Pakistan Jemal Beker Abdula thanked to the government of Pakistan for extraordinary support to launch the airline and for providing a friendly environment for business.",
  "retrievedAt": "2025-08-11T08:28:33.651Z"
}
