{
  "title": "No chances of martial law, emergency may be imposed if chaotic situation persists: Khawaja Asif",
  "link": "https://www.app.com.pk/national/no-chances-of-martial-law-emergency-may-be-imposed-if-chaotic-situation-persists-khawaja-asif/",
  "date_published": "2023-05-11T18:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP):Defence Minister Khawaja Muhammad Asif on Thursday said there was no chance of imposition of martial law in the country whereas an emergency might be imposed with the approval of the Federal Cabinet if the chaotic situation persisted.\nAddressing a press conference here at the PTV Headquarters, he said the Pakistan Tehreek-e-Insaf’s (PTI) workers and supporters had attacked the Parliament House and Pakistan Television earlier too, and the same pattern was adopted in the case of Radio Pakistan and APP (in Peshawar on Wednesday).\nHe said the General Headquarters (GHQ) was earlier attacked by the Tehreek-e-Taliban and now by the Pakistan Tehreek-e-Insaf. Had any other party or organization done it they would have faced serious consequences.\nNo suo moto notice was taken by the judiciary in the prevailing situation and about the conduct of the PTI, he regretted.\nThe minister asked when there were houses of other personalities in Lahore then why the Corps Commander’s House was targeted.\nHe said he had made speeches against the military dictator but never made such attacks on the institution. “Imran Khan is not targeting any personality rather the institution of the Pakistan Army.”\nThe minister said the PTI chief was the first beneficiary of the amendments in the National Accountability Bureau (NAB) law as during his party’s rule there was physical remand of 90 days, which was now reduced to 14 days.\n“In those days no one had thought of ending our detention and today the provision of facilities at the rest house is being ordered (referring to the apex court’s directives to provide proper facilities to Imran Khan at the Police Rest House). Why are there two standards in the country? Everyone has two standards,” he said.\nKhawaja Asif He said Imran Khan claimed that he was beaten with sticks and did not remember anything, adding, “It is strange that he has got a short-term memory loss based on his personal wishes.”\nHe said there was a big difference between the medical reports of Imran Khan in police custody and those of his charity hospital as two spelt out different nature of his injuries.\n“How long will the nation be fooled? Even today Imran Khan walked in the corridor of the Supreme Court by himself. It seems that his leg was neither injured nor he was feeling any pain as he did not use the wheelchair,” the minister queried.\nHe said the PTI chairman was showing indifference to the protests. “Had he not incited the workers to violence in his last video statement before the arrest?”\nThe violence resulted into attacks on the memorials of martyrs, defence installations and the Corps Commander’s House, but no notice was taken by the judiciary in that regard, he added.\nHe said Nawaz Sharif and his daughter Maryam Nawaz, Asif Ali Zardari and his sister, he and Shehbaz Sharif did not stay in any rest house, but they had to approach courts to get food from their homes.\nHe said there was a question as to why there was a double-standard. No one was taking notice of the violence and destruction in Punjab and Khyber Pakhtunkhwa , and the language used by the “PTI goons” against the institutions, he added.\nThere was an attack on the country’s integrity, which should not have gone unnoticed, he remarked.\nHe said in an audio leak a lawyer was heard telling another person that the decision had yet to come. “He (the alleged lawyer) also informed about what would happen on Monday and Tuesday.”\nHe said negotiations were going on with PTI, “but dictation does not work in the talks”.\nHe said the only solution to get out of the difficult situation was simultaneous election on a same across the country. “We had not asked anyone to dissolve the assemblies,” he replied to a question.\nThe minister said the attackers and those who were giving them instructions had been identified from social media.\nAnswering a question, he asked why the government was being advised to only look at the current situation. “We have not created unrest or asked anyone to rebel against the state and show anti-nationalism.”\nHe alleged that the Indian media was highlighting the current situation in Pakistan.\n“What they could not achieve in 75 years, they had achieved now due to the anti-state actions of a political party of Pakistan.”",
  "retrievedAt": "2025-08-11T08:28:24.611Z"
}
