{
  "title": "International Golden Jubilee Convention emphasizes importance of Constitution, stresses promoting social justice",
  "link": "https://www.app.com.pk/national/international-golden-jubilee-convention-emphasizes-importance-of-constitution-stresses-promoting-social-justice/",
  "date_published": "2023-05-11T09:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP):The political leaders, parliamentarians and experts on Thursday emphasized the importance of Pakistan’s Constitution in establishing democracy, protecting minority rights and promoting social justice at the International Parliamentary Convention being organized by National Assembly Secretariat in connection with Golden Jubilee Celebrations of the Constitution of Islamic Republic of Pakistan.\nThe speakers stressed the role of parliament as the people’s representative and the need to prevent non-constitutional forces from interfering.\nThe UN Charter and international laws were cited as means for resolving disputes. Discussions included the need to learn from past mistakes, and to promote teachings of Islam, which encourage tolerance and non-discrimination.\nThe session focused on threats to the constitution, including its suspension and abrogation, and the impact of emergency rules on democracy and the rule of law.\nIt also discussed ways to navigate and overcome crises that threaten democracy, such as national security threats, social unrest, and political and economic instability, and the role of constitutional principles and institutions in promoting resilience and stability during times of crisis.\nSenior leader of Pakistan Muslim League Nawaz (PML-N) Mohsin Shah Nawaz Ranjha stated that the Constitution of Pakistan guaranteed rights to people of all religions and had taken into account all future challenges.\nChairing the first session titled Constitution in the age of Crises: Navigating Challenges,” in the International Convention as part of Pakistan’s Golden Jubilee of the Constitution, he also highlighted that parliamentary discussions assist in comprehending the Constitution.\nMoreover, he emphasized that it was imperative to practice tolerance, social justice, and protect the rights of minorities in accordance with Islamic teachings and the Constitution of Pakistan to ensure effective democratic governance.\nAccording to the Constitution of Pakistan, there is a significant link between the fundamental rights of the people and the Holy Quran. The Constitution is designed to encompass and address all situations.\nThe Kyrgyzstan representative expressed gratitude for the Speaker of the National Assembly, Raja Pervez Ashraf, for organizing the convention. Kyrgyzstan and Pakistan are both interested in boosting cooperation in tourism, healthcare, trade, and economy.\nThey have recently signed the Charter of Operation to strengthen their collaboration. The representative also welcomed new investment prospects between the two nations.\nSpeaking on the occasion, Senator Mushahid Hussain Syed emphasized the significance of the Constitution in establishing a functional democracy in Pakistan.\nHe highlighted the parliament’s role as a representative of its country and people and warned against constitutional violations and non-constitutional forces.\nHe also mentioned the provisions for resolving disputes between countries under the United Nations Charter and international laws.\nThe senator also emphasized the importance of the Constitution in forming the basis for a functioning democracy in Pakistan.\nHe emphasized that the parliament served as a representative of its country and people, and there was consensus among political parties based on the Constitution.\nThis democratic process was the purpose of Pakistan’s creation, and it relied on the foundation of democratic rule and the Constitution, he added.\nHowever, Pakistan has a history of constitutional violations, such as judicial activism, military coups, and amendments targeting specific individuals.\nSimilarly, other countries, like the United States and India, have also violated their own Constitutions. For example, the US violated its Constitution by going to war in Iraq in 2003 without proper validation from Congress, and the Supreme Court’s decision in the President George Bush vs.\nAl Gore presidential election was a violation of the Constitution as it declared Bush the winner by a 5-4 majority. India has also had various violations, including the promulgation of emergency by Indra Gandhi and blatant violations in Indian Illegally Occupied Kashmir.\nThe Senator noted that under the United Nations Charter and international laws, there were provisions for determining relations and resolving disputes between countries.\nThe International Convention discussed various challenges related to crises in different parts of the world.The interference of non-constitutional forces have significant effects.\nIn his address to the plenary session, Khalid Mahmood, a member of the British Parliament, stated that democracy was not an easy thing to achieve, but rather a difficult task.\nUnderstanding democracy is fundamental. According to the constitution, representatives will remain in office for five years, and it is imperative that this be implemented.\nHow can anyone talk about removing someone who has been elected for five years? We do not have a written constitution in Britain. India is not a true democratic country.\nWhen it comes to the issue of Kashmir, Sikhs, and those who are discriminated against in India, there are serious human rights violations taking place. He said he strongly disagree with the notion that India is a democratic country.\nDeputy Speaker of the Kenyan Parliament, Farah Malam Muhammad, spoke about the attack on the Kaaba by the Abraha and its consequences. He stated that ISIS and other terrorist organizations do not represent his religion.\nAccording to him, Oman and Kuwait have a proper democracy. Instead of repeating mistakes, we should learn from them. Protesting in the country will not lead to anything.\nHe asked if there was peace in Syria, Iraq, and Somalia. Democracy is not a Quran. The constitution is not the last word. We should elect our own representatives. We must learn about governance from our Holy Prophet and Hazrat Umar’s lives. People should lead a simple life.\nPolitics has become a business nowadays. America’s middle class is made up of people from various places. Despite having our own tribes and classes, we still fight.\nParliament cannot be stopped from legislation since that is its primary role. If there is a flaw in the law, then it is necessary to legislate to fix it.\nHe highlighted the teachings of Islam, which promote patience, tolerance, and the protection of non-Muslims’ rights. He emphasized that terrorists have no religion.\nIn addition, he stated that equality can only exist among those who are equal. He also pointed out that politics has become a business in many countries.\nKhalid Maqbool Siddiqui, a member of the Mutahidda Quomi Movement (MQM), said the current crisis in Pakistan is largely due to the fact that the country’s Constitution has failed to safeguard the rights of its citizens.\nHe believes that this failure has led to the emergence of a troubling phenomenon known as the “doctrine of necessity,” which allows the ruling elite to purge themselves of any opposition, thereby consolidating their power and undermining democratic institutions.\nSiddiqui also made a comparison between Pakistan and India, stating that the people of Pakistan have never elected any extremist as their ruler, unlike India, where religious bigots have been elected as leaders. He went on to suggest that the dangers to world peace come from India, rather than Pakistan.\nMs. Nafeesa Shah, a member of the National Assembly of the Pakistan Peoples Party, expressed her opinion that the judiciary’s rejection of the doctrine of necessity was a positive step towards improving the country’s image.The doctrine of necessity had been used in the past to justify unconstitutional actions, such as military coups, which had undermined the rule of law and democracy in Pakistan.\nTo address this issue, the PPP government introduced the 18th amendment to the constitution, which included safeguards to prevent the promulgation of emergency in the country.\nThese safeguards were designed to ensure that any declaration of emergency was based on genuine and compelling reasons, and that it was subject to judicial review to prevent abuse of power.\nThe 18th amendment also strengthened the autonomy of the provinces and devolved more powers to them, which was another important step towards strengthening democracy .\nOverall, the amendment was a significant milestone in Pakistan’s constitutional history, and it played a crucial role in improving the country’s democratic institutions and governance.",
  "retrievedAt": "2025-08-11T08:28:34.101Z"
}
