{
  "title": "President directs SLICP to immediately pay widow’s insurance claim",
  "link": "https://www.app.com.pk/national/president-directs-slicp-to-immediately-pay-widows-insurance-claim/",
  "date_published": "2022-03-13T11:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 13 (APP): Expressing displeasure over an unnecessary delay of seven years in the payment of life insurance claim to a widow, President Dr Arif Alvi directed the State Life Insurance Corporation of Pakistan (SLICP) to pay the sum assured of Rs 412,000, as well as add inflation cost/interest to the accrued amount.\nHe further directed SLICP to apologize to the widow and change its financial system attitude and report compliance to Wafaqi Mohtasib within 30 days.\nThe president passed these orders while rejecting a representation of SLICP against a decision of the Wafaqi Mohtasib, directing it to pay the claimants the assured amount without further delay.\nAs per the details, the deceased Zahid Altaf Bhatti had obtained two life insurance policies from SLICP (the Agency) on 06.07.2007 and 25.06.2010 for the sum assured of Rs 212,000 and Rs 200,000 respectively.\nHe died on 20.03.2015 and his wife, Fouzia Zahid Bhatti (the complainant), approached the Agency to pay the insurance claim but the latter refused to pay the sum on the ground that the deceased had pre-insurance ailments and was a patient of liver disease/hepatitis C.\nFeeling aggrieved, Fouzia Zahid Bhatti filed a complaint with Wafaqi Mohtasib who directed SLICP to pay the amount and report compliance within 30 days. Instead of implementing the orders of the Wafaqi Mohtasib, SLCIP filed a representation with the President against the decision of the Mohtasib.\nRejecting the representation, President Dr Arif Alvi referred to section 80 of the Insurance Ordinance, 2000, which provided that an insurance policy could not be called into question on the grounds of misrepresentation, false statement or suppression of material facts after two years from the date when the policy was originally effected.\nIn the present case, the policies were issued in 2007 and 2010, whereas the policyholder expired in 2015, thus, the policy could not be called into question.\nHe further noted that the agency had failed to substantiate its claim and no clinical investigation or diagnostic assessment had been produced to corroborate the existence of pre-insurance ailment.\nThe president further observed that the confidential report of the field officer had also declared the insured as healthy, categorically stating that he knew the deceased for the last 12 years.\nThe president underlined that ethical principles and compassion should not be ignored in the pursuit of making profits.\nHe said that SLICP came out with frivolous excuses and delayed the payment in an unethical manner.\nHe also advised the agency to change its financial-system attitude and add inflation cost/interest to the accrued amount of the beneficiary.",
  "retrievedAt": "2025-08-11T14:31:47.042Z"
}
