{
  "title": "Imran Khan name of ideology, courage, bravery: Farrukh",
  "link": "https://www.app.com.pk/national/imran-khan-name-of-ideology-courage-bravery-farrukh/",
  "date_published": "2022-03-13T08:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP): Minister of State for Information and Broadcasting Farrukh Habib said on Sunday that Imran Khan was the name of ideology, courage and bravery who does not bow down and will not let the nation bow down to anyone.\nAddressing the three-day Overseas Convention here he said expatriates participating in this convention were truly special guests.\nHe invited Asif Zardari, Bilawal Zardari and Maryam Safdar to come and see those who donated for PTI from abroad were sitting in the convention.\n“We stand with Imran and can proudly say that there is a difference between Imran Khan and his opponents”, he said\nHe alleged that “the bouquet of dacoits” had joined hands out of fear of Imran Khan, as they like money laundering, property building and treatment abroad, loot, plunder and fleeing.\nHe said that remittances worth over $ 30 billion this year were prove of expatriates confidence in Imran’s leadership. Next year the remittances will exceed $ 35 billion, he hoped.\nHe said that Imran Khan was an upright person as certified by the Supreme Court, who presented a 40-year record.\nImran Khan, he said has given overseas Pakistanis the right to vote,online power of attorney, and simplified inheritance certificate.\nThe reason for honor of green passport was that Imran Khan was a patriot by heart.“Ever since Imran Khan came to power, Overseas Pakistanis have been treated with more respect,” he said.\nDue to prudent policies of the government, Pakistan was going to stand on its own feet economically, Farrukh Habib remarked.\nHe said Imran Khan raised the voice against Islamophobia at international forums and it was appreciated globally.\nThese corrupt people cannot say “Absolutly Not” because their interests get in the way.“Imran Khan is a preacher of peace” and wanted to have friendly relations with all nations but not at the cost of national dignity and has laid the foundation of an inclusive and independent foreign policy.\n“No matter how many “no trust motion” the opposition brings, nation’s trust in Imran Khan was going to increase.”\nIn the past, drone strikes were allowed in Pakistan with the written approval of the former rulers, but Imran was ready to go to any lengths to honor and respect Pakistanis.He said the PTI introduced the concept of political fund-raising for first time.\nIn the past, he claimed bribery was order of the day and ministries and posts were sold upto Rs 200 million.\nThe minister appealed to the ECP should immediately activate the scrutiny committee so that the foreign accounts of PML-N and PPP could be scrutinized.\nHe challenged Bilawal and Maryam to present the record of their 100 donors, as millions of rupees have been transferred in their accounts by strangers.\nTalking about the ‘no confidence motion’ he said the PML-N and PPP will fall into the pit they dug for PTI as they did not enjoyed the required support.",
  "retrievedAt": "2025-08-11T14:31:46.764Z"
}
