{
  "title": "80 pc Pakistanis believe PM to complete five year term",
  "link": "https://www.app.com.pk/national/80-pc-pakistanis-believe-pm-to-complete-five-year-term/",
  "date_published": "2022-03-13T15:18:00.000Z",
  "source": "APP",
  "content": "Eighty percent Pakistanis, according to a Pulse survey, believe that Prime Minister Imran Khan will complete his five year tenure and there will no mid term elections.\nAlmost six amongst 10 (62 percent) believe that the government of Prime Minister Imran Khan will sustain against the no trust move, whereas two amongst 10 (23%) have the opinion that the government of Prime Minister will be topped as a result of the no confidence move. While 15% have no opinion.\nWhen asked about relief package of Prime Minister Imran Khan, overall 63 percent of respondents were satisfied (32 percent completely satisfied and 31 percent somewhat satisfied) with the announcement of Rs 2000 increase in Ehsaas financial aid from Rs 12000 to Rs 14000. Thirty two percent were completely dissatisfied and five percent have no opinion.\nOn an overall level, 66 percent respondents from Punjab were satisfied (37% were completely satisfied and 29 percent somewhat satisfied) with the announcement of the Prime Minister for issuing of Sehat cards till March end.\nThe Prime Minister claimed that despite the high inflation rate of petroleum products at the international level, due to efficient and high tax collection, his government was able to provide relief to the masses.\nWhen we asked respondents opinion about the claim, 10 percent of the respondents completely agreed and 42 percent  somewhat agreed (cumulatively 52 percent agreed), whereas 42 percent completely agreed with the claim.\nThere was a split opinion on relief of Rs 10 on petroleum prices by the Prime Minister. Almost half (48%) believe that it will not work. Whereas 8 percent believe that it was a huge relief and 41 percent take it as somewhat relief (cumulatively 49 percent have the perception of getting relief), three percent had no opinion.\nAgain there was a split opinion on reduction of Rs 5 on electricity. 47 percent feel that this reduction was not a significant relief whereas nine percent believed that this was a significant reduction and 42 percent believed that it was somewhat relief (cumulatively 51 percent have the perception of getting relief). Three percent had no opinion.",
  "retrievedAt": "2025-08-11T14:31:42.510Z"
}
