{
  "title": "Over 8.2 mln Overseas Pakistanis registered with NADRA: Tariq Malik",
  "link": "https://www.app.com.pk/national/over-8-2-mln-overseas-pakistanis-registered-with-nadra-tariq-malik/",
  "date_published": "2022-03-13T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP):Chairman National Database and Registration Authority (NADRA), Muhammad Tariq Malik here on Sunday said that over 8.2 million Overseas Pakistanis registered with NADRA and the government was committed to provide maximum facilities to expatriates.\nAddressing at the Overseas Pakistanis International Conference (OIC), he said that now all diaspora Pakistanis could get their passport online and CNIC within short time.\nHe informed that 20,498 employee working with NADRA, however, 760 Registration centers including 10 for Overseas Pakistanis, 10 mega centers, 222 mobile registration vans, 3 data centers and over 1000 services were providing to the people.\nTariq said that new mobile APPs are under process to facilitate to the expatriates within hours including digital NICOP, passport renewal or new registration for passport, death certificate, power of attorney, Roshan digital accounts, land record, succession certificates online biometric verification for overseas family members, PIA Repatriation initiatives to ring Pakistanis back during Covid-19, Internet Voting, Complaints registration cell, he said that these were the major initiates for Overseas Pakistanis.\nSecretary Office of International Chapters of Pakistan Tehreek-e-Insaf (PTI) Dr Abdullah Riar has appreciated all the efforts of the government regarding Overseas Pakistanis and adding that through the Roshan digital account daily million of rupees remittances submitted.\nHe said the incumbent government has taken milestone steps for the welfare and development of expatriates in the history of the country.\nHe said that the main purpose of this conference was to thanked to the incumbent government for taking historic steps for Overseas Pakistanis and appreciated the meritorious efforts of Prime Minister Imran Khan.\nHe said that a series of projects and schemes were launched for the betterment of the Overseas Pakistanis and their dependents in different sectors including Sohni Dharti, schemes of Modern Luxury Apartments, Roshan Digital Account, Prime Minister’s Performance Delivery Unit, Call Sarzameen, Naya Pakistan Calling Project, Visit Pakistan, internship, Complaint Cell, Ambulance Service, Investment Facilities Centre, Reintegration of Returnee Migrant Workers and Foreign Exchange Remittance Card.\nDr Abdullah revealed that 5% population of the country was living abroad and sending over US$30 billion remittances to the country which was playing a backbone role in the national economy. Prime Minister has restored the dignity of green passport across the globe and first time in the national politics expatriates could participate due to the great efforts of the current regime.\nHe also underlined and appreciated the steps of the government including health card, loan without interest, receiving power of attorney for expatriates. The international community had acknowledged the smart lockdown policies and revival of industrial sector despite drastic impact of COVID-19.",
  "retrievedAt": "2025-08-11T14:31:43.779Z"
}
