{
  "title": "ICT Police enhances security measures for diplomats and foreign nationals in 2024",
  "link": "https://www.app.com.pk/national/ict-police-enhances-security-measures-for-diplomats-and-foreign-nationals-in-2024/",
  "date_published": "2024-12-21T13:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP):The Islamabad Capital Territory (ICT) Police Security Division introduced comprehensive reforms in 2024 to enhance the safety of foreign diplomats, embassies and international institutions in the capital.\nTo fortify the security of foreign embassies, diplomats and institutions, a protective wall was constructed around all four sides of the Diplomatic Enclave, complete with an electric fence, an official told APP on Saturday.\nHe said that to ensure effective surveillance, a Safe City control room was established with modern cameras. He added that the entry of individuals into the Diplomatic Enclave is now recorded through advanced high-tech tablets, while body-worn cameras and iron gates have been installed in high-security zones.\nA Cascade Service Center was also set up within the Diplomatic Enclave to provide global-standard facilities under one roof, offering 24/7 services to applicants, including all police-related services for diplomats, he added.\nAdditionally, a Special Protection Unit (SPU) was formed to ensure the security of Chinese nationals, with 415 young police officers assigned to safeguard them. A dedicated control room was also established to address the security-related issues faced by Chinese citizens in a timely manner, he said.\nThe ICT Police also launched innovative initiatives, including a community horse-riding school for diplomats and citizens and a Diplomatic Diagnostic Center for the welfare of police officers, where medical services are available at discounted rates, he said.\nIn 2024, the ICT Police Security Division ensured top-notch security during the Shanghai Cooperation Organization (SCO) conference for international delegations, maintaining order in high-security zones and ensuring law and order, he told APP.\nHe added that throughout the year, the division ensured foolproof security for 31 National Assembly sessions, 17 Senate sessions, four joint sessions, in-camera briefings and 903 other national and international conferences and events.\nMoreover, police officers provided excellent security during the arrival and departure of 15 VIP international delegations in the federal capital.\nDIG Security Jawad Tariq said that the responsibilities entrusted to the ICT Police Security Division are of utmost importance, including the security of foreign diplomats, judges and all embassies, as well as the government and private offices located in high-security zones.\nDIG further stated that the ICT Police is carrying out its duties professionally and effectively, using all available resources to ensure the security of foreign guests and maintain the country’s dignity and identity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:57:08.468Z"
}
