{
  "title": "IWMB defends its role amid controversy over Margallah Hills National Park",
  "link": "https://www.app.com.pk/national/iwmb-defends-its-role-amid-controversy-over-margallah-hills-national-park/",
  "date_published": "2024-12-21T12:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP):The Islamabad Wildlife Management Board (IWMB) has countered claims regarding the alleged removal of its current board, asserting that the Islamabad Nature and Wildlife Management Act 2024 has, in fact, bolstered the institution and the Margallah Hills National Park’s (MHNP) protection.\nThe Board, in a news release, clarified that the Act, which repealed the Islamabad Wildlife Ordinance 1979, does not invalidate prior notifications under the ordinance, including those related to the national park, the Board, and its employees.\nIndependent legal opinion, the IWMB stated, confirms that the Board remains intact with a three-year tenure, which any interference would violate.\nThe IWMB highlighted the importance of MHNP, established to safeguard Islamabad’s natural environment. While Daman-e-Koh remains a popular getaway for middle-class families, commercial enterprises such as the now-demolished Monal Restaurant had turned the park into a playground for elites, leading to environmental degradation.\nFollowing a Supreme Court order, the Monal Restaurant was demolished in October 2024. The IWMB estimates that this has reduced traffic to Pir Sohawa by 60%, benefiting local communities who can now travel to Islamabad more easily, particularly during emergencies.\nThe IWMB underscored the environmental damage caused by Monal and similar ventures like La Montana and Gloria Jeans. These businesses were developed without Environmental Impact Assessments (EIA) or compliance with environmental regulations. Monal, for instance, disposed of solid waste and wastewater directly into the environment, contaminating streams and disrupting wildlife with heavy traffic and nighttime illumination.\nThe Supreme Court upheld earlier rulings, ordering the demolition of such establishments and the reintegration of the land into the national park.\nThe IWMB is now focusing on rewilding the former Monal site into a public viewpoint and finalizing a scientific management plan for MHNP.\nThe Board advocates sustainable development that involves local communities, emphasizing regulated kiosks for basic visitor needs, as directed by the Supreme Court.\nddressing misconceptions, the IWMB pointed out that MHNP contributes significantly to the economy. Recreational sites like Rawal Lake and Shakarparian host large-scale businesses, generating far more economic activity than the now-demolished establishments.\nThe IWMB urged the government to prioritize environmental preservation over short-term financial gains, highlighting Pakistan’s international commitments to biodiversity and climate change. “Islamabad’s beauty and well-being lie in protecting the sanctity of Margallah Hills National Park,” the Board stated, calling for support rather than sabotage of its efforts.\nThe IWMB stressed the need to value protected areas as sites of recreation, reflection, and environmental education, emphasizing their crucial role in Islamabad’s ecological health amidst rising urban pollution.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:57:31.597Z"
}
