{
  "title": "2-10 years jail-term announced to 25 civilians involved in May 9 riots",
  "link": "https://www.app.com.pk/national/2-10-years-jail-term-announced-to-25-civilians-involved-in-may-9-riots/",
  "date_published": "2024-12-21T10:43:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 21 (APP): As many as 25 civilians involved in violent attacks on military installations during the nationwide May 9, 2023 riots have been sentenced by the military courts two to 10 years prison.\nOn December 13, the 7th member’s constitutional bench of the Supreme Court allowed military courts to announce the decision of under custody civilians pertaining to the May 9 incidents, said an Inter-Services Public Relations (ISPR) news issued here Saturday.\nThe sentences have been pronounced after a complete investigation of all evidence and fulfilling all legal procedures. The convicted persons have also been provided complete legal rights to fulfil the legal requirements, it further said.\n“On May 9, the nation witnessed politically provoked violence and arson at multiple places, marking a dark chapter in the history of Pakistan”, the press release said.\n“Building on a sustained narrative of hate and lies, politically orchestrated attacks were carried out on the installations of the armed forces including desecration of the monuments of shuhada,” it added.\n“These blatant acts of violence not only shocked the nation but also underscored the necessity of checking this unacceptable attempt of political terrorism to impose own perverted will through violence and coercion,”  ISPR further said.\nAfter this black day, all evidence and events were thoroughly investigated besides gathering irrefutable evidence against the perpetrators. Some select cases were also referred to Field General Court Martial “as per law.”\n“Promulgation of the sentences of remaining accused is also being done and will be announced shortly as and when the due process is complete,” the statement said.\n“The verdict is an important milestone in the dispensation of justice,” it added.\nThe sentences are also a clear message to those who “are exploited by the vested interests and fall prey to their political propaganda and intoxicating lies, to never take law in own hands ever in the future,” the press release said.\n“Some additional suspects are being tried in various Anti-Terrorist Courts,” it added. However, it emphasized that “justice would truly be served once the mastermind and planners of  May 9 riots are punished as per the Constitution and laws of the land”, it further added.\nTen-year sentences were handed down to 14 of the 25 persons convicted, with the majority linked to the Jinnah House incident. Other attacks involved GHQ, PAF Base Mianwali, Punjab Regimental Centre Mardan, and various military installations across the country.\nThe following 25 people were handed down the sentences:\nJan Muhammad Khan  S/O Toor Khan— involved in Jinnah House incident (10 years)\nMuhammad Imran Mehboob S/O Mehboob Ahmed — involved in Jinnah House incident ((10 years)\nRaja Muhammad Ehsan S/O Raja Muhammad Maqsood — involved in GHQ attack incident (10 years)\nRehmat Ullah S/O Manjoor Khan — involved in Punjab Regimental Centre Mardan incident (10 years)\nAli Iftikhar S/O Iftikhar Ahmed — involved in Jinnah House incident (10 years)\nZia ur Rehman  S/O Azam Khursheed — involved in Jinnah House incident (10 years)\nAdnan Ahmed S/O Sher Muhammad — involved in Punjab Regimental Centre Mardan incident (10 years)\nShakir Ullah S/O Anwar Shah — involved in Punjab Regimental Centre Mardan incident (10 years)\nAnwar Khan S/O Muhammad Khan— involved in PAF Base Mianwali incident (10 years)\nAbdul Hadi  S/O Abdul Qayyum— involved in Jinnah House incident (10 years)\nAli Shan S/O Noor Muhammad — involved in Jinnah House incident (10 years)\nDaud Khan  S/O Shad Khan— involved in Jinnah House incident (10 years)\nUmar Farooq S/O Muhammad Sabir — involved in GHQ attack incident (10 years)\nBabar Jamal  S/O Muhammad Ajmal Khan— involved in PAF Base Mianwali incident (10 years)\nMuhammad Afaq Khan S/O M Ashfaq Khan — involved in Bannu Cantt incident (nine years)\nDaud Khan  S/O Amir Zeb— involved in Chakdara Fort incident (seven years)\nFaheem Haider S/O Farooq Haider — involved in Multan Cantt Check Post incident (six years)\nMuhammad Hashir Khan S/O Tahir Bashir — involved in Jinnah House incident (six years)\nZahid Khan  S/O Muhammad Khan— involved in Multan Cantt Check Post incident (four years)\nMuhammad Ashiq Khan  S/O Naseeb Khan— involved in Jinnah House incident (four years)\nKhuram Shahzad  S/O Liaquat Ali— involved in Multan Cantt Check Post incident (three years)\nMuhammad Bilawal  S/O Manzoor Hussain— involved in Jinnah House incident (two years)\nSaid Alam  S/O Maaz Ullah Khan— involved in Punjab Regimental Centre Mardan incident (two years)\nLaeeq Ahmed  S/O Manzoor Ahmed— involved in ISI Office Faisalabad incident (two years)\nYasir Nawaz   S/O Amir Nawaz Khan — involved in Punjab Regimental Centre Mardan incident (two years).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T13:57:33.207Z"
}
