{
  "title": "Pakistan terms US official’s alleged perception over its missile capabilities as unfounded",
  "link": "https://www.app.com.pk/global/pakistan-terms-us-officials-alleged-perception-over-its-missile-capabilities-as-unfounded/",
  "date_published": "2024-12-21T10:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): Ministry of Foreign Affairs Spokesperson on Saturday asserted that the alleged threat perception from Pakistan’s missile capabilities and delivery means, raised by the US official were unfortunate, terming the allegations as ‘unfounded, devoid of rationality and sense of history.’\nIn response to media queries regarding the statement by a senior US Official at a think-tank, the Spokesperson Ministry of Foreign Affairs Mumtaz Zahra Baloch, in a statement, said the recent spate of US allegations towards a major non-NATO ally would be unhelpful for the overall relationship, especially in the absence of any evidence in this regard.\n“Pakistan has never had any ill-intention towards the US in any form or manner, and this fundamental reality has not changed. On the contrary, Pakistan has made monumental sacrifices for this relationship and continues to suffer hugely in sustaining the onslaught of the aftermath of US policies in the region,” she added.\nThe spokesperson maintained that since 1954, Pakistan and the US had enjoyed a positive and broad-ranging relationship.\n“It is regrettable that the US official alluded to bracketing Pakistan with those who are perceived to be in an adversarial relationship with the US.  While ignoring and shielding the manifestations of a much more potent missile capability in our eastern neighbourhood, concerns on Pakistani capabilities are being raised seemingly at the behest of others to further accentuate the already fragile strategic stability in the region,” it was further added.\nThe spokesperson reiterated that Pakistan’s strategic capabilities were meant to defend its sovereignty and preserve peace and stability in South Asia.\n“Pakistan cannot abdicate its right to develop capabilities that commensurate with the need to maintain credible minimum deterrence as well as evolving and dynamic threats. Since 2012 when the US officials started broaching the subject, different Pakistani governments, leadership and officials, have endeavored from time to time, to positively address and remove the misplaced US concerns,” the press statement quoted her as saying.\nMoreover, the spokesperson said Pakistan had also made it abundantly clear that its strategic programme and allied capabilities were solely meant to deter and thwart a clear and visible existential threat from its neighbourhood and should not be perceived as a threat to any other country.\nHence, any irrational assumption of a hostile intent from Pakistan by any other country including the US ‘is perplexing as well as illogical’.\nIn view of the profound sanctity of strategic programme for the people of Pakistan and for the country’s defense, she said their clear iterations and manifestation of intent and purpose thereof, any attempt to seek intrusion into it, in any form or manner, on any pretext whatsoever, was neither thinkable nor possible.\n“There is unshakeable resolve and complete consensus on this aspect across the entire political and social spectrum of the country,” it was further emphasised.\nPakistan had always sought to engage constructively with the US on all issues, including the need to pursue a balanced approach to security and stability in the region. They had a long history of cooperation and wish to build on this strong legacy, the spokesperson said.",
  "retrievedAt": "2025-08-10T13:57:11.656Z"
}
