{
  "title": "Former regimes pay no attention to install electricity transmission lines: Gill",
  "link": "https://www.app.com.pk/national/former-regimes-pay-no-attention-to-install-electricity-transmission-lines-gill/",
  "date_published": "2021-01-10T16:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): Special Assistant to Prime Minister (SAPM) on Political Communication Dr. Shahbaz Gill on Sunday said that Pakistan Muslim League Nawaz (PMLN)’s government had inked expensive power contracts just to make money and didn’t paid attention to install electricity’s transmission lines which led sudden power outage across the country.\nThe consequences of incompetency of the former regimes were causing troubles to the nation today, he said.\nThe nationwide power breakdown, he said, had been effectively overcome with effective measures of the incumbent government who always took the national issues as serious, he said.\nIn a statement, Dr Shahbaz Gill said that if there was a possibility of using “Saria” in power transmission lines projects, PML-N could end the power crisis in its regime.\nThese corrupt thieves had no concern for the country and the nation, he said, adding that these people kept working on the certain projects from which they could get commissions. These lines were supposed to benefit the country’s industry and the general public if developed, so it was not taken into account, he maintained.\nThe SAPM said that who had been making money in power projects in previous regimes forgot to install transmission lines. Due to their corrupt practices the country went into sudden darkness today but unfortunately the PML-N’s leaders were blaming others for what their absconder leader did.\nHe said that the PMLN’s leaders were currently in mental anxiety and they feel that milk and honey were flowing in their time.\nDr. Shahbaz Gill further said that the corrupt gang of PDM had been exposed before the people of Pakistan.\nBilawal Zardari and Maryam Nawaz had no sympathy with the heirs of martyrs of Mach tragedy instead they had been instigating the poor people to do just politics, adding that they didn’t even bother to attend the funerals of martyrs.\nPrime Minister Imran Khan, he said, was fighting against these corrupt politicians to save the country.\nThe SAPM said that Bilawal Zardari had destroyed Sindh in 13 years. Billions of rupees had been plundered in Sindh province through generating fake accounts on the names of poor people and fake pensioners, he highlighted.\nIf Bilawal and Maryam were concerned about the nation, they would point out the problems of the people instead of doing dirty politics. They took the support of Maulana to save their parents’ black money, he said.\nAll the tactics of PDM had failed. The nation would not be deceived by them, Gill concluded.",
  "retrievedAt": "2025-08-11T20:13:44.614Z"
}
