{
  "title": "Nawaz Sharif offered bribe to cast aside foreign assets’ investigations: Broadsheet GB",
  "link": "https://www.app.com.pk/national/nawaz-sharif-offered-bribe-to-cast-aside-foreign-assets-investigations-broadsheet-gb/",
  "date_published": "2021-01-10T15:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): Nawaz Sharif offered bribe to Broadsheet for abandoning probe against his foreign assets, Broadsheet Chief Executive Officer (CEO) Kaveh Moussavi said.\nIn an interview to a web Tv, he said the Broadsheet had flatly refused the deal offered by a person claiming himself as the nephew of Nawaz Sharif, in the year 2012 retorting that the Broadsheet did not negotiate with the crooks.\nSharif family has assets not only in the United Kingdom (UK) but across the globe, he\nsaid adding that the Sharif family required plenty of explanation about their resources of amassing these assets.\nHe said the process of accountability was continuing but after the President Musharraf left office, his successors started hampering the process by not giving the access to information and termination of Broadsheet’s contract.\nResponding to a question, he severely criticized Nawaz Sharif for claiming that Broadsheet had exonerated the Sharifs.\nIndeed Broadsheet did the opposite exactly, he said adding that it was a complete lie that Broadsheet exonerated Sharif family.\nBroadsheet did not pursue Avenfield apartments source of buying as a Pakistani Accountability court had already contended that the apartments were bought by the Sharifs from the stolen money.\nHowever the Broadsheet was ready to investigate money sources of Avenfield apartments, If asked by the government of Pakistan, he said.\nNawaz Sharif was behind termination of contract with Broadsheet which was investigating how hundreds of million of dollar had been stolen from Pakistan and stashed abroad, Moussavi said.\nHe said Gen Musharraf tasked Broadsheet to detect the assets of 200 people. But, after his tenure NAB started asking to remove names of certain people from the list that was refused. This was the hypocrisy of then government of Pakistan, he said.",
  "retrievedAt": "2025-08-11T20:13:44.708Z"
}
