{
  "title": "Sanjrani vows to draw world’s attention towards HR violations in IIOJ&K",
  "link": "https://www.app.com.pk/national/sanjrani-vows-to-draw-worlds-attention-towards-hr-violations-in-iiojk/",
  "date_published": "2021-01-10T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): Chairman, Senate, Sadiq Sanjrani Sunday vowed to draw the world parliamentarians’ attention towards brutalities, being committed by the Indian forces in the Indian Illegally Occupied Jammu and Kashmir (IIOJ&K).\nHe expressed the resolve during a meeting with Tehreek-e-Kashmir (TeK) United Kingdom (UK) President Raja Fahim Kayani, who was called on him here, said a news release.\nThe Senate chairman told the TeK president that he would write letters to more than 56 thousand parliamentarians across the world to seek their attention to stop growing human rights (HR) violations in the Kashmir.\nHe said Pakistan would raise IIOJ&K dispute at every international fora, adding “Kashmiris movement is as per the spirit of United Nations that had passed the resolutions for the Kashmiris right of self-determination.”\n“It is time to give right of vote to the people of IIOJ&K, so they can decide about their future,” Sanjrani remarked.\nHe said following the August 5, 2019 situation, the overseas Pakistanis and Kashmiris were playing pivotal role to expose India’s highhandedness in IIOJ&K, where people were still searching and waiting for their missing loved ones.\n“India is not only violating human rights of Kashmiris but also using all the resources at its disposal to crush the ongoing indigenous liberation movement in IIOJ&K,” the Senate chairman noted.\nHe appreciated the role of TeK UK for highlighting Kashmir cause by holding conferences, ‘Kashmir marches’ and pro-freedom protests across the UK that helped a lot to expose Indian bellicosity before the people of UK and rest of the other western countries.\nSanjrani said besides writing letters to world parliamentarians, he would also update the rest of the world about the rising human rights abuses faced by Kashmiris at the hands of occupational troops stationed in IIOJ&K.\nOn the occasion, TeK UK president Kayani told the Senate Chairman that overseas Pakistanis and Kashmiris living in UK would continue to contribute in the economy of Pakistan.\nHe said the Pakistani expatriates were committed to the country’s development.",
  "retrievedAt": "2025-08-11T20:13:46.929Z"
}
