{
  "title": "Indian media goes haywire with false claims on Balakot casualties using ‘doctored clip of Pak ex-diplomat’",
  "link": "https://www.app.com.pk/national/indian-media-goes-haywire-with-false-claims-on-balakot-casualties-using-doctored-clip-of-pak-ex-diplomat-2/",
  "date_published": "2021-01-10T15:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): The entire mainstream Indian media on January 9 used a doctored video clip of a former Pakistani diplomat, misquoting him that Indian airstrike had killed 300 people in Balakot.\nThe leading Indian media outlets became a laughing stock by airing and publishing the fake news reports based on the clipped and doctored video of a panel discussion of\nex-diplomat Zafar Hilaly, claiming that he admitted about the 300 Balakot casualties.\nThe Indian media reports misquoting the TV news debate of Hilaly said, “India crossed the international border and did an act of war in which at least 300 were reported dead.”\nHowever, the video programme ‘Agenda Pakistan’ uploaded on YouTube clearly shows that the Indian media used the doctored video to serve its biased agenda against Pakistan.\nThe topic of the debate was ‘By using the vocabulary of the enemy (in this context “surgical strike”), is Pakistan making its own case weak?’.\nDuring the video clip at 4:17 minute, Zafar Hilaly begins to answer this question. At about 5:14 minutes he says, (as translated in English), “What you did, India was an act of war. By crossing the international boundary India committed an act of war in which they intended to kill at least 300 people.”\nThe very next sentence at 5:29 minutes of the video clip shows the diplomat stating that the Indian operation had failed — “Coincidentally, they [Pakistani people] did not die and India bombed a football field.”\nIn fact, prior to the portion of the segment made viral, Hilaly was actually speaking about India’s intention to kill 300 on the Pakistani side.\nAt about 4:30 minutes of the video clip, he states, “It is said that your intention was to strike at a madrassa where 300 children were studying. This means that your intention was to kill 300 people. They were not there, this [information] was wrong, it [strike] did not happen so you threw your bomb at a football field.”\nFrom the video transcript, it becomes clear that at no point the Pakistani diplomat admitted that there were 300 casualties in the Balakot airstrike.\nIronically, none of the media organizations referred to the original video in their news reports. Also, Republic and NE Times embedded a video uploaded by a Twitter user.\nComparing the original video with the one embedded by Republic also revealed an abrupt cut around 0:7-0:9 seconds.\nThe word “marna (to kill)” sounds as if Hilaly said “mara (killed)”. The ‘n’ pronunciation was edited out.\nHilaly’s statement right after the above claim has also been removed in the viral clip. This is where he stated that the Indian operation failed and the air force instead bombed a football field.\nFurthermore, the viral video has been inverted and screen-recorded. The original video shows the damaged trees of Balakot and the doctored video shows a picture of Indian Prime Minister Narendra Modi in military fatigue.\nThe doctored video also doesn’t feature the names of the people in the panel and the border is pink, unlike the white border in the original video.\nZafar Hilaly in a series of tweets himself confirmed that his statement was “cut, spliced and edited”.\n“The extraordinarily extent to which the Indian Govt has gone to cut, splice and edit the tape of my Hum TV appearance suggests their desperation to prove what they failed to do, namely, lend credence to Modi’s lies about Balacot and his farcical claims,” he said.\n-APP Digital Report by Shumaila Andleeb",
  "retrievedAt": "2025-08-11T20:13:45.594Z"
}
