{
  "title": "COVID-19 claims 46 more lives, over 2,899 new cases reported",
  "link": "https://www.app.com.pk/national/covid-19-claims-46-more-lives-over-2899-new-cases-reported/",
  "date_published": "2021-01-10T13:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): The national tally of total active COVID-19 cases in Pakistan on Sunday reached 34,803 as 2,899 more people tested positive for the deadly virus and 1,524 people recovered from it during the last 24 hours.\nForty Six corona patients had lost their lives out of which 41 were under treatment in hospitals and five others in their respective homes or quarantines, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in Punjab followed by the Sindh. It added that out of the total 46 deaths during last 24 hours 24 patients died on ventilators.\nNo COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Balochistan and Gilgit Baltistan (GB) while 304 ventilators were occupied elsewhere in Pakistan.\nThe maximum ventilators were occupied in four major areas including Multan 51 percent, ICT 33 percent, Bahawalpur 41 percent and Lahore 34 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in Four major areas of Peshawar 49 percent, Multan 34 percent, Karachi 35 percent and ICT 31 percent.\nSome 44,410 tests were conducted across the country on Saturday, including 14,572 in Sindh, 17,613 in Punjab, 5,993 in Khyber Pakhtunkhwa (KP), 4,998 in Islamabad Capital Territory (ICT), 511 in Balochistan, 350 in GB, and 373 in AJK.\nAround 456,969 people have recovered from the disease so far across Pakistan making it a significant count with over 86 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 502,416 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 8,478, Balochistan 18,373, GB 4,879, ICT 39,120, KP 61,148, Punjab 144,909 and Sindh 225,509.\nAbout 10,644 deaths were recorded in country since the eruption of the contagion. Around 3,693 perished in Sindh among 14 of them died on Saturday, 11 of them died in hospital and Three out of the hospital.\n4,260 in Punjab had died with 18 deaths in past 24 hours, 16 of them perished in the hospital and Two out of the hospital on Saturday. 1,718 in KP where 10 of them died in hospital on Saturday, 439 in ICT where three of them died in the hospital on Saturday, 188 in Balochistan where one of them died in hospital on Saturday, 101 in GB and 235 in AJK succumbed to the deadly virus.\nA total of 7,088,014 corona tests have been conducted so far, while 623 hospitals are equipped with COVID facilities. Some 2,804 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:13:47.377Z"
}
