{
  "title": "Turkish embassy mark’s 5th anniversary of failed coup attempt",
  "link": "https://www.app.com.pk/national/turkish-embassy-marks-5th-anniversary-of-failed-coup-attempt/",
  "date_published": "2021-07-15T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 15 (APP): The Turkish Cooperation and Coordination Agency in collaboration with the Turkey’s Embassy in Pakistan on Thursday marked the fifth anniversary of the July 15, 2016 defeated coup in Turkey.\nAn event at the Fatime Jinnah Park in Islamabad was attended by Federal Minister for Law and Justice Barrister Dr Farogh Naseem and Turkish Ambassador to Pakistan Mustafa Yurdakul, Turkish people living in Pakistan, and local officials.\nDr Farogh Naseem said that Pakistan always stood by Turkey in every difficult time and we will do the same in the future as well.\nOn the historical relationship between the two countries, the minister said that the people of Turkey and Pakistan are not only friends but “we love our Turkish brothers and sisters.”\nPakistan was one of the first countries to condemn the coup attempt, and the entire Pakistani nation stood with their Turkish brethren while both houses of Pakistan’s parliament unanimously passed resolutions expressing solidarity with Turkey and condemning the defeated coup. Turkey and Pakistan are partners in world peace, he added.\nHe said that Pakistan and Turkey are two countries and one nation.\nHe said that Pakistan sided with Turkey in the fight for democracy. He said that Pakistan and Turkey always stood together in international forums and there should be no ambiguity that the two countries were brethren countries.\nPraising the Turkish nation, the Minister said that the Turkish brothers bravely fought the terrorist organization.\nHe said that he saluted the hundreds of Turkish brothers who were martyred and wounded in the war for democracy.\nHe said that he saluted the Supreme Court of Pakistan which took notice of the schools of the organization which attempted failed coup in Turkey and it also closed the schools run by the Turkish organization Fetullah Terrorist Organization (FETO) and these were handed over to Turkiye MAARIF Foundation.\nHe said that the Turkish nation took to the streets for democracy.\nHe said that Turkish Prime Minister Recep Tayyip Erdogan has visited Pakistan several times.\nAddressing the event, Ambassador Yurdakul paid tribute to the July 15 martyrs and said Turkish people sacrificed to protect their democratic system.\n“The coup-plotters used Turkish Armed Forces tanks and jets against its own people, including shelling innocent civilians, and bombed vital government functions – including parliament and the intelligence and national police buildings,” he said.\n“I am very proud that the people, government, parliament, and every organization stood with us, and Pakistan was one of the first nations to stand with Turkey and its elected government,” Yurdakul said.\n“When they saw the real face of FETO, our Pakistani brothers all stood against them and supported their Turkish brothers and government,” he added.\nOn the occasion, Federal Minister for Law and Justice Barrister Dr. Farough Naseem also planted a tree in memory of Turkish martyrs.\nIt is to mention here that the Fetullah Terrorist Organization (FETO) and its leader Fetullah Gulen orchestrated the defeated coup, which left 251 people martyred and nearly 2,200 injured on July 15, 2016.",
  "retrievedAt": "2025-08-11T20:58:28.737Z"
}
