{
  "title": "COVID-19 claims 47 more lives, active cases recorded 42,330",
  "link": "https://www.app.com.pk/national/covid-19-claims-47-more-lives-active-cases-recorded-42330/",
  "date_published": "2021-07-15T06:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 15 (APP): The national tally on Thursday of total active COVID-19 cases recorded 42,330 with 2,545 more people tested positive for the deadly virus during the last 24 hours.\nForty-seven (47) corona patients have died during past 24 hours, 45 of whom were under treatment in hospital and two out of the hospital in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in Sindh followed by the Punjab.\nOut of the total 47 deaths occurred during last 24 hours, 27 of the deceased had died on ventilators during their treatment.\nThe maximum ventilators were occupied in four major areas including Multan 15 percent, Islamabad Capital Territory (ICT) 24 percent, Peshawar 13 percent and Lahore 18 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Skardu 42 percent, Gilgit 56 percent, Muzaffarabad 30 percent and Karachi 38 percent.\nAround 237 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Gilgit Baltistan (GB) and Balochistan.\nSome 48,910 tests were conducted across the country on Wednesday, including 16,528 in Sindh, 17,325 in Punjab, 9,915 in Khyber Pakhtunkhwa (KP), 2,043 in Islamabad Capital Territory (ICT), 1,592 in Balochistan, 721 in GB, and 786 in AJK.\nAround 916,373 people have recovered from the disease so far across Pakistan making it a significant count.\nSince the pandemic outbreak, a total of 981,392 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 21,481, Balochistan 28,588, GB 7,163, ICT 84,083, KP 139,960, Punjab 349,111 and Sindh 351,006.\nAbout 22,689 deaths were recorded in country since the eruption of the contagion. Around 5,647 have perished in Sindh, out of which 26 died in hospital on 14 July.\n10,852 in Punjab out of which 11 deaths occurred in hospital and two out of hospital during past 24 hours.\n4,377 in KP where 06 of them died in hospital on Wednesday, 787 in ICT among one deaths in hospital during past 24 hours, 317 in Balochistan, 113 in GB and 596 in AJK succumbed to the deadly virus out of which one is died in hospital on Wednesday.\nA total of 15,248,785 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities. Some 2,619 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:58:33.987Z"
}
