{
  "title": "Mass scale reforms underway in tax regime of province: CM",
  "link": "https://www.app.com.pk/national/mass-scale-reforms-underway-in-tax-regime-of-province-cm/",
  "date_published": "2021-07-15T14:42:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jul 15 (APP): Chief Minister Khyber Pakhtunkhwa Mahmood Khan on Thursday said that like other sectors, mass scale reforms were also underway in the tax regime of the province, which had resulted in significant increase in the annual revenue collection.\nHe expressed these views while addressing an inaugural ceremony of upgradation Pensioners Facilitation Center and Information & Complaint Redressal Cell at office of the Accountant General Khyber Pakhtunkhwa. Special Assistant to CM Kamran Bangash, Controller General Accounts Farrukh Ahmad Hamidi, Accountant General Murtaza Khan, Secretary Information Arshid Khan and other high ups attended the ceremony.\nThe chief minister stated that when the incumbent provincial government came into power, the annual revenue collection of the provincial government was Rs 31 billion which now had been increased to Rs 56 billion adding that despite the difficult financial situation due to COVID-19, the provincial government made no increase in the provincial taxes rather it provided significant relief to people in the various provincial taxes.\nHe said that credit for reforms in public sector entities went to Pakistan Tehrik-e-Insaaf adding that in 2013, PTI provincial government had started reforms process from the scratches and today, Khyber Pakhtunkhwa was at forefront in terms of reforms initiatives.\nHe said that people of the province had brought PTI back into power with two third majority which was undoubtedly a result of these reforms and good governance strategy of the previous provincial government.\n“Provision of maximum facilities to general public was the core of the reforms agenda of his government,” he added.\nTouching upon the public friendly initiatives of the current provincial government, Mahmood Khan said that Citizen’s Facilitation Centers and Service Delivery Centers were being established to facilitate people in the provincial departments and institutions.\nHe said that more reforms would be introduced in all the departments directly linked to the people so that these departments could deliver as per the expectations of the general public.\nHe appreciated the reforms introduced in accountant general office and expressed the hope that reforms process would continue in order to facilitate the public as much as possible.\nEarlier, the chief minister formally inaugurated the upgradation of Pensioners Facilitation Center and Information & Complaint Redressal Cell and visited the various sections of the centers.\nHe was also given a detailed briefing about the facilities being provided to pensioners in the center.",
  "retrievedAt": "2025-08-11T20:58:28.658Z"
}
