{
  "title": "PNS ZULFIQUAR visits UK; participates in bilateral naval exercise White star-III",
  "link": "https://www.app.com.pk/national/pns-zulfiquar-visits-uk-participates-in-bilateral-naval-exercise-white-star-iii/",
  "date_published": "2021-07-15T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 15 (APP): The Pakistan Navy Ship ‘ZULFIQUAR’ (with embarked helicopter) visited Portsmouth, United Kingdom, as part of Pakistan Navy’s overseas deployment.\nUpon arrival, the ship was warmly welcomed by officials from Royal Navy, Deputy High Commissioner and Defence & National Advisor of Pakistan at UK, a news release said here.\nDuring stay at the port, the Mission Commander Commodore Syed Rizwan Khalid along with Commanding Officer PNS ZULFIQUAR Captain Rao Ahmed Imran Anwar called on Commander Naval Base Portsmouth Cdre J J Bailey.\nDuring the interaction, matters of mutual interest came under discussion and contribution of the Pakistan Navy to regional peace and maritime security was acknowledged.\nThe Mission Commander conveyed well wishes from Chief of the Naval Staff Admiral Muhammad Amjad Khan Niazi for the people of UK in general and Royal Navy in particular. He also extended his gratitude for whole hearted support provided in making the ship stay comfortable.\nThe High Commissioner of Pakistan to United Kingdom Moazzam Ali Khan also visited onboard PNS ZULFIQUAR and interacted with the Mission Commander.\nAfter the port visit, PNS ZULFIQUAR participated in 3rd PN-RN Bilateral Naval Exercise (WHITE STAR-III) with Royal Navy Ship HMS TYNE off Portsmouth.\nThe exercise encompassed advanced Maritime maneuvers including Maritime Interdiction Operations (MIO) Boarding and Force Protection drills.\nThe exercise was aimed to enhance military cooperation through naval engagement and augment interoperability between the two friendly navies.\nThe visit of PNS ZULFIQAR to the United Kingdom would further foster navy to navy relations and go a long way in strengthening diplomatic and military relations, between the two countries.",
  "retrievedAt": "2025-08-11T20:58:31.131Z"
}
