{
  "title": "Strong Pak-Uzbek trade, economic ties to ensure win-win situation: PM",
  "link": "https://www.app.com.pk/national/strong-pak-uzbek-trade-economic-ties-to-ensure-win-win-situation-pm/",
  "date_published": "2021-07-15T16:14:00.000Z",
  "source": "APP",
  "content": "TASHKENT, July 15 (APP): Prime Minister Imran Khan on Thursday said with Pakistan and Uzbekistan sharing the same objective of lifting their people from poverty, increased and strong bilateral trade and economic relations would be mutually beneficial to a win-win situation for the two sides.\n“Uzbekistan can benefit from Pakistan’s geo-strategic location, a market of 220 million people and providing access to Middle East and Africa, While Pakistan can have access to Central Asian States through Uzbekistan, an important country of the region,” he remarked.\nThe Prime Minister expressed these views while addressing a joint press conference with the President of Uzbekistan Shavkat Mirziyoyev after holding an in-depth discussion on various issues of mutual interest.\nStressing on the importance of economic cooperation, he said the two countries were following similar visions of the new Uzbekistan and new Pakistan to lift their people out of poverty through a welfare state.\nThe Prime Minister said that it was a model of Prophet Muhammad (Peace Be Upon Him) who established the first welfare state and ensured inclusive development by taking care of the poor and downtrodden.\nHe mentioned that China pursued the same strategy to lift its people out of poverty.\nThe Prime Minister said that Pakistan with a shift in its from geo-strategic to geo-economics wanted to strengthen its trade and economic relations, adding, Pakistan’s strong trade relations with Uzbekistan, which is a big country in Central Asia, would be a win-win for the two countries.\nHe said that Pakistan’s seriousness to have strong trade and economic relations could be gauged from the visit of the biggest-ever country’s trade delegation comprising over 130 large business houses.\nThe Prime Minister said that when he was leaving for Tashkent, he received messages from a number of Pakistani businessmen expressing their desire to be part of the delegation.\nHe welcomed the agreements signed between the two countries private sectors and said it was very important and would benefit the two countries.\nThe Prime Minister said that Pakistan wanted to benefit from the expertise of Uzbekistan, which manufactured agricultural implements.\nBesides, he said, Pakistan had also sought help and cooperation from Uzbekistan in cotton seed.\nLauding the passion of President Shavkat Mirziyoyev on a railway project from Pakistan to Uzbekistan through Peshawar, Kabul and Mazar-e-Sharif, the Prime Minister said it was very project for regional connectivity and assured that his government will fully pursue and push for realization of the project.\nImran Khan said that during the talks the two sides also discussed the situation in Afghanistan, adding, as the brotherly people of Afghanistan were suffering from hardships for the last 40 years, now there should be peace and peaceful settlement.\nHe said that the two sides also agreed to arrange a meeting of Foreign Ministers of Pakistan, Uzbekistan, Tajikistan, Iran and Turkey before a summit-level meeting to discuss the Afghan situation and find a way to avoid civil war in the brotherly country,\nThe Prime Minister further said that in order to strengthen cultural relations between Pakistan and Uzbekistan, the two sides have decided to make a film on Zaheeruddin Babar, a ruler of the Mughal era in Hindustan, which was a superpower of that time and owned 25% of the world’s Gross Domestic Product (GDP).\nHe said that the youth of Pakistan and Uzbekistan must know the history and culture of Muslims and their its leaders, adding, they can also make films on Allama Muhammad Iqbal, Mirza Ghalib and Imam Bukhari.\nThe Prime Minister said that when people of the two countries will get closer through enhanced cultural exchanges and relations, he will also introduce and work for the promotion of cricket in Uzbekistan.\nImran Khan thanked the Uzbek side for the warm hospitality given to him and his delegation and said, as it was his first visit to Uzbekistan, he and his delegation were also very excited to visit the historic cities of Bukhara and Samarkand on Friday.\nThe Prime Minister on this occasion also invited the Uzbek President to visit Pakistan, which the latter accepted and said he looked forward to visit Pakistan at the earliest.\nPresident of Uzbekistan Shavkat Mirziyoyev in his remarks said that Uzbekistan wanted to have strong political and economic relations with Pakistan, which was a strong country in South Asia.\nHe said since Uzbekistan and Pakistan had a strong and historic relationship, rooted in similar values and culture, the visit of Prime Minister Imran along with a large dele4gation will help further strengthen these relations.\nThe President of Uzbekistan also expressed his pleasure over the signing of a Joint Agreement on Strategic Partnership as well as the trade agreements worth US $ 500 million signed between the two private sector businessmen.\nHe said that the realization and implementation of railway project from Uzbekistan to Pakistan will strengthen connectivity for the mutual benefit.\nThe President of Uzbekistan highlighting the importance of people to people contacts and cultural exchanges said that the people of Uzbekistan were keen to see the historical mosques and places in Lahore.\nEarlier, Prime Minister Imran Khan and President Shavkat Mirziyoyev signed a Joint Declaration on the Establishment of Strategic Partnership.\nThey also witnessed the signing of agreements and Memorandums of Understanding (MOUs) fort cooperation in the areas of transit trade, military education, simplification of visa procedures for businessmen and tourists, cultural exchanges, tourism.",
  "retrievedAt": "2025-08-11T20:58:26.673Z"
}
