{
  "title": "FM thanks US for $31.1 million in humanitarian relief assistance",
  "link": "https://www.app.com.pk/national/fm-thanks-us-for-31-1-million-in-humanitarian-relief-assistance/",
  "date_published": "2022-09-08T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 8 (APP): Foreign Minister Bilawal Bhutto Zardari on Thursday thanked the U.S. government for US $31.1 million in humanitarian relief assistance.\nHe also underscored the need for the international community to step up their ambition in climate financing towards mitigation, adaptation, and resilience especially towards the developing countries.\nThe Foreign Minister expressed these views during a meeting with Counselor Derek Chollet of the U.S. Department of State who called on him here.\nCounselor Chollet offered heartfelt condolences to the people of Pakistan over the loss of life and devastation caused by the super floods in Pakistan, a press release issued here by the Ministry of Foreign Affairs said.\nThe Foreign Minister while thanking the Counselor for his visit at this difficult hour appreciated the strong expression of support and solidarity by the U.S. government.\nHe sensitized them that almost a third of Pakistan’s territory was under water. Over 1,300 had lost their lives; more than 33 million were affected; critical infrastructure had been destroyed; over 4 million acres of crops had been washed away; and close to a million livestock had already perished, he added.\nThe Foreign Minister said that, at present, the government was fully engaged in the immediate rescue and relief efforts to save lives.\nAt the same time, the long-term impacts on food security, health, and the economy were a matter of serious concern, he said, adding, rehabilitation of the millions impacted, reconstruction, rebuilding communities and addressing the economic repercussions would require enormous resources.\nThe Foreign Minister added it was unfortunate that although Pakistan contributed less than 1% of greenhouse gas emissions, it suffered the severity of climate change.\nHe maintained that in recent months there has been a steady momentum of engagement between Pakistan and the United States, adding, Pakistan was committed to deepen and broaden its long-standing relationship with the U.S. based on mutual trust and mutual respect.\nThe Foreign Minister emphasized the importance of sustained cooperation in the areas of climate change, energy, health, trade and investment, education, and people-to-people links.\nCounselor Chollet underlined that the US was committed to supporting Pakistan in its efforts to deal with the devastation caused by the floods.\nHe agreed with the Foreign Minister to reinforce ongoing engagement in various sectors and to explore more areas of cooperation to widen and strengthen this relationship.\nCounselor Chollet is leading an inter-agency delegation to Pakistan from September 7-9, to reaffirm U.S. support to Pakistan in the wake of catastrophic flooding and reinforce the broad-based and enduring Pakistan-U.S. relationship.",
  "retrievedAt": "2025-08-11T15:32:39.850Z"
}
