{
  "title": "Sikhs to vote in Khalistan referendum in Toronto on Sept 18",
  "link": "https://www.app.com.pk/national/sikhs-to-vote-in-khalistan-referendum-in-toronto-on-sept-18/",
  "date_published": "2022-09-08T18:58:00.000Z",
  "source": "APP",
  "content": "TORONTO, Sep 8 (APP): The next round of Khalistan referendum will be held in Toronto, Canada on September 18, giving an opportunity to Sikhs to express their opinion, set agenda, raise awareness and put pressure on India to hold an official referendum on creation of Khalistan.\nThe Khalistan Referendum being organized by the organization Sikhs for Justice, will be held in Brampton, suburban area of Toronto.\nSpeaking at a press conference and during an online discussion here Thursday about the upcoming referendum, M Dane Waters, the chair of the Punjab Referendum Commission said the referendum will be held in a free, fair and transparent manner and according to international standards.\nThe Punjab Referendum Commission is a panel of independent and non-aligned direct democracy and political experts whose mission is to monitor the non-governmental Punjab Independence Referendum.\nDane is the founder and Chair of the Initiative & Referendum Institute at the University of Southern California – a research and educational organization established to study direct democracy.\nA member of the commission Paul Jacobs, said the issue of self-determination in a referendum was very consequential. “We believe in the power of the vote.”\nHe quoted Winston Churchill who once said that: “democracy is the worst form of government – except for all the others that have been tried.”“Our goal is to help make the referendum as good as it can be.”\nPaul is a leading national figure in initiative and referendum and is president of Citizens in Charge Foundation.\nThe voters for the referendum on Khalistan will be registered and will cast their votes in a secret ballot. The voting will be monitored by the members of the Punjab Commission.\nAccording to experts who took part in the virtual discussion, the referendum is unofficial but it will have a political impact and symbolic value.\nThe referendum as a democratic process will send a signal and solidify support on the issue of Khalistan, they said.\nProcess of the referendum is hugely important as people express their opinion through voting, they added. It will be an opportunity for Sikhs in Canada to express their opinion.The panelists said if India wanted to be seen as a democracy in the world, then it has to act as a democracy. The nonbinding referendums set the agenda and raise awareness.India has blacked out the news about the Khalistan issue.\nWhen the process of referendum will take place, the world would have an opportunity to respond, the experts said adding in many states of the world, multiple referendums were held on a single issue before anything was accomplished. An unofficial referendum can create pressure on a government to hold an actual referendum and bring actual political change.\nBefore the referendum, Sikhs in Canada carried out a five-kilometer long car rally and attracted the attention of local people. Over 2,000 vehicles participated in the car rally carried out in Toronto on a Sunday night.\nBesides a truck rally was also organized in connection with the referendum and its campaign was also advertised through mega billboards.\nThe Khalistan Referendum was first London on October 31 last year. Voting on the referendum has already been held in various cities of the UK as well as in Switzerland and Italy with the participation of 450,000 Sikhs so far.\nThe Khalistan Referendum in Canada has been dedicated to Harjinder Singh Paria Shaheed.",
  "retrievedAt": "2025-08-11T15:32:36.553Z"
}
