{
  "title": "36 more die due to monsoon catastrophe: NDMA",
  "link": "https://www.app.com.pk/national/36-more-die-due-to-monsoon-catastrophe-ndma/",
  "date_published": "2022-09-08T13:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 8 (APP): The unprecedented torrential monsoon rains across the country on Thursday inflicted further lives and property losses as the 36 more people perished in past 24 hours that took the total death count in various incidents to 1,391 and 12,722 individuals got injured since the onset of the rainy season.\nThe National Disaster Management Authority (NDMA) issued a 24-hour situation report released on routine basis that accounted overall life, property and infrastructure losses incurred by the heavy rains lashing out various parts of the country.\nThe heavy rains and flash floods caused maximum deaths of 35 individuals in Sindh province including eight men, four women and nine children in Jamshoro, three men, a woman and child in Shaheed Benazirabad, two men in Noushero Feroze, a man and two children died due to electrocution in Badin, a woman died due to collapse of house in Ghotki, two children drowned in pond and a child died due to snake bite in Tando Muhammad Khan.\nIn Khyber Pakhtunkhwa (KP), the provincial disaster management authority (PDMA KP) updated its data from August 17 to 27. However, in past 24 hours a man perished in Dera Ismail Khan.\nThere was no incident or loss to report in Islamabad Capital Territory (ICT), Gilgit Baltistan (GB), Punjab, Balochistan and Azad Jammu and Kashmir (AJK).\nIn Balochistan, M-8 (100-140 km) was blocked due to land sliding in 24 kilometers (km) section of Wangu hills whereas 2 kms area was cleared and restoration work in process.In KP, N-95 Madyan was blocked between Behrain-Ashrait (23 km) and Laikot-Kalam section (8 km) was blocked due to debris whereas Frontier Works Organization (FWO) was creating diversion at these locations.\nIn Sindh, N-55 from Meher Johi Canal to Khairpur Nathan Shah was submerged and the road would open after drainage of water.\nThe NDMA teams for Joint Survey and Damage Assessment of Flood Affected Areas comprised of 32 teams that reached respective destinations including two in Quetta, Pashin, Loralai, Dhuki, Surab, Panjghoor, Jaffarabad, Sohbatpur, Jhal Maghsi, Awaran, Lasbela, Gawadar, Qila Saifullah, Ziarat, Qila Abdullah, Musakhel, Washuk, Kohlu, Barkhan, Khuzdar, Nasirabad, Kachhi, Kharan, Kalat, Mustang, Sherani, Zhob, Nushki, Chaman, Sibi, Dera Bugti).\nHowever, the survey started in 26 districts of Quetta, Qila Saifullah, Pishin, Gawadar, Surab, Sohbatpur, Dukhi, Kharan, Khuzdar, Qila Abdullah, Awaran, Washuk, Barkhan, Kalat, Kohlu, Mustang, Musakhel, Sherani, Sibi, Loralai, Zhob, Lasbela, Ziarat, Jaffarabad, Chamman and Dera Bugti.\nThe report mentioned that mainly dry weather was expected over most parts of the country. However, isolated thunderstorm and rain was expected over the upper catchments of all the major rivers.",
  "retrievedAt": "2025-08-11T15:32:40.863Z"
}
