{
  "title": "IHC rejects Imran Khan’s reply, decides to indict him on Sept 22, in contempt case",
  "link": "https://www.app.com.pk/national/ihc-rejects-imran-khans-reply-decides-to-indict-him-on-sept-22-in-contempt-case/",
  "date_published": "2022-09-08T14:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 08 (APP): The Islamabad High Court (IHC) on Thursday rejected the reply of PTI Chief Imran Khan and decided to indict him on September 22, in contempt of court case with regard to his threatening remarks about Additional District and Session Judge Zeba Chaudhry.\nChief Justice Athar Minallah remarked the reply submitted by the PTI chief was unsatisfactory. A very serious offense had been committed but it seemed that he (Imran Khan) didn’t understand the seriousness of the situation, the court said. The respect of the judiciary was bigger than the ego of someone, he observed, adding that it was a criminal contempt case.\nA five member bench headed by Chief Justice Athar Minallah and comprising Justice Mohsin Akhter Kayani, Justice Miangul Hassan Aurangzeb, Justice Tariq Mehmood Jahangiri and Justice Baber Sattar heard the contempt of court case against Imran Khan who appeared before the court amid foolproof security arrangements in place.\nAt the outset of hearing, the chief justice remarked that there was a legal procedure if someone was affected by a judge’s decision. Addressing Imran’s lawyer, the chief justice said the court had told you last time that District Judiciary was a red line for us.\nThe decisions of the Supreme Court related to contempt of court were a binding on us and we had to obey law, Justice Minallah observed and asked whether you had tried to justify the objectionable remarks in the answer.\nImran Khan’s lawyer Hamid Khan said we had tried not to justify but to explain it.\nThe chief justice said place and time of the insulting statement were very important. Whether your reply was as per the directives of the top court, he asked the lawyer.\nJustice Minallah asked that whether a former prime minister could give justification of not knowing the law. There was so much division in the society that followers of political parties used to insult opponents in public places, he said, adding that the female judge could also face the situation somewhere.\nChief Justice asked the lawyer whether the decisions should be made by the courts or in the public meetings. Whether they would have submitted the same answer if the matter was related to the Supreme Court’s judge, he asked.\nAdvocate Hamid Khan said that the judges of Supreme Court, High Court and lower judiciary were respectable for us. He said we wrote that were were regret if the judge’s feelings were hurt.\nDid you want to contest the contempt case, Justice Minallah asked. This was not just a statement against a female judge but a case of incitement, he said and asked whether someone could give threat of legal action in a public meeting.\nHamid Khan said we were not taking legal action by going outside the circle of law. He said Imran Khan did not make any threats, maybe it was felt too much.\nJustice Babar Sattar said Imran Khan did not show that he was sorry even by his behavior here. The language used about the judge was highly inappropriate, chief justice said.\nJustice Tariq Mehmood Jahangiri said six medical boards were constituted where not a single report mentioned that torture took place against Shahbaz Gill.\nGiving arguments, Attorney General for Pakistan (AGP) Ashtar Ausaf Ali said that the Supreme Court had waived contempt case against Imran Khan in 2014 on the similar offences. Now they believed that they would be forgiven again by doing the same thing.\nThe AGP said that this time, Imran Khan had been received not only a notice, but a show cause notice. The reply to the show-cause notice should have come with an affidavit, he said.\nHe said that the intention and purpose of the remarks was very important. The AGP said he had the transcript of Imran Khan’s speech and he would place the CD and the transcript on the record.\nDuring hearing, Advocate Makhdoom Ali Khan said that in America, the president called a court decision the worst. T judiciary there showed tolerance and they took another way. But Donald Trump’s used Twitter account for inciting followers, the Chief Justice noted.\nJustice Minallah asked whether such incident would not take place in future after submission of supplementary response.\nMakhdoom Ali suggested the court to accept the reply of Imran Khan and discharge the show-cause notice. The court should give an opportunity to the former prime minister for submission of an affidavit. He didn’t think the word apology was necessary.\nAmicus-Curiae Akhtar Hussain highlighted that even conditional apology was not sought in the supplementary reply. He supported the show-cause notice served to Imran Khan.\nMunir A. Malik also requested the court to express tolerance and withdraw its show-cause notice.\nAfter listening detailed arguments, the bench subsequently decided to indict Imran Khan on September 22, while rejecting his fresh response.",
  "retrievedAt": "2025-08-11T15:32:39.952Z"
}
