{
  "title": "PM for united efforts to help flood-hit masses; leaving politics aside",
  "link": "https://www.app.com.pk/national/pm-for-united-efforts-to-help-flood-hit-masses-leaving-politics-aside/",
  "date_published": "2022-09-08T17:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sept 8 (APP): Prime Minister Muhammad Shehbaz Sharif Thursday said that with the country facing severe challenges including the worst flooding in history, there was a need for all to join hands to pay heed to the miseries of flood-hit masses by leaving political differences aside.\n“Millions of people are sitting under the open sky and waiting for some Masiha to come to their help. If we have to save the people of Pakistan and its future, we have to work together with courage, brotherhood and harmony. Let’s resolve to be together in this hour of need,” the Prime Minister told media-persons from the print and electronic mediums.\nPrime Minister Sharif, who informed the newsmen about the huge human and material losses caused by the floods, observed that at a time when the nation was facing the severe floods’ situation, those who talk about Riasat-e-Madina were busy in the activities, contrary to their claims.\n“Is it the politics,” he remarked without naming any party. The Prime Minister also urged media to play their role in uniting the nation to face the challenges.\nPrime Minister Shehbaz Sharif said that with the province of Sindh hit most by the current floods, which were worst in the country’s history, were much bigger than the 2010 floods in terms of its spread and devastation.\n“Over 1300 deaths and many more injured due to floods, thousands of villages in Sindh were inundated; rice, cotton and date-palm crops on millions of acres were destroyed and the human life had come to a standstill,” he added.\nThe Prime Minister said that with poor people’s houses destroyed and around 700,000 cattle and livestock lost in the floods, over 33 million people have been affected due to floods.\nAfter Sindh, Balochistan was the most affected province followed by Khyber Pakhtunkhwa, Southern Punjab and some parts of Gilgit Baltistan, he added.\nThe Prime Minister said that as rescue and relief efforts were continuing in the flood affected areas through effective coordination among the National Disaster Management Authority (NDMA), the Provincial Disaster Management Authorities (PDMAs) and the National Flood Response and Coordination Center (NFRCC), the federal and provincial government were doing their best to help the flood-hit people.\nBesides, he said, the country’s armed forces personnel from Army, Navy and Air Force were also working day and night in the flood affected areas in the rescue and relief efforts by using their resources including boats and helicopters.\nThe Prime Minister said that the federal government, which had earlier allocated Rs. 28 billion for the flood affected area across the country as per initial assessment of damages, has now enhanced that amount to Rs. 70 billion after the latest assessment of losses.\nHe said that as the federal government had announced the financial assistance of Rs. 25,000 per affected family in the flood-hit areas, an amount of Rs. 20 billion has already been distributed among the affected families through a transparent process under the Benazir Income Support Program (BISP).\nThe Prime Minister further said that Rs. one million each was also being paid to the heirs of those over 1300 people who lost their lives in the floods, adding, Rs. 70 billion allocated by the federal government did not include any foreign funding.\nHe also mentioned with praise the generous relief goods being dispatched through an air-bridge created by the friendly countries including the United Arab Emirates (UAE), Qatar, Turkey, Saudi Arabia, Australia and others.\nShehbaz Sharif said with the Sindh province hit the most by the current floods, which were worst in the country’s history – much bigger than the 2010 floods in terms of their spread and devastation.\n“Over 1,300 deaths and many more injured due to the floods; thousands of villages in Sindh inundated; rice, cotton and date-palm crops on millions of acres were destroyed and the human life had come to a standstill,” he added.\nThe prime minister said with the houses of poor destroyed and around 700,000 cattle and livestock lost in the floods, over 33 million people had been affected.\nAfter Sindh, Balochistan was the most affected province followed by Khyber Pakhtunkhwa, Southern Punjab and some parts of Gilgit-Baltistan, he added.\nThe prime minister said as rescue and relief efforts were continuing in the flood affected areas through effective coordination among the National Disaster Management Authority (NDMA), the Provincial Disaster Management Authorities (PDMAs) and the National Flood Response and Coordination Center (NFRCC), the federal and provincial governments were doing their best to help the flood-hit people.\nBesides, he said, the personnel of Pakistan Army, Navy and Air Force were also busy in carrying out rescue and relief operations round the clock by using their resources, including boats and helicopters.\nThe prime minister said the federal government, which had earlier allocated Rs 28 billion for the flood affected area across the country as per initial assessment of damages, had now enhanced that amount to Rs 70 billion after the latest assessment of losses.\nAs the Federal Government had announced the financial assistance of Rs 25,000 per affected family in the flood-hit areas, an amount of Rs 20 billion had already been distributed among the victim families through a transparent process under the Benazir Income Support Program (BISP), he added.\nShehbaz Sharif further said that Rs one million each was also being paid to the heirs of over 1,300 people, who lost their lives in the floods. Rs 70 billion allocated by the Federal Government did not include any foreign funding, he added.\nHe also mentioned with praise the generous relief goods being dispatched through an air-bridge created by the friendly countries, including the United Arab Emirates (UAE), Qatar, Turkey, Saudi Arabia, Australia and others.\nPrime Minister Shehbaz Sharif also thanked the UAE President for announcing 50 million AED as a first tranche of relief assistance.\nHe further said that the United States and UK have announced $ 31 million 15 million Pounds, respectively, in humanitarian relief aid.\nThe Prime Minister also appreciated the United Nations for launching a flash appeal of US $ 160 million aid to help the flood affected people in Pakistan.\nHe said that Turkey has dispatched more relief goods through Istanbul-Tehran-Islamabad train service.\nThe Prime Minister also highlighted the huge challenge of post-flood contagious diseases including water-born in flood affected areas especially in Sindh.\nGiving an overall picture of financial losses caused by the flood devastation including the destruction of infrastructure and agricultural produce, he said, the country’s economy had suffered an estimated loss of US $ 20 billion.\nThe Prime Minister also mentioned the economic challenges faced by the country due to inflationary trends in the international market, energy crisis due to Russia-Ukraine conflict. The US $ 20 billion spent on the import of petroleum products alone had put a big dent to the country’s foreign exchange reserves, he added.\nHe criticized the previous government for not taking timely decisions and making deals on the import of gas during the COVID-19 pandemic when LNG was available at US $ 3 per MMBTU as against the current US $ 40, which caused problems for the country.\nThe Prime Minister reiterated that it was time to come together to address the problems of people. “Where you want to take this nation by poisoning the politics and creating divide in society,” he remarked.\n“Politics can be done later. Come together to save people, economy and the country,” the Prime Minister remarked",
  "retrievedAt": "2025-08-11T15:32:36.575Z"
}
