{
  "title": "SC adjourns hate campaign case against Imran Khan",
  "link": "https://www.app.com.pk/national/sc-adjourns-hate-campaign-case-against-imran-khan/",
  "date_published": "2022-09-08T14:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 08 (APP): The Supreme Court on Thursday adjourned a petition against Pakistan Tehreek-e-insaf (PTI) Chairman Imran Khan for an alleged hate campaign against the national institutions.\nA two-member SC bench comprising Justice Ijaz ul Ahsan and Justice Sayyed Mazahar Ali Akbar Naqvi adjourned the hearing on an application moved through Advocate on Record Muhammad Sharif Janjua, stating that Hassan Raza Pasha, the petitioner’s counsel, was suffering from severe lower back pain.\nThe petition was moved by Advocate Qausain Faisal through his counsel Hassan Raza Pasha, sought an order to restrain the respondents, including the PTI leadership, members and their official spokespersons, from making any public or private statement.\nThe application stated that since the doctors had advised complete bed rest for two weeks, Hassan Pasha was not in a position to appear before the apex court to plead the case.\nThe application had also attached the medical prescription of the doctor concerned with a request that the proceedings be postponed in the interest of justice.\nIn the main petition, the petitioner sought a direction to set up a commission to assess the impact and damage of the alleged organised hate campaign and suggest further legal steps and proceedings to determine individual liability as well as a collective responsibility and to stop the negative effects of the campaign against national security, which had allegedly adversely affected Pakistan’s relations with friendly countries.\nThe petitioner named the federation through the interior secretary, the PTI, its chairman Imran Khan, former information minister Fawad Chaudhry, and former human rights minister Shireen Mazari, among others as the respondents in the case.\nThe petitioner also sought a direction for the Pakistan Telecommunication Authority, Pakistan Electronic Media Regulatory Authority, Federal Investigation Agency and the Election Commission of Pakistan (ECP) to strictly control the publication of the organised hate campaign immediately and deal with the violators and contemnors.",
  "retrievedAt": "2025-08-11T15:32:39.860Z"
}
