{
  "title": "GSMA highlights Pakistan’s digital progress, potential to spur accelerated economic growth",
  "link": "https://www.app.com.pk/national/gsma-highlights-pakistans-digital-progress-potential-to-spur-accelerated-economic-growth/",
  "date_published": "2024-08-07T12:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): Pakistan is poised to unlock its economic potential through accelerated digital transformation, according to a new report, “Realising Pakistan’s Aspiration to become a Digital Nation,” launched by the GSMA at its Digital Nation Summit.\nThe report underscores the country’s significant strides in mobile connectivity and smartphone adoption while outlining a clear path to maximise these gains for the benefit of its citizens. However, achieving these aspirations will require concrete action and reforms.\nThe GSMA’s supporting report revealed a substantial increase in mobile broadband coverage in Pakistan, with 81% of the adult population now in areas covered by 3G or 4G networks, up from just 15% in 2010.\nAdditionally, smartphone ownership reached 63% by the end of 2023. However, only 23% of the population subscribes to mobile internet services, underlining the scale of the challenge to connect the unconnected.\nThe report reveals the blueprint to address these challenges: infrastructure, innovation, data governance, security, and people. These five pillars are the foundation for a thriving digital nation. The report emphasises the importance of financial reforms and strategic initiatives. Recommendations include eliminating the 15% Advance Income Tax and the 19.5% sales tax on mobile services, addressing high spectrum prices, and introducing a smartphone financing policy to improve access to affordable devices. Additionally, the GSMA advocates for a rational approach to spectrum pricing ahead of the planned 5G spectrum auction in early 2025.\nJulian Gorman, Head of APAC at the GSMA, said: “Pakistan has the potential to realise its aspiration to become a Digital Nation. First it must scale its connected population to strengthen its basic digital economy enabler. Then by adopting a whole-of-government approach and investing in the five key pillars of infrastructure, innovation, data governance, security, and people, Pakistan can unlock its full digital potential, improve the lives of its citizens, and drive sustainable economic growth. The GSMA is committed to supporting the country’s digital journey and working in partnership to build a connected, inclusive, and prosperous future.”\nHowever, achieving these goals requires addressing significant regulatory and fiscal challenges. While market reforms are hoped for, without changes to the regulatory framework and a reduction in tax, progress will be limited, and the substantial usage gap will remain difficult to bridge.\nAdding to the momentum, the upcoming edition of M360 Asia Pacific in Seoul this October will see the release of the first pan-Asia Pacific Digital Nation Report, which will compare the digital progress of 20 nations across the Asia Pacific region. This event follows the recently published Mobile Economy APAC 2024 Report, which highlights key trends and insights shaping the mobile industry in the Asia Pacific region. The report provides valuable data and analysis on the growth trajectory and economic impact of mobile technology, reinforcing the strategic importance of digital advancement in Pakistan and beyond.",
  "retrievedAt": "2025-08-11T04:27:41.367Z"
}
