{
  "title": "NA body expresses concern on disbursements process, surveys BISP",
  "link": "https://www.app.com.pk/national/na-body-expresses-concern-on-disbursements-process-surveys-bisp/",
  "date_published": "2024-08-07T18:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 7 (APP):The Standing Committee on Finance and Revenue on Wednesday expressed concern on the disbursements process, surveys and corruptions’ in the Benazir  Income Support Program (BISP).\nThe 5th meeting of the Standing Committee on Finance and Revenue was held, in the Parliament House under the Chairmanship of Syed Naveed Qamar, MNA/Chair.\nThe Committee was briefed on major programs and initiatives, Budget allocations, disbursements, poverty surveys and new payment methods in BISP.\nThe Chairperson BISP and Secretary Poverty Alleviation and Social Safety informed the Committee that during 2024-25, BISP’s annual Budget has increased by 27% as compared to last year. They added that the current Budget of BISP is 598.718 billion.\nThe Committee expressed concern on the disbursement process, surveys, illegal deduction by POS, and corruption in the program and desired direct access of beneficiaries on the payments.\nThe committee also expressed displeasure on the entire process of recertification and asked BISP officials to stop the traditional bureaucratic approach’ toward policy making matters.\nThe Committee directed the Governor State Bank of Pakistan (SBP) to help BISP in the process of secure disbursements and ensure biometrics of the beneficiary in the system.\nThe Governor SBP briefed the committee on inflation, money supply, monetary policy, current account, foreign exchange reserves and road-map to price stability and sustainable growth.\nHe replied to a number of questions and queries of the chair and the members of the committee.\nThe meeting was attended by MNAs Bilal Azhar Kayani, Rana Iradat Sharif Khan, Syed Sami Ul Hassan Gilani,  Waseem Qadir,  Kesoo Mal Kheal Das,  Ali Jan Mazari, Dr. Mirza Ikhtiar Baig, Dr Nafisa Shah,Arshad Abdullah Vohra, Omar Ayub Khan,  Muhammad Mobeen Arif (ON ZOOM),Usama Ahmed Mela (ON ZOOM),  Muhammad Ali Sarfraz, and Ms. Shahida Begum.\nThe meeting was also attended by Ali Pervaiz Malik, the State Minister for Finance, Ms Rubina Khalid, Chairperson BISP, Secretary Finance Division, Secretary BISP, Governor SBP and other senior officers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:27:16.206Z"
}
