{
  "title": "Director PDMA Punjab assures prompt action on rain emergencies, damaged buildings",
  "link": "https://www.app.com.pk/national/director-pdma-punjab-assures-prompt-action-on-rain-emergencies-damaged-buildings/",
  "date_published": "2024-08-07T09:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 7 (APP):Director Provincial Disaster Management Authority (PDMA), Hamidullah Malik Wednesday assured that all relevant departments, divisional, and district administrations are maintaining close coordination to effectively address emergency situations arising from rain incidents and reconstruction of damaged buildings that pose a danger to the public.\nTalking to PTV news channel, he said with a proactive approach, the authorities are working together to mitigate the impact of rain-related disasters and ensuring the safety of citizens.\nThe PDMA has already alerted all rescue services, including machinery and personnel from Rescue 1122, to be ready for deployment, adding, the authority has urged citizens to exercise caution and stay away from electric poles and hanging wires, as well as avoid dirty and dilapidated buildings during the monsoon season.\nPDMA Director Hamidullah Malik emphasized the importance of timely measures to protect human lives, stating that 24-hour monitoring is being conducted in both provincial and district control rooms.\nMalik encouraged collaboration with other PDMA institutions, stressing that a unified approach is crucial in mitigating the impact of rain-related disasters.\nReplying a query, he assured that the authority is fully prepared to respond to any situation, with all necessary resources and personnel on standby.\nIn addition to its emergency response efforts, the Provincial Disaster Management Authority (PDMA) has also taken proactive measures to mitigate the impact of heavy rainfall on high-risk buildings and urban flooding.\nPDMA Director Hamidullah Malik announced that the authority has identified high-risk buildings in vulnerable areas and is taking steps to reconstruct or reinforce them to prevent collapses.\nFurthermore, the PDMA has also introduced a de-watering system to quickly remove water from flooded areas, reducing the risk of damage and disruption.\nAs part of this initiative, underground tanks are being established to store excess rainwater, allowing for swift drainage and minimizing the likelihood of urban flooding, he added.\nThese preemptive measures demonstrate the PDMA’s commitment to reducing the risk of rain-related disasters and ensuring public safety during the monsoon season, he said, adding, by addressing vulnerabilities in infrastructure and implementing effective water management systems, the authority aims to minimize the impact of heavy rainfall on communities across Punjab.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:28:07.947Z"
}
