{
  "title": "Govt. allocates historic budget for growth of IT, Telecom sectors: PM",
  "link": "https://www.app.com.pk/national/govt-allocates-historic-budget-for-growth-of-it-telecom-sectors-pm/",
  "date_published": "2024-08-07T14:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday said that the federal government had allocated a historic development budget, in the current fiscal year, for the promotion of Information Technology and Telecom sectors.\nHe said the incumbent government was prioritizing steps for increasing country’s IT export.\nThe prime minister expressed these views during a meeting with a four-member delegation of GSM Association led by its Asia Pacific head Julian Gorman, PM Office Media Wing said in a press release.\nThe meeting was attended by Minister of State for IT and Telecom Shaza Khawaja Fatima, Chairman Pakistan Telecommunication Authority Major General (retired) Hafeezur Rehman and other relevant senior officials.\nThe prime minister observed that GSMA had significant and vital role in the digitization processes and welcomed holding of Digital National Summit in Islamabad for the promotion of telecommunication and IT.\nHe said the mechanism processes for IT sector reforms and digitization was being implemented and the focus was made on common man’s better access to internet, digital infrastructure, E-Governance, professional training of youth in the digital skills and innovations, besides promotion of business in this sector.\n“Our vision envisaged access to smart phone by every individual, broadband internet facility to every household and facility of QR Code for all businesses, “ the press release quoted the prime minister as saying.\nThe delegation apprised the prime minister of GSMA role throughout the world, including Pakistan, over promotion of telecom services and expressed its keen interest in enhancing cooperation with the government in IT and telecom sectors.",
  "retrievedAt": "2025-08-11T04:27:23.642Z"
}
