{
  "title": "Talal lauds security forces for foiling Jaffar express terror attack, calls for national unity against terrorism",
  "author": null,
  "content": "ISLAMABAD, Mar 14 (APP):Minister of State for Interior and Narcotics Control, Talal Chaudhry, on Friday commended the security forces for their successful operation against terrorists involved in the recent attack on the Jaffar Express, which saved the lives of innocent civilians, including women and children.\nSpeaking on the floor of the National Assembly, he said, “The way our security forces conducted the operation during the terrorist attack on the Jaffar Express to rescue innocent passengers deserves recognition. These brave individuals risked their lives to protect our people.”\nTalal Chaudhry described tragic Jaffar Express attack as a cowardly act of terrorism. “From one side, there was an assault by militants hiding in the mountains; on the other, regrettably, social media was used to malign Pakistan’s security forces. These forces were protecting innocent civilians, including women, children, and government employees,” he said.\nHe warned that those facilitating terrorists through social media would be treated no differently than terrorists themselves. “Whether it’s BLA, TTP, or others, their handlers and trainers are operating from neighboring countries.” he said.\nTalal Chaudhry attributed the resurgence of terrorism to policy failures post-2018.\nHe urged all political stakeholders to engage in serious dialogue on Pakistan’s future, particularly on issues of national security. “This is a matter of national security. Let’s sit down and talk—whether about the National Action Plan or any other strategy. But speeches alone won’t solve anything,” he said.\nHe praised the unity shown by the entire national leadership—including both the government and opposition in Balochistan—in addressing the menace of terrorism.\nDismissing negative perceptions about the province, he asserted, “There is no insurgency in Balochistan. What we are dealing with is terrorism—pure and simple. Whether it is the Balochistan Liberation Army (BLA) or Tehreek-e-Taliban Pakistan (TTP), their patterns are identical.”\nResponding to concerns over the resurgence of terrorism, Talal Chaudhry stressed the urgent need for full implementation of the National Action Plan (NAP). “It’s been 20 years, and Khyber Pakhtunkhwa has received over Rs 600 billion through the National Finance Commission (NFC) Award. Yet, their Counter-Terrorism Department (CTD) still operates from rented buildings and lacks proper resources,” he lamented.\nHe criticized the Khyber Pakhtunkhwa government for failing to build institutional capacity. “Our intelligence agencies provide timely information, but implementation at the provincial level is missing. In Punjab, intelligence leads are acted upon, and results are visible. But in Khyber Pakhtunkhwa, either there’s no capacity or no will to act,” he said.\nCalling for accountability, he challenged political leaders to present their 13-year performance in Khyber Pakhtunkhwa.\n“They promised to turn KP into Europe. Yet, there’s no medicine in hospitals, law and order remains a concern, and even their own people admit that corruption has reached historic levels,” he added.\nTalal Chaudhry expressed his readiness to present a comprehensive report on the Interior Ministry’s one-year performance before Parliament and for public scrutiny. “I am ready to present myself and the Interior Ministry’s one-year performance for accountability. Whether you need a day or a week, I am available 24/7 to answer questions. Where there are deficiencies, we will improve; where good work has been done, it deserves appreciation,” he pledged.\nAppreciating the performance of Federal Interior Minister Mohsin Naqvi, he highlighted the successful hosting of the Shanghai Cooperation Organization (SCO) conference and international tournaments in a peaceful environment.\n“Projects like bridges and underpasses, which used to take years, are now being completed in two months. Stadiums of international standards have been built and are a gift for Pakistan,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:40:45.923Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/talal-lauds-security-forces-for-foiling-jaffar-express-terror-attack-calls-for-national-unity-against-terrorism/",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T10:06:00.000Z"
}
