{
  "title": "PM meets footballer from Hangu, offers financial support, employment",
  "author": null,
  "content": "ISLAMABAD, Mar 14 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday met football player Muhammad Riaz from Hangu and offered him financial support worth Rs 2.5 million along with an employment opportunity.\nThe prime minister, taking notice of the financial difficulties faced by the national footballer, whose video of selling funnel cakes (Jalebi) recently went viral, invited him to the PM House.\nPraising courage and determination of the football player, the prime minister said “You are the country’s talented player, and we will not let your talent go to waste”.\nHe said Pakistani youth were a valuable asset to the country, and providing them with all types of facilities and resources for international competitiveness was the top priority of the government.\n“Youth should actively participate in sports and other healthy activities,” he remarked.\nHe urged Muhammad Riaz to continue playing and play an active role in promoting football in Pakistan.\nThe prime minister directed that Muhammad Riaz be given a job in his preferred federal department.\nHe also instructed that national players should be provided jobs in government institutions according to their abilities.\nThe prime minister emphasized the need to accelerate efforts for the promotion of sports in the country.\n“A strategy should be formulated for the welfare of players representing Pakistan internationally and to provide them with sustainable employment opportunities,” he said.\nMuhammad Riaz thanked the prime minister for the financial assistance.\nHe also thanked PM Shehbaz Sharif for his efforts towards the welfare of the players and the promotion of sports.\nOn the occasion, the prime minister presented a cheque worth Rs 2.5 million to Muhammad Riaz.\nThe meeting was attended by federal ministers Ataullah Tarar, Shaza Fatima Khawaja, PM’s Adviser Rana Sanaullah, Chairman of the PM’s Youth Program Rana Mashhood Ahmed Khan, and Media Coordinator Badar Shehbaz Warraich.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:40:26.692Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-meets-footballer-from-hangu-offers-financial-support-employment/",
  "dateList": "2025-03-14",
  "date_published": "2025-03-14T09:55:00.000Z"
}
