{
  "article_id": "2025-04-03_c300d94eb3b985f12ee93fd7e4bb3542",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-enhance-bilateral-cooperation-with-belarus-abdul-aleem-khan/",
    "retrieved_at": "2025-08-27T14:11:44.056Z"
  },
  "metadata": {
    "title": "Pakistan to enhance bilateral cooperation with Belarus: Abdul Aleem Khan",
    "author": null,
    "date_published": "2025-04-03T14:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 337,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 03 (APP):Federal Minister for Communications Abdul Aleem Khan along with a high-level delegation arrived in Minsk, Belarus for a two-day official visit. During the visit, apart from having different meetings, he participated in a Ministerial Session, said a press release issued here on Thursday. Abdul Aleem Khan stressed Pakistan's commitment to enhance bilateral cooperation with Belarus and expressed the desire to make swift progress on existing agreements between the two countries enabling the commencement of practical work across various sectors. He added that both sides should move forward on existing MoUs so that practical progress can be achieved. On the first day, Aleem Khan held meetings with Belarusian Minister of Energy, Denis Moroz and Minister of Transport Alexei Lyakhnovich, high-level officials from both sides were also present. Accompanying the Minister were the Federal Secretaries from Pakistan's Ministries of Communications, Industry, Food Security and Interior along with the Deputy Governor of the State Bank of Pakistan, the Secretary of the Economic Affairs Division, and officials from the Ministry of Commerce. Federal Minister Abdul Aleem Khan, in his discussions with Belarusian Ministers, highlighted the potential for significant improvement in the Communications Sector between Pakistan and Belarus. He emphasized the importance of creating trade corridors between the two countries which could play a key role in facilitating access to Central Asian States through routes in Pakistan, China, Afghanistan, or Iran, ultimately opening up pathways to Eastern Europe. Abdul Aleem Khan stated that these infrastructure projects would also be a strategic milestone. He further added that the world is moving towards innovation and the future of trade and business is linked to the development of transportation infrastructure making its enhancement a top priority. Belarusian Ministers of Energy and Transport warmly welcomed Federal Minister Abdul Aleem Khan, assuring him of their full cooperation. It is worth noting that Federal Minister Abdul Aleem Khan is being hosted as a State Guest during his visit and will have the opportunity to sign several new Memoranda of Understanding (MOUs) during this official tour.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}