{
  "article_id": "2025-04-03_e0283150e69e7833f9e19195c23f5e30",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-speaker-welcomes-big-reduction-in-electricity-tariffs/",
    "retrieved_at": "2025-08-27T14:11:14.968Z"
  },
  "metadata": {
    "title": "NA Speaker welcomes big reduction in electricity tariffs",
    "author": null,
    "date_published": "2025-04-03T18:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 03 (APP):National Assembly Speaker Sardar Ayaz Sadiq has welcomed Prime Minister Shehbaz Sharif's announcement of a significant reduction in electricity tariffs, which will provide major relief to consumers. The cuts include a decrease of Rs. 7.41 per unit for domestic users and Rs. 7.59 per unit for industrial consumers. In a statement issued by the Directorate General of Media of the National Assembly Secretariat, the speaker said that this is a historic public decision of the prime minister and his team. This decision will benefit all consumers without discrimination. Such a big relief to the people after pulling the country out of the economic whirlpool is a historic step. Speaker of the National Assembly Sardar Ayaz Sadiq further said that the prime minister's decision will further accelerate economic activities in the country. This decision of the government also brought immediate improvement in the stock market, which is a reflection of the confidence of the business class. The public circles, including the business classes and the business community, have also welcomed this decision. He said that despite the challenges facing the country, such a big relief is the fulfilment of the promises made by the prime minister to the people. The reduction in electricity prices will increase exports and increase the growth rate.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}