{
  "article_id": "2025-04-03_8a9aac0eda45da43370dc2f0ddf69d64",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/food-allergy-awareness-crucial-for-public-health-expert-says/",
    "retrieved_at": "2025-08-27T14:12:10.687Z"
  },
  "metadata": {
    "title": "Food allergy awareness crucial for public health, expert says",
    "author": null,
    "date_published": "2025-04-03T06:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 262,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 3 (APP):A health expert Thursday stressed that food allergies necessitate an immediate attention, emphasizing the critical need for public awareness for timely, cost-effective treatment which are entirely curable if proper precautions are taken. \"Neglecting it can have severe and potentially life-threatening consequences\". Food Allergy Expert Dr Anwar ul Haq Roomi talking to a private news channel, explained food allergies can manifest at any stage of life, from early childhood to adulthood and occur when the immune system mistakenly identifies certain foods as harmful, triggering a defensive response. He further noted that food allergies can be inherited and alarmingly, adding, approximately 80% of food allergies manifest in children, making them significantly more prone to developing these allergies compared to adults and the elderly. He emphasized that in South Asian countries, including Pakistan, there is a growing need for holistic treatment approaches that not only address the physical aspects of food allergies but also provide rehabilitation and support for affected individuals. Dr Roomi highlighted that common food allergens in Pakistan include gluten, wheat, chicken and nuts which can trigger severe allergic reactions in sensitive individuals. He assured that the treatment for food allergies is not only effective but also cost-effective, making it accessible to a wider population in Pakistan. He emphasized the need for nationwide awareness programs to educate citizens about food allergies and their implications. Additionally, he stressed the importance of conducting more extensive research on food allergies specific to Pakistan, highlighting the need for a better understanding of the prevalence, causes and consequences of these allergies in the local population.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}