{
  "title": "PUC urges religious scholars to advocate minority rights in Friday sermons",
  "link": "https://www.app.com.pk/national/puc-urges-religious-scholars-to-advocate-minority-rights-in-friday-sermons/",
  "date_published": "2023-08-10T13:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP):The Pakistan Ulema Council (PUC), in a unified call to action on Thursday, fervently appealed to religious scholars across the nation to use their Friday sermons as a platform to shed light on the rights of minorities in accordance with Islamic principles.\nThe prominent leaders of the PUC, including Chairman Hafiz Muhammad Tahir Mahmood Ashrafi and esteemed scholars such as Allama Abdul Haq Mujahid, Maulana Muhammad Rafiq Jami, Maulana Muhammad Shafi Qasmi, Maulana Nauman Hashir, Allama Zubair Abid, Maulana Asadullah Farooq, Allama Tahir Hassan, Maulana Qasim Qasimi, Maulana Abu Bakr Hamid Sabri, Maulana Tahir Aqeel Awan, Maulana Muhammad Ashfaq Pitafi, Maulana Aziz Akbar Qasimi, Maulana Muhammad Islam Siddiqui, and others, have come together to emphasize the importance of upholding the rights of minorities.\nIt, highlighting the diversity that enriches the cherished homeland of Pakistan, where people of various faiths coexist harmoniously, informed that August 11, is observed as a day dedicated to championing the rights of non-Muslims. It emphasized that this day serves as a poignant reminder of the significance of ensuring equal rights for every individual, regardless of their religious beliefs.\nThe PUC advocated for a thoughtful discourse within Friday sermons on August 11, encouraging Ulema and Mashaykh to delve into the teachings of the Quran, Sunnah, and the Constitution, in order to shed light on the rights of non-Muslims and minorities in Pakistan.\nIt underlined that Pakistan’s Constitution is firmly rooted in the principles of the Quran and Sunnah, underscoring the importance of honor and respect for all citizens, guided by the principles of Taqwa.\nReverently referring to Allah Almighty as the “Lord of the Worlds” and Hazrat Muhammad ? as the “Mercy for the Worlds” in the Holy Quran, the PUC emphasized that these attributes serve as guiding principles for the treatment of minorities.\nIt underscored that it is not only the duty of Muslim-majority nations to protect the rights of non-Muslim minorities within their borders, but it is equally vital for Muslims living as minorities in non-Muslim countries to have their rights safeguarded.\nIt concluded by urging the entire populace to recognize that every Pakistani citizen, irrespective of their background, enjoys equal rights and protections under the Constitution, laws, and regulations of the nation.\nAs the PUC has taken this noble stance to advocate for the rights of minorities, it called upon the collective conscience of the nation to embrace the spirit of unity, tolerance, and compassion that is intrinsic to Islam’s teachings.",
  "retrievedAt": "2025-08-11T09:08:39.823Z"
}
