{
  "title": "Outgoing NA concludes remarkable term, passing 235 bills and overseeing key transitions",
  "link": "https://www.app.com.pk/national/outgoing-na-concludes-remarkable-term-passing-235-bills-and-overseeing-key-transitions/",
  "date_published": "2023-08-10T08:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP): The 15th National Assembly of Pakistan, which came to a close on August 9, 2023, left behind a legacy of legislative productivity, executive oversight and transformative leadership changes.\nWith an array of accomplishments, the outgoing assembly’s tenure underscores its commitment to democratic governance and national progress. During its tenure, the 15th National Assembly achieved an impressive feat by passing a total of 235 bills.\nThe assembly, comprising 342 members, skillfully discharged its duty of executive oversight, ensuring the effective functioning of the government. Lawmakers displayed unwavering dedication by submitting thousands of questions across various ministries, probing into critical matters affecting the nation.\nFurthermore, the assembly took proactive steps towards addressing key concerns by introducing and adopting resolutions. A total of 107 resolutions were adopted, reflecting the assembly’s endeavor to provide solutions to a broad spectrum of issues mainly related to governance, education, foreign affairs, health and energy.\nAccording to the National Assembly’s official website, the house witnessed the introduction of 181 government bills and 360 private member bills. This comprehensive legislative approach highlighted the assembly’s commitment to inclusivity and addressing multifaceted challenges. Notably, 12 bills were referred to the joint sitting of Parliament, demonstrating the assembly’s collaborative approach to lawmaking.\nThe tenure of the outgoing 15th National Assembly was characterized by significant leadership shifts and milestones. The assembly played a pivotal role in the ousting of former Prime Minister Imran Khan through a motion of no-confidence passed on April 9, 2022. Subsequently, Mian Muhammad Shehbaz Sharif secured a vote of confidence, heralding a new era of leadership.\nA total of 126 bills were passed during the period from August 13, 2018 to April 9, 2022, underpinning the legislative achievements of the assembly’s early years. The remaining 109 bills were endorsed during the tenure of the PML-N-led government, spanning from April 10, 2022, to August 9, 2023, affirming the assembly’s enduring commitment to governance.\nThe 15th National Assembly marks the fourth instance in Pakistan’s history where a National Assembly has successfully completed its term.\nIn a notable departure from the scheduled term completion date of August 12, 2023, Prime Minister Mian Muhammad Shehbaz Sharif announced the dissolution three days earlier on August 9, 2023. Over its tenure, the outgoing assembly convened a total of 52 sessions, each dedicated to robust deliberations and the passage of vital legislative proposals.\nThe assembly’s focus on the well-being and advancement of the nation is evident in its meticulously crafted bills that addressed a wide range of issues. With a strong emphasis on democratic principles, the 15th National Assembly leaves an indelible mark on Pakistan’s political landscape, fostering a legacy of dedication, innovation, and progress.",
  "retrievedAt": "2025-08-11T09:08:40.885Z"
}
