{
  "title": "Nawaz Sharif to return next month to lead election campaign: PM",
  "link": "https://www.app.com.pk/national/nawaz-sharif-to-return-next-month-to-lead-election-campaign-pm/",
  "date_published": "2023-08-10T16:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP): Prime Minister Shehbaz Sharif Thursday said Quaid of Pakistan Muslim League(N) Nawaz Sharif would come back to Pakistan next month and would face his cases in courts.\nIn an interview with a private television channel, he said after the caretaker government was formed he would go to London to discuss plan of his return with his brother Nawaz Sharif.\nNawaz Sharif would lead the election campaign of his party and would be the next prime minister for the fourth time if Pakistan Muslim League(N) won the next election, he added.\nThe prime minister said last night the President signed the advice to dissolve the National Assembly and he had talked with coalition partners about the caretaker prime minister and the decision would be made in the next three days.“Tomorrow we will hopefully finalize a name for the post of caretaker prime minister,” he said adding he would further consult the matter with the allied parties and Nawaz Sharif.\nHe said as he had been saying all along he would hand over the government to the caretaker set up and the Election Commission would decide about the date for new elections.\nCouncil of Common Interests (CCI) had already approved the new digital census and the election would be held according to this census, he told.\n“We have followed the constitution and now the institutions have the responsibility to hold the elections,” he remarked adding he desired that elections should be held as soon as possible.\nShehbaz pointed out that he led the shortest government of 16 months formed by coalition parties of various ideologies and thinking.\n“We proved to the people that the coalition parties were united for sake of the country. We performed our responsibilities in the best interests of the state.”\nHe said after he took over the country faced devastating floods and the government within its limited resources provided timely relief to the people, took steps for their rehabilitation and transparently distributed the aid that came from foreign countries.\nThe biggest contribution of his government was that Pakistan was saved from default and for that his governmentwent through a difficult phase of negotiations with the International Monetary Fund (IMF).\nThe Managing Director IMF at one point in a meeting with him in Paris said that no time was left for revival of the programme but later an agreement was reached for loan of three billion dollars, he recalled.\nThe PM said in the four years of the previous government, relations were damaged with friendly and brotherly countries and long time friends of Pakistan were alienated.\nHe said countries like Saudi Arabia unconditionally came to the rescue of Pakistan on numerous difficult occasions in the past, provided monetary assistance to the country and gave oil on deferred payment for three years but despite all that the previous government could not maintain better ties with the brotherly country.\nTo a question, the prime minister said he chaired two meetings of National Security Committee and Pakistan’s then former ambassador to the United States and present foreign secretary Dr Asad Majeed told there that he sent the report of his conversation with State Department official Donald Lu in a cypher.\nThe ambassador told the meeting that it was never mentioned in the cypher that the United States was conspiring against the government of that time in Pakistan, he narrated.\nHe said Imran Niazi gave contradictory statements on the issue of cypher and on various occasions held different personalities and the United States responsible for removal of his government and then withdrew his accusations.\nAt one point Imran claimed that as he was getting close to China and Russia therefore his government was removed, Shehbaz said while stressing, “It was my government that improved relations with China and Russia.”\nThen Imran Niazi said he lost the cypher, he said adding as prime minister Imran Niazi could have read the cypher but he should not have taken the cypher with him as it was confidential.\n“If the cypher was lost by Imran Niazi then how it got published now?” he wondered. adding the law enforcement agencies were investigating the matter of cypher.\nTalking about foreign relations, he said his government revived badly damaged relations with the United States and he himself met with various delegations from the US and foreign minister Bilawal met the Secretary of State and US Congressmen on numerous occasion in a bid to restore ties.“I told the American ambassador in Pakistan that we wanted better relations with the United States.”\nHe said the perception that his government was “imported” was fabricated, adding his government restored ties and received support from different friendly and brotherly countries. “For instance if we were imported government, then we should have received open support from the IMF,” he observed. He agreed that the United States did not oppose IMF programme for Pakistan.\nHe said Pakistan as a developing country was faced with numerous challenges and should do its best to promote good ties with all countries.\nTo another question, he said Special Investment Facilitation Council (SIFC) would focus on agriculture, information technology, mineral development and water resources.\nHe said according to the ground realities of Pakistan, it had 33 years of martial law which ultimately failed and also democratic governments which were not that strong.\nSo everybody should work together now to bring prosperity in the lives of the people, he said while giving reasons for forming the SIFC in which army would have a role for attracting investment.\nThe prime minister said Pakistan had fertile land and abundant water and mineral resources but it could not get benefit from them and it even wasted billions of dollars on fighting cases in international courts on issues of mining.\nNow a law had been made and the federal and provincial governments and army would collaborate on execution of the development projects undertaken under SIFC, he elaborated.He was of the view that youth could bring revolution in Pakistan through use of information technology.\nHe reminded that Imran Niazi was following a hybrid model of governance and General (R) Qamar Bajwa gave unprecedented support to Imran Niazi but he used this support for putting members of opposition in jails and for abusing and maligning them.\nShehbaz said, “I am not happy that Imran Niazi is in jail,” adding, “Although, when we were sent to jail, Imran Niazi made statements that he put his political opponents in jail, then he personally victimized his opponents and asked for their mistreatment in jail by denying them facilities of bed, home food and medicine.”\n“I was forced to sleep on floor and then I was made to travel in armoured personnel carrier despite problem of my backbone.”",
  "retrievedAt": "2025-08-11T09:08:31.641Z"
}
