{
  "title": "Ministry seeks applications for annual Urs of Hazrat Khawaja Moinuddin Chishti in Ajmer Sharif",
  "link": "https://www.app.com.pk/national/ministry-seeks-applications-for-annual-urs-of-hazrat-khawaja-moinuddin-chishti-in-ajmer-sharif/",
  "date_published": "2023-08-10T12:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP): The Ministry of Religious Affairs and Interfaith Harmony has opened its doors to fervent Pakistani pilgrims, encouraging them to seize the opportunity and apply for participation in the annual Urs of the revered Sufi saint, Hazrat Khawaja Moinuddin Chishti, held in Ajmer Sharif, India.\nThe Ministry’s Spokesperson Muhammad Umar Butt on Thursday informed that pilgrims could submit their applications through the dedicated Ziyarat form until August 31, 2023.\nHe said the Urs ceremonies, a cherished tradition among followers, were set to grace the holy city of Ajmer Sharif from January 13 to 23, 2024. Devotees from Pakistan and beyond would have the privilege to engage in this spiritually uplifting event, he added.\nHe said in anticipation of an overwhelming response, if the number of applications surpass the available slots, a selection draw would be conducted on October 10, 2023. This impartial process would determine the fortunate individuals who would embark on this auspicious journey, he maintained.\nUmar Butt said for comprehensive information and updates on the Urs, interested applicants were encouraged to visit the official website of the Ministry of Religious Affairs and Interfaith Harmony, as well as their dedicated Facebook page.\nHe said it’s important to note that no applications would be entertained via the old application forms; all pilgrims were urged to use the provided Ziyarat form for consideration.\nHe said this esteemed event presents a unique opportunity for pilgrims to connect with their spiritual roots and experience the profound significance of Hazrat Khawaja Moinuddin Chishti’s legacy in the heart of Ajmer Sharif, India.",
  "retrievedAt": "2025-08-11T09:08:35.965Z"
}
