{
  "title": "Marriyum urges journalists, media workers to remain united for implementation of PEMRA Amendment Bill 2023",
  "link": "https://www.app.com.pk/national/marriyum-urges-journalists-media-workers-to-remain-united-for-implementation-of-pemra-amendment-bill-2023/",
  "date_published": "2023-08-10T12:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP): Information Secretary of Pakistan Muslim League-Nawaz and former Minister for Information and Broadcasting Marriyum Aurangzeb on Thursday urged the journalists and media workers to remain united and ensure implementation of PEMRA Amendment Bill 2023, which would replace the 2002 PEMRA Ordinance, a black law introduced by Pervez Musharraf.\nMarriyum Aurangzeb thanked all the media organizations including All Pakistan Newspaper Society (APNS), Pakistan Broadcasters Association (PBA), Parliamentary Reporters Association (PRA), Council of Pakistan Newspaper Editors (CPNE) for their guidance and support in the preparation of the PEMRA Amendment Bill 2023.\nDuring her visit to National Press Club here, she said that for the past over 12 months, consultations were held with all stakeholders for the preparation of the Bill.She said that the rights of working journalists and media workers have been protected in the Bill as the issuance of government advertisements has been linked to payment of salaries and dues of the journalists and media workers. Moreover, the rule of minimum wages would now be applicable for media organizations, she added. The former minister said that the outgoing government had introduced Health Insurance Card scheme for journalists and media workers and had created a fund for payment of Rs 4 million to the families of those who die in the line of duty.She ruled out the impression given by a certain lobby that the Bill was prepared in haste or it was being passed on the instructions of someone.The former minister also rubbished the impression that she had withdrawn the Bill from the Senate Standing Committee on Information and Broadcasting under pressure of some persons. Citing the examples of slogans against her by workers of a political party, she said that she never bowed to pressure.She said that some people had been opposing the Amendment Bill without bothering to read it thoroughly. She said that in the National Assembly and its standing committee, each and every clause of the Bill was discussed and then it was approved.Criticizing the impression that the Bill was meant to impose restrictions on the media, she said as a political worker, she could not even think about curtailing freedom of expression.Marriyum Aurangzeb said that PML-N leadership had always faced censorship and restrictions on their media coverage and they could not think about imposing any bill against the interest of the media industry. The PML-N Secretary Information said that she was shocked when a person alleged that she was strangulation the media and imposing gag on freedom of expression through this Bill.She said that she decided to withdraw the Bill as she did not want that the coalition government should be blamed in any way for bulldozing a bill to curb media freedom. She said the protection of journalists and media workers rights were linked with the PEMRA Amendment Bill 2023 as a lot of efforts were put in the Bill in this regard.She said that the positive aspect of these efforts was that all the industry stakeholders joined hands for approval of the Bill as it was meant for the betterment of the entire industry and the pro-worker bill was prepared by keeping in view the needs of changed media landscape.She thanked the former minister for law and justice Azam Nazeer Tarar for providing legal guidance for ensuring that there was no legal lacuna in the bill.She said that the past couple of days, the efforts of journalists and media workers for protection of their rights were historic.",
  "retrievedAt": "2025-08-11T09:08:36.822Z"
}
