{
  "title": "Farewell celebrations held to honour Shazia Marri for transformative leadership",
  "link": "https://www.app.com.pk/national/farewell-celebrations-held-to-honour-shazia-marri-for-transformative-leadership/",
  "date_published": "2023-08-10T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP):The Benazir Income Support Programme family acknowledged the unwavering dedication and efforts of the Federal Minister for Poverty Alleviation and Social Protection, Shazia Marri in championing the noble cause of welfare for marginalized segments of society.\nThe officials came together at the BISP Headquarters on Tuesday to bid a heartfelt farewell to the outgoing minister, Shazia Marri who is also Chairperson BISP.\nThe event marked an emotional yet celebratory moment as Shazia Marri shared her reflections on her time with the BISP team and the remarkable achievements accomplished under her leadership.\nIn her address, Shazia Marri said that BISP has witnessed a substantial increase in funding, with the allocation growing from Rs. 235 billion in FY 2021-22 to an impressive Rs. 404.2 billion in FY 2022-23.\nThis surge in resources allowed BISP to expand its reach, as the number of eligible households surged from 7.6 million to 9 million. Notably, the stipend for the Benazir Kafaalat programme was raised by 25%, and the quarterly stipend for BISP beneficiaries was elevated from Rs. 7000 to Rs. 8750, she said.\nShazia Marri also highlighted the successful implementation of transformative initiatives, including the Benazir Nashonuma programme, which provided crucial support to 770,000 lactating mothers and infants through 488 Facilitation Centers across Pakistan. Additionally, the Benazir Taleemi Wazaif initiative witnessed a remarkable surge in children’s enrollment from 2.6 million to an impressive 7.52 million.\nShazia Marri further said that this was the first time in the history of Pakistan that the Benazir Income Support Programme included Transgender Persons in the Benazir Kafaalat Programme.\nMobile Registration Vehicles have been introduced to reach the most vulnerable communities in remote regions of Balochistan and Sindh, she said.\nShazia Marri lauded the introduction of the Benazir Social Protection Accounts, which streamlined payments to beneficiaries, enhancing convenience, efficiency, and transparency.\nThrough this initiative, 1400 bank accounts were opened, ensuring direct and secure financial support for those in need.\nShazia Marri said that Benazir Income Support Programme rapidly disbursed Rs. 70 billion to 2.8 million flood-affected families, offering critical support of Rs. 25,000 per family during times of floods.\nFurthermore, an essential fuel subsidy of Rs. 16.3 billion was provided to 8.6 million families, helping to alleviate financial burdens, she said.\nShazia Marri extended her heartfelt gratitude to the entire BISP management and team for their unwavering efforts and dedication.\nShe acknowledged their pivotal role in realizing the vision of an inclusive and prosperous Pakistan.\nShe expressed her gratitude for the opportunity to serve as the Chairperson of BISP and the Federal Minister for Poverty Alleviation and Social Safety.\nShe highlighted that her journey with BISP had been an invaluable learning experience, leaving her with a wealth of knowledge and insights.\nShazia Marri emphasized that it had been an honor to work with a dedicated team that consistently strived for excellence and the betterment of society.\nOn the occasion, Minister of State for Poverty Alleviation and Social Safety, Faisal Karim Kundi, appreciated acknowledged the dedication and efforts for the welfare of marginalized segments of society.\nHe particularly highlighted her remarkable commitment to empowering women, recognizing her as a driving force behind transformative initiatives that have positively impacted countless lives.\nSecretary BISP, Mr. Amer Ali Ahmad, expressed his profound gratitude to Shazia Marri for her guidance and support.\nHe commended her extensive experience, which enriched the team’s collective knowledge.\nSecretary Poverty Alleviation and Social Safety, Mr. Yousaf Khan praised Shazia Marri’s dedication and leadership during her tenure, wishing her a bright future ahead.",
  "retrievedAt": "2025-08-11T09:08:30.646Z"
}
