{
  "title": "PIA plane crash’s provisional inquiry report to be submitted before Parliament by June 22: Sarwar",
  "link": "https://www.app.com.pk/national/pia-plane-crashs-provisional-inquiry-report-to-be-submitted-before-parliament-by-june-22-sarwar/",
  "date_published": "2020-05-28T05:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP):Minister for Aviation Ghulam Sarwar Khan Thursday expressed the confidence that the provisional inquiry report of the Pakistan International Airlines’ (PIA) plane crash that claimed 97 lives, would be made public and tabled before the Parliament by June 22.\n“By the grace of Allah Almighty, the provisional investigation report will be put before the public and Parliament by June 22, 2020. It will be a free and fair investigation . . . and there should be no confusion in that regard,” he said here while addressing a news conference.\nThe minister said in the country’s aviation history, as many as 12 major accidents had taken place, out of which ten tragedies were faced by the PIA and one each by Bhoja Air and Airblue. “But, unfortunately no investigation report had been made public.”\nHe announced that during the upcoming session of parliament he would try to public findings of all previous inquiries and investigation reports compiled after the plane crashes. He also hinted that the Pakistan Tehreek-e-Insaf government would take action in line with the findings of previous reports, if the past regimes avoided taking any action against those who were found involved in the tragic incidents.\nThe minister said soon after the incident on May 22, the Aviation Division held a teleconference and notified an Investigation Board, under a senior officer, after getting approval from the prime minister.\nHe said the board was independent and fully authorized to include anyone, whom it deemed appropriate, for assistance in the probe. An 11-member team of experts from France had arrived to inspect the incident site and other materials, he added.\nHe said the black-box and cockpit voice recorder had been recovered, which would be taken to France for decoding and compiling a report.\nThe minister said 51 bodies of the victims had so far been identified and handed over to their heirs, while the medical record and samples from the heirs were being collected for DNA (Deoxyribonucleic Acid) tests for the identification of remaining bodies. As many as 97 persons had lost their lives in the crash occurred in Karachi on May 22.\nHe said utmost efforts were being made in collaboration with the Sindh and Punjab health departments, besides the National Disaster Management Authority, to complete the identification process at the earliest.\nInitially, he said, an amount of Rs one million each was being given to the heirs of deceased and Rs 500,000 each for injured by the government. However, the real compensation amount would be given by the insurance company concerned.\nHe said a survey was underway to assess the damages occurred to the houses and property, following which the government would announce a compensation package.\nAnswering a question, the minister urged the so-called experts to avoid undue discussion on the incident’s causes based on their limited information, asking them to wait for the inquiry results and have faith in the Investigation Board.\n“Each and every thing is documented and record. Besides, all evidences are in the custody of the board.”\nHe also clarified that nothing had been removed or lifted from the debris before arrival of the rescue teams and departments concerned.\nReplying to another question, he said the segregation of Civil Aviation Authority (CAA) was in process under which two commercial and regulatory authorities would hopefully be set up by June 30 to improve efficiency of the aviation sector.\nLike the CAA, he said, there would be two authorities ‘Commercial & Regulatory,’ headed by their respective director generals. The authorities would have their independent boards and work under the Aviation Division.\nAnswering a question, he said domestic flight operations had been restored partially in consultation with all the stakeholders, and efforts would be made to increase the number of flights gradually. On the same pattern, he said, the resumption of international flights was also under consideration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:15:58.814Z"
}
