{
  "title": "Sarwar condemns construction of temple at Babri mosque site",
  "link": "https://www.app.com.pk/national/sarwar-condemns-construction-of-temple-at-babri-mosque-site/",
  "date_published": "2020-05-28T01:38:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 28 (APP):Governor Punjab Chaudhry Mohammad Sarwar has condemned the extremist government of Indian Prime Minister Narendra Modi on construction of a Hindu temple at the site of historic Babri mosque.\nTalking to a delegation headed by Imam, Glasgow Central Mosque Maulana Idrees Ahmed at the Governor’s House on Thursday, he said de-secularization of India, on the birth anniversary of Jawahar Lal Nehru, was a proof that India had become an unlivable place for the Muslims under Narendra Modi’s regime.\n“Indian Muslims are being stripped of religious freedom while their constitutional rights are usurped by RSS fascists in connivance with a government promoting Hindutva”, he added.\nSarwar said that PTI government safeguarded constitutional and political rights of the minorities in Pakistan and treated them equal with the Muslim majority.\nHe said the world must break silence on oppression against Indian minorities, adding that the United Nations (UN) Security Council should also deal with the case of Islamophobia in Europe.\nHe said the New York Times had also exposed the failure of Modi government in protecting human rights and the coronavirus pandemic.\nGovernor Punjab Chaudhry Sarwar said coronavirus lockdown in India also revealed the systematic economic oppression against Muslims of India.\nEarlier, Governor Punjab visited the residence of senior bureaucrat Shaheed Khalid Sherdil who embraced martyrdom in plane crash last Friday.\nGovernor Punjab Sarwar condoled with the bereaved family and offered Fateha for the departed soul.\nSarwar hailed the services of the shaheed civil servant as the CEO Urban Unit, adding that Khalid Sherdil not only provided profound assistance to the government in fighting coronavirus by augmenting institutional capacity of Urban Unit, but he played vital role in improving functioning of many other government institutions.\nPunjab Governor Chaudhry Mohammad Sarwar said the government was conducting free and fair investigation of crash, adding that the true reason of the plane crash will be made public.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:02.418Z"
}
