{
  "title": "PIA’s plan crash inquiry report to be made public: PM",
  "link": "https://www.app.com.pk/national/pias-plan-crash-inquiry-report-to-be-made-public-pm/",
  "date_published": "2020-05-28T09:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP):Prime Minister Imran Khan on Thursday said all facts about the Pakistan International Airlines (PIA) plane crash in Karachi would be made public.\nChairing a high-level meeting, he directed the authorities concerned to do their best for a thorough probe into the incident and also ordered making public the inquiry reports of all the plane crash incidents occurred in the past so that the people could know facts about them.\nThe prime minister also directed for provision of all possible facilities and compensation to the families of martyrs, besides preparing a compensation package for all those whose houses or assets were damaged due to the crash.\nImran Khan said for making the air travel safe, the process of reforms in the Civil Aviation Authority, PIA, related departments and the things related to air travel should be fast-tracked\nThe prime minister was given a detailed briefing about the plane crash investigations, and hiring the services of local and foreign experts for the purpose.\nExpressing deep grief over the loss of precious human lives in the plane crash incident and sympathy with their bereaved families, he said it was a great tragedy for the nation on the occasion of Eid ul Fitr.\nHe said there was no substitute to a human life, however, the government shared the grief of the affected families, assuring that all the requirements of justice would be fulfilled.\nThe meeting was attended by Minister for Aviation Ghulam Sarwar Khan, Information Minister Shibli Faraz, Special Assistant to the PM on Information Lt. Gen.(retd) Asim Saleem Bajwa, Special Assistant Dr Shahbaz Gill, Secretary Aviation Division Hassan Nasir Jami, PIA Chief Executive Officer Air Marshal Arshad Mahmood Malik and senior officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:15:58.705Z"
}
