{
  "title": "Govt strategy on COVID-19 moving in the right direction: Shibli Faraz",
  "link": "https://www.app.com.pk/national/govt-strategy-on-covid-19-moving-in-the-right-direction-shibli-faraz/",
  "date_published": "2020-05-28T06:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP):Minister for Information and Broadcasting Senator Shibli Faraz said on\nThursday the government has tackled COVID-19 in an organized manner\nand its strategy against pandemic was moving in the right direction.\nAddressing a press conference here, the minister said soon Pakistan would\ncome out of the difficult period under the dynamic leadership of Prime Minister\nImran Khan.\nHe said the government was reviewing the situation emerging out of the\ncoronavirus on daily basis and taking steps to deal it effectively.\nShibli said that Prime Minister Imran Khan was very clear to protect both lives\nand livelihood as the continued lockdown would have badly affected\ndaily wage workers.\nThe model of complete lockdown had failed almost all\nover the world and there was no plan under consideration to adopt it, he added.\nHe said that the masses will have to show responsibility\nand adopt social distancing by following Standard Operating Procedures\n(SOPs). The situation in Pakistan was far better than\nneighbouring India and many other countries as death rate here was far\nless than other countries, he added.\nThe minister said Yaum eTakbeer was the day to remember 1998 nuclear\nblasts but it was also a day for the renewal of pledge that with\ncommitment and determination the nation could achieve any\ngoal. He said that Pakistan believes in peaceful coexistence in the\nregion but its desire for peace should not be considered its weakness.\nHe said that when Pakistan Muslim League-Nawaz came to power in 2013,\nits finance minister Ishaq Dar, who escaped from the country in\nconnivance with Shahid Khaqan Abassi in 2018, issued Rs 484 billion\nto Independent Power Producers and these details have been unearthed\nby Senator Mohsin Aziz and Auditor General has also pointed out all\nthe irregularities with facts and figures.\nHe said that track record of PML-N showed that they do not believe in\n“scoring singles”, rather they want to “hit sixes” and Dar hit a six\nby issuing Rs 484 billion through single cheque.\nShibli Faraz said that Shahid Khaqan Abbasi as loyal worker of Sharif\nfamily patronized the sugar mafia which was led by Salman Shahbaz, the\nson of Shahbaz Sharif . He said while giving subsidy,\nvarious steps were neglected to benefit the Sharif family. The\nsubsidy in itself was not a bad thing but its benefit should go to\nthe farmers and not sugar barons, he remarked.\nAbout the locust attack, he said that this phenomenon had appeared\nafter 27 years but the government had made full preparations to tackle\nit. He said that National Locust Control Cell was being established to\nface this challenge. He said that presently locust was present in five\ndivisions of Punjab and some areas of Baluchistan and Dera Ismail Khan\nin KPK. Shibli Faraz said that there was a threat of another locust\nattack on Pakistan from Africa in early July. However he said that\npreparations were done to tackle the situation as ample pesticides\nwere available and six planes were available for fighting locust.\nThree more planes would be available by July 15, he said. The government\nwas ready to meet the situation if any flood emergency situation arises during\nmonsoon .\nReplying to questions, the minister dispelled the\nimpression that the federal government had a discriminatory policy\ntowards Sindh and said that Prime Minister Imran Khan always\nthought of and cared about entire Pakistan.\nThe minister said it was unfortunate that PPP played a negative role with regards to\nCOVID-19, and now in relation to locus attack. He alleged that Sindh\ngovernment was politicizing the locust crisis, in order to defame the\nfederal government and to cover up its own failures. Shibli Faraz said\nthat PTI cannot ignore Sindh as it would form the government in the\nprovince after next general election, as PPP had been confined\nto Larkana.\nChief Minister Murad Ali Shah, he said, used to attend the NCOC\nmeetings and agreed to the decisions but later indulged in\npolitical point scoring as their policy on locust had failed, like\ncoronavirus.\nHe said that people of Sindh were brothers and close to\nthe heart of PTI leadership which had won 14 seats from Karachi.\nAbout the government’s tough stand on the sugar mafia and\nits allies the minister said that the allies would remain part of the government\nGod willing and it would complete its tenure. However, he added there would be\nno compromise on principles, which was not the case in the past and\nand this pushed back the country as well as those political parties.\nFor Imran Khan, he said, it was more important to see what was in the\nbest interest of the country and people, adding to take care\nof the daily wagers, labourers and small shopkeepers or those who work\nin private firms were his priority.\nAbout PML-N and its leadership claiming credit of making\ncountry a nuclear power, he said that he would like Energy Minister Omar Ayub\nto place facts about the matter; how were decisions made and what was\ntheir (PML-N) position thereon. He pointed out that a lot had been\nsaid and written and Gohar Ayub, Omar Ayub’s father was also part of\nthe then government and his book was also in the market.\nShibli said the history was witness to it, what and how it\nhappened. He said that Zulfikar Ali Bhutto had a great role in\nmaking Pakistan a nuclear power and Ghulam Ishaq Khan as President\nwithstood pressures and took things forward. He said that Sharifs claim\nin making Pakistan a nuclear power was like eating a baked cake. He\nquestioned, “Should we give the credit to those who prepared the cake or those\nwho ate it?.”\nTo another question he said those who were doing politics on coronavirus and locust\nattack were in fact trying to hide their mega corruption cases.",
  "retrievedAt": "2025-08-11T19:15:59.826Z"
}
