{
  "title": "FM says UAE steadfastly stood by Pakistan in times of need",
  "link": "https://www.app.com.pk/national/fm-says-uae-steadfastly-stood-by-pakistan-in-times-of-need/",
  "date_published": "2021-01-20T11:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP): Foreign Minister Shah Mahmood Qureshi, terming Pakistan’s relationship with the United Arab Emirates (UAE) as “special” said the Emirati leadership steadfastly stood by Pakistan in its times of need.\nIn a meeting with UAE’s ambassador Hamad Obaid Ibrahim Salem Al Zaabi here at the Ministry of Foreign Affairs, the Foreign Minister said Pakistan always accorded paramount importance to its long-standing fraternal ties with the UAE.\nQureshi said warm sentiments between the two leaderships and strong people-to-people linkages were rooted in shared faith, values and culture.\nHe paid rich tribute to late Sheikh Zayed bin Sultan Al Nahyan, who he said contributed immensely towards strengthening bilateral ties.\nRecalling his successful visit to the UAE in December last year, Foreign Minister Qureshi underscored the importance of frequent high-level visits from both sides, which served to continually provide impetus towards deepening and diversifying bilateral relations.\nHe looked forward to enhanced high-level engagements with the UAE, as soon as the global health situation improved.\nThe Foreign Minister appreciated the UAE’s support for Pakistan’s Expo pavilion to be held in 2021, covering an approximate area of 3,500 sq. meters. The pavilion will exhibit Pakistan’s culture, investment opportunities and tourism potential in the largest exhibition ever staged in the Arab world, with 190 countries and 25 million people projected to participate.\nThe UAE Ambassador hailed the strong UAE-Pakistan relations and pledged to work towards further strengthening and diversifying them in all sectors for the benefit of the two countries and their peoples.\nHe acknowledged the positive contribution made by Pakistani diaspora towards the progress and development of the UAE.\nAmbassador Al Zaabi reaffirmed the UAE’s desire to develop bilateral ties with Pakistan on the basis of mutual respect, understanding, and common interests.\nThe UAE is Pakistan’s largest trading partner in the Middle East. Under the patronage of His Highness Sheikh Mohamed bin Zayed Al Nahyan, (UAE-Pakistan Assistance Programme), valuable support was provided to Pakistan in the areas of education, health, energy and infrastructure development.\nThe UAE is home to more than 1.6 million Pakistanis – the second largest Pakistani expatriates’ community abroad.",
  "retrievedAt": "2025-08-11T20:15:37.358Z"
}
