{
  "title": "COVID19 claims 13 lives, infects 1,162 others: CM Sindh",
  "link": "https://www.app.com.pk/national/covid19-claims-13-lives-infects-1162-others-cm-sindh/",
  "date_published": "2021-01-20T05:24:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jan 20 (APP): As many as 13 more patients of COVID-19 died overnight lifting the death toll to 3,843 while 1,162 new cases diagnosed when 13,632 tests were conducted.\nIn a statement issued here from CM House on Wednesday, he said that 13 more patients of coronavirus died overnight lifting the death toll to 3,843 that constituted 1.6 percent death rate.\nSyed Murad Ali Shah said that 13,632 samples were tested which diagnosed 1,162 cases that constituted 8.5 percent current detection rate.\nHe said that so far 2,612,503 tests have been conducted against which 238,470 cases emerged, of them 90.6 percent or 216,145 patients have recovered, including 1044 overnight.\nThe CM Sindh said that currently 18,482 patients were under treatment, of them 17,519 were in home isolation, 12 at isolation centers and 951 at different hospitals.\nHe said that the condition of 859 patients was stated to be critical, including 85 shifted to ventilators.\nAccording to the statement, out of 1162 new cases, 973 have been detected from Karachi, including 449 from East, 285 South, 86 Central, 54 each from Korangi and Malir and 45 West.\nHyderabad has 66 cases, Thatta 20, Umerkot 14, Tando allahayar 13, Matiari 10, Dadu and Sujawal seven each, Badin and Ghotki four each, Larkana, Naushehroferoze and Shaheed Benazirabad two each and Sanghar one.\nThe CM Sindh urged people of the province to stay safe by the follow the COVID19 standard operating procedures (SOPs).\nMeanwhile, the Sindh Chief Minister has expressed profound grief over the sad demise of wife of Saeed Mangnijo, the provincial secretary Services.\nThe chief minister prayed the Almighty to rest the departed soul in eternal peace and grant courage to the aggrieved family.",
  "retrievedAt": "2025-08-11T20:15:42.733Z"
}
