{
  "title": "FM Qureshi for deeper Pak-EU engagement in economic, cultural diplomacy",
  "link": "https://www.app.com.pk/national/fm-qureshi-for-deeper-pak-eu-engagement-in-economic-cultural-diplomacy/",
  "date_published": "2021-01-20T17:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi on Wednesday stressing the importance of economic and cultural diplomacy, called for deeper engagement between Pakistan and the European Union in those spheres.\nThe foreign minister expressed these views during a working luncheon he hosted for the EU ambassadors here at the Ministry of Foreign Affairs.\nIt was the second such luncheon hosted by the foreign minister, which provided an opportunity to both sides to share their perspectives and plans to carry forward the relationship.\nQureshi welcomed the ambassadors and stated that Pakistan greatly valued its relations with the European Union, which were based on shared values and common objectives of peace, prosperity and development.\nThe Pakistan-EU relationship has strengthened steadily over the years and was pursued through sound institutional mechanisms and dialogue processes.\nThe two sides elevated their relationship by signing the Strategic Engagement Plan (SEP) in June 2019. SEP is a forward-looking and comprehensive framework of cooperation in diverse areas of mutual interest.\nThe foreign finister highlighted that the ‘smart’ lockdown strategy of the government to save lives and secure livelihoods had turned out to be successful and also led to an increase in economic activity in the country, including exports.\nHe stressed that the global community must come together to combat the virus and should realize that nobody is safe till everyone is safe.\nForeign Minister Qureshi expressed satisfaction at the trade and investment relations between Pakistan and the European Union.\nHe also appreciated the continuation of GSP Plus status to Pakistan. He highlighted the positive outlook of Pakistan’s economy.\nThe growing economic trajectory coupled with extensive natural resources offered huge opportunities for enhanced trade, investment, and tourism, he added.\nThe foreign minister also briefed the EU ambassadors regarding regional situation. He highlighted the grave human rights situation in the Indian Illegally Occupied Jammu & Kashmir (IIOJK) and underscored the importance of peaceful solution of the Jammu & Kashmir dispute in accordance with the relevant UN resolutions.\nThe foreign minister dilated upon Pakistan’s positive contributions to the Afghan peace process and facilitative role in advancing the cause of peace, stability and prosperity in Afghanistan, region and beyond.\nThe EU ambassadors appreciated the initiative which provided an opportunity for an in-depth exchange of views on areas of mutual interest.\nThe importance of closer engagement on Pakistan-EU relations and regional and international issues was underscored.",
  "retrievedAt": "2025-08-11T20:15:31.687Z"
}
