{
  "title": "PM for open hearing of political parties’ foreign funding case",
  "link": "https://www.app.com.pk/national/pm-for-open-hearing-of-political-parties-foreign-funding-case/",
  "date_published": "2021-01-20T17:38:00.000Z",
  "source": "APP",
  "content": "WANA, Jan 20 (APP):Prime Minister Imran Khan on Wednesday called for open hearing of the foreign funding case of all political parties, including Pakistan Tehreek-e-Insaaf (PTI), Pakistan Muslim League-Nawaz (PML-N), Pakistan Peoples Party (PPP) and Jamiat-e-UIema Islam-F (JUI-F) for clarity of the issue among the masses.\n“I ask for open hearing or even on live television of the foreign funding case with all parties, including JUI-F of Fazlur Rehman, PPP, PML-N and PTI sitting there…,” he said while talking to media persons here at the Cadet College Wana.\nThe prime minister said the PTI was the pioneer of political fund-raising campaigns and had all the records of fund donations, including the names of 40,000 people.\nHe regretted that how the funds collected from the oversees Pakistanis, whose remittances were playing a major role in running the country, could be described as foreign funding.\nThe prime minister said he was thankful of the opposition for raising the issue of foreign funding as it would help clear the situation and the nation would know the reality of how the funds were raised.\nThe opposition parties also knew the facts about the PTI’s fund raising as well as their sources of foreign funding, he added.\nAbout the Pakistan Democratic Movement’s (PDM) gathering outside the Election Commission of Pakistan on Tuesday, the prime minister remarked if he would have known the number of people attracted by 11 political parties he would have asked the PTI workers to join them at the show.\nThe PDM parties’ movement, he said, was a drama of to get an NRO (National Reconciliation Ordinance) through blackmailing tactics. Maulana Fazlur Rehman, who always remained in power and had no answer of how he made billions of rupees properties, was just trying to regain power, he remarked.\nTo a question, the prime minister referred to the economic hardships his government inherited such as the huge US $ 20 billion current account deficit and US $ 40 billion trade gaps, which pushed devaluation of rupee and caused increase in prices of essential imported commodities, including pulses, ghee, petroleum products and resultant hike in energy prices.\nHe also mentioned 18th Amendment of the Constitution, which required the Federal Government to consult the provincial governments before taking major decisions of public importance.\nThe prime minister, however, added that with the grace of Allah Almighty the situation was improving and despite the COVID-19 pandemic, the country’s economic indicators were showing positive trends, including enhanced exports, positive current account in 17 years, Large Scale Manufacturing (LSM) sector growing and textile industry booming.\nTo a question, he said with 70% poverty level the areas of South Waziristan and Balochistan were left behind due to various reasons and now the government was making all-out efforts to ensure their uplift.",
  "retrievedAt": "2025-08-11T20:15:31.658Z"
}
