{
  "title": "Jodhpur killings: ‘Pakistan not to inch back in seeking justice for 11 Hindu nationals’",
  "link": "https://www.app.com.pk/national/pakistan-to-raise-issue-of-death-of-its-hindu-citizens-in-india-at-all-levels-qureshi/",
  "date_published": "2021-01-20T11:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP): Foreign Minister Shah Mehmood Qureshi Wednesday said India was consistently denying investigation into the mysterious killing of 11 Pakistani Hindu nationals and vowed that Pakistan would raise the matter at all international forums.\nTalking to the members of the Hindu community led by MNA Ramesh Kumar outside the Foreign Office, Qureshi assured them that Pakistan would not inch back till getting justice for the bereaved family.\nEleven members of a Pakistani Hindu family were killed under mysterious circumstances during their visit to the Jodhpur area of Rajasthan in India. The daughter of the head of family had held the Indian intelligence agency RAW responsible for the heinous murders.\nThe Foreign Minister said doubts were being created due to the dodgy responses by India as it was not willing to share any information.\n“But I assure my Hindu community that Pakistan stands by them and will raise the issue at every international fora,” he said, adding that Pakistan High Commission in New Delhi was also actively pursuing the matter.\nQureshi said the government of Pakistan had high respect for human life and recalled how the Supreme Court immediately reacted to a recent attack at a Hindu place of worship. He said the government immediately took action and all the culprits were arrested.\nHe said the Hindu community needed to rest assured that the government would pursue the genuine demand of the community.\nHe said India had been sponsoring terrorism in Pakistan and said it not only came to the fore with the arrest of the Kalbhushan Jhadev and the recent disclosures by the EU DisInfo Lab which showed how the fake media, NGOs and even parliamentarians were being used against Pakistan.\n“The real face of India stands exposed,” Qureshi said, as he mentioned that India took the lives of its own 40 military personnel in the Pulwama attack to shift the blame on Pakistan.\nThe Foreign Minister said the Hindu community was positively contributing to the development and stability of Pakistan.\nA female member of the Hindu community told the Foreign minister that the Indian government had filed a case against some planted people, who were not being persecuted.\nShe said that her family members were running pillar to post to get the remains of their loved ones.\nMNA Ramesh Kumar, also the patron of the Pakistan Hindu Council, said the minorities in Pakistan enjoyed full protection and said India must respect its responsibilities towards the protection of foreign citizens visiting the country.\nHe called for approaching the Human Rights Commission of the United Nations and other international human rights watchdogs on the issue.\nHe urged India to hand over the remains of the killed Hindu nationals at the earliest.\nRamesh Kumar on behalf of the Hindu community presented a formal petition to the Foreign Minister.\nEarlier, the Hindu community held a strong protest outside the Indian High Commission in Islamabad and submitted an application with demands for an investigation into the killings besides sharing details about the First Information Report.",
  "retrievedAt": "2025-08-11T20:15:39.095Z"
}
