{
  "title": "CJP seeks report regarding updated status of implementation of the PRC’s report",
  "link": "https://www.app.com.pk/national/cjp-seeks-report-regarding-updated-status-of-implementation-of-the-prcs-report/",
  "date_published": "2021-02-18T18:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP):Chief Justice/Chairman Law and Justice Commission of Pakistan (LJCP) Gulzar Ahmed on Thursday directed the Secretary Law and Justice Commission of Pakistan to call Secretary Interior and Chief Secretaries of all provinces, to submit report to the Chief Justice regarding updated status of implementation of the Police Reforms Committee’s (PRC’s) Report before the next meeting of PRC.\nA meeting of the Police Reforms Committee (PRC) held here under chairmanship of the\nChief Justice Gulzar Ahmed in the Supreme Court which was attended by the SC judge Justice Umar Ata Bandial, Dr. Muhammad Raheem Awan, Secretary, LJCP, serving IGPs from all four provinces, ICT, GB, AJ&K and former Inspector Generals of Police Afzal Ali Shigri, (Convener), Dr. Shoaib Suddle, Tariq Khosa, Tariq Pervez and Director General of National Police Bureau to discuss on the agenda items i.e. Public Complaints redressal mechanism; Initiatives for implementation of recommendations of the PRC; Implementation status of PRC Report sent to the Federal and Provincial Governments during the year 2019; Measures taken to improve quality of Investigation and result thereof; Presentation of the Book to the Chief Justice and Launching of the Book titled “Handbook of Criminal Investigation in Pakistan”.\nThe Chief Justice in his opening remarks welcomed the participants and opened the meeting for members of PRC for presentation of their input in accordance with the agenda items.\nHe asked all Inspector Generals of Police to timely submit their progress reports regarding Complaint Redressal Cells and District Assessment Committees through Law and Justice Commission of Pakistan for perusal and assessment of their performance. Further, with respect to the transparent system of arrest in cognizable offence, the kind of offence should be assessed from the material, on the basis of which FIR is chalked out and unnecessary arrests in conventional manner should be curtailed.\nTo discourage the practice of treating the simple criminal cases as terrorism cases particularly in\nSindh Province, the principle laid down in the land mark judgment of Supreme Court should be practically followed/observed by all the concerned forums, whereby terrorism is well defined for guidance of investigating agencies as well as prosecution and judiciary.\nHe advised that Police Department needs to improve their capabilities to restore their efficacy, effectiveness and trust in people. For the fair investigation, the capabilities of Investigating Officers should be critically assessed. For this purpose, the chief justice directed the IGPs to verify the degrees and certificates of entire police force starting from the PSP officers.\nHe also directed DG, NPB to maintain the list of competent investigating officers for specialized investigation of different crimes. He observed that the adverse image established in the society due to negative attitude of police officials’ needs consideration, because the positive attitude of police personals is as vital as their competence for protection of rights of common persons and general public. The chief justice said to ensure impartiality of police force and to eliminate undue influence upon Police Department, it is vital that the power of posting and transfers of the Police Officers/officials including PSP’s of every rank should be assigned to the concerned IGPs.\nJustice Umar Ata Bandial emphasized that specialized training of every officer/official for every department is essential. The officers need to be well versed and well trained. There should be complete coordination between all the stakeholders of the Criminal Justice Sector specially between investigation and prosecution departments to eliminate flaws in investigation which would also reduce the acquittal rate, which is presently quite higher due to faulty investigation and other grounds of acquittal as mentioned in the data analysis conducted by LJCP, based on the findings of District Assessment Committees that have been established throughout the country on the directions of PRC with the task to review the cases of acquittal and bail.\nDr. Shoaib Suddle, Former IGP expressed that international practice of certification of IO’s should be followed to enhance the standards of investigation and in case of misconduct IO should be de-certified which itself is a big punishment.\nThe IGP KPK shared that during his tenure in KPK he has penalized 854 delinquent officials for their negligent attitude in performing their official duties and misconduct.\nThe IGP Punjab apprised the Committee that the ban on purchase of vehicles is creating hurdles in purchase of operational vehicles causing inconvenience to the police officers in performing their official duties.\nUpon this the Chief Justice expressed that the ban has only been imposed on the purchase of luxury vehicles not on the operational vehicles. However, the excessive and misuse of official vehicles should be looked into, which is giving bad name to the police department among the general public.\nThe Director General, National Police Bureau suggested that in the light of judgment of Justice Mansoor Ali Shah, Judge Supreme Court of Pakistan amendment may be proposed in Section 510 Cr.P.C. through the Law and Justice Commission of Pakistan.\nThe chief justice said that self-accountability within police department would be beneficial for public at large. In case of any law and order situation the police force should play their pivotal role to every extent so that no other force, other than civil forces is called upon to overcome the situation.\nIn pursuance of the directions of the Chief Justice, and recommendations of the PRC, National Police Bureau complied a national handbook of criminal investigation titled “Handbook of Criminal Investigation in Pakistan” in collaboration with all the Federal and Provincial criminal investigation agencies of Pakistan and the same was jointly reviewed by the National Police Bureau and Law and Justice Commission of Pakistan. After collecting the data of DACs, the LJCP has analyzed the same, on the basis of which LJCP has proposed a Chapter “Major Causes of Acquittal” to be added in the said handbook.\nThe chief justice observed that Handbook needs further improvements. The flaws in investigation and grounds of acquittal should be supported with illustrations. At this juncture Secretary LJCP apprised the chief justice that the task of Urdu translation of the handbook has been undertaken by the Secretariat of LJCP for awareness of all concerned.\nIt was also apprised to the forum that the book will be reviewed on the yearly basis by updating the latest laws and principles laid down in the verdicts delivered by the superior courts. The Handbook was launched during the meeting and also presented to the Chief Justice.",
  "retrievedAt": "2025-08-11T20:22:39.367Z"
}
