{
  "title": "Punjab govt investing in tourism, culture for economic growth",
  "link": "https://www.app.com.pk/culture-heritage/punjab-govt-investing-in-tourism-culture-for-economic-growth/",
  "date_published": "2021-02-18T10:17:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 18 (APP): Tourism plays a vital role in the success of economies through revenue generation, job creation and infrastructure development.\nMany countries in the world have been earning billion of dollars in foreign exchange by strengthening their tourism industry and bolstering their economies.\nA number of countries in America, Europe and Asia continents had fully exploited their potential in tourism earning billions of dollars over the decades.\nUnited States of America (USA) is the market leader in global tourism and earns two trillion dollars revenue annually which is one percent of its GDP while tourism is the back-bone of Maldives’ economy and generates 2.7 billion dollars revenue per annum – 60 percent of its\ngross income. Spain and France are second and third in revenue earned through tourism.\nHowever, the situation had been flimsy in Pakistan where policy makers had failed to harness benefits of rich tourism potential. Pakistan, a country diverse in centuries old heritage and tourism and monumental sites owns picturesque plateaus, scenic planes, deserts and mountains and masterpieces of ancient construction.\nThe country lagged far behind in this race despite its charming woodlands, haunting deserts and mythical mountains and its revenue through tourism is minimal of its GDP.\nThere is ample room to promote tourism industry in Pakistan, in general, and Punjab, in particular. The present  government, under the vision of Prime Minister Imran Khan, has paid attention to the promotion of tourism and provision of facilities to the tourists.\nAll provinces including Punjab, Gilgit Baltistan (GB), Khyber Pakhtunkhwa (KPK) have been doing their best to provide facilities to the tourists. Respective governments are also renovating and beautifying tourist and historic places.\nPrime Minister Imran Khan has recently constituted National Coordination Committee on Tourism to realised the tourism potential of bewitching tourist sites of the country.\nPunjab government, under Chief Minister Sardar Usman Buzdar, has introduced revolutionary initiatives to promote domestic and inbound tourism by luring more and more tourists.\n“Punjab government has formulated a Tourism Policy and established Tourism and Heritage Authority for the first time. This initiative will make Punjab one of the most sought-after tourist destinations in the world,” said Advisor to Chief Minister on Tourism Asif Mehmood.\n“The first task was to define outlines of the tourism department. Previously Lahore Museum worked under provincial culture department while the shrines fell under the ambit of Auqaf”, he said.\n“The PTI government had introduced three amendments in the Department of Tourist Service Law 1976 to streamline tourism services.”\nAsif Mahmood said the government has also revived dormant and abandoned projects of the previous government and under a World Bank (WB) funded US$ 50 million ‘Punjab Tourism for Economic Growth’ project, the Tourism Department had restarted work from January 2020.\n“Many unknown sites have been developed into tourist hubs, eight new districts been chosen to be developed as tourist sites including Kotli Sattian, Koh-e-Suleman, Fort Munro, Khushab, Kala Bagh, Mianwali and Chakwal,” he said.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2021/02/ehsan.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nHe said district Chakwal, with 26 natural lakes, is Lake District of Pakistan. An Amusement Park and Water reservoir were being constructed to make it a tourist attraction as sites of  Nandana, Pind Dadan Khan, Jhelum District were also being renovated Besides constructing a by-pass to divert traffic from Rohtas Fort; the Fort Museum was being revamped and a Jeep Track was being laid at Tilla Jogian, he said.\n“Tourism department will also be launching soon, the state of the art Glamping Pods at various sites to attract tourists.”\nTourism, in the past, had become a slave of the powerful and all state-owned guest houses were out of reach of the tourists. But, Prime Minister Imran Khan and his government as well as Chief Minister Punjab Sardar Usman Buzdar had freed these guest houses from the\nred-tapism and today the public has access to 179 rest houses in different cities at nominal rates.\nProvincial Secretary Tourism, Sports and Youth Affairs Ihsan Bhutta said special attention was being paid to the historic sites in the provincial metropolis as illumination work had started at 13 different cultural heritage sites including Shalamar Gardens, Jahangir’s Tomb,\nNoor Jehan’s tomb, Harrappa and Taxila Museums and Mughal Gardens. “New roads were being built to promote religious tourism in Nankana Sahib, Sacha Sauda, Kot Mithan and Maryam Abad.”\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2021/02/WhatsApp-Video-2021-02-11-at-6.59.53-PM-1.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nBhutta said Queen of Hills, Murree had become overcrowded over the years and roads were being built to develop Kotli Sattian and nearby places into tourist sites. Development work has also been started to develop Soon valley, Khushab into a tourist spot.\nHe said in order to ensure ease for the tourists, Punjab Tourism Development Corporation (TDCP) assets were being leased out to private bidders to attract more investment.\nComputerized ticketing is being introduced to save income while more facilities are provided to the participants of the Cholistan Jeep rally by the TDCP.\n“Participation of women in the jeep rally in recent years was a good omen for our tourism industry.”\nThe Secretary said the tourism department has uploaded videos, photos and related information about tourist sites on the department’s web-site and now people may design their online tour plan from any part of the world.\n“Hotel, resorts and restaurants could also be booked through an ‘app’ developed by the Punjab Information Technology Board (PITB).\nWith these dedicated efforts for the uplift of tourism in the province, it is hoped more and more tourists will visit religious, cultural and historical sites from Murree to Cholistan and Fort Munro due to a comprehensive tourism strategy of the government which will\nresult in strengthening the national economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T20:22:57.844Z"
}
