{
  "title": "AJK President terms envoys’ Srinagar visit an attempt to deceive world of IIOJK bleak picture",
  "link": "https://www.app.com.pk/national/ajk-president-terms-envoys-srinagar-visit-an-attempt-to-deceive-world-of-iiojk-bleak-picture/",
  "date_published": "2021-02-18T13:19:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Feb 18 (APP):Denouncing India’s stage-managed visit of a group of Delhi based envoys to Indian Illegally Occupied Jammu and Kashmir (IIOJ&K), AJK President, Sardar Masood Khan said that Kashmir was burning and India had vainly tried to project an image of “normalcy” in the territory.\n“The visit is a farce because the envoys know the bitter truth about the occupied valley. They went there out of sheer courtesy. Their presence in selected and ‘sanitised locations’ of Srinagar will not underwrite the occupation authority’s crime against humanity being committed with impunity in the territory”, said Masood Khan, in a statement issued by his office on Thursday.\nThe President said that in the past such disingenuous public relations exercises have failed to gain currency for India’s false narrative on Kashmir. This visit too is a flop”, he said and added that no access was given to common Kashmiris to meet the visiting envoys.\n“It was totally stage-managed event. Sufferers barricaded and silenced. Envoys are not stupid; they knew what was being hidden under a thick pall of tyranny,” he said.\n“Empty streets, shuttered shops, boarded up wounds of a captive people, a territory under siege, parents waiting for their sons’ dead bodies- that’s all the “normalcy” the occupation authorities showed to the envoys. They witnessed silence of lurking death,” Khan said.\nIf India is so confident, the AJK President said, why it doesn’t receive a delegation of the Human Rights Council as recommended by the High Commissioner of the UN Human Rights Council in its reports of 2018 and 2019.\nEarlier in an interview to a national English periodical, the AJK President highlighted the enormity of the crisis in Kashmir and said that some 14 million people of Indian Occupied Jammu and Kashmir have been totally disenfranchised and they are at the mercy of their captors.\nThe occupiers’ hope that the hostage population would at least develop Stockholm Syndrome is not materializing to their utter frustration. Hence, their recipe is more brutal oppression.\nEquating the current Indian rulers with the rulers of Nazi Germany, President Masood said that in the last century, Adolf Hitler thought that he was above the law. He introduced Nuremberg Laws to target, persecute, expel and kill Jews, Poles and Romanis. He (Hitler) set up concentration camps to eliminate them.\nThe BJP-RSS regime in India is replicating that vicious model in IIOJ&K and India itself, and threatens to export it to its neighbourhood to establish Hindu supremacy in South Asia and beyond, he said and maintained that the world is busy appeasing India.\nHe said some powers are underwriting India’s crimes by not calling out the regime or by empowering India by making it their preferred destination for investments and trade.\nThe Indian fascism – Hindutva – is threatening the stability of South Asia and extended neighbourhood, President Masood said and added that the toxic legacy will ultimately affect all nations and all continents of the world. There is no room for complacency. If a big nation like India becomes the biggest rogue and bully in the world, seeking exceptionalism, what impact would that have on smaller nations, he questioned.\nBut unfortunately, the authors and custodians of the world order have started either backtracking from their commitments to protect human rights or soft-pedalling them because of political expediency leading to glaring double standards, President Masood regretted.",
  "retrievedAt": "2025-08-11T20:22:44.351Z"
}
