{
  "title": "Imran to be held accountable as threats to institutions doom to fail: Uzma Bukhari",
  "link": "https://www.app.com.pk/national/imran-to-be-held-accountable-as-threats-to-institutions-doom-to-fail-uzma-bukhari/",
  "date_published": "2022-08-07T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): PTI Chairman Imran Khan and his accomplices would have to surrender themselves before the law of the land as their threats to institutions were doomed to fail.\nUzma Bukhari, a senior leader of Pakistan Muslim League Nawaz (PML-N) said this while speaking to media on Sunday.\nShe said Imran Khan should be held accountable for embezzling donation’s funds.\nShe also urged the government to take immediate action as Pakistani political parties were not ready to tolerate Imran Khan, who devoured the money received from prohibited sources and used that money for destabilising the country, sabotaging China-Pakistan Economic Corridor (CPEC) project and harming Kashmir cause.\nShe said Imran had also deceived overseas Pakistanis as he was caught red handed in utilising donation money for creating chaos and anarchy in the country.\n“Imran must be ashamed of himself when his provincial government of Khyber Pakhtunkhwa accepted American aid, including 34 keys of donated vehicles from the US ambassador in Pakistan the other day.\nLikewise, a burn centre and over 20 more projects were being executed by the US government in PTI ruled province.\nSeveral new projects were also being launched in the province in collaboration with the US.\n“This has exposed Imran Khan’s so called anti American narrative, who feels no qualm in saying “Absolutely Not” to receiving dollars by brazenly ignoring his misleading regime change narrative,” she added,\nShe said despite extraneous efforts, Imran had failed to bring proof against PML-N supremo Nawaz Sharif, Prime Minister Shehbaz Sharif and PMLN’s Vice President Maryam Nawaz.\nThrice elected premier Nawaz Sharif was disqualified on clumsy grounds to pave way for Imran who was launched to lead the country under a well orchestrated conspiracy.",
  "retrievedAt": "2025-08-11T15:21:19.756Z"
}
