{
  "title": "Another round of Khalistan referendum held in Luton, Leeds",
  "link": "https://www.app.com.pk/national/another-round-of-khalistan-referendum-held-in-luton-leeds/",
  "date_published": "2022-01-09T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 9 (APP): Another round of Khalistan referendum was held on Sunday in Luton and Leeds, United Kingdom.\nThe Sikh community cast the ballot in the referendum from 10 am to 5 pm at Guru Nanak Gurdwada in Luton and Sikh Temple Chapel Town Road in Leeds.\nWith 20,000 votes in favour of Khalistan state cast by the British Sikh community at four venues on 31 Dec 21, overall figure of votes cast in the Khalistan referendum crossed the 200,000 mark.\nAccording to SFJ General Counsel Gurpatwant Singh Pannun, Sikhs in Britain have spoken clearly through voting that they want liberation of Punjab from Indian occupation. Gurpatwant Singh Pannun said that Indian government had gone out of its way to target the Sikh leaders and especially those associated with Khalistan referendum and Khalistan movement but vindictive actions would fail. Next phase of voting is being held on 9 January 2022 in Leads and Luton.\nThe referendum kick started from London on 31 October, SFJ’s innovative Khalistan referendum sought votes from the Sikh diaspora on the question of the secession of Punjab and other Sikh majority areas from India.\nIndia has tried to portray Sikhs as terrorists but the whole world witnesses that they are peaceful and democratic people who believe in ballots, not bullets, and that’s what frightens India.” Huge participation of Sikhs in a referendum for their homeland has unnerved India, India tried hard to stop the Sikh referendum exercise in the UK.\nKhalistan referendum has sent a strong message to Indian establishment to end discrimination against Sikhs and India should be prepared to give Sikhs their birthright of freedom. Findings of Khalistan referendum would be shared with United Nations and international bodies to create wider consensus.",
  "retrievedAt": "2025-08-11T14:03:39.726Z"
}
