{
  "title": "Socio-economic mainstreaming of women in Pakistan, Afghanistan is crucial; Dr. Sania",
  "link": "https://www.app.com.pk/national/socio-economic-mainstreaming-of-pak-afghan-women-is-crucial/",
  "date_published": "2021-12-07T09:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 7 (APP): Special Assistant to the prime Minister on Poverty Alleviation and Social Protection, Senator Dr. Sania Nishtar Tuesday stressed the importance of socio-economic mainstreaming women in both Pakistan and Afghanistan.\nShe was invited to keynote the inaugural session of the Afghanistan-Pakistan Bilateral Dialogue on “Women for Peace Initiative – Road to an inclusive future” organized by a local think tank, the Regional Peace Institute (RPI) in Islamabad.\nDr. Sania was joined by SAPM Raoof Hasan, who is also the CEO of RPI, Per Albert Ilsaas, Ambassador of Norway, Sharmeela Rassool, UN Women Country Representative for Pakistan and distinguished women delegates from Afghanistan.\nKeynoting the session, Dr. Sania reiterated Pakistan’s resolve to empower underprivileged women and said, “More than three-quarters of the entire Ehsaas’ benefits go to women and girls under the Ehsaas 50%+ benefits policy for women and girls.”\n“Also, gender data disaggregation and its use for accountability is cardinal to the programme review, monitoring and reporting”, she said.\nShe further highlighted that all the twelve million beneficiaries of the Ehsaas cash this year are women.\n“In addition to the Ehsaas Education Stipends, Ehsaas Nashonuma, which provides specialised nutritional food and cash transfers to mothers and their children under two to prevent stunting also has a higher stipend policy for the girl child. Under Ehsaas’ Undergraduate Scholarships, over 142,000 need and merit-based scholarships have been given in two years, with strictly half of all scholarships reserved for girls.”\n“Similarly, Ehsaas interest free loans for poverty graduation aims to impact 14.7 million vulnerable people in four years with half of them women.”\n“Enabling 1.4 million individuals to come out of shackles of poverty, 60% of small livelihood assets have also been allocated for women under the 4-year Ehsaas Amdan programme”, she further added.\nThe distinguished women delegates of Afghanistan affirmed to cooperate on various aspects of common aspirations in poverty reduction and women empowerment.\nThe two-day dialogue includes working sessions around education for women, governance and development, and legislative processes and procedures.\nRPI is focused on peace and stability through working for regional peace, development and the elimination of terrorism and extremism in South Asia. The Institute is an outcome of intense dialogues and discussions that took place among research, diplomats, academics, and journalists, in South Asia.",
  "retrievedAt": "2025-08-11T21:41:50.620Z"
}
