{
  "title": "Pakistan proposes Norway establishment of JEC, initiation of talks on investment treaty",
  "link": "https://www.app.com.pk/national/pakistan-proposes-norway-establishment-of-jec-initiation-of-talks-on-investment-treaty/",
  "date_published": "2021-12-07T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 7 (APP): Pakistan has proposed Norway the establishment a Joint Economic Commission (JEC) as well as the initiation of negotiations on a bilateral investment treaty between the two countries.The proposal was given during the 11th Round of Pakistan-Norway Bilateral Political Consultations (BPC) held in Oslo on Monday.\nThe Pakistan side was led by Additional Secretary (Europe), Dr. Muhammad Tariq, while the Norwegian delegation was headed by  Vebjørn Dysvik, Director General, Department for Regional Affairs, Ministry of Foreign Affairs.\nAmbassador Babar Amin also participated in the meeting, a press release issued here by the Ministry of Foreign Affairs on Tuesday said.The two sides reviewed the entire spectrum of bilateral relations and discussed opportunities for further cooperation, especially in the spheres of trade and investment, energy, education, parliamentary exchanges, health and global pandemics, culture and enhancement of people-to-people contacts.\nAdditional Secretary (Europe) apprised the Norwegian side of the government’s shift from geopolitics to geo-economics.\nHe invited Norwegian companies to benefit from Pakistan’s investor friendly policies, particularly in clean and green energy, climate change, and agriculture.\nThe Norwegian side was apprised of efforts being undertaken by Pakistan for bringing peace and stability to Afghanistan.\nHe emphasized that the international community should assist the Afghan people in averting a humanitarian crisis.\nThe Norwegian side appreciated Pakistan’s assistance in the evacuation of Norwegian nationals from Afghanistan and expressed gratitude for acceding to Norway’s request for allowing additional diplomats to be based in Islamabad to look after the Afghan affairs.Dr. Tariq briefed his Norwegian counterpart on the atrocities being committed by Indian security forces in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and the Indian government’s unilateral actions to alter its demographic structure.\nHe hoped that Norway would use its good offices to put pressure on India to reverse the illegitimate Indian actions and take appropriate steps to stop the human rights violations in IIOJK.The two delegations expressed satisfaction with their cooperation at international fora including the United Nations, and resolved to continue their mutual support.Additional Secretary also called on Henrik Thune, State Secretary of the Norwegian Ministry of Foreign Affairs.\nThey discussed matters of mutual interest and cooperation on regional and international issues. The Additional Secretary highlighted atrocities perpetrated by Indian security forces in IIOJK.Dr. Tariq also called on Ms. Ine Eriksen Søreide, President of Norwegian Parliament’s Foreign Affairs and Defence Committee.\nThe Additional Secretary underlined the importance of enhanced bilateral and parliamentary cooperation. He shared Pakistan’s perspective on Afghanistan and the human rights situation in IIOJK.Dr. Tariq invited Mr. Thune and Ms. Søreide to visit Pakistan.Pakistan and Norway share longstanding, cooperative relations, both at bilateral and multilateral levels.\nA sizable Pakistani community resides in Norway and positively contributes to its society. Norway is one of the leading investors in Pakistan.The next round of the Pakistan-Norway BPC will be held in Islamabad on mutually agreed dates.",
  "retrievedAt": "2025-08-11T21:41:48.382Z"
}
