{
  "title": "PR to make procurement process transparent, efficient: Swati",
  "link": "https://www.app.com.pk/national/pr-to-make-procurement-process-transparent/",
  "date_published": "2021-12-07T09:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 7 (APP): Minister for Railways, Azam Khan Swati Tuesday said that Pakistan Railways has started work to make the procurement process transparent, efficient, and easy as per the vision of Prime Minister Imran Khan for good governance and digital Pakistan.\nAddressing the Memorandum of Understanding (MoU) ceremony held between Pakistan Railways and Tejari, the minister said the government was focusing on accountability, transparency, and providing relief to the people and has made practical progress towards e-governance in this regard.\nThe minister launched a pilot project of the E-Procurement system in Pakistan Railways during the ceremony attended by Secretary Railways, Habib ur Rehman, General Manager, Tejari, Syed Usman Hassan, and other officials.\nAzam Swati said the launch of e-procurement by Pakistan Railways was encouraging as billions of rupees were involved in different projects and routine purchases.\nThe minister said that Pakistan Railways would also take further steps to improve financial and administrative affairs in the future.\nAzam Swati said the contract between Pakistan Railways and Tejari would be helpful in ensuring transparency in awarding of contracts.\nAddressing the ceremony, Secretary Pakistan Railways, Habib ur Rehman Gilani said that the department has developed a roadmap that would not only make the procurement process transparent but also help in saving time.\nHe said the performance would be reviewed on the basis of the use of technology and in this regard practical steps would be taken to utilize the latest technology in the affairs of Pakistan Railways.\nWith the successful launch of the pilot project on e-procurement, he said more public sector entities would be encouraged to follow the suit.\n“Make your procurement budget transparent and work harder to achieve 100 percent audit trail as per Prime Minister Imran Khan,” he urged.\nSpeaking on the occasion, Syed Usman Hassan said that Tejari is a pioneer in e-Procurement Solutions which is serving clients in the Public and Private Sector such as National Highway Authority (NHA), Pakistan Petroleum Limited (PPL), United Bank Limited (UBL), Punjab Skills Development Fund (PSDF), Orient Petroleum Limited (OPL), Pearl Continental and Marriot Hotels.",
  "retrievedAt": "2025-08-11T21:41:51.488Z"
}
