{
  "title": "Govt devises concrete strategy to ensure affordable energy for all by 2030",
  "link": "https://www.app.com.pk/national/govt-devises-concrete-strategy-to-ensure-affordable-energy-for-all-by-2030/",
  "date_published": "2021-08-26T13:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):The incumbent government devised a concrete strategy to ensure access to affordable, reliable, sustainable and indigenous electricity for all by 2030.\nAccording to the three-year performance report of the government released on Thursday, the incumbent government inherited multiple challenges in power sector including system constraints, fast rising circular debt, inefficiencies driven by corruption, theft, growing burden of tariff non-rationalization and lack of policy decisions leading towards shattering of confidence of foreign investors.\nUnder vision of the government, the most efficient and consumer centric power generation, transmission and distribution system was being developed.\nRenewable Energy share in total energy mix was being enhanced to 20 per cent by 2025 and 30 per cent by 2030.\nSimilarly, the strategy aimed at reducing line losses to the permissible limit, continue the ongoing country-wide campaign against theft of electricity and recovery campaign against current and dead defaulters.\nCurrently, Private Power Infrastructure Board (PPIB) is handling portfolio of 22 multiple fuel based (Hydro, Thar, coal, imported coal, R-LNG) IPPs with cumulative capacity of 12,028 MW worth multi billion dollars.\nThese projects were at different stages of implementation which included six Thar Coal based Projects (4,290 MW), 14 Hydro based Projects (6,175 MW), one each Imported Coal (300 MW) and RLNG project (1,263 MW).\nSimilarly, for power evacuation from China Pakistan Energy Corridor power projects and strengthening transmission line Matiari-Lahore Transmission project (having 4,000 MW Load) has already been completed.\nDuring 2020-2021, Alternative Energy Development Board (AEDB) facilitated four solar power projects of 250 MW cumulative capacity to achieve Financial Closing of the projects. These solar power projects were now under construction.\nAn Anti-Theft Campaign was launched on the directions of the Prime Minister since October, 2018 across Pakistan with main slogan of zero tolerance for over billing and zero tolerance for corruption.\nAs per latest data, a total of 102,823 First Information Reports have been registered while 13,515 persons involved in theft have been arrested. An amount to the tune of Rs. 5295.21 million has been recovered from the anti-theft campaign.\nMassive system upgradation has resulted in transmitting 24200 MW record deliveries which has been a prime factor for uninterrupted electricity supply to the consumers across the board.\nThe industrial consumers were also getting continuous power supply due to these efforts.\nPower Sector has one of the most advance complaint resolution system linked via state of the art technology with mobile application, web portal, telephone call and SMS.\nIn the centralized complaint management system,2,592,355 complaints were received from 1st July 2018 to 30 June 2021. In response to it 2,591,746 complaints were resolved.\nPower Division has made significant achievements in removal of hazards from residential areas and has succeeded in removing 19701 such hazards against 37857 identified hazards.\nDedicated portal has been launched for safety of employees and regular trainings are\nimparted to make working environment safe for workers.\nA project of Advanced Metering Infrastructure (AMI) was being launched in Lahore and Islamabad Electric Supply Companies (LESCO and IESCO) areas with the assistance of Asian Development Bank worth US $ 400 million.\nTo control power theft and check menace of kundas, PESCO and SEPCO have started installation of ABC cables, which are much secure and effective against Kundas.",
  "retrievedAt": "2025-08-11T21:08:16.820Z"
}
