{
  "title": "President for enhancing Pak-Swiss commercial ties for mutual benefit",
  "link": "https://www.app.com.pk/national/president-for-enhancing-pak-swiss-commercial-ties-for-mutual-benefit/",
  "date_published": "2021-08-26T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):President Dr Arif Alvi Thursday said that Switzerland was an important trade and investment partner of Pakistan and underlined the need for further enhancing the commercial relations between the two countries for mutual benefits of the two sides.\nThe president, in a meeting with Ambassador-designate of Pakistan to Switzerland Aamir Shouket, who called on him at Aiwan-e-Sadr, said that Pakistan highly valued its relations with Switzerland which were based on mutual trust and cooperation.\nHe said that the growing investment of Swiss multinational companies reinforced bilateral ties and reflected their confidence in Pakistan.\nUnderscoring the need for enhanced economic relations, the president urged the ambassador-designate to encourage Swiss businessmen to make more investment in Pakistan as the environment for investment was very conducive due to the improved security situation and the investment-friendly policy of the government.\nThe president also stressed the need for increased engagements at the political level and asked the ambassador designate to work for further improving bilateral cooperation with Switzerland.\nHe stressed the need for actively engaging the Pakistani community in Switzerland to play their role in improving the image of the country.\nHe urged Aamir Shouket to work for image building of the country and highlight Pakistan’s success stories, particularly its role in the promotion of peace and reconstruction of Afghanistan, hosting of three million Afghan refugees for four decades and its successes against the war on terror.\nHe congratulated the ambassador-designate on his appointment to Switzerland and expressed the hope that he would make concerted efforts to further cementing and expand bilateral relations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T21:08:07.172Z"
}
