{
  "title": "PTI govt opens corridor of peace, Kartarpur during its tenure",
  "link": "https://www.app.com.pk/national/pti-govt-opens-corridor-of-peace-kartarpur-during-its-tenure/",
  "date_published": "2021-08-26T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):The incumbent government of Pakistan Tehreek-e-Insaf (PTI) had opened Gurdwara Darbar Sahib Kartarpur Corridor, Narowal, the corridor of peace, connecting Dera Baba Nanak shrine in India’s Punjab with Darbar Sahib, with the cost of Rs 16,280 million.\nThe three years performance of incumbent Pakistan Tehreek-e-Insaf (PTI) government launched by Prime Minister Imran Khan said the flagship Kartarpur Corridor project inaugurated by Prime Minister Imran Khan in November 2019, paved the way for Indian Sikh pilgrims to visit one of their religion’s holiest sites located in Pakistan without needing a visa. The opening of corridor has generated goodwill among the Sikh community spread all over the world.\nIn the project, Evacuee Trust Property Board (ETPB) has a lead role. The project was inaugurated on the occasion of 550th birthday anniversary of Baba Guru Nanak DevJi, founder of Sikh religion.\nAccording to the performance report, the government has initiated Geo-Tagging of Evacuee Trust Property Board’s urban and agricultural properties.\nThe document said the e-governance has been introduced in the ministry in conformity of the vision of Pakistan Tehreek-e-Insaf (PTI) government.\nIn last three years the Ministry of Religious Affairs and Interfaith Harmony ensured access to right to information act. Over 25,000 pilgrims benefitted from Road to Makkah initiative.\nHajj quota reserved for 10,000 each senior citizens, 10,000 unsuccessful candidates in last three years and 1,000 overseas Pakistanis. Temporary haji camp was established in Gilgit. E-Visa for hujjaj had started during the tenure of incumbent government.\nCentral Ruet-e-Halal Committee and Mashaikh Council was reconstituted to make it more effective. Anti Blasphemy Cell was operationalised in the ministry to check blasphemy.\nDistrict Interfaith Harmony Committees and other fora were constituted at federal and provincial levels to ensure safety of churches, shrines, temples, gurdawaras and other places of minorities’ worship.\nNational Commission for Minorities was set up to give recommendations in respect of policy matters of minorities as well as sale /purchase/transfer of communal properties of minority communities.",
  "retrievedAt": "2025-08-11T21:08:10.867Z"
}
