{
  "title": "MoDP gets unprecedented boost in Defence Exports worth Rs 60 bln: Report",
  "link": "https://www.app.com.pk/national/modp-gets-unprecedented-boost-in-defence-exports-worth-rs-60-bln-report/",
  "date_published": "2021-08-26T16:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):The Ministry of Defence Production in line with the Prime Minister’s vision, started a focused campaign for a self-reliant and self-sustained defence production industry through massive modernisation and development measures.\nAn unprecedented boost in the Defence Exports of around Rs 60 billion and Inland Sales of some Rs 70 billion was accomplished due to dedicated and synergic efforts of the MoDP and respective Services Headquarters during three years period where Rs 6 billion taxes and duties were paid annually, said the Three Years Performance Report launched by the Prime Minister here on Thursday.\nThe Ministry has ensured modernisation of Pakistan Ordnance Factories (POF) where the POF has spent substantially on upgrading of its infrastructure and machinery thus increasing its output and reducing the cost effect.\nThe POF established two Directorates of Production Directorate and Commercial Directorate during 2019 which have proved extremely useful in enhancing the production as well as commercial activities.\nHowever, acquisition for the latest arms and ammunition technologies and phased modernization production units is under process.\nThe corporatization of Heavy Industries Taxila (HIT) was also part of the self-reliance and export growth vision of the Ministry. The commercial window of HIT was established after amendment in the HIT Act in order to enhance its inland and foreign sales. “Rolling out of indigenously manufactured Al-Khalid Tanks also completed at the 1/3rd cost of the international market,” it highlighted.\nThe National Radio and Telecommunication Corporation (NRTC) has become a role model being self-sustainable enterprise. “NRTC is venturing into new and diversified products like RFID number plates, safe city projects and Artificial Intelligence solutions,” it added.\nKarachi Shipyard & Engineering Works (KS&EW) was transformed from a sick to thriving unit. The Ministry has managed full financial sustainability of KS&EW achieved after settlement of all previous liabilities. Massive upgradation of shipyard through PSDP has been completed where transfer of technology (ToT) worth millions of US dollars was acquired for submarine and ship manufacturing.\nThe Ministry also ensured that ToT was now being made part of all big-ticket items in order to ensure self-reliance whereas special attention was paid in the recent past for indigenous development of state of the art defence equipment in future.\nMoDP and its allied departments made substantial contributions to national exchequer by huge savings through import substitution, procurement negotiations, exports and taxes and duties.\nA substantial amount was also spent annually on quality education, medical facilities, respectable living and welfare of over 50,000 employees.\nAround 8,000 jobs were provided to unemployed youth in Defence Production Sector during past three years where quota system was strictly adhered in all the enrolments.\nClean and Green Pakistan drive was undertaken with full zeal and enthusiasm at MoDP and all allied setups. Around one million trees were planted during the campaign.\nCapabilities of indigenous production of ventilators as well as production of 25,000 surgical masks, 400 liters of sanitizer and 500 personal protective equipment or PPEs per day production were attained.\nMoDP steered a massive defence production and export promotion campaign both inland and abroad. Two Seminars and 5 exhibitions including IDEAS were organized to promote the defence industry of Pakistan.",
  "retrievedAt": "2025-08-11T21:08:07.139Z"
}
