{
  "title": "Permits issued to1,934 foreign tourists for climbing/trekking in Gilgit-Baltistan",
  "link": "https://www.app.com.pk/national/permits-issued-to1934-foreign-tourists-for-climbing-trekking-in-gilgit-baltistan/",
  "date_published": "2021-08-26T14:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):The government has issued permits to 1,934 foreign tourists who applied for climbing/trekking in Gilgit-Baltistan during the tenure of present government.\nAn amount of Rs 67.885 million has been collected as Royalty Fee in the said period, said a documents highlighting the three years performance of Ministry of Kashmir Affairs and Gilgit Baltistan.\nPrime Minister of Pakistan Imran Khan has announced an integrated development plan for Gilgit-Baltistan (GB), worth of Rs 370 billion.\nThe Government of GB has prepared PC-I of various projects in health, roads, hydro power sectors and etc. The central development working party and ECNEC have approved these projects.\nIn view of the willingness of the Government of Azad Jammu and Kashmir (AJK) and GB, all properties would be retained by Pakistan Tourism Development Corporation (PTDC) and would be leased out in a transparent and competitive manner to well reputed hospitality service providers to bring quality accommodation and service facilities to the visiting tourists.\nThe PTDC would utilized the rest of 50 percent income on tourism growth, facilitation, awareness, skill development and other promotional activities for projecting tourism industry in Pakistan including that of GB and AJK.\nThe ministry has prepared Gilgit-Baltistan Governance Reforms, 2019 in consultation with all stakeholders and submitted the same in the Supreme Court of Pakistan.\nThe Election Act, 2017, all rules, regulations and by laws, framed thereunder, were adopted in the territory of Gilgit-Baltistan for holding of General Elections to the Gilgit-Baltistan Legislative Assembly.\nThe ministry has facilitated Government of Gilgit-Baltistan and Chief Election Commissioner Gilgit-Baltistan for conducting the general elections of Gilgit-Baltistan Legislative Assembly.\nThe Jammu and Kashmir (Administration of Property) Ordinance 1961 is being amended and tabled in the Parliament in compliance with the directions of the Federal Cabinet pursuant to Supreme Court judgment.\nThe government has given approval of 13th Amendment in the AJ&K Interim Constitution ACT, 1974 incorporated which transferred Legislative/Executive Functions from AJK Council Secretariat to AJK Legislative Assembly.\nThe ministry has also prepared Gilgit-Baltistan Governance Reforms, 2019 in consultation with all stakeholders and submitted the same in the Supreme Court of Pakistan.\nThe Supreme Court of Pakistan vide its judgment dated 17-01-2019 issued Orders in favor of Federation of Pakistan. All provincial subjects of Gilgit-Baltistan have been devolved/transferred to Gilgit-Baltistan Legislative Assembly as per 18th Constitutional Amendment.",
  "retrievedAt": "2025-08-11T21:08:12.095Z"
}
