{
  "title": "PTI sets precedent of issuing performance report: Fawad",
  "link": "https://www.app.com.pk/national/pti-sets-precedent-of-issuing-performance-report-fawad/",
  "date_published": "2021-08-26T10:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Thursday said it was the Pakistan Tehreek-e-Insaf (PTI) government which had set the tradition of sharing yearly performance report with public.\nBefore the PTI, there was no culture of sharing the government and its departments’ performance with public continuously. Those who had had ruled for thirty years in the country were hiding their faces right now, Fawad Hussain told the Pakistan Television (PTV) here.\n“The PTI is the only government which brings its performance before the public. Before that, no other political party had dared to appear before the public so that it could tell as to what extent the promises made with people were fulfilled,” the minister maintained.\nHe said Prime Minister Imran Khan would proudly present the incumbent government’s three years performance at 3 pm Thursday here at a convention hosted by Ministry of Information and Broadcasting.\nThe prime minister would also highlight three year’s performance of all the ministries and their departments there, besides sharing next year’s plan of action of the government.\nLashing out at the opposition alliance—Pakistan Democratic Movement (PDM) which was misleading the public through fake claims, he said they told the people that wheat flour was being sold at exorbitant prices, but at the same time hide the fact that the prices of wheat had also gone up from Rs 1,200 [per 40 Kilogram] to Rs 1,800 which directly benefited the farmers.\nHe said they should tell the public that the prices of sugarcane had also increased by Rs 135 [per 40kg] to Rs 300 which also provided direct benefit to the farmers. They had never mention the additional income of Rs 1,100 billion generated by the farmers through the numerous steps taken by the government for agriculture sector to whom around 60 per cent of population was associated.\nThe inflation became irrelevant with such a surge in income of people, he added.\nAbout socio-economic uplift of citizens, he said the government started Ehsaas Programme for marginalized segments of society, besides bringing innovations in many departments, including science and technology.\nFawad said it was the PTI government which had made environment a subject for public discussion. Before that, nobody bother to hold a debate over the topic.\nHe said the world was acknowledging the steps taken by Prime Minister Imran Khan for tackling the climate change in Pakistan.\nThe minister said it was the first time in history of Pakistan that the country’s foreign policy was based on self-respect which could be gauged from Prime Minister’s Imran Khan straight away reply of ‘Absolutely Not’ to a question asked by an English anchor about Pakistan’s alleged plan of giving bases to US in the country.\nThe whole world was recognizing Pakistan’s role in Afghanistan, he said, adding Prime Minister Imran Khan brought the country back at international horizon, besides playing major role in united Muslim Ummah and internationalizing the Kashmir issue.\nHe said the PTI government would complete its five-year constitutional term, expressing confidence that it would remain in the power for the next five years.\nOn the occasion, Minister of State for Information and Broadcasting Farrukh Habib said when Prime Minister Imran Khan came into the power, there were multiple challenges stemming from fragile economy to weak state institutions\nHe said on completion of its five year term in 2018, the PML-N left the country with foreign exchange reserves of only 15 days. It left the country with $9 billion reserves and the historic current account deficit of $19 billion, he added.\nFarrukh said in comparison with 2018, Pakistan now had the highest foreign exchange reserves of $20 billion.\nHe said the textile industry came to a grinding halt in Faisalabad, while power looms were being sold in scrap yards against Rs 40 kilogram (kg).\nThe state minister said despite the COVID-19’s fallouts, exports were recorded at the highest level with $25.4 billion of goods and if services sector’s added, it would cross $31 billion mark. Textiles and IT exports were also showing phenomenal growth, he added.\nRemittances, which remained at upto $20 billion during the PML-N tenure, now reached to $29 billion, he noted and remarked that the foreign remittances surged remarkably due to the confidence posed by the overseas Pakistanis in Prime Minister Imran Khan’s leadership.\nHe said the current account deficit which left by PML-N at $19 billion was now at its lowest level. It also remained surplus for sometime during the present government’s tenure, he added.\nThe minister said the PML-N leaders did criminal negligence by installing 45 per cent of those power projects that had to be run on imported fuels. By 2023, Rs 1,500 billion would have to be paid in capacity payments.\nHe said the present government was taking steps to build major water reservoirs in the country to enhance storage capacity and reliance on hydel power.\nFarrukh said work on several water projects including Diamer Bhasha Dam, Dasu hydropower, Mohmand Dam, Sindh Barrage, Huripur power project, Kachhi Canal, K-IV water supply, Kurram Tangi and Nai Gaj dams was in full swing.\nHe said completion of those ten projects would not only ensure water reserves of 12.89 million acre feet, but also increase generation of inexpensive hydropower in the country by 9,043 mega watt (MW). It would also create more than 35,000 job opportunities in the country, he added.\nPrime Minister Imran Khan had emerged as a global leader by taking practical steps on climate change, he said, adding his efforts were also being recognized by the International Organizations.\nHe said the Health Insaf Card had been provided to the entire population of Khyber Pakhtunkhwa, whereas people of Punjab would get the facility this year.\nFarrukh said the government had so far disbursed soft loans amounting to over Rs22 billion among more than 18,000 young people under the Youth Entrepreneurship Scheme (YES) of Prime Minister’s Kamyab Jawan Programme (KJP).\nHe also mentioned different prop-poor initiatives like Panahgah, Langarkhanay and Ehsaas programme.\nThe minister said in the next two years, the government would achieve its all targets on the fast track basis.",
  "retrievedAt": "2025-08-11T21:08:17.578Z"
}
