{
  "title": "National Quality Policy, STI Policy at final stages; to be submitted to cabinet",
  "link": "https://www.app.com.pk/national/national-quality-policy-sti-policy-at-final-stages-to-be-submitted-to-cabinet/",
  "date_published": "2021-08-26T15:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):The Ministry of Science and Technology (MOST) took various initiatives to facilitate bringing sustainable socio-economic progress in the country including preparation of a comprehensive National Quality Policy, national research agenda, National Science, Technology and Innovation policy (STI) in addition to various new Public Sector Development Programme projects being executed by the departments.\nAccording to the three-years performance report of Ministry of Science and Technology unveiled on Thursday, the National Quality Policy (implementation to cost Rs. 250 million annually) and Science, Technology and Innovation Policy 2021-2030 were at final stages and would be submitted to the federal cabinet shortly. These policies were the fruit of prolonged deliberations with stakeholders in all sectors of the economy.\nThe performance report highlighted that the development of Electronic Voting Machines was in the final phases which would help realize vision of the Prime Minister for free and fair elections.\nElectronic Voting machines were being introduced to ensure transparency and accountability in the elections process.\nAnother project for cultivation of Cannabis with an estimated cost of Rs. 1896.72 million has been approved by the Planning Commission which would be initiated soon.\nThe cultivation of Cannabis was a new project introduced for the first time in the history of the country and it could invigorate various industries such as Paper, Textiles, Clothing, Biodegradable plastics, Paint/ insulation, Biofuel, Food and Animal feed.\nThe Pak-Korea PV module testing lab was being established with funding from KOICA and would cost around Rs. 1319.550 million.\nA Science and Technology Park was established at National University of Science and Technology (NUST) with a state-of-the-art incubation center to establish market-industry linkages. The Technology Park has attracted various industrialists and investors for funding start-ups and is the first-of-its-kind technology park in Pakistan.\nAn agreement was also signed between NUST and International Consulting Associates (ICA) for development of National Sciences and Technology Park in Islamabad, the report highlighted.\nA Memorandum of Understanding was signed between Pakistan Council of Research in Water Resources (PCRWR) and Capital Development Authority for recharging ground water in Islamabad as a pilot project.\nAn initiative has been taken to standardize electrical appliances such as motor, fan and geysers. This would enhance energy efficiency and lead to conservation of energy up to 3000 MW per day.\nVarious stakeholders have been engaged from the electrical and gas industry through consultative meetings to introduce standardization in electrical and gas appliances including motors, geysers and fans.\nThe project for STEM education has been approved and the criteria for selection of schools that would be part of the initiative have also been finalized.\nPakistan Standards and Quality Control Authority (PSQCA), Pakistan Engineering Council (PEC) amendments bills were being introduced in the Parliament to make them more responsive and efficient organizations.\nThe Research and Development budget has been increased from Rs. 300 million to Rs. 2.5 billion whereas development budget has been increased from Rs. 4.458 billion to Rs. 8.314 billion.",
  "retrievedAt": "2025-08-11T21:08:10.366Z"
}
