{
  "title": "Govt takes effective steps to root out menace of terrorism, sectarianism from country",
  "link": "https://www.app.com.pk/national/govt-takes-effective-steps-to-root-out-menace-of-terrorism-sectarianism-from-country/",
  "date_published": "2021-08-26T15:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):The present government has successfully faced and handled various challenges in security, both internally and externally and rooted out the menace of terrorism and sectarianism from the country.\nAs per available document on Thursday, during its three year tenure, the present government had made effective policies to tackle pandemic situation due to Covid-19 besides taking steps to meet the requirements of Financial Action Task Force (FATF).\nIt claimed that the government had taken over control of schools, colleges, hospitals, dispensaries, ambulances etcetera of proscribed organizations with conviction of over 200 main individuals and supporters besides recovery of funds amounting to Rs 2,400 million for management of taking over facilities.\nIt said the Ministry of Interior had freezed 976 movable and immovable properties of the proscribed organizations besides proscription of two main and 11 affiliated organizations.\nIt said the Ministry of Interior had introduced new policies for enhancing the efficiency of Ministry through the practice of identifying and completing within stipulated deadline. The new policies will further ensure transparency and merit.\nThe government had also introduced technology to convert the manual system into e-system for ensuring efficiency and quick disposal.\nIt added the government has established facilitation desks, information counter at Ministry, attached departments and regional offices for redressal of public complaints.\nThe government had amended the existing procedures to achieve the goal of service delivery in efficient and simple way. The amendment in procedures aimed at putting an end to pendency and increasing the capacity.\nThe government had completed work on up-gradation of the existing system by escalating e-office usage, improved coordination by usage of video conferencing, updating of Ministry of Interior website having up to date information of data, connectivity to the Board of Investment network system and improved security surveillance by repairing and maintenance of CCTV cameras.",
  "retrievedAt": "2025-08-11T21:08:09.099Z"
}
