{
  "title": "British MP writes to PM Johnson for raising horrifying torture on Indian farmers with Modi",
  "link": "https://www.app.com.pk/national/british-mp-urges-pm-johnson-to-raise-torturing-of-protesting-indian-farmers-with-modi/",
  "date_published": "2021-01-09T09:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 9 (APP): As Indian police continued to torture protesting farmers, a British parliamentarian urged his Prime Minister Boris Johnson to raise the issue with Narendra Modi during his upcoming visit, urging him to resolve the deadlock and allow the people to use their democratic right of protest.\nIn a letter to British prime minister, Labour Member of Parliament for Slough Tan Dhesi said, “many constituents, especially those emanating from the Punjab and other parts of India, were horrified to see footage of water cannon, tear gas and brute force being used against hundreds of thousands of peacefully protesting farmers.”\nTanmanjeet Singh Dhesi was elected as the MP for Slough, winning in the 2017 General Election with a 17,000 majority and later re-elected in 2019, thereby becoming the first ever turbaned Sikh in any European Parliament.\nGreat that over 100 MPs and Lords signed cross-party letter to the Prime Minister, given our serious concerns for the peaceful India #FarmersProtest.\nBoris Johnson must raise it with Indian PM when they next liaise, expressing hopes of speedy resolution to the current deadlock. pic.twitter.com/mLw3tYHA2S\n— Tanmanjeet Singh Dhesi MP (@TanDhesi) January 8, 2021\nHe said the issue had so galvanised the Indian diaspora community, especially those of a Punjabi or Sikh background, and others who have land or links to farming in India, that tens of thousands engaged in global protests, including in towns and cities across the Jammu and Kashmir.\nHe said a cross-party letter, signed by over hundred MPs and Lords, was sent to Foreign Secretary Dominic Raab to raise this matter with his Indian counterpart who had assured that it was raised with the Indian Foreign Minister, but he did not do so with the Indian Prime Minister during his December Delhi meeting.\nReferring to a question raised to PM Johnson during the Prime Minister’s Questions on December 9, the MP said he had misunderstood the question as he made a reference to Pakistan and the need for “those two Governments to settle” these matters.\nImmensely grateful to the 100+ MPs and Lords who’ve signed cross-party letter to the Prime Minister, given huge concerns for the peaceful India #FarmersProtest.\nBoris Johnson must raise with Indian PM when they liaise, expressing hopes of speedy resolution to current deadlock. pic.twitter.com/6VpjIW6TxO\n“The issue of course has nothing to do with Pakistan, but is regarding farmers from across India protesting and expressing their concerns of major corporates moving into the sector, as a result of new agriculture laws,” he clarified.\nHe urged the prime minister, who was scheduled to meet Indian counterpart in near future in New Delhi, to convey to the Indian Prime Minister “the heart-felt anxieties of our constituents, our hopes for a speedy resolution to the current deadlock and also for the democratic human right of citizens to peacefully protest.”\nReporting by Ishtiaq Ahmed",
  "retrievedAt": "2025-08-11T20:13:36.381Z"
}
