{
  "title": "Coordinated CT operations busts major terrorist plots: PM",
  "link": "https://www.app.com.pk/national/coordinated-ct-operations-busts-major-terrorist-plots-pm/",
  "date_published": "2021-01-09T15:12:00.000Z",
  "source": "APP",
  "content": "A number of major terrorist incidents have been averted owing to the timely operations of security agencies, Prime Minister Imran Khan said while addressing the families of the Machh tragedy in Quetta on Saturday.\nThe Prime Minister said he got the intel about foreign-funded terrorist groups who were planning to trigger chaos in the country on basis of sectarian clashes in March and he shared the information with the Cabinet.\nHe said a number of measures were taken to ensure coordinated operations against the various terrorist outfits who were bent upon creating chaos in society.\n“I laud the Inter-Services Intelligence because they managed to preempt three or four plots to kill Shia or Sunni ulema … I have no doubt in my mind that what happened is part of a bigger game,” Khan said.\nHe said he believed that there were between 35 to 40 people spreading chaos in the country.\n“We have a whole program prepared, and a security forces cell is being made which will look at providing you with protection and pursuing those responsible,” he said.\nAs per the data collected by the APP just in the past few months, a number of major foreign terrorist groups operating in Pakistan have been busted.\nAccording to a senior security official, most of the groups work under different cover names and banners but have the same foreign intelligence agencies as their paymasters. He said different groups were used for specific targets, to achieve certain objectives.\nHe recalled how in Karachi a group was busted which was involved in killing both Shias and Sunnis, to trigger sectarian clashes. However, all these attempts failed as a vast majority of people do not have an extremist mindset.\nZakiur Rehman Lakhvi\nAn anti-terrorism court (ATC) on Friday, Jan 8, awarded a 15-year jail term to Zakiur Rehman Lakhvi, a leader of Lashkar-e-Taiba (LeT) – a proscribed organization, over charges of terrorism and terror financing.\nATC Judge Aijaz Ahmad Butter sentenced Lakhvi to five years rigorous imprisonment each on three counts with fine of Rs 100,000 rupees each on three counts.\nIn case of default on payment , the convict would have to undergo further imprisonment. The verdict also directed the Counter-Terrorism Department (CTD) to arrest the co-accused in the case, Abu Anas Mohsin and produce him in the court.\nThe CTD had booked Lakhvi in case no 26/20, registered at the CTD Lahore station under three different charges of the Anti-Terrorism Act (ATA). Lakhvi was accused of running a medical dispensary, as a front, to collect and disburse funds for financing terrorism and militant activities.\nIn a joint operation on January 6 and 7, the Counter-Terrorism Department Punjab and a sensitive agency busted an international terrorist network in Sargodha.\nThe whole group was busted after initial arrest of two terrorists, who revealed that the group of seven planned to eliminate leaders of another sect, to create sectarian strife in the country.\nAccording to details released by the CTD, the network belonged to proscribed organization Sipah-e-Muhammad Pakistan (SMP), whose mastermind had been directing the network from a neighbouring country.\nThe CTD team Sargodha along with officials of a sensitive agency apprehended two terrorists, who were on their way to hit a religious personality, from Luqman Canal on Kot Momin Road, in district Sargodha on January 6.\nThe terrorists Musharraf Abbas alias Bawaji and Ameerbaaz alias Shahid were arrested after a gunfight and explosives and parts of an IED (Improvised Explosive Device), a rifle, a pistol and ammunition were recovered from them and FIR registered in Police Station CTD Sargodha.\nMore raids were conducted and two more terrorists – Niaz Abbas and Adeel Abbas were arrested from Grot Chowk, city Joharabad district Khushab and a hand grenade, a Kalashnikov, a pistol, ammunition and funds were recovered from their possession.\nFIR was registered against them in Police Station CTD Sargodha.\nIn yet another raid in Tehsil Sahiwal of district Sargodha, three terrorists; Aslam Hussain, Baharat Khan and Muhammad Ali were arrested and parts of an IED including explosive material, detonators, safety fuse were recovered.\nThe Counter-Terrorism Department termed the arrest of seven terrorists a big success as it disrupted their plot.\nInitial investigation revealed that the mastermind was a terrorist Mehmood Iqbal alias Mesam caste Baloch, who is operating from a neighboring country, with the financial aid of its Intelligence agency for the purchase of weapons and explosives for terrorist activities. The CTD spokesman said it would be approaching Interpol for his arrest.\nTerrorists of Rawalpindi Blasts\nIn another Intelligence Based Operation (IBO) in Rawalpindi on Dec 14, 2020, the CTD Punjab arrested three terrorists involved in four bomb blasts in Rawalpindi in 2020, including the Pir Wadhai Bomb Blast of December 4.\nThe terrorists were ready to strike the Islamabad Stock Exchange. The CTD recovered explosives from them.\nThe CTD Rawalpindi Team on a tip-off raided a place at Adyala-Kharakan Road along the Swan River Rawalpindi on the basis of investigation and evidence collected from Pir Wadhai crime scene. Explosives, detonators, cell phones, and other articles were recovered.\nIn the initial investigation, they admitted conducting four bomb blasts in Rawalpindi in 2020 – January, March, June & December – killing four innocent citizens and injuring more than 30 people.\nThe terrorists, whose names have been withheld due to ongoing investigation, have been radicalized and motivated initially by the ideology of the proscribed organisation TTP.\nHowever later they started working for their masterminds based in Afghanistan for money. They disclosed that their group leader was getting funds from Afghanistan for this terrorism.\nIt was discovered that they were planning their next attack at the building of the Islamabad Stock Exchange and had already conducted a recce of the target. FIR has been lodged at Police Station CTD Rawalpindi.\nFive key members of the al-Qaeda Indian Subcontinent (AQIS) network were arrested by CTD Punjab and ISI Counter-Terrorism Wing (CTW) in a joint Intelligence Based Operation (IBO) in the Goth Mazari, Tehsil Rojhan District Rajanpur.\nA joint team been collecting intelligence about the network for the past several months. The network was shifting from Balochistan to Rajanpur and was planning to launch terrorist attacks on vital installations in South Punjab.\nAn IBO was conducted and suicide jackets, hand grenades, Kalashnikov, rifles, pistols and ammunition were recovered. The terrorists were identified as Ejaz Ali Khan alias Waqas, Saghir Ehtesham, Jabir Ehtasham, Anwer Khan alias Mufti Abdullah and Kamran Zahid alias Asad. Investigation launched to further probe the presence of other AQIS cells in Pakistan.\nCounter-Terrorism Department – Sindh\nSimilarly in Sindh, the Counter-Terrorism Department in the year 2020 registered 211 cases related to terrorism, arrested 132 suspects, including 103 for involvement in heinous crimes and 23 others for terror financing.\nThe CTD arrested 17 from the Muttahida Qaumi Movement London, 14 belonged to different factions of Tehreek-e-Taliban Pakistan (TTP), 14 to Lashkar-e-Jhangvi, six to the Lyari gangs, and four to Sindhudesh Revolutionary Army (SRA), while 35 target killers and other criminals had no affiliation.\nThe CTD registered 56 terror funding cases and arrested 23 suspects: seven from Jamaat-ud-Dawa and the Falah-e-Insaniyat Foundation, four from different TTP groups, three from Haqqani network, and two each to Daesh, the Sipah-e-Sahaba Pakistan, the SRA and the Lyari gangs, while one from the Sipah-e-Muhammad Pakistan.",
  "retrievedAt": "2025-08-11T20:13:36.380Z"
}
