{
  "title": "Pakistan strongly condemns extra-judicial killing of four more Kashmiri youth",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-extra-judicial-killing-of-four-more-kashmiri-youth/",
  "date_published": "2022-04-16T11:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 16 (APP): Pakistan on Saturday strongly condemned Indian occupation forces’ relentless killing spree resulting in the martyrdom of four more Kashmiri youth during this week in staged ‘cordon and search’ operation in Shopian district of the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nMore than 576 innocent Kashmiris had, so far, been martyred by the Indian occupation forces since India’s illegal and unilateral actions of 5 August 2019, Foreign Office Spokesperson said in a press release.\n“The pattern of ongoing atrocities in the IIOJK, which has been intensified during the holy month of Ramzan, reflects India’s despicable policy of terrorizing the population in a bid to perpetuate its systemic persecution of the Kashmiris. The valiant Kashmiri youth is, however, resolutely committed to their just cause and no amount of brutalities can dampen their unbreakable resolve,” it was added.\nThe spokesperson said Pakistan reiterated its call for investigation of extra-judicial killings in IIOJK by the Commission of Inquiry as recommended by the Office of the United Nations High Commissioner for Human Rights (OHCHR) in its Kashmir reports of 2018 and 2019.\n“Pakistan also calls upon the international community to play its due role for a just and peaceful resolution of the Jammu and Kashmir dispute in accordance with the relevant UNSC resolutions and the wishes of the Kashmiri people,” the spokesperson added.\nNotably, Kashmiri youth had been a specific target of the 900,000 strong Indian military force and thousands of Kashmiri youth were living in a perpetual environment of terror, harassment and intimidation. Indian forces continue to perpetrate egregious violations of human rights in the occupied territory with shameless impunity under draconian laws such as the Public Safety Act (PSA) and Armed Forces Special Power Act (AFSPA).",
  "retrievedAt": "2025-08-11T14:42:43.260Z"
}
