{
  "title": "Parliamentary delegation visits NEOC to review monsoon response",
  "author": null,
  "content": "ISLAMABAD, Sep 01 (APP):A delegation of parliamentarians, led by National Assembly Speaker Sardar Ayaz Sadiq, visited the National Emergencies Operation Center (NEOC) on Monday to assess the ongoing monsoon situation and review nationwide relief efforts.\nNational Disaster Management Authority (NDMA), Chairman Lieutenant General Inam Haider Malik, briefed members on National Emergencies Operation Center (NEOC’s) early warning systems, preparedness protocols, and disaster mitigation strategies.\nSo far more than 600,000 people have been shifted to safer locations.\nLieutenant General Inam Haider Malik stated that all relevant institutions are working in close coordination to manage the flood situation. He noted that NDMA continues to issue timely alerts on rainfall and associated hazards to ensure swift response and public safety.\nThe delegation was apprised that the National Emergencies Operation Center (NEOC) is actively monitoring river flows and flood conditions across the country. He noted that accelerated glacier melt in the northern regions is heightening flood risks and creating additional hazards. All alerts, he added, are being promptly issued to the public and relevant institutions to ensure timely precautionary measures.\nActing on the prime minister’s directives, the NDMA is overseeing all rescue and relief operations. With river levels rising, controlled breaches are being executed at designated points to manage floodwaters. Evacuation efforts are also in progress in vulnerable areas threatened by the surge.\nParliamentarians reaffirmed their support for national disaster management efforts and pledged to contribute to a coordinated strategy. The delegation also offered their services to promote awareness and strengthen preparedness within local communities.\nThe delegation appreciated the federal government and NDMA for their efforts in disaster response and preparedness.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:45:10.784Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/parliamentary-delegation-visits-neoc-to-review-monsoon-response/",
  "dateList": "2025-09-01",
  "date_published": "2025-09-01T18:33:00.000Z"
}
