{
  "title": "Khawaja Asif urges construction of small dams",
  "author": null,
  "content": "ISLAMABAD, Sep 01 (APP): Minister for Defence Khawaja Muhammad Asif on Monday emphasized the urgent need to construct small dams across the country to tackle looming water scarcity and mitigate flood devastation.\nSpeaking in the National Assembly, he said, “Small dams should be built nationwide instead of waiting decades for mega projects,” warning that water would become an extremely scarce commodity in the future.\nCalling for political consensus, the minister stressed that natural resources like rivers and dams should not be turned into partisan disputes. “We cannot afford to let every year’s floods become another tragedy. This is a national issue that requires unity and urgent action,” he remarked.\nHe said while climate change was triggered globally by human actions, Pakistan’s devastation had been aggravated by encroachments on riverbeds, unregulated housing schemes, and construction on natural waterways.\nRecalling that the country had faced its third or fourth major catastrophe in the last 12–14 years, he said little corrective action had been taken. “We built hotels and housing colonies on riverbeds, treating them like drains, and nature has reacted. Every year, billions are lost, but encroachments remain intact,” he noted.\nUnderscoring the importance of grassroots governance, Khawaja Asif said local bodies were essential for disaster management, service delivery, and accountability. “Power must be dispersed to towns, villages, tehsils, and districts.\nWhen voters can knock at their councillor’s door, only then will governance respond effectively,” he asserted.\nThe minister said the floods should serve as a reminder that the laws of nature cannot be challenged. “Water never stands still—it will find its way. Until we respect these natural laws and remove encroachments, such tragedies will revisit us every year,” he cautioned.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:46:20.231Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/khawaja-asif-urges-construction-of-small-dams/",
  "dateList": "2025-09-01",
  "date_published": "2025-09-01T14:37:00.000Z"
}
