{
  "title": "Naveed announces one month salary for flood victims, calls for united action against climate change",
  "author": null,
  "content": "ISLAMABAD, Sep 01 (APP):Member National Assembly (MNA) Naveed Qamar on Monday announced to donate his one-month salary for the relief of flood victims, urging collective national action against climate change and environmental mismanagement.\nSpeaking on the floor of the National Assembly, he thanked Speaker Sardar Ayaz Sadiq for prioritizing debate on the flood crisis by postponing other business.\nNaveed Qamar said that while natural calamities are inevitable, much of the devastation was caused by human mismanagement and misuse of natural resources.\nHe added that the impacts of climate change were now visible in daily life, with glacial melt, blocked waterways, and unchecked deforestation intensifying disasters.\n“When we cut a tree today for temporary gain, its price is paid by the child who loses a home or life in the floods,” he said.\nCiting expert warnings, the PPP leader said that floods next year could be 22 percent more destructive, while in the long term, melting glaciers might dry up the Indus and other rivers, turning fertile lands into deserts and threatening centuries-old ecosystems.\nThe senior PPP parliamentarian emphasized the urgent need for a collective national resolve, involving all political parties, to enforce bans on deforestation, river and drain encroachments, and mismanagement of natural resources. He added that flood preparedness must begin immediately, as reliance on divine mercy alone is not a solution.\nNaveed said Parliament was the only platform to build consensus and guide government action through constructive criticism and solutions. “Politics has its time, but in the face of national calamities, we must rise above partisanship and work together,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:46:24.560Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/naveed-announces-one-month-salary-for-flood-victims-calls-for-united-action-against-climate-change/",
  "dateList": "2025-09-01",
  "date_published": "2025-09-01T13:40:00.000Z"
}
