{
  "title": "UN launches network on migration in Pakistan to strengthen migration management & governance",
  "author": null,
  "content": "ISLAMABAD, Sep 1 (APP):The United Nations (UN) in Pakistan has formally launched the Pakistan United Nations Network on Migration (UNNM) at a high-level event here on Monday.\nThe launch marks a significant step towards a unified, collaborative approach to migration governance and responding to the interconnected challenges of human trafficking and migrant smuggling aligned with international frameworks, including the 2030 Agenda for Sustainable Development and the Global Compact for Safe, Orderly and Regular Migration (GCM).\nHosted by the UN Resident Coordinator Mr Mohamed Yahya, the event also featured the inauguration of Pakistan’s first Migration Multi-Partner Trust Fund programme (MMPTF)- “Strengthening Response to Combat Trafficking in Persons (TIP) and Smuggling of Migrants (SOM) in Pakistan” implemented jointly by the International Organization for Migration (IOM) and the United Nations Office on Drugs and Crime (UNODC) in collaboration with the Government of Pakistan, Private Sector, Media, and Civil Society. The joint programme contributes to the national efforts in the areas of migration management and governance and combating human trafficking and migrant smuggling with a whole-of-government and whole-of-society approach.\nThe MMPTF was established to support the implementation of GCM and is the only pooled funding mechanism dedicated to migration, open to all States.\nThe International Organization for Migration (IOM), as coordinator and secretariat of the UN Network on Migration, plays a central role in the network, alongside the United Nations Resident Coordinator in Pakistan, who will serve as the network’s Chair. The network will leverage partnerships across the UN system to promote policy coherence and integrate migration policies into the broader development goals.\n“The establishment of this network is a testament to our collective resolve to ensure that migration is safe, orderly, and regular,” said Mr Mohamed Yahya, UN Resident Coordinator. It provides a crucial platform to shift the narrative on migration, amplify a unified voice, and foster the innovation needed to address complex challenges related to mobility and protecting the rights of all people on the move.”\nThe event featured a video message from Mr Jonathan Prentice, Head of the UN Migration Network Secretariat. Mr Prentice congratulated Pakistan on continuing to play its significant role in the global collective to help improve migration governance in the world.\nThe launch also featured a Pakistani migrant recently returned from an arduous journey to Europe and was reintegrated back home. “Life makes us move. But journeys, either from our home to new destinations or back to our country, should become easier, more dignified,” said Moazzam Ali, who opted for voluntary return to Pakistan from Romania with support from IOM.\nA high-level panel discussion on “Enhancing whole-of-government migration governance in the age of complex mobility dynamics and emerging global challenges” was moderated by Dr Nasra M Shah, Professor of Migration and Development at the Lahore School of Economics.\nThe panellists included representatives from the Government of Pakistan (Ministry of Foreign Affairs, Ministry of Interior,  Ministry of Overseas Pakistanis and Human Resource Development, National Commission for Human Rights, IOM and civil society organizations.\nThe event concluded with an official launch ceremony, reaffirming a strengthened commitment to multi-stakeholder partnerships for migration governance in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:47:29.876Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/un-launches-network-on-migration-in-pakistan-to-strengthen-migration-management-governance/",
  "dateList": "2025-09-01",
  "date_published": "2025-09-01T11:04:00.000Z"
}
