{
  "title": "‘Don’t play with fire’: AJK President warns India: Condemns fresh unprovoked Indian firing",
  "link": "https://www.app.com.pk/national/dont-play-with-fire-ajk-president-warns-india-condemns-fresh-unprovoked-indian-firing/",
  "date_published": "2020-06-10T04:24:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jun 10 (APP):Azad Jammu & Kashmir ( AJK ) President Sardar Masood Khan Wednesday strongly condemning unprovoked Indian firing in Jandrot, Tatta Pani and Goi sectors along the Line of Control has warned India to stop playing with fire in the interest of peace and security of the region.\nFive civilians including two innocent women and two kids were injured and public property destroyed as a result of the Indian aggression.\nDescribing the growing violations of the 2003 ceasefire agreement by India in recent days as an abortive attempt by the Modi regime to hide its failures in India and the repression in occupied Kashmir, the AJK president appealed to the international community to take cognizance of the Indian attempts of disrupting peace in the region. He maintained that India would never succeed in its heinous plans because the global community has become aware of its hegemonic designs, AJK Presidential secretariat told media on Wednesday.\nExpressing sympathy with those injured in the Indian firing including 32 years old Rabia, six years old Maria, 26 years old Nasreen, seven years old Momina and Mohammad Munshi, he said that the nation would never forget the sacrifices of those living along the Line of Control.\nThe president said that the Indian troops hiding behind the bunkers were targeting defenseless civilians particularly women and children, but the same troops have capitulated to the Chinese Army in Ladakh.\nReferring to the situation in occupied Jammu and Kashmir, Sardar Masood Khan said that the lives of more than eight million Kashmiri people were in serious danger because of the anti-Kashmir policy of the Indian government.\nOn the one hand, he maintained that India was not taking any steps to save the Kashmiri people from COVID-19 while on the other, it is massacring the innocent people particularly the Kashmiri youth in cordon and search operations.\nHe said that the Indian had killed 14 Kashmiri youth in past three days in Shopian district of IOK and dozens of others were taken into custody, and they were being subjected to the worst torture in jails and detention cells.\nPaying tributes to the Kashmir youth for sacrificing their lives and resisting the Indian barbarity, he said that their sacrifices would certainly culminate in the dawn of freedom.\nIt is pertinent to mention here that Indian troops in their fresh act of state terrorism martyred five more Kashmiri youth in Shopian district on Wednesday. The troops martyred the youth during a cordon and search operation in Sugoo Hendhama area of the district.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:19:15.261Z"
}
