{
  "title": "COVID-19 lockdown is badly affecting India’s households: Report",
  "link": "https://www.app.com.pk/national/covid-19-lockdown-is-badly-affecting-indias-households-report/",
  "date_published": "2020-06-10T11:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP):Amid a gradual reopening of its economy, India has extended its nationwide lockdown in containment zones – areas where people have tested positive for COVID-19 – through June 30.\nA Knowledge @ Wharton Network report says the wisdom of even a phased reopening in select sectors such as malls, restaurants and markets selling non-essential goods and domestic train and air travel is being questioned as the number of COVID-19 cases and deaths continues to climb.\nAccording to the Johns Hopkins University’s dashboard, as of June 8, India was seventh on the list of countries with the most infections with 258,090 positive cases and 7,263 deaths.\n“But also compelling is the pile-up of economic misery the lockdown has wrought. In the latest quarter ended April 20, India’s GDP grew the slowest in 11 years at 3.1%, and is expected to contract by 6.8% in the current fiscal year,” the report said.\nThe economic distress in India caused by the lockdown is dire. Nearly 84% of Indian households are seeing decreases in income since the lockdown began, according to a recent study by experts at the University of Pennsylvania, University of Chicago and the Mumbai-based Centre for Monitoring the Indian Economy (CMIE), titled “How Are Indian Households Coping Under the COVID-19 Lockdown Key Findings.”\nThe study found a “sharp and broad negative impact on household income” as the pandemic diminished their staying capacity. Nearly a third of all households will not be able to survive beyond a week without additional assistance, it stated.\nThat harsh statistic finds corroboration in the unemployment rate, which had crossed 27% in early May, up nearly four-fold from levels in January-February, according to CMIE data. The jobless rate has since dropped to less than 24%.\nAccording to the report, the study’s authors are Marianne Bertrand, professor of economics at the University of Chicago Booth School of Business and faculty director of its Rustandy Center for Social Sector Innovation and UChicago’s Poverty Lab; Kaushik Krishnan, chief economist at the CMIE; andHeather Schofield, assistant professor of medical ethics and health policy at the Perelman School of Medicine and a Wharton professor of business economics and public policy.\nHow should India’s policy makers respond to the economic distress?\n“Direct and immediate transfers of food and cash are very high priority,” said Schofield. “These transfers should be broad based and reach most of the income distribution, as it is clear that nearly everyone but the wealthiest have seen their incomes fall and are in need of additional resources to survive.”\nThe study’s researchers built upon a CMIE survey of households by layering other data including those on per-capita household income, and classifying them by state and urban/rural status. CMIE had surveyed nearly 5,800 households across 27 Indian states in the last two weeks of April, asking them if the lockdown caused a fall in their income, and for how long they could cope without borrowing or getting any help in cash or kind.\n“Direct and immediate transfers of food and cash are very high priority” said Heather Schofield.\nDegrees of Distress\nThe fall in incomes affected people in the lower and middle segments of the income distribution most severely, the study found. Households in the lowest of the five income groups had average monthly per-capital earnings of less than Rs. 3,800 (about $50), while those at the high end made between Rs. 12,374 and upwards of Rs. 1 lakh ($167 to $1,370 and more), the report said.\nHouseholds in the middle-income groups are hurt disproportionately more perhaps because they are most likely to be dependent on sources of income that are hit due to the lockdown, the study’s authors stated. “The households in the highest quintile are more likely to have stable salaried jobs, with the ability to work from home and continue to earn a living,” they added. “Households in the lowest quintile may be more heavily concentrated in occupations that have continued despite the lockdown (e.g., agriculture, food vendors) or have benefited from targeted transfer programmes.”\nRural households have seen disproportionately more distress than those in urban India during the lockdowns. Incomes have fallen at some 88% of rural households, compared to 75% at urban households, the study found.\n“Higher-income households in urban India have shown more “resilience” than their rural counterparts. That is because working out of home is possible for many urban jobs, and therefore they are “relatively protected,” the authors noted.\nEconomic Stimulus, Direct Support\nThe Indian government has announced three rounds of stimulus programmes totaling nearly Rs 21 trillion ($266 billion). That include a Rs. 7.2 trillion liquidity package the Reserve Bank of India had unveiled in February before the coronavirus, which it followed up with other measures to stem the pandemic-induced economic slowdown.\nA KPMG note breaks down the details. However, the stimulus programmes have largely been either credit guarantee programmes or new fund creations to be shouldered by banks and financial institutions, as Reuters reports.\n“Estimates of the actual new fiscal commitment by Mr. Modi’s government range from a puny 0.7% of GDP to 1.3%, a far cry from the touted 10%,” The Economist noted.\nThe International Monetary Fund ranked India 13th among G-20 nations in the size of the stimulus programs as a share of GDP.\n“It will be important to be generous but also have some protections to make sure there isn’t too much leakage and diversion so that the benefits reach those who need them,” Heather Schofield noted.\nThe report said that the direct cash transfers in those packages provide little relief in individual hands, and are limited in their reach. They include Rs. 1,500 over three months to 204 million women with bank accounts; an upfront transfer of Rs. 1,000 ($14) in old-age, widow and disability pensions to 30 million recipients; and advance payment of this year’s first instalment ($27) of an income support program of Rs. 6,000 annually ($80) for small and marginal farmers that was announced in 2018. About 800 million households will also get free food grains for three months, while 83 million households will get free cooking gas over that period. But those benefits will not reach many poor urban households because they may not be able to satisfy documentation requirements, economist Indira Rajaraman wrote in the newspaper Mint.\n“[The stimulus measures] are a good start, but the devil is in the details,” said Schofield. “One first order concern is how to actually get the transfers to those who need it. Administration of these benefits will be incredibly challenging. It will be important to be generous but also have some protections to make sure there isn’t too much leakage and diversion so that the benefits reach those who need them.”\nAnother huge barrier to efficient administration of benefits and stimulus funds is the high level of informality in the Indian economy, Schofield pointed out. About 85% of the labour force is informal. “This will make it much more challenging to target the aid since there aren’t strong records or distribution systems in the informal economy,” she said.\nSchofield called for support to small and mid-sized firms, along with spending to create demand for their products and services through direct cash transfers to individuals and households. Alongside, there is a need for substantial investments in public health (e.g., campaigns to improved adherence with wearing masks) so that people are able to reenter the economy more safely, she said",
  "retrievedAt": "2025-08-11T19:19:16.106Z"
}
