{
  "title": "PM resolves to take ties between ‘Iron Brothers’ to new heights",
  "link": "https://www.app.com.pk/national/pm-resolves-to-take-ties-between-iron-brothers-to-new-heights/",
  "date_published": "2022-05-21T07:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): Prime Minister Muhammad Shehbaz Sharif Saturday reiterated that the iron-clad ties between Pakistan and China would reach to new acme of bilateral cooperation, trust and affinities.\nIn a message on 71st anniversary of the establishment of diplomatic ties between Pakistan and China, the prime minister felicitated Chinese President Xi Jinping, the governments and the people of the two countries.\nHe said Pakistan and China were brotherly countries.\nToday has been a day when the two countries established diplomatic ties. The seeds of friendship during the last 70 years had now grown into a strong and fruit-bearing tree, he added.\nSince May 21, 1950, the leadership of the two countries had been playing their parts to further strengthen the time-tested ties, he added.\n“I want to salute all the leadership of China and Pakistan who have transformed this unprecedented friendship into a cooperative strategic partnership between the Iron Brothers,” the prime minister observed.\nThe prime minister said this iron-clad friendship would withstand tests of time, emerging situations, and enemies’ machinations.\nHe also paid tributes to those who had sacrificed their lives for Pakistan-China friendship.\nReferring to Karachi terrorist incident, the prime minister said they saluted the Chinese brothers and sister who laid down their lives and expressed his condolence with the bereaved families.\nThe prime minister resolved to eliminate the elements involved in such crimes.\nAbout the China Pakistan Economic Corridor (CPEC), the prime minister said it had laid the foundations to efface poverty from the region, foster economic cooperation, and regional connectivity, and bring stability.\nThe CPEC augured and guaranteed the bright future of the coming generations, he added.",
  "retrievedAt": "2025-08-11T14:56:47.904Z"
}
