{
  "title": "WHO assures full support to beef up response to AWD epidemic",
  "link": "https://www.app.com.pk/national/who-assures-full-support-to-beef-up-response-to-awd-epidemic/",
  "date_published": "2022-05-21T09:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): Country Representative, World Health Organization (WHO), Dr. Palitha Mahipala has visited the affected areas in Sindh and Balochistan and assured full support to beef up response to the present epidemic of acute watery diarrhea (AWD) or suspected Cholera cases.\nIn order to mitigate factors that may cause fatal dehydration, WHO has provided Aqua tablets, oral rehydration solutions, and antibiotics to Karachi, and Dera Bugti, Dr. Palitha said addressing on the occasion.\nHe said that the WHO will go an extra mile to assist the government of Pakistan to save the lives of people through this preventable disease.\nHe said that WHO immediately responded to the situation by scaling up interventions and mobilizing resources to the affected districts.\nHe added WHO was working closely with the health department and the agency has supported in preventive as well as clinical management domains.\nAdditionally, the agency as per its mandate has strengthened the laboratories in the provinces of Sindh and Balochistan by providing reagents and transport media for confirming the extent of the disease, he added.\nThe WHO Country Representative said that the WHO will also assist in the provision of clean drinking water, a precious commodity, in these districts.\nWHO-UNICEF joint steering committee has been constituted to create awareness and implement the WASH component for averting AWD/Cholera at the community level while urgent recruitment of health care workers has been completed.\nSimilarly, clinical treatment SOPs have been circulated and 312 doctors and health workers were trained. Social mobilizers will go house to house and agencies have dispatched broachers, leaflets, and banners.\nCoordination as an important pillar during outbreaks has been addressed through the constitution of joint working groups of government, WHO, and UNICEF.\nThree districts of Karachi including Central, East, and South, two in Balochistan including Dera Bugti and Harnnai, and one in Punjab which is Lahore have been hit by illness affecting hundreds.\nThe cases are continuously increasing and illness leads to life-threatening conditions. AWD is a dangerous state of health that can prove fatal if not managed properly.\nUnhygienic practices, poverty, and contamination of water are major contributing factors that may lead to AWD and Cholera.",
  "retrievedAt": "2025-08-11T14:56:46.092Z"
}
