{
  "title": "PM issues directives to take up conviction of Yaseen Malik under fake charges at relevant international fora: Marriyum",
  "link": "https://www.app.com.pk/national/pm-issues-directives-to-take-up-conviction-of-yaseen-malik-under-fake-charges-at-relevant-international-fora-marriyum/",
  "date_published": "2022-05-21T09:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Saturday that Prime Minister Shehbaz Sharif had issued directives to the Ministry of Law and Justice and the Ministry of Human Rights to raise at the concerned forums at international level the issue of the conviction of senior Hurriyat leader Yaseen Malik in an Indian court on concocted charges.\nLIVE #APPNews : Federal Minister for Information & Broadcasting @Marriyum_A along with @MushaalMullick addressing press conference #Islamabad  https://t.co/H3wayUGocG\nAddressing a press conference along with Kashmiri leader, Mashaal Malik, who is also wife of incarcerated Yaseen Malik, she said that India had made false allegations against peaceful Hurriyat leader Yaseen Malik.\nShe said according to Indian media reports, the Indian court indicted Yaseen Malik on May 19 on a fabricated terrorism case and he would be awarded a sentence on May 25. She said that India was conspiring to sentence him to death or life imprisonment through this fake case.\nYaseen Malik had not been accused of any negative activities till date as he was struggling for freedom of Kashmir through peaceful means, the minister said adding that Yaseen Malik had dedicated his entire life to Kashmir cause.\nShe said that Mashaal Malik met her husband Yaseen Malik in September2014 when their daughter Razia Sultana was only two years old.\nMarriyum said that Yaseen Malik who had given great sacrifices for Kashmir cause, in his video released from Tihar Jail was heard saying that he should be allowed to speak.She questioned that if India was not afraid of Yaseen Malik,  why it was not allowing him to speak and why it was not allowing Yaseen Malik’s free trial.\nThe minister said that India was blatantly violating international laws and conventions on human rights by inhuman incarceration of Yaseen Malik and many other Hurriyat leaders.She said that an organized campaign was being launched in India against Yaseen Malik through mainstream and social media.\nMarriyum Aurangzeb said that India was trying to create division among Kashmiris through the religious card, but it would fail in its nefarious and unholy designs.\nShe said that the Kashmiri people had never been and would never beslaves of  India despite its bullying and barbarism.\nIndia was afraid of late veteran Hurriyat leader Syed Ali Gilani and it did not allow his funeral as it was afraid of Gilani’s mortal remains, even today his grave was heavily guarded, she added.\nYaseen Malik, a peaceful freedom fighter, was being denied a free trial in contravention of international human rights. It was the responsibility of the international community to take cognizance of India’s blatant violations of international law by denying him basic rihgts.\nShe paid homage to the martyrs of Indian Occupied Kashmir including Maqbool Butt, Afzal Goru and Syed Ali Gilani who dedicated his whole life for Kashmiris.\nShe said that many pro-freedom  Kashmiri leaders, including Musarrat Alam, Shabbir Ahmed Shah, Asiya Andrabi and Mirwaiz Omar Farooq were also in jail, and they too were not being given access to the fair and transparent trial.\nShe lamented that Ashraf Sahrai was poisoned to death in jail. The minister said that there was a complete media blackout in occupied Kashmir and no one’s voice was being allowed to come out from there.\nShe said that Modi regime was worried over the Hurriyat leaders, that was the reason it was carrying out fascist activities in IIOJK to suppress the voice of pro-freedom leadership.\nThe international community should take notice of human rights violations being committed by Indian occupation forces in the occupied territory, she said.\nShe said that the treatment meted out to Yaseen Malik was against human rights protocols as he was not even allowed to fight his case and the international community must act on this Indian attitude.\n“Yaseen Malik has no access to a free trial, his voice is not being heard outside,” the minister said.She said no matter how hard India tried, it could not stifle the spirit of the Kashmiri people and independence movement.\nThe Pakistani nation, she said always stood with the Kashmiris forthe liberation of occupied Kashmir as Kashmir was the jugular vein of Pakistan,  and “we are not ready to back down an inch from it”.\nThe minister said that the fascist Modi regime implemented an illegal law on August 5, 2018, to annex the state of  Jammu and Kashmir and condemned it at every level.\nThe people of Kashmir want a resolution of the long-standing dispute in accordance with the UN resolutions, she maintained.",
  "retrievedAt": "2025-08-11T14:56:46.300Z"
}
