{
  "title": "Senate resolution on Bajaur blast demands effective measures by govts to contain terrorism resurgence",
  "link": "https://www.app.com.pk/national/senate-resolution-on-bajaur-blast-demands-effective-measures-by-govts-to-contain-terrorism-resurgence/",
  "date_published": "2024-07-04T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 04 (APP): The Upper Houe of the Parliament on Thursday unanimously approved the condolence resolution tabled by Senator Kamran Murtaza condoling the sad demise of Senator Hidayat Ullah in bomb blast incident in Bajaur demanding the federal and provincial governments to take active measures against terrorism resurgence in the country.\nThe 340th Senate session started almost eight minutes late with Chairman Senate, Syed Yousaf Raza Gillani in Chair that commenced with the recitation of Holy Quran verses from Surah Al Waq’iah that highlighted the bounties of the Almighty on pious and virtuous believers in the hereafter as a reward for their good deeds on the earth.\nPrior to the motion, the Chair announced the members for the panel of presiding officers of the 340th session including Senators Anousha Rehman, Saleem Mandviwalla and Abida Ateeba.\nThe Chair directed the mover Senator Kamran Murtaza to lead prayer for the departed soul of Senator Hidayat Ullah Khan and his colleagues who got killed in a bomb blast incident.\nPresenting the motion to the House, Senator Kamran Murtaza read the motion, “This House expresses its profound grief and sorrow over the sad demise of former Senator Hidayat Ullah and his colleagues in a tragic incident of bomb blast in Dama Dola area of Bajaur on 3rd July, 2024″.\nSenator Hidayat Ullah belonged to the Bajur Agency of erstwhile FATA. He was elected as Member of the Senate for two consecutive terms i.e., March, 2012 to March, 2018 and March, 2018 to March, 2024 as an Independent Member from FATA. During his tenure, Senator Hidayat Ullah always raised his voice for the rights of the under privileged people of tribal areas.\nHe remained an active member of the Senate of Pakistan and also served as the Chairman of the Senate Standing Committees on Aviation, Communications, Industries and Production and also as member of various other Standing Committees. He was well respected and widely liked by amongst all members.\nThe late Senator always took active part in debates on important legislation and other issues of national and public importance. The services rendered by him would be long remembered and his loss will be deeply mourned. The House resolves that the Federal and Provincial Governments take urgent and effective measures to combat the resurgent threat of terrorism in the country. We all share the loss sustained by his family and friends and expresses the deepest sympathies with the bereaved family. We pray to Almighty Allah to shower His infinite blessings upon the departed soul and may his soul rest in eternal peace (Ameen). A copy of this resolution may be sent to the bereaved family.”\nThe Senator requested the Chair that the House could not make up the loss of the deceased’s family, however a copy of the resolution may be sent to the bereaved family.\nThe Chair after the vote count directed the Senate Secretariat to send the copy of the motion to the family of deceased senator.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:41:22.946Z"
}
