{
  "title": "PM reaffirms Pakistan’s commitment to SCO objectives; urges collective efforts for peace, development",
  "link": "https://www.app.com.pk/national/pm-reaffirms-pakistans-commitment-to-sco-objectives-urges-collective-efforts-for-peace-development/",
  "date_published": "2024-07-04T08:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 4 (APP):Prime Minister Shehbaz Sharif on Thursday, reaffirming Pakistan’s commitment to SCO objectives of peace and prosperity, urged the member states to put in their collective efforts against terrorism, poverty alleviation and dispute resolution, particularly the ongoing Israeli barbarism in Palestine.\n“I reaffirm Pakistan’s commitment to working together to strengthen SCO as an active and integrated regional forum to achieve the common objective of peace and prosperity in line with the Shanghai spirit,” the prime minister said addressing the 24th Summit of the Council of Heads of State of the Shanghai Cooperation Organization (SCO), which commenced here in the capital city of Kazakhstan.\nTitled “Strengthening Multilateral Dialogue – Striving Towards a Sustainable Peace and Prosperity”, the summit is being attended by leaders from Pakistan, China, Russia, Tajikistan, Turkiye, Uzbekistan, Belarus, Iran, Kyrgyzstan, India and others.\nThe prime minister’s address encompassed all major regional and international issues, including terrorism and extremism, Islamophobia, instability in Afghanistan, poverty, climate change, regional connectivity, and resolution of disputes.\nThe prime minister said that Astana held significance for Pakistan where the country had formally joined the SCO in 2017 and congratulated Belarus for being the newest member.\nHe also felicitated Chinese President Xi Jinping on assuming the SCO chairmanship for 2024-25 and expressed confidence that under his visionary leadership, the SCO would continue to grow and prosper.\nHe told the international gathering that Pakistan aligned itself with socioeconomic and security objectives of the SCO as the country’s association with the Organization went back centuries.\nHe said during 23 years, the SCO had established itself as a credible and effective transregional organization.\nHe said contemporary realities of globalization and interdependence necessitated “working together and joining hands for a secure, peaceful and prosperous future for our people”.\n“SCO leaders have repeatedly underscored the importance of investing in connectivity in the SCO region through transport corridors and reliable supply chains… Promoting use of national currencies within SCO can help avoid international financial shock. Pakistan supports the proposal of an SCO alternate development fund mechanism to give impetus to various stalled initiatives,” he remarked.\nHighlighting Pakistan’s ideal geostrategic location, the prime minister said the China-Pakistan Economic Corridor (CPEC) – a flagship project of the Belt and Road Initiative (BRI) – also supplemented the SCO’s vision of regional connectivity and economic integration.\nComing to the climate change challenge, he called for a collective and urgent global response and reiterated Pakistan’s commitment to working for a sustainable and nature-positive world.\nHe told the gathering of SCO leaders that the rise in political and military conflicts across the globe and consequent hike in energy and food prices worsened the post-COVID recession seriously affecting the member states’ ability to address poverty. He said Pakistan would do its utmost to provide impetus to raise the living standards of people in the SCO member states.\nPrime Minister Shehbaz Sharif, calling the lasting peace and stability in Afghanistan the linchpin to achieving the SCO objective, urged the international community to meaningfully engage with the interim Afghan government to help meet their economic needs. Similarly, the interim Afghan government must also take effective measures to prevent the use of its soil for terrorism against any other state, he stressed.\n“Recent terror activities have been a matter of great concern for all of us. Terrorism and extremism by individuals, groups or states must be fought collectively in a comprehensive fashion. Terrorism in all its forms and manifestations, including state terrorism, must be condemned in clear and unambiguous terms. There can neither be any justification for killing innocent people nor should the bogey of terrorism be used for political point-scoring,” he said and emphasised outlawing Islamophobia universally.\nHe said Pakistan opposed divisive policies based on prejudice and discrimination, inciting hate on racial and religious basis.\nHe urged the need to ensure respect for the universally recognized principles of sovereignty, territorial integrity and people’s fundamental right to self-determination and said the United Nations Security Council resolutions offered a workable framework to resolve long-standing disputes, including those in the region. Failure to implement those resolutions had brought unimaginable sufferings to the people.\n“Failure to resolve issues amicably has brought sufferings…One of the worst examples is Palestine where 37,000 civilians, mostly women and children, have been killed, and over two million displaced due to Israeli indiscriminate and unabated bombing,” he said.\nPrime Minister Shehbaz urged the SCO to denounce the barbarism and called for an immediate ceasefire leading to the implementation of a two-state solution which should include the establishment of a contiguous Palestine state with pre-1967 borders and Al-Quds as its capital.\nHe told the gathering that as the current chair of the SCO Council of Heads of Government, Pakistan had already proposed to hold the next meeting CHG on October 15-16 this year and looked forward to hosting all leaders in Islamabad.\nHe said that Pakistan would strive to adopt forward looking initiatives to promote steady development and sought active and positive collaboration of all SCO member states.\nThe Council of Heads of States (CHS) discussed important regional and global strategic political, security and economic issues, challenges and developments.\nThe Council approved about 20 decisions in various areas of cooperation. Besides adopting the Astana Declaration that conveys the views of SCO leadership on important regional and global issues of interest to the Organization, the CHS adopted three statements on safety of drinking water and sanitation; effective waste management; as well as principles of good neighbourliness.\nThe Council also approved various plans and strategies for the ongoing cooperation in the economic and security fields. An agreement on environment protection was also signed by the relevant SCO ministers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:42:16.628Z"
}
