{
  "title": "Vaccine development training of OIC scientists begins in Jakarta",
  "link": "https://www.app.com.pk/national/vaccine-development-training-of-oic-scientists-begins-in-jakarta/",
  "date_published": "2024-07-04T10:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 4 (APP):COMSTECH in collaboration with Indonesian Ministry of Health, PT Bio Farma, and Padjadjaran University, the Center of Excellence on vaccine and biotechnology products, enrolled 12 researchers from nine OIC member states for training in virology and vaccine technology.\nThe program officially commenced with an opening ceremony in Jakarta. The event was held concurrently with a vaccine and virology workshop, accessible online to researchers and the general public across OIC member states.\nAmbassadors and representatives from OIC embassies in Jakarta were also present at the ceremony, said a news release.\nThe program offers a comprehensive learning experience, encompassing the workshops, industry visits, and laboratory training.\nTrainees will have the opportunity to visit PT Etana Biotechnologies Indonesia, Kalbe Business Innovation Center, and BRIN laboratories in Jakarta.\nThey will also undergo intensive training at PT Bio Farma’s laboratory and the central laboratories of UNPAD Bandung and Jatinangor. This program is aimed at researchers from OIC member countries who want to gain knowledge and expertise in vaccine manufacturing.\nThe program is designed to foster knowledge sharing and equip researchers with the necessary skills and expertise in virology and vaccine technology, ultimately strengthening vaccine development and manufacturing capabilities within OIC member countries.\nThis third phase of one month-long training program will be held in Jakarta and Bandung, west Java.\nParticipants from Indonesia, Cameroon, Kazakhstan, Malaysia, Egypt, Pakistan, Somalia, Tanzania, and Uganda, are participating in the program. First two phases of the same program have been successfully conducted in Indonesia in 2022 and 2023.\nIn his opening remarks, Indonesia’s Minister of Health, Budi Gunadi Sadikin, emphasized the role of the program in strengthening the capabilities of researchers from OIC countries in vaccine manufacturing.\nHe highlighted the importance of expanding vaccine research and development beyond developed nations, aiming for a more equitable global vaccine production capacity.\nHe said that this fellowship program is a testament to the collaborative efforts between the Indonesian government and the OIC-COMSTECH.\nHe underscored the significance of this initiative in ensuring global access to vaccines during future pandemics.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:42:07.188Z"
}
