{
  "title": "Health advocates call for enhanced cigarette taxes for public health",
  "link": "https://www.app.com.pk/national/health-advocates-call-for-enhanced-cigarette-taxes-for-public-health/",
  "date_published": "2024-07-04T13:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 04 (APP):Health advocates have expressed deep concern over the government’s decision to maintain current cigarette tax rates in the federal budget 2024-25.\nDuring a session organized by the Society for the Protection of the Rights of the Child (SPARC) and the Social Policy and Development Centre (SPDC) here Thursday, they highlighted the negative implications for public health and revenue generation.\nChief guest Murtaza Solangi, Former Federal Minister for Information and Broadcasting, stated, the federal budget 2024-25 missed a critical opportunity to generate substantial revenue through increased cigarette taxes. He said this revenue could have been invested in public health, easing the economic burden on our healthcare system. Instead, maintaining current tax rates benefits cigarette manufacturers without additional excise tax contributions, undermining tobacco control efforts and worsening the public health crisis caused by tobacco use, he expressed.\nHe further added that we must advocate for policies that prioritize public health and urge the government to implement measures that balance revenue generation with health objectives.\nManaging Director of SPDC, Muhammad Asif Iqbal, said that the government’s decision to spare the cigarette industry from any tax hike, despite the need to generate additional revenue to address the fiscal deficit, was of great concern. “The FED revenue target of Rs 324 billion for 2024-25 is unrealistically high without an increase in cigarette taxes, with estimates suggesting a shortfall of over Rs 100 billion. The Finance Act 2024’s changes benefit cigarette manufacturers by allowing price increases without additional excise tax revenue. The government should adopt a dual approach of increasing the FED rate and implementing regulations to combat the illegal cigarette trade”. Effective tobacco control policies should leverage higher cigarette taxes as a tool to discourage tobacco use and promote public health, he added.\nRenowned tobacco control activist Malik Imran Ahmed, Country Head Campaign for Tobacco Free Kids added, the increase in the FED price tier thresholds only serves to benefit the cigarette manufacturing firms, allowing them to increase consumer prices without any additional contribution to excise tax revenue. This approach, he said not only undermines our efforts towards tobacco control but also risks exacerbating the public health crisis caused by tobacco consumption.\nDr. Khalil Ahmad, Program Manager SPARC said, while the Finance Bill’s provision may enhance profitability within the tobacco industry, its implications for public health and fiscal policy are significant and contentious. The debate underscores the delicate balance governments must strike between economic interests, public health priorities to save Pakistani children and youth from addiction and disease and sustainable fiscal management, he expressed.\nMr. Mehboob-ul-Haq, CEO Human Development Foundation (HDF), emphasized that higher cigarette taxes were crucial for discouraging tobacco use and protecting public health. The recent budget decisions highlight the need for continued advocacy to ensure public health priorities are not overshadowed by industry interests. The decision has raised alarms among healthcare advocates and the general public alike, who fear its long-term ramifications on public health and economic stability, he said.\nAs discussions on the Finance Bill progress, stakeholders continue to call for a reconsideration of policies that prioritize short-term industry gains over the broader public interest.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:41:42.231Z"
}
