{
  "title": "Pakistan, Turkiye, Azerbaijan agree to strengthen trilateral cooperation to promote regional, global peace",
  "link": "https://www.app.com.pk/national/pakistan-turkiye-azerbaijan-agree-to-strengthen-trilateral-cooperation-to-promote-regional-global-peace/",
  "date_published": "2024-07-04T18:07:00.000Z",
  "source": "APP",
  "content": "ASTANA, Jul 4 (APP):Turkiye, Azerbaijan and Pakistan have agreed that strengthening the trilateral cooperation would not only contribute to prosperity of the peoples of the three countries, but also serve to promote regional and global peace and stability.\nRecep Tayyip Erdogan, President of Türkiye, Ilham Aliyev, President of Azerbaijan and Shahbaz Sharif, Prime Minister of Pakistan met in Astana on July 3 on the side-lines of the 24thMeeting of the Council of Heads of State of the Shanghai Cooperation Organization (SCO), a joint statement on the meeting issued on Thursday said.\nThe statement added that in the trilateral summit, relations among Türkiye, Azerbaijan and Pakistan as well as regional and global matters, such as Gaza, Cyprus, Kashmir, Islamophobia, were discussed.\nThe Türkiye – Azerbaijan – Pakistan trilateral cooperation process, which held meetings at the level of Speakers of Parliaments and Ministers of Foreign Affairs previously, would also meet at the level of state leaders. Their common will to develop opportunities for cooperation among the three countries was also affirmed.\nThe three countries expressed their support for prioritizing dialogue among relevant countries in conflict resolution, in line with principles of sovereignty and territorial integrity.\nThe importance of cooperation among the three countries in combating transnational threats, particularly in the fight against terrorism, and joint resolution of this matter was also reaffirmed.\nSubsequent meetings of the trilateral cooperation process would be held in all the three countries, namely Türkiye, Azerbaijan and Pakistan, the statement added.",
  "retrievedAt": "2025-08-11T03:40:36.866Z"
}
