{
  "title": "PM’s climate aide Romina Khurshid lauds Qatar’s support to boost Pakistan’s climate resilience",
  "link": "https://www.app.com.pk/national/pms-climate-aide-romina-khurshid-lauds-qatars-support-to-boost-pakistans-climate-resilience/",
  "date_published": "2024-07-04T10:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 04 (APP): A high-level three-member technical delegation of Qatar, led by Colonel Ahmed Abdullah Al-Abdullah, Thursday called on\nCoordinator to Prime Minister on Climate Change Romina Khurshid Alam, where the PM’s aid lauded Qatar’s support to boost Pakistan’s climate resilience.\nDuring the meeting held here at the Ministry of Climate Change and Environmental Coordination, both sides discussed at length the various matters of bilateral interest and collaboration regarding climate risk management, environment conservation, water management, energy, forest and disaster risk management, a news release said.\nPM’s climate aide Romina Khurshid briefed the Qatari delegation about Prime Minister’s various clean and green initiatives being implemented to boost Pakistan’s climate resilience and protect lives and livelihoods of the country’s vulnerable communities.\n“The present government led by Prime Minister Mian Muhammad Shehbaz Sharif is more focused on engaging with various countries through climate diplomacy to boost global climate action so as to deal with adverse fallouts of the global warming and consequent disasters, particularly heatwaves, floods, land erosion and sea-level rise,” Romina Khurshid apprised the Qatar’s official delegation.\nDuring the meeting, she also highlighted challenges and impacts of global warming, climate change, heatwaves and devastating floods during monsoon seasons being faced by the country.\nRomina Khurshid Alam told the delegation that Pakistan is grappling with increasingly severe impacts from climate change, posing significant challenges to its environment, economy, and people.\n“The country is continuously experiencing a rise in average temperatures, leading to more frequent and intense floods and heatwaves across the country. These extreme heat events not only threaten public health but also strain energy resources and exacerbate water scarcity issues,” the PM’s climate aide told the Qatari delegation.\nShe added, “The frequency of extreme weather events such as floods and droughts has been increasing. These events disrupt agricultural productivity, cause loss of lives and livelihoods and strain already fragile infrastructure.”\nDuring the meeting she also highlighted that the water stress, exacerbated by the climate change during recent years has emerged to be a critical and added that “Pakistan is heavily relies on its river systems for agriculture and domestic water supply, but climate impacts are altering water availability and quality, further straining these vital resources.”\nThe PM’s climate aide also shared progress on various initiatives of the present government related to climate change risk mitigation, environmental conservation, water efficiency, energy conservation, tree plantation programme, flood risk management and heatwaves.\nHead of Qatar delegation Colonel Ahmed Abdullah Al-Abdullah lauded Prime Minister Shehbaz Sharif’s initiatives of environment conservation, climate risk management, disaster management, Green Pakistan Programme, Living Indus Initiative, Glacial Lake Outburst flood management and Urban Resilience.\nColonel Ahmed Abdullah Al-Abdullah told the PM’s coordinator Romina Khurshid Alam that the government of Qatar is aware of Pakistan’s climate vulnerability and efforts being taken by the present government to cope with the exacerbating impacts of climate change on the country’s various socio-economic sectors, particularly agriculture, water, energy, food security, health and education.”\nHe said further that the Qatari government intends to extend and strengthen the cooperation and collaboration in climate-vulnerable socio-economic sectors, which are bearing the brunt of the climate change, specially health, education, food security, water and energy.\nThe Qatari delegation head Ahmed Abdullah Al-Abdullah also pledged to provide every possible technical and non-technical support to Pakistan to achieve climate change, environmental conservation, national disaster risk management and flood protection goals.\nPM’s coordinator Romina Khurshid Alam thanked the Qatar delegation for pledging support for addressing climate change, disaster risks and achieve environmental conservation and protection goals.",
  "retrievedAt": "2025-08-11T03:41:47.892Z"
}
