{
  "title": "Ministry of Interior shares details of protest fiasco orchestrated by PTI",
  "link": "https://www.app.com.pk/national/ministry-of-interior-shares-details-of-protest-fiasco-orchestrated-by-pti/",
  "date_published": "2024-12-01T10:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 01 (APP):The Islam­abad High Court (IHC) on November 21 directed the federal government to take all necessary measures to maintain law and order in the federal capital, says the handout issued by the Ministry of Interior on Sunday, sharing all the details of the protest fiasco orchestrated by Pakistan Tehreek-e-Insaf (PTI).\n\nThe High Court directed the Interior Minister to engage with the PTI leadership in this regard, says the handout adding that given the sensitivity of the Belarusian President and Chinese high-level delegation visit, PTI was initially asked to postpone the protest but on their persistence to continue with the protest, PTI was subsequently offered Sangjani area as a designated location. In this regard, out of the ordinary and at odd timings, meetings were also allowed between PTI leadership and its founder. On the contrary and inspite of the extraordinary concessions extended, PTI violated the court’s orders blatantly and instead of holding protest at designated place (Sangjani), unlawfully breached entry towards the Red Zone of Islamabad.\n\nThroughout the protest march from Peshawar to Red Zone Islamabad, violent protestors of PTI aggressively engaged LEAs repeatedly using fire arms and all sorts of other weaponry including steel sling shots, stun grenades, tear gas shells and nail studded batons to force their way to Red Zone Islamabad. This violent protest was primarily orchestrated and logistically & financially sustained and supported by the resources of the government of KP. Alarmingly, PTI’s protest included violent and trained miscreant elements including many illegal Afghan nationals who spearheaded the riots and violent activities throughout the march. These miscreants, employed as violent vanguard, comprised of approximately 1500 hard core fighters working directly under absconder and proclaimed offender Murad Saeed. This vanguard group, using militant tactics violently attacked the LEAs and breached the blocks with the help of government machinery paving the way for the second wave of vehicles and protestors to cross. It must be noted that LEAs personnel, despite sustaining grievous injuries, exhibited high degree of restraint against these violent protesters led by trained miscreants.\n\nDuring this, a vehicle also ran over Rangers personnel performing duty at a check post in Islamabad, resulting in the shahadat of three Rangers soldiers and critical injuries to five. Besides, during the violent protest, one policeman embraced shahadat and 232 LEAs personnel were also grievously injured by these miscreants. This violent mob not only attacked security forces but also set multiple police vehicles on fire, showcased firearms, burnt trees and police tents, damaged properties and created terror among the common citizens.\n\nPakistan Army was deployed in Islamabad under Article 245 of the Constitution only to secure key government installations and foreign diplomats in the sensitive Red Zone while ensuring secure environment for high-profile foreign dignitaries visiting the country.\n\nOn 26 November, as protesting miscreants reached Red Zone, violating the lawful orders of the IHC, the situation escalated and they directly clashed multiple times with LEAs using fire arms, tear gas shells, stun grenades, steel slingshots and nail-studded batons etc.\n\nLEAs comprising Police and Rangers were employed without live ammunition to disperse this violent mob while the Army neither came in direct clash with these miscreants nor employed for riot control. During this process, the armed guards of the protesting leaders and the hard-core armed miscreants resorted to indiscriminate firing. The leadership under the cover of such self-induced violence instead of controlling the violent mob fled from the area. Once the area had been cleared from the violent protestors and miscreants, a site media visit was also promptly undertaken by both the Information Minister and Minister for Interior followed by the press talks.\n\nUnfortunately, the social media accounts of PTI resorted to planned and coordinated massive fake propaganda of deaths caused by LEAs so as to divert attention from this senseless, violent and failed activity. The major hospitals of the Capital city after due diligence rubbished reports of alleged gunshots and casualties inflicted by LEAs. However, a sustained fabricated social media campaign, using old and AI-generated clips is being viciously undertaken by PTI and joined by other inimical elements. There have been multiple false claims of deaths ranging from tens to hundreds to thousands on social media as well as PTI political leadership and their official pages.\n\nAlarmingly, certain elements of foreign media also fell prey to this fake news and propaganda without any credible evidence. The government functionaries including Ministers as well as Chief Commissioner ICT and senior police officials, who were directly involved in these riot control operations, have already repeatedly explained and clarified the actual situation and events unfolding with credible evidence. It may also be noted that the use of lethal means by LEAs, if at all to be employed, was best suited at multiple enroute blocks rather than within Red Zone under complete media and public glare.\n\nOfficers and jawans of LEAs embraced shahadat, sustained injuries and risked their lives enduring grave physical hardships for multiple days to protect the lives and properties of citizens of Pakistan. Still, many jawans of Rangers and Police are critically injured and are receiving medical care.\n\nUnfortunately PTI and its social media propagandists are bent upon to create divisions and confusion within society. Such elements, whether inside the country or abroad, will surely be held accountable under relevant laws and no one will be allowed to sow divisions, hatred and propagating fake news.\n\nIt is deplorable that the Chief Minister of KP made baseless inflammatory statements against institutions, using KP Assembly as a platform to distort facts and spread blatant lies, rather than being ashamed of inciting innocent youth of KP for such undesirable activities.\n\nIt is concerning to note that 39 lethal weapons including 18 automatic weapons have been recovered from the violent protesters and that amongst the apprehended offenders there are more than three dozen paid aliens.\n\nWith regards to material losses incurred during the violent protests, initial estimates suggest damages to the tune of hundreds of millions.\n\nBesides, 11 vehicles of LEAs were damaged including prison vans set ablaze.\n\nDue to these violent protests, indirect losses to the economy are estimated to be Rs 192 billion per day. In addition to that, significant expenditure is incurred on taking necessary security measures. While the plundering of the financial resources by the KP Government is separate.\n\nThe people of Pakistan including the proud people of Khyber Pakhtunkhwa reject this kind of violent and extremist streak of politics. They also reject the baseless allegations and malicious designs behind the vicious propaganda and the complete nation wholeheartedly stands firm with peace and stability in the country.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T11:47:52.615Z"
}
