{
  "title": "Harmain Al-Sharifain’s message, a great source of peace, moderation in world: religious scholars",
  "link": "https://www.app.com.pk/national/harmain-al-sharifains-message-a-great-source-of-peace-moderation-in-world-religious-scholars/",
  "date_published": "2022-10-22T16:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP): The message received from the Harmain Al-Sharifain can end sectarianism, extremism and terrorism as it is a great source of peace and moderation in the world.\nThe Harmain Al-Sharifain was the center of unity and stability of the Muslim Ummah, said the religious scholars of various Islamic countries while addressing ‘International Tahzeem-e-Harmain Al-Sharifain Conference’ in Abuja (Nigeria) on Saturday.\nThey were of the view that unity and stability were need of the day to contain Islamophobia and resolve other issues confronting the Muslim Ummah on the globe.\nThe conference was chaired by Secretary General of International Tahzeem-e-Harmain Al-Sharifain Council Hafiz Muhammad Tahir Mahmood Ashrafi. Leading Ulema, Mashaykh and religious scholars from all over the Islamic world, including Dr Ibrahim Jamia Otoyo, Dr Dawood Abdul Baqi Muhammad, Dr Imam Issa Abdul Kareem, Dr Sulaiman Usman, Dr Muhammad Abdullah Al-Thani, Dr Sharafuddin Badibur Aji, Dr Muhammad Munir Ilyas, Dr Muhammad Al-Haaj Abu Bakr, Dr Abu Bakr Muhammad Al-Thani, Dr Al-Khizar Abdul Baqi Muhammad and others also addressed the conference, said a statement received here.\nThey commended the services of Khadim-e-Harmain Al-Sharifain Shah Salman bin Abdul Aziz and his Crown Prince Muhammad bin Salman.\nThey said the entire Muslim Ummah’s stance was loud and clear that they would not compromise on the security, sanctity and stability of the soil of Harmain Al-Sharifain. They also supported and endorsed the stance of Saudi Arabia on all the issues.\nOn the occasion, Ashrafi, who is also prime minister’s special representative for interfaith harmony and middle east and Pakistan Ulema Council’s chairman, said, “to get rid of sectarianism, extremism and terrorism, we had to disseminate the message of Islam in its actual context, which we received from the Holy Lands of Makkah and Madinah.”\nHe said the message of Islam was peace, security and moderation, and its teachings completely rejected sectarianism, extremism, and terrorism anyway.\nWith the advent of Islam, slaves and women got their respective rights as the Prophet Muhammad (Peace Be Upon Him) taught to love the humanity, he added.\nHe said the situation of unrest in some Islamic countries was due to the external interference which should be stopped on immediate basis.\nAshrafi said Kashmir and Palestine were the two burning issues of Muslim Ummah, and they should be resolved as per the will of the Kashmiris and Palestinians.\nHe said the stance of Saudi Arabia on the issue of oil was in the right direction, adding that Pakistan and the entire Islamic world were standing by its narrative.\nHe said interfaith dialogue was also need of the hour. Pakistan had prepared a document titled ‘Paigham-e-Pakistan’ (Message of Pakistan), which has become a beacon against sectarianism, extremism and terrorism. The way Saudi Arabia serving the humanity was admirable and praiseworthy, he added.",
  "retrievedAt": "2025-08-11T15:46:41.575Z"
}
