{
  "title": "Marriyum urges OIC states to step up efforts for combating Islamophobia",
  "link": "https://www.app.com.pk/national/marriyum-urges-oic-states-to-step-up-efforts-for-combating-islamophobia/",
  "date_published": "2022-10-22T13:14:00.000Z",
  "source": "APP",
  "content": "ISTANBUL, Oct 22 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Saturday underscored that the Organisation of Islamic Cooperation (OIC) should more proactively play its role in protecting the fundamental rights of Muslims across the globe, especially in those areas where they were in minority.\nAddressing the 12th Session of Islamic Conference of Information Ministers, she said it was high time for the OIC member states to step up efforts for combating the Islamophobia rising gradually across the world.\n“The abhorrent phenomenon of Islamophobia is not abating. In our region – South Asia – hate speech and hate crimes against Muslims remain a source of increasing concern. Despite our efforts to the contrary, there has been a constant rise manifested in mob lynching, pre-planned communal riots, and negative portrayal in electronic and social media in India.”\nAs a representative of the collective aspirations of the Muslim Ummah, she stressed, the OIC was uniquely poised to lead the endeavour, and must throw its full political and economic weight and clout in protecting the fundamental rights of Muslims and interests of Muslim minorities across the globe.\nShe put forward multiple recommendations coupled with observations regarding the challenges faced by the Muslims, especially their faith Islam in the information domain.\nThe minister highlighted deliberate use of instruments of information control that define perceptions about Islam and the Muslims.\nShe cited that many Muslim countries now had independent media which had made inroads into the people’s minds about stereotyped image of Islam.\n“Information colonialism has to be fought,” she said, suggesting that a new independent information regime established. “More needs to be done in terms of creating information synergies among the Muslim states.”\nThe Muslim states should look within, and tackle those currents and trends at home that were feeding misperceptions about Islam and the Muslim societies, she stressed.\n“More democracy, more public participation, more inclusivity and focus on freedom of speech that is culturally sensitive and internationally projectable should be our goal to tackle the motivated misrepresentation,” she said while highlighting the steps required for taking the hate-mongers to the task.\n“We must fight fake news with real news; fight bots with real people’s aspirations and fight trolls with genuine polls. Laws are needed to identify and prosecute promoters of hate and deception. However, we must continue to uphold basic freedoms.”\nThe minister emphasized that the OIC member states must capitalize on the momentum generated by the adoption of the United Nations General Assembly resolution, designating 15th March as the ‘International Day to Combat Islamophobia’.\nThe OIC Secretary General, she said, should accord priority to appointment of a Special Envoy on Islamophobia, as mandated by last the Council of Foreign Ministers’ resolution in Islamabad.\nThe formation of an OIC-led panel of experts, she added, would be useful to advise the Organization in dealing with incidents of Islamophobia as well as providing support to its victims.\nShe said Pakistan believed that the significance of OIC’s efforts in combating disinformation in the post-truth era could not be overemphasized. “We reiterate our commitment to the principles and goals enshrined in the OIC-2025 Programme of Action on Media and Public Diplomacy, and we are also committed to ensure capacity building and sharing of best practices within OIC.”\nThe minister further recommended the OIC states to coordinate their efforts for using wide-ranging media tools and options to showcase the true image of Islam and its teachings; propagation of tolerance and peaceful coexistence; and rejection of extremism and terrorism.\nShe underlined the need for establishing strategic partnerships among media organizations of the OIC member states, besides Joint Islamic Media Action Institutions for propagating Islamic values like tolerance, and curbing disinformation, in the true spirit of Islamic solidarity.\nThe minister said the Department of Information of the OIC General Secretariat should lead collective efforts to counter disinformation and Islamophobia. It could select journalists from the member states and organize field trips to Jammu and Kashmir and Palestine with a view to facilitating investigative journalism and factual reporting by the respective media outlets, she added.\nShe said the OIC should institutionalize tangible targets for cultural and media exchange. “We can also utilize the huge potential of screen tourism to enhance mutual understanding of our people and our cultures.”\nThere was a need to establish a ‘Working Group on Disinformation and Islamophobia’ in the age of social media and cyberspace, which, she said, might work in an inter-sessional mode with the objective of sharing experiences and discussing the issues in detail.\nShe said the Working Group could also be used for standard setting by utilizing the best practices, and expressed the desire to host its first meeting by Pakistan.\nOn the occasion, she also drew your attention of the participants to some other major challenges faced by the OIC states and the role of media in addressing the same.\n“Climate change is the biggest generational issue of our time. Recently, my country Pakistan has faced catastrophic and unprecedented climate-induced floods – causing massive loss of life, property and livelihood,” she said.With over one third of Pakistan’s land under water, more than 33 million people affected and over 500,000 forced to move to relief camps as over 1 million homes damaged, she said the climate-induced floods had resulted in losses estimated at $40 billion.\nShe said the Government of Pakistan had undertaken an extensive operation for relief, recovery and rehabilitation in the flood affected areas. “We are grateful to international community, in particular OIC countries, for their invaluable contribution for flood relief efforts.”\nMarriyum said she would especially highlight extensive and multipronged assistance given by the Republic of Turkiye under President Erdogan’s leadership.\n“The catastrophic floods in Pakistan are a perfect example of the climate injustice many countries face today. Many member states of OIC, like Pakistan and Nigeria recently, are amongst the most climate vulnerable countries in the world – even though our carbon emissions are negligible,” she said, urging the media in the OIC countries to underscore the importance of an urgent, unified and decisive action by the international community to combat climate change and enhance climate financing geared to building the necessary resilience – especially in vulnerable developing countries.\n“Pakistan pays tribute to the steadfastness of the Kashmiri and Palestinian people, and calls upon the media in member states to continue providing maximum coverage to the suffering and brave struggle of the Kashmiri and Palestinian people, who continue to face relentless aggression and violations of basic rights at the hands of the Indian and Israeli occupation forces,” she remarked.\nShe said the media in the OIC geography must accord priority to highlighting the systematic violations and transgressions, and inform as well as educate the world on the reality and magnitude of the ensuing human rights and humanitarian crises in occupied territories.\nOn its part, she said, Pakistan had been consistently leading peace efforts in the region from the front.\nMarriyum expressed the hope that Pakistan’s efforts for durable peace and long-term development in the region would be reciprocated.\nShe said she was confident that meaningful deliberations during the session would contribute meaningfully to “our collective effort to counter disinformation and Islamophobia, and enhance our mutual cooperation to ensure that we can squarely and effectively address these challenges”.\nThe minister also thanked the government and people of Türkiye for their generous and warm hospitality.",
  "retrievedAt": "2025-08-11T15:46:41.579Z"
}
