{
  "title": "Lahore engulfed by smog every winter due to lack of leadership in past: Fawad",
  "link": "https://www.app.com.pk/national/lahore-engulfed-by-smog-every-winter-due-to-lack-of-leadership-in-past-fawad/",
  "date_published": "2021-11-20T11:21:00.000Z",
  "source": "APP",
  "content": "JHELUM, Nov 20 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Saturday lashed out the past rulers of Punjab for causing substantial damage to its capital city’s green cover which had adversely affected air quality in Lahore.\n“We see Lahore as engulfed by fog in every winter due to past rulers of Lahore who had cut trees for building a jungle of concrete there which badly affected jungle cover of Lahore and its surroundings, Punjab and overall Pakistan,” he said while addressing the inaugural ceremony of Green Day Plantation.\nHe said prior to PM Imran Khan, there was no discussion on environment in the country due to lack of a leadership which could have stressed on forestation and eco-friendly activities in a way as by the prime minister with full intensity and devotion.\nFawad said it seemed that those who built palatial palaces might have forgotten that there would be suffocation while living in those big concrete buildings. For preventing suffocation, it was imperative to plant and grow trees, he added.\nThe minister said the name of billion tree tsunami project became public knowledge for the first time in the history of Pakistan when Pakistan Tehreek-e-Insaf government first came into the power in Khyber Pakhtunkhwa.\nWhen PM Imran Khan took oath, the first project announced by him was of planting 10 billion trees in the country, the minister added.\nHe said the prime minister always stressed that only that person could be called as a genuine leader who thought of future generation instead of the next elections. The entire emphasis laid by PM Imran Khan on environment was mainly about the future generation of Pakistan.\nFawad said it was vision of the prime minister to leave behind a safe and secure environment for the generations to come as there had already been an increase in respiratory ailments and deadly disease like cancer due to least focus of past rulers on environment of the country.\nHe said he felt glad to inform the public that a jungle spanning over 10,500 acres land of Jhelum has been preserved by the present government.\nAs many as 26,000 trees were planted on 35 acres land of Bajwala jungle when the prime minister announced a mega tree plantation campaign in 2018, he said, while pointing to extensive plantation of eucalyptus saplings there recommended by the relevant district forest department due to salinity.\n“We will plant 20,000 trees on 25 acres land today (Saturday) here,” he said while asking the audience to clap for around 6,000 students who came to participate in the Green Day Plantation activity.\nThe minister felicitated officers of district administration and forest division and locals and students for their active participation in the plantation drive.\nUrging the students to look after the saplings through intermittent visits in future, he asked them to leave any mark around the plant they were planting so that they could identify them later.\nExtending gratitude to the envoys of different countries for attending the Green Day Plantation, the minister said, “I hope you will be able to tell this beautiful story that how these children actually contributed in a big way towards environment.”\n“Environment is an issue that is not only related to one country or to the one community, so the tree planted here actually affects the environment of Europe as well because this is the whole world which gets affected by the environment,” he added.\nThe minister also shed the light on the mega projects carried out by the present government in Jhelum. “We have brought those projects to Jhelum that could not even think of by anyone in the past,” he remarked.\nAbout Lillah-Jhelum dual carriageway, he said it would be completed soon. The economy of Jhelum and adjacent areas would entirely change after the completion of the dual carriageway.\nWork on Jalalpur canal project was in full swing, he said, adding it would provide water to 178,000 acres of land of Jhelum after completion.\nHe said Jhelum was not getting its due share from tax net when he contested election from there. “But, now by grace of the God, we have ensured projects worth Rs 70 billion for the tehsil of Pind Dadan Khan and Jhelum during the last three years.”\n“This is the right of the people living in different areas of Jhelum,” he said while paying tribute to martyrs and ghazis of the city, as well as, of the country for their services.\nThe minister said the agricultural economy and industrial sector got a new boost during the present government’s tenure.\nHe said the government was making serious efforts to control inflation which went up in the country due to global inflation.",
  "retrievedAt": "2025-08-11T21:38:23.444Z"
}
