{
  "title": "PM directs to urgently resolve issues as Chinese investors set to launch operations",
  "link": "https://www.app.com.pk/national/pm-directs-to-urgently-resolve-issues-as-chinese-investors-set-to-launch-operations/",
  "date_published": "2021-11-20T06:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 20 (APP): Prime Minister Imran Khan Saturday directed the authorities concerned to facilitate all Chinese investors, who were setting up industries in Pakistan, on emergency basis by resolving their issues related to road connectivity and the provision of utilities.\n“We will support Chinese businesses in Pakistan on the priority basis, and are grateful to them for their keen interest in accelerating their investment in Special Economic Zones (SEZs),” said Prime Minister Imran Khan in a meeting with Chinese business delegation led by Chen Yan from Challenge Fashion (Pvt) Ltd.\nDuring the meeting, the prime minister was told that Chinese businessmen are almost ready to start operations in the glass, ceramics and information technology sectors.\nThe prime minister said that Pakistan and China were connected not only in the past or present but would remain united through their future generations too.\n“We appreciate the valuable relationship of the peoples of the two countries,” he added.\nIt is worth mentioning that OPPO, one of the leading tech manufacturers in the world, is going to establish a local mobile manufacturing unit and a research and development centre in Pakistan.\nIt would not only save a lot of foreign exchange reserves on the import of smartphones annually but would also create employment opportunities for our tech graduates.\nThe meeting was also attended by Energy Minister Muhammad Hammad Azhar, Advisor on Commerce Abdul Razzak Dawood, SAPM on Political Communication Dr Shahbaz Gill, SAPM on CPEC Affairs Khalid Mansoor and Chinese Ambassador Nong Rong along with senior officers concerned.\nIn his remarks, Chinese Ambassador in Pakistan Nong Rong said that he was very happy assince the prime minister’s previous meeting with the Chinese businessmen on September 13, a lot of issues had been resolved and great progress had been achieved.\nHe said that the Chinese entrepreneurs were encouraged and hoping great progress after this meeting.\n“We will send more positive information to China to encourage more Chinese businessmen to make decision to invest in Pakistan,” he commented.\nA Chinese entrepreneur representing OPPO, said that the company had already been present in Pakistan for more than seven years and had made around $150 million investment in the country.\nHe said like other companies, for OPPO too, it was a very good environment in Pakistan to continue to invest there and the interaction with the prime minister helped the swift resolution of the issues.\nHe thanked the prime minister for helping the Chinese businessmen by extending facilitation to them.\n“If anybody comes to me and ask should they invest in Pakistan, I will say yes,” he remarked.",
  "retrievedAt": "2025-08-11T21:38:23.778Z"
}
