{
  "title": "26 nations vow to give Ukraine postwar security guarantees, Macron says - World - DAWN.COM",
  "author": null,
  "content": "Twenty-six nations have pledged to provide postwar security guarantees to Ukraine, which will include an international force on land and sea and in the air, French President Emmanuel Macron said after a summit meeting of Kyiv’s allies on Thursday.\n\nMacron said he, fellow European leaders and Ukrainian President Volodymyr Zelenskiy held a call with United States President Donald Trump after their summit, and US contributions to the guarantees would be finalised in the coming days.\n\nThe meeting of 35 leaders from the “coalition of the willing” — of mainly European countries — was intended to finalise security guarantees and ask Trump for the backing that Europeans say is vital to make such guarantees viable.\n\nSecurity guarantees are intended to reassure Ukraine and deter Russia, which launched a full-scale invasion of Ukraine in 2022, from attacking its neighbour again.\n\n“The day the conflict stops, the security guarantees will be deployed,” Macron told a press conference at the Elysee Palace in Paris, standing alongside Zelenskiy.\n\nEuropean officials say peace looks a distant prospect for now, but they want to be ready whenever the war ends. They also see the planning of security guarantees as a way to reassure Kyiv of their support and hope Trump will join their efforts.\n\nMacron initially said the 26 nations — which he did not name — would deploy to Ukraine. But he later said some countries would provide guarantees while remaining outside Ukraine, for example, by helping to train and equip Kyiv’s forces.\n\nHe did not say how many troops would be involved in the guarantees.\n\nGermany and other countries pledged they would be involved in that effort. But Berlin said it would decide on a military commitment only when conditions were clear, including the extent of US involvement in security guarantees.\n\nItalian Prime Minister Giorgia Meloni made clear she would not send troops to Ukraine but said Italy was open to monitoring a ceasefire and training Ukrainian troops outside the country.\n\nFrance and Britain, which co-chair the coalition of the willing, have indicated they are open to deploying troops to Ukraine after the war ends.\n\n“We are working out which countries will take part in which security component,” Zelenskiy said.\n\n“Twenty-six countries agreed to provide security guarantees. Today, for the first time in a long time, this is the first such serious, very specific substance.”\n\nOn his call with the coalition leaders, Trump said Europe must stop purchasing Russian oil that he said is helping Moscow fund its war against Ukraine, a White House official said.\n\n“The president also emphasised that European leaders must place economic pressure on China for funding Russia’s war efforts,” the official said.\n\nMacron said the coalition and the US had agreed to work more closely on future sanctions, notably on Russia’s oil and gas sector, and on China.\n\nEuropean governments have said European forces in Ukraine would need their own US security guarantees as a “backstop”. Trump has made no explicit commitment to go that far.\n\nHis special envoy, Steve Witkoff, met French, British, German, Italian and Ukrainian senior diplomats ahead of the summit, before briefly attending the opening session.\n\nEuropean officials also wanted to highlight a lack of progress toward direct peace talks between Russian President Vladimir Putin and Zelenskiy since Trump hosted Putin in August, and to prod Trump to raise pressure on Moscow now.\n\nHaving rolled out the red carpet in Alaska, Trump on Wednesday accused Putin of conspiring with China and North Korea after the three countries’ leaders staged a show of unity in Beijing at a lavish commemoration of the end of World War Two.\n\nPutin told Kyiv on Wednesday there was a chance to end the war in Ukraine via negotiations “if common sense prevails”, an option he said he preferred, although he was ready to end it by force if that was the only way.\n\nPutin also ruled out the deployment of troops from Nato nations to Ukraine as part of a peace settlement. But Nato Secretary General Mark Rutte dismissed his objections.\n\n“Why are we interested in what Russia thinks about troops in Ukraine? It’s a sovereign country,” he said at a conference in Prague before joining the Paris summit by video link.\n\n“Russia has nothing to do with this,” he said. “I think we really have to stop making Putin too powerful.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/0423540665bf8a8.webp",
  "retrievedAt": "2025-09-06T10:02:28.065Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939732/26-nations-vow-to-give-ukraine-postwar-security-guarantees-macron-says",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T18:54:39.000Z"
}
