{
  "title": "Sinner powers into US Open semis, Anisimova gains Swiatek revenge - Sport - DAWN.COM",
  "author": null,
  "content": "Reigning champion Jannik Sinner marched into the US Open quarter-finals Wednesday as Amanda Anisimova avenged her Wimbledon thrashing by Iga Swiatek to set up a last-four clash with Naomi Osaka.\n\nWorld number one Sinner swept aside 10th seed Musetti 6-1, 6-4, 6-2 in the first all-Italian men’s quarter-final in Grand Slam history.\n\n“It was a great performance, very solid. I started the match very well,” said Sinner, who faces Canadian 25th seed Felix Auger-Aliassime in the semi-finals on Friday.\n\nAuger-Aliassime has won two of three previous meetings but Sinner thrashed him for the loss of just two games in Cincinnati last month.\n\n“Every player who is in the semis of a Grand Slam can say they’re playing their best tennis,” added Sinner.\n\nThe 24-year-old Sinner also tied Nicola Pietrangeli for the most Grand Slams win by an Italian man with his 86th victory.\n\nAuger-Aliassime overcame Alex de Minaur in a four-set battle lasting over four hours to reach his second US Open semi-final.\n\nThe 25-year-old Auger-Aliassime is back in the last four of a Grand Slam for the first time since the 2021 US Open after beating eighth seed De Minaur 4-6, 7-6 (9/7), 7-5, 7-6 (7/4).\n\n“Some days you won’t feel your best but I was willing to dig really deep and do everything I can,” said Auger-Aliassime.\n\n“It feels amazing. Four years ago, it feels like more. It was a tough couple of years but it feels even better now to be in the semi-finals.”\n\nAustralia’s De Minaur, 26, has now lost all six of his Grand Slam quarter-finals.\n\n“Right now I’m looking at this like a wasted opportunity,” De Minaur said.\n\nAnisimova rebounded from her disastrous double-bagel defeat at the hands of Swiatek at Wimbledon two months ago, beating the second-ranked Pole 6-4, 6-3 in New York.\n\n“I’ve been having the run of my life here,” said Anisimova, the American eighth seed.\n\n“The first day I got here I was like ‘OK, let’s try and get through one round… This has been such a dream. To come back from Wimbledon like that is really special to me.”\n\nSix-time major winner Swiatek entered the US Open as the bookmakers’ favourite, after she followed up her maiden Wimbledon title with victory at the Cincinnati Open WTA 1000 event.\n\nSwiatek broke in the first game of the match but Anisimova hit back immediately and snatched the opening set when her rival ballooned a forehand long.\n\nAnisimova again had to rally after falling behind early in the second set. She broke back for 2-2 and then moved a game from victory as Swiatek coughed up a costly double fault.\n\nSwiatek saved two match points but a net cord in Anisimova’s favour sealed the win and a sense of redemption for the 24-year-old.\n\n“Today is definitely the most meaningful victory I’ve had in my life,” said Anisimova.\n\nSwiatek accepted she didn’t play well enough.\n\n“I kind of have to let it go and just focus on the next one,” said Swiatek.\n\nOsaka beat Czech 11th seed Karolina Muchova 6-4, 7-6 (7/3) to extend her deepest run at a Grand Slam since returning to tennis after the birth of her daughter in 2023.\n\nThe Japanese star hit 30 winners in a smooth performance reminiscent of the player who lifted the trophy here in 2018 and 2020.\n\n“It’s been a while since I’ve been in this position,” said Osaka, who has gone on to win the tournament every time she has reached the last four of a major.\n\n“You play the best players in the world towards the end of a Slam. We’re all hoping to achieve the same thing. It’s kind of like boxing, but with a tennis ball,” said Osaka, the 23rd seed.\n\nHowever, she has lost both previous matches with Anisimova — at the Australian Open and Roland Garros in 2022.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/041049443a833e7.webp",
  "retrievedAt": "2025-09-06T10:02:37.716Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939626/sinner-powers-into-us-open-semis-anisimova-gains-swiatek-revenge",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T05:45:58.000Z"
}
