{
  "title": "‘India, Pakistan may not host hockey events unless normal political ties established’ - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Arch-rivals India and Pakistan may not get any tournament of the International Hockey Federation (FIH) and of its Asian chapter in future until the two neighbouring countries establish normal political relations, a well-informed source close to the matter exclusively told Dawn on Wednesday.\n\nThe sporting relations between India and Pakistan is recent times have taken a significant hit amid heightened political tensions particularly following a brief but intense military clash between the nuclear-armed neighbours in May. As a result, Pakistan decided not to send its teams to India for the ongoing Asia Cup and the Junior World Cup — to be staged in November-December.\n\nSources on the condition of anonymity said that the issue has been discussed seriously by the Asian Hockey Federation (AHF) after Pakistan withdrew from the Aug 29-Sept 7 Asia Cup — which also serves as a qualifier for the 2026 World Cup — being staged in Rajgir due to prolonged strains between New Delhi and Islamabad.\n\nAs the Pakistan government’s decision to avoid sending the national team for the Asia Cup was based on concrete reasons, the AHF waited till the very last moment to receive confirmation from the PHF. However, after not getting it the Asian body included Bangladesh in the continental event.\n\nThen Oman also withdrew their team from the Asia Cup due to financial constraints, and they were replaced with Kazakhstan.\n\nAccording to sources, the FIH while keeping an eye on the situation naturally anticipated Pakistan’s non-participation in the Junior World Cup.\n\nWhile apprising the AHF and the FIH of the situation, the PHF requested both of them to take such a decision which could assure Pakistan’s participation in all events organised by them.\n\n“As the Asia Cup and the Junior World Cup were allotted to India some two years ago and the war between India and Pakistan was fought in May this year, there was no immediate solution to the matter, [including] shifting these events to any other country,” sources said while adding that both the AHF and FIH, like the International Cricket Council, do not have adequate funds to hold Pakistan’s matches at a neutral venue.\n\n“However, both the bodies [FIH and AHF] considered different options to resolve the problem. Now they are very much close to deciding that both Pakistan and India should be bound to give surety – before bidding for any event of the AHF and the FIH – that their governments are ready to send their teams to each other’s venues without any objection,” sources disclosed.\n\nRecently, sources added, the AHF and FIH also decided to give Pakistan a chance to qualify for the World Cup, despite not participating in the Asia Cup.\n\n“Pakistan will have to face the team, which earn sixth spot in the Asia Cup, in a three-match series and after winning two matches they would also qualify for the World Cup,” they revealed.\n\n“Showing further leniency towards Pakistan, the FIH has decided that if the country which finish at sixth do not have enough funds to host Pakistan for the said three-game series at home, even then Pakistan will qualify for the World Cup,” sources disclosed.\n\nMeanwhile, sources, however, warned the PHF not to officially boycott the Junior World Cup being held in India, as it would compel the FIH to penalise Pakistan.\n\n“The way PHF dealt with the case of its non-participation in the Asia Cup — by not making any official announcement regarding the boycott — helped it escape any penalty and got a way forward to have a chance to qualify for the World Cup,” sources further said.\n\nIt may be mentioned here that in a recent media talk in Lahore, PHF president Tariq Hussain Bugti expressed that there was no possibility of Pakistan sending the national team to India for the Junior World Cup.\n\nPublished in Dawn, September 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:03:02.445Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939524/india-pakistan-may-not-host-hockey-events-unless-normal-political-ties-established",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T01:57:37.000Z"
}
