{
  "title": "Search teams retrieve bodies as Afghan quake toll rises to over 2,200 - World - DAWN.COM",
  "author": null,
  "content": "More than 2,200 people have been killed in the magnitude 6.0 earthquake that struck eastern Afghanistan on the weekend, the latest toll from the authorities said, as volunteers and rescuers retrieved bodies from the rubble on Thursday.\n\nThe vast majority of the total 2,217 dead and nearly 4,000 injured were in the mountainous Kunar province near the border with Pakistan, deputy government spokesman Hamdullah Fitrat wrote on X, adding that “rescue efforts are still ongoing”.\n\nFirat said that the earlier toll of 1,469 dead and more than 3,700 injured would likely rise. “We cannot stop hoping” that injured people remain alive under the rubble, he told AFP.\n\nLimited access to the hardest hit areas of mountainous Kunar province delayed rescue and relief efforts, with rockfalls from repeated aftershocks obstructing already precarious roads etched onto the side of cliffs.\n\nWhile most of the areas that had been unreachable were accessed by Wednesday, expectations of finding survivors were fading fast.\n\n“Many survivors are still believed to be trapped beneath collapsed homes in remote villages, and the window for finding them alive is rapidly closing,” the World Health Organisation (WHO) said in a statement late on Wednesday.\n\nPoor infrastructure in the impoverished country, still fragile from four decades of war, has also stymied the emergency response.\n\nThe WHO warned that local healthcare services were “under immense strain”, with shortages of trauma supplies, medicines and staff. The agency has appealed for $4 million to deliver lifesaving health interventions, expand mobile health services and supply distribution.\n\n“Every hour counts,” WHO emergency team lead in Afghanistan, Jamshed Tanoli, said in a statement. “Hospitals are struggling, families are grieving and survivors have lost everything.”\n\nThe loss of US foreign aid to the country in January this year has exacerbated the rapid depletion of emergency stockpiles and logistical resources.\n\nNGOs and the UN have warned that the earthquake creates a crisis within a crisis, with cash-strapped Afghanistan already contending with overlapping humanitarian disasters.\n\nUN refugee chief Filippo Grandi said on X that the quake had “affected more than 500,000 people” in eastern Afghanistan.\n\nAfter decades of conflict, the country is contending with endemic poverty, severe drought and the influx of millions of Afghans forced back to the country by Pakistan and Iran since the Taliban’s 2021 takeover.\n\nEven as Afghanistan reeled from its latest disaster, Pakistan began a new push to expel Afghans, with more than 6,300 people crossing the Torkham border point in quake-hit Nangarhar province on Tuesday.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/04162037539a34c.webp",
  "retrievedAt": "2025-09-06T10:02:30.564Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939681/search-teams-retrieve-bodies-as-afghan-quake-toll-rises-to-over-2200",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T11:42:48.000Z"
}
