{
  "title": "China denies conspiring with North Korea, Russia against US - World - DAWN.COM",
  "author": null,
  "content": "China defended on Thursday its decision to invite the leaders of Russia and North Korea to World War II commemorations, which President Donald Trump accused them of using to conspire against the United States.\n\nTrump wrote a testy Truth Social post addressing his Chinese counterpart after North Korean leader Kim Jong Un and Russia’s Vladimir Putin flanked Xi Jinping at a massive parade in Beijing showcasing Chinese military hardware.\n\n“Give my warmest regards to Vladimir Putin, and Kim Jong Un, as you conspire against The United States of America,” Trump wrote.\n\nAsked about Trump’s post, Beijing’s foreign ministry said on Thursday “foreign guests” had been invited to commemorate 80 years since the end of World War II.\n\n“It is to work together with peace-loving countries and peoples to remember history, cherish the memory of the martyrs, cherish peace, and create the future,” spokesman Guo Jiakun told reporters.\n\n“China’s development of diplomatic relations with any country is never directed against any third party,” he said.\n\nThe Kremlin, meanwhile, said on Wednesday it thought Trump’s allegation was “not without irony”.\n\nBeijing had much stronger words for the European Union’s top diplomat Kaja Kallas, who also criticised the parade.\n\nKallas said on Wednesday that Xi, Putin and Kim appearing together was part of efforts to build an anti-Western “new world order” and was “a direct challenge to the international system built on rules”.\n\n“The remarks made by a certain EU official are full of ideological bias, lack basic historical knowledge, and blatantly stir up confrontation and conflict,” Guo said on Thursday.\n\n“Such statements are profoundly misguided and utterly irresponsible,” he said, adding, “We hope that those people will abandon their frog-in-the-well prejudice and arrogance … and do more things that are conducive to world peace and stability and China-Europe relations.“\n\nState media reported that Xi and Kim have had talks in Beijing while the North Korean leader is in China on a rare foreign visit.\n\nChina is North Korea’s most important ally, their relationship forged in the bloodshed of the Korean War in the 1950s.\n\nChinese state media said Kim and Xi met for talks in Beijing’s Great Hall of the People today. The foreign ministry said earlier that the talks would be “an in-depth exchange of views on China-DPRK relations and issues of common concern”, using the acronym for North Korea.\n\n“China is willing to work with the DPRK to strengthen strategic communication… (and) deepen the exchange of experience in governance,” spokesman Guo Jiakun said.\n\nKim arrived in Beijing on Tuesday accompanied by his daughter Kim Ju Ae, his second reported trip abroad in six years and his first to China since 2019.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/04144405d9a367e.webp",
  "retrievedAt": "2025-09-06T10:02:33.869Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939663/china-denies-conspiring-with-north-korea-russia-against-us",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T09:53:44.000Z"
}
