{
  "title": "Pakistan’s first women’s software technology park inaugurated in Muzaffarabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: The Special Communications Organisation (SCO), a public-sector telecom provider in Azad Jammu and Kashmir (AJK) and Gilgit-Baltistan (GB), on Wednesday launched the country’s first dedicated Women’s Software Technology Park at Fatima Jinnah Women’s Postgraduate College in downtown Muzaffarabad.\n\nThe facility was inaugurated by SCO Director General Maj-Gen Umar Ahmed Shah at a ceremony attended by AJK Prime Minister’s Coordinator Asma Andrabi, Secretary Information Technology Rashid Hanif, Director Public Instruction Colleges Prof Dr Khawaja Abdul Rehman, Muzaffarabad Station Commander Brig Qaiser, SCO Sector Commander Col Yousaf Javed, Principal Huma Mufti and a large number of officials, faculty members and students.\n\nDesigned exclusively for women, the park offers a modern, secure and fully equipped workspace for freelancers, IT professionals and entrepreneurs. It aims to generate employment, foster entrepreneurship and build technical capacity, thereby contributing to women’s social and economic empowerment.\n\nAfter the inauguration, Maj-Gen Shah toured various sections of the park, interacted with young freelancers and praised their work. He also appreciated the state-of-the-art facilities, including uninterrupted electricity, high-speed internet and advanced training infrastructure, which he said would ensure a professional environment for women.\n\n“The establishment of a dedicated technology park for women reflects SCO’s Vision 2025, which seeks to enhance women’s participation in technology and enable them to play a significant role in Pakistan’s growing digital economy,” he said.\n\nHe noted that under IT Vision 2025, SCO had established 17 software technology parks and 76 freelancing hubs across Azad Kashmir and Gilgit-Baltistan over the past 20 months, creating more than 7,000 jobs and empowering over 1,500 freelancers.\n\nBy the end of the current month, he added, the network would be expanded to 100 centres.\n\nThe Muzaffarabad park — 8th in AJK — was aimed at bridging the digital divide, encouraging women-led startups and boosting Pakistan’s IT exports by showcasing the potential of AJK’s youth, he said.\n\nMs Andrabi congratulated SCO on what she called a “historic achievement” and said the project would always be remembered as a milestone in women’s empowerment.\n\nShe commended the organisation for providing a dedicated space for women freelancers, recalling that in the past, they had faced numerous obstacles in pursuing IT careers.\n\n“Now, with a safe and culturally secure environment, they have an easy pathway to compete with the international community and prove their talent,” she said.\n\nShe expressed the hope that AJK’s women, particularly students, would use IT positively to move towards self-reliance and generate valuable foreign exchange for their families.\n\nMeanwhile, Col Javed told Dawn that the Pakistan Software Export Board (PSEB) had earlier announced plans for a women-exclusive Software Technology Park at Women University Bagh and initially promoted it as the country’s first such facility.\n\nHowever, since that project was still at least two months from completion, “it is SCO that now has the distinction of launching Pakistan’s first operational Women’s Software Technology Park with today’s inauguration in Muzaffarabad,” he said.\n\nPublished in Dawn, September 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/04092642cd3bb7e.webp",
  "retrievedAt": "2025-09-06T10:02:48.832Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939500/pakistans-first-womens-software-technology-park-inaugurated-in-muzaffarabad",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T01:58:21.000Z"
}
