{
  "title": "US lawmakers briefed on flood devastation in Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The Pakistani American community has launched a campaign to support victims of the 2025 floods, briefing US lawmakers on Capitol Hill on Tuesday about the scale of the disaster and urging international engagement.\n\nThe US-based Muslim Charity Helping Hand for Relief and Development (HHRD), largely run by Pakistani Americans, spent the day on Capitol Hill, highlighting the urgent need for food, clean water, medical assistance, and long-term rehabilitation for millions of people affected by the floods.\n\nPakistan’s Ambassador to the United States, Rizwan Saeed Sheikh, described the floods as “an unprecedented disaster that has set back economic growth, and continues to cause devastation across the country”.\n\nWarning that next year’s monsoon could arrive earlier and bring even greater devastation, he called Pakistan “a frontline state” in the fight against climate change.\n\n“Governments will do what they can, but all should come forward and help. The world must form a collective strategy to deal with recurring disasters,” he said.\n\nPakistani Americans highlight urgent need for food, clean water, medical aid and rehabilitation for millions hit by floods\n\nThe HHRD also announced dedicating an initial $5 million for relief and rehabilitation work and pledged to expand its efforts. The Pakistani community is holding fundraising events across the United States and Canada to supplement the relief efforts.\n\nHHRD officials told lawmakers that the floods have directly affected more than five million people, with over 20 million at risk, underscoring the urgency of global support. Since late June, torrential rains and flash floods have battered Pakistan, especially Khyber Pakhtunkhwa and Gilgit-Baltistan.\n\nThe floods have killed 881 people, injured more than 1,100, destroyed 11,000 homes, and damaged 250 bridges and 415 miles of roads. Some 1.2 million hectares have been submerged, including 853,000 hectares of cropland.\n\nA UN report, released on Wednesday, warned that “the situation remains highly fluid, with reservoirs at full capacity and heavy rainfall forecast in early September, cautioning that new surges along the Chenab and other rivers could impact downstream districts in South Punjab”.\n\nHHRD officials said their teams have been providing mobile clinics, water filtration systems, search-and-rescue operations, cooked meals, hygiene kits, mosquito nets, milk, and “Smile Boxes” for children. By early September, their relief teams had reached over 62,000 people across 13 districts, including Lahore, Sialkot, Swat, Neelum Valley, and Gilgit-Baltistan.\n\nOfficials emphasised that this initial $5m is a starting point and that the organisation intends to expand its reach in the coming weeks and months.\n\nAmbassador Sheikh also highlighted the proactive spirit of Pakistanis, noting that citizens often take initiative in disaster response without waiting for government intervention.\n\nPublished in Dawn, September 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:03:03.693Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939545/us-lawmakers-briefed-on-flood-devastation-in-pakistan",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T01:57:23.000Z"
}
