{
  "title": "Dhaka eyes end to mystery of last Nawab’s treasure trove - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: For more than a century, the fate of the dazzling Darya-i-Noor (River of Light) diamond has been sealed inside a bank vault — a mystery that haunts Khawaja Naim Murad, great-grandson of the last Nawab of Dhaka.\n\nLocked away in 1908, were the family’s heirlooms lost during the violence at the end of British rule in 1947? Did they survive the 1971 break-up of Pakistan and the string of coups that followed in Bangladesh, or are they still safe, dusty but untouched?\n\nMany suspect the jewels are long gone, and officials at a state-run bank in Dhaka hesitate to simply open the vault, fearing they’d carry the cost if it is empty.\n\nBut the cash-strapped Bangladesh government has now ordered a committee to unseal the vault — and Murad clings to hope.\n\n“This is not a fairytale,” said Murad, 55, recounting a story passed down from his father about the giant diamond, the centrepiece rock of glittering armband.\n\n“The diamond was rectangular in shape and surrounded by more than half a dozen smaller diamonds,” Murad recalled.\n\nIt was part of a trove of 108 treasures. According to original court documents, they include a gold-and-silver sword encrusted with diamonds, a bejewelled fez with cascading pearls, and a fabulous star brooch once owned by a French empress.\n\nHistory and myth\n\nThe nawab’s riverside pink palace of Ahsan Manzil is now a museum.\n\nMurad, a former popular film star, lives in a sprawling villa in a wealthy Dhaka suburb.\n\nHe flourished a sheaf of documents, including a family book with detailed paintings of the treasures.\n\n“It is one of the most famous diamonds in the world. Its history is closely associated with that of the Koh-i-Noor,” the book reports, referring to the shining centrepiece of Britain’s crown jewels — a gem also claimed by Pakistan, India, Afghanistan and Iran.\n\n“It is absolutely perfect in lustre.”\n\nAnother diamond of the same name, the pink-hued Daria-i-Noor, is in Tehran as part of Iran’s former royal jewels.\n\nMurad maintains that the family’s diamond, too, was once owned by Persia’s shahs, then worn by Sikh warrior-leader Ranjit Singh in 19th-century Punjab. It was later seized by the British and eventually acquired by his ancestors.\n\nBut fortunes shifted. In 1908, the then-nawab faced financial trouble.\n\nSir Salimullah Bahadur borrowed from British colonial powers by mortgaging his vast Dhaka estates and placing the treasures in a vault as collateral.\n\nThat was their last confirmed sighting. Since then, myth and history merge.\n\nMurad believes his uncle saw the jewels in the bank in the 1980s, but bank officials say they do not know if the vault has ever been opened.\n\nSalahuddin Nagri, who chairs Bangl­a­d­e­sh’s Land Reforms Board, says the government body inherited custody of the trove, held in a state-owned bank.\n\n“But I haven’t seen any of the jewels yet,” he said.\n\nVault is sealed\n\nThe 1908 court papers did not specify the diamond’s carat weight, but valued it at 500,000 rupees — part of a hoard worth 1.8 million rupees.\n\nBy today’s conversion, that equals roughly $13 million, though experts say the market value of such rare and large jewels has since sometimes soared many times higher.\n\nToday’s guardian, Shawkat Ali Khan, managing director of Sonali Bank, said the safe remains shut.\n\n“The vault is sealed,” Shawkat Khan said. “Many years ago an inspection team came to check on the jewels, but they never really opened it. They just opened the gate that held the vault.”\n\nHe is keen for the vault to be opened at last, though no date yet has been given.\n\n“I am excited,” he said with a brief smile.\n\nThe family hopes to discover if any of the century-old debt remains, and whether they could reclaim the jewels.\n\nMurad dreams of diamonds, but says his real wish is to simply see the treasure for himself.\n\n“We believe that if anyone dies in debt, his soul never finds peace.”\n\nPublished in Dawn, September 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/0411305394ce927.webp",
  "retrievedAt": "2025-10-12T03:59:57.602Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939539/dhaka-eyes-end-to-mystery-of-last-nawabs-treasure-trove",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T01:57:51.000Z"
}
