{
  "title": "Opposition alliance rails against Punjab govt’s flood relief efforts - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Tehreek-i-Tahaffuz Ayeen-i-Pakistan (TTAP) on Wednesday called the Punjab government’s flood relief efforts a failure, accusing officials of prioritising a media campaign for the chief minister over providing aid amid severe flooding.\n\nThe remarks were made during a press conference, where leaders of the political alliance criticised the government’s response to a natural disaster affecting numerous districts.\n\n“Punjab is also facing severe floods, but the provincial government has completely failed,” said TTAP Secretary General Asad Qaiser, who was joined by Salman Akram Raja, Raja Nasir Abbas and others.\n\n“Instructions have been passed that relief activities cannot be done without pictures of Maryam Nawaz. Only media campaign is going on and no relief has been provided.”\n\nTTAP accuses officials of using relief efforts to run media campaign for CM\n\nMr Qaiser, stating that he also belongs to a flood-affected area, spoke of the human toll of the disaster. “I also belong to areas affected by flood and know a house in which 13 family members died,” he said.\n\nHe called for a comprehensive plan to build small dams and suggested that an emergency be declared. Mr Qaiser also blamed illegal housing societies for flooding in Lahore and urged the government to re-launch the Billion Tree Tsunami project to prevent disasters in future.\n\nHe contrasted the current situation with the 2022 floods, claiming the former PDM government sought international funds but failed to act. He also alleged the current Punjab government was preoccupied with social media.\n\n“Punjab government was busy on TikTok and was doing nothing,” Mr Qaiser said, noting that livestock was suffering without care while officials were making visits to Japan instead of supporting the people.\n\nSalman Akram Raja, who also spoke at the conference, warned of economic consequences. He said destroyed crops would lead to higher prices for rice and wheat.\n\n“The import-export gap has been increasing due to which inflation will increase,” Mr Raja said.\n\nPublished in Dawn, September 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:00:16.713Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939548/opposition-alliance-rails-against-punjab-govts-flood-relief-efforts",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T01:57:23.000Z"
}
