{
  "title": "Global funding cuts to force 6m more children out of school in 2026: Unicef - World - DAWN.COM",
  "author": null,
  "content": "Amid global cuts in education funding, the UN agency for children (Unicef) has projected that an estimated six million additional children could be out of school worldwide by the end of 2026, with around one-third of them in humanitarian settings.\n\nThe projection was made in an new analysis, according to a Unicef press release issued on Wednesday, which said that the Official Development Assistance for education was estimated to fall by $3.2 billion — a 24 per cent drop from 2023 — with just three donor governments accounting for nearly 80 per cent of the cuts.\n\n“Such a decline would push the number of out-of-school children worldwide from 272m to 278m — the equivalent of emptying every primary school in Germany and Italy combined,” it added.\n\nThe press release quoted Unicef Executive Director Catherine Russell as saying, “Every dollar cut from education is not just a budgetary decision, it is a child’s future hanging in the balance.”\n\n“Education, especially in emergency settings, often serves as a lifeline, connecting children to essential services like health, protection, and nutrition. It also provides the strongest opportunity for a child to escape poverty and build a better life,” she said.\n\nThe Unicef analysis showed that West and Central Africa face the “sharpest impact, with 1.9m children at risk of losing out”, while the Middle East and North Africa could face “an increase of 1.4m out-of-school children”, alongside major rollbacks in all other regions.\n\nMoreover, 28 countries were projected to lose at least a quarter of the education assistance for pre-primary, primary, and secondary schooling. “Among them, Ivory Coast and Mali face some of the greatest risks, with enrolment at risk of declining by 4pc — equivalent to 340,000 and 180,000 students, respectively,” the press release said.\n\nThe analysis concluded that primary education would be hit the hardest, with funding set to fall by a third, “deepening the learning crisis and putting affected children at risk of losing an estimated $164bn in lifetime earnings”.\n\nIt further underlined that in humanitarian settings, “where education goes beyond learning, offering life-saving support, stability, and a sense of normalcy for traumatised children, funding could drop sharply – in some cases, cutting the equivalent of at least 10 per cent of the national education budget.\n\n“For example, in Unicef’s Rohingya refugee response, 350,000 children risk losing access to basic education permanently. Without urgent funding, education centres may close, leaving children vulnerable to exploitation, child labour, and trafficking.\n\n“Essential services such as school feeding programmes, sometimes a child’s only nutritious meal of the day, could see funding slashed by more than half, while support for girls’ education is also set to decline significantly,” the press release read.\n\nMoreover, it was pointed out that “wide cuts at the system level will also undermine governments’ ability to make evidence-based plans, adequately support teacher development, and monitor learning outcomes.”\n\nThis means that even children who remain in school could see their learning suffer, with at least 290m students across all regions projected to face a decline in education quality, the press release said.\n\nUnicef urged donor and partner countries to “act now to protect education by rebalancing education assistance to be more equitable and effective with a minimum of 50pc directed to least developed countries; safeguarding humanitarian education funding and prioritising education as a lifesaving intervention alongside other essential services; focusing education assistance on foundational learning, concentrating on early childhood and primary education where the returns are the highest; simplifying global financing architecture in line with the UN80 Initiative to improve efficiencies; and expanding innovative financing without replacing core funding to education”.\n\n“Investing in children’s education is one of the best investments in the future — for everyone,” the press release quoted Russell as saying. “Countries do better when their children are educated and healthy, and it contributes to a more stable and prosperous world.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T10:02:31.169Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939641/global-funding-cuts-to-force-6m-more-children-out-of-school-in-2026-unicef",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T08:36:59.000Z"
}
