{
  "title": "Iraq thrash 10-man Pakistan 8-1 in AFC Under-23 Asian Cup qualifying campaign - Sport - DAWN.COM",
  "author": null,
  "content": "PHNOM PENH: Nolberto Solano’s Pakistan suffered an inauspicious start to their 2026 AFC Under-23 Asian Cup qualifying campaign when they were handed an 8-1 thrashing by Iraq in their Group ‘G’ opener on Wednesday.\n\nReduced to 10 men after Mohibullah Afridi’s red card past the half-hour mark, Pakistan trailed 1-0 at half-time in Peruvian Solano’s first game in-charge of the national team.\n\nBut they were eventually swamped by Iraq, who used their numerical superiority — Pakistan ended the game with nine men after an injury to defender Haseeb Khan in the 66th with all substitutions having been made — to make it a rout with Ali Jasim hitting a hat-trick and Ahmed Ayyed Al-Aridhee bagging a brace.\n\nIraq dominated proceedings but only took the lead in the 32nd minute through Amoori Faisal, who converted from the penalty spot after Mohib received a second yellow.\n\nIraq, the 2013 champions, increased their lead soon after the break with Jasim getting his first in the 47th.\n\nPakistan did mount a response, England-based McKeal Abdullah keeping his cool from the spot to pull one back.\n\nIraq, though took only five minutes to restore their two-goal advantage with Jasim getting his second and Haseeb hurting himself in the process as he collided with the goal post.\n\nIt was all Iraq after that with Jasim completing his hat-trick with a rocket from just outside the box in the 72nd.\n\nAl-Aridhee added to Pakistan’s misery with a dinked finish for Iraq’s fifth six minutes later and Dhulfiqar Younnus Al-Imari turned in a cutback to make it 6-1 in the 83rd.\n\nPakistan had lost their legs with Ali Sadeq Shaheen got another two minutes later before Al-Aridhee completed the scoring deep into stoppage time.\n\nThe other Group ‘G’ game saw Iraq and Cambodia play out a goalless draw.\n\nIn the next round of fixtures on Saturday, hosts Cambodia will face Pakistan while Oman will have the daunting task of going up against Iraq.\n\nPublished in Dawn, September 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:00:20.380Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939519/iraq-thrash-10-man-pakistan-8-1-in-afc-under-23-asian-cup-qualifying-campaign",
  "dateList": "2025-09-04",
  "date_published": "2025-09-04T01:57:37.000Z"
}
