{
  "title": "Suspicions among PDM leadership to pave way for dismemberment of alliance: Defense Minister",
  "link": "https://www.app.com.pk/national/suspicions-among-pdm-leadership-to-pave-way-for-dismemberment-of-alliance-defense-minister/",
  "date_published": "2021-01-24T16:15:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 24 (APP): Minister for Defense, Pervaiz Khattak has said that political parties that are part of Pakistan Democratic Movement (PDM) are wary of one another and people would soon witness dismemberment of heterogeneous alliance that is being formulated to pursue interests.\nHe was addressing a ceremony held in Nizampur, district Nowshera on Sunday after inaugurating Kahi Grid Station and electricity provision to Piran village.\nPervaiz Khattak said that the rifts and suspicions among the leadership of PDM would the pave way for dissolution of impermanent alliance. He said that Maryam Nawaz, Moulana Fazal-ur-Rehman and Bilawal Bhutto Zardari are trying to destabilize the government through unconstitutional means but their efforts would fail.\nHe said people would not elect those who brought country to the brink of disaster just to fulfill their ulterior motives. He said that government is capable and fully prepare to stave off ambitions of opposition adding PTI would not budge from its stance due to threats of opposition.\nElements that looted public money with impunity would be made accountable to public for their misdeeds and they would not be pardoned, he said explicitly.\nHe said that hue and cry of opposition over senate elections is beyond understanding adding opposition would also face defeat in elections.\nDefesne Minister said that PTI government believes in development of backward areas and bring them in national mainstream. He said that remote area of Piran village has provided electricity after 73 years and every household of Nowshera district would get electricity and Sui gas by 2023.\nHe said that Kahi Grid Station would address the electricity related problems being faced by population of 36 villages. He said that all the problems of area citizenry would be resolved with consultation and keeping in view their interests.\nOn the occasion, Haji Qayum of Piran village and Doctor Aziz of Meera Akora announced joining PTI with friends and followers and reposed confidence on party leadership.",
  "retrievedAt": "2025-08-11T20:16:22.316Z"
}
