{
  "title": "People of Pakistan are so nice; climbers tell the world after scaling K-2 in winter",
  "link": "https://www.app.com.pk/national/people-of-pakistan-are-so-nice-nepalese-mountaineers-tell-the-world/",
  "date_published": "2021-01-24T13:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 24 (APP): The Nepalese mountaineers, who recently scaled the world’s second highest peak –Pakistan’s K2- in winter, have felt deep attraction for the hospitality of Pakistani people, reaffirming the world’s stance that the country had a potential to become tourism hub of the world.\n“What really attracts all of us at the moment is you people. Honestly the people of Pakistan are so nice. Once we summited K2, we got such a really warm welcome and receipts from you guys, and honestly without [that] if we even get that to our country or not,” leader of the 10-member Nepalese team, Nirmal Pujra said in a video posted by the Ministry of Overseas Pakistanis and Human Resource Development (OP&HRD) on its twitter.\n‘Bauhat Bauhat Shukria’ (Thank you very much), Nirmal Pujra said while extending his gratitude to the Pakistanis in Urdu language for looking after all of them during their stay. “We are very happy and we will come here again and again and again,” he added.\nThe Nepalese climbers were called on Special Assistant to the Prime Minister OP&HRD Sayed Zulfikar Abbas Bukhari to discuss their mountain tourism experience in Pakistan.\nNirmal said he along with his team visited the country every year to climb some of the greatest mountains of the world and this time, felt lucky for having a meeting with the head of National Tourism Coordination Board.\nHe highlighted a couple of issues faced by the adventure tourists in the country and discussed ways with the SAPM to improve mountain tourism in the country.\n“Great discussion with the Nepalese mountaineering team, today. I will work on all points discussed to improve the mountain tourism experience in Pakistan. Will be putting all proposals for Prime Minister Imran Khan’s approval soon,” Zulfikar Bukhari, who also heads National Tourism Coordination Board, tweeted soon after the meeting that took place the other day at the OP&HRD ministry.",
  "retrievedAt": "2025-08-11T20:16:24.239Z"
}
