{
  "title": "Fazlur Rehman is politically trapped: Sheikh Rasheed",
  "link": "https://www.app.com.pk/national/fazlur-rehman-is-politically-trapped-sheikh-rasheed/",
  "date_published": "2021-01-24T15:56:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jan 24 (APP): Federal Minister for Interior Sheikh Rasheed Ahmed on Sunday said that Jamiat Ulema-e-Islam (JUI-F) Chief Maulana Fazlur Rehman trapped himself in a blind alley from where he would not be able to turn back.\nAddressing a reception held in his honor in Rawalpindi, Rasheed said that both Pakistan People Party (PPP) and Pakistan Muslim League-Nawaz (PML-N) have once again deceived JUI-F Chief Maulana Fazl-ur-Rehman while making their way.\nSheikh Rasheed said that PTI government was neither going to recognize Israel nor would make any amendment in the Khatam-e-Nabuwat Act.\nHe offered Fazl-ur-Rehman to hold a joint rally against Israel and Indian brutalities in Indian occupied Kashmir.\nHe said Prime Minister Imran Khan has rendered much greater services for the cause of Kashmir and rights of Kashmiris and very clearly took up this issue at every world forum including United Nations Organization (UNO) while Fazl-ur-Rehman did nothing when he (Maulana) was Chairman of Kashmir Committee.\nThe government will complete its constitutional term and if the Pakistan People’s Party (PPP) Chairman Bilawal Bhutto Zardari’s wishes to bring a no-confidence motion, the government will not just defend but crush the move, said the Minister.\n“I don’t know Shehbaz Sharif paid US $ 750,000 to NAB (National Accountability Bureau)” the minister told the gathering.\nSheikh Rasheed reiterated that Broadsheet issue will become Panama case part II while asking opposition to give final date of long march for warm welcome.\nHe further said that he earlier predicted that opposition alliance will not resign from assemblies and it will also participate in by-polls and Senate elections.",
  "retrievedAt": "2025-08-11T20:16:22.670Z"
}
