{
  "title": "All set to observe Indian Republic Day as Black Day on Jan 26",
  "link": "https://www.app.com.pk/national/all-set-to-observe-indian-republic-day-as-black-day-on-jan-26/",
  "date_published": "2021-01-24T12:53:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Jan 24 (APP): All is set by Jammu & Kashmir population inhibiting both sides of the line of control including AJK, IIOJK and rest of the world to observe the Indian Republic Day, falling on January 26, Tuesday, as black day to invite the attention of international community towards the continued long unlawful and forcible Indian occupation of Jammu & Kashmir and continued depriving them of their internationally-recognized right of self determination by India since last 74 years.\nKashmiris observe the Indian Republic day as black day every year to mark strong indignation and protest against the continued long Indian subjugation of the occupied Jammu & Kashmir besides to mark the Indian Republic Day as black day every year to protest and apprise the world of the continued brutalities and custodial killing of the innocent Kashmiris and the unabated massive violations of human rights by the Indian occupying forces in the held state.\nThis year, too, Kashmiris are observing the Indian republic day as black day at the time when the hardliner PM Modi-led Indian government, by violating all international norms and commitments on the global issue of Jammu Kashmir, scrapped special status of the internationally-acknowledged disputed status of the Indian Illegally Occupied Jammu and Kashmir (IIOJK) revoking article 370 and article 35-A of her (India) constitution through August 5, 2019 sinister act at the gun point through fresh deployment of at least a million of its military and para military troops in IIOJK.\nBesides the observance of the day also aimed at to apprise the world community of the continued hostile attitude of India denying Kashmiris their legitimate right to self determination and deviating all international norms escaping from the peaceful solution of the much delayed Kashmir issue.\nIn Azad Jammu & Kashmir, protest rallies and demonstrations against continual illegal, illicit and unlawful Indian occupation of a major part of Jammu & Kashmir, will be the hall mark of the black day in all ten districts of the liberated territory. These protest marches and rallies will be the hallmark of the scheduled black day.\nMajor rally to observe the Indian Republic Day will be held in Muzaffarabad on this occasion. AJK leaders of various political parties including those in the AJK Parliament will lead the rally to be held to mark the day.\nThe day will also mark complete solidarity with the freedom-loving people of IIOJK in their just and principled struggle for freedom and for the achievement of their legitimate right to self determination.\nThe protest rallies are scheduled to be arranged by various social, political and public representative organizations representing people of all spheres of life including lawyers, journalists, members of the business community, laborers, students, women and social and political workers to express fullest traditional hatred against the Indian imperialism besides protesting against the continued denial of all global norms and commitments on Kashmir and the persistent deviation and denial of the Kashmiris birth right to self determination since over last 74 years by India.\nIn Mirpur, a protest rally, to be followed by a big procession of people belonging all segments of the civil society, to observe the Indian Republic Day as black day, will be held at Shaheed chowk, organizers said.\n“The city elders representing all segments of the civil society will highlight the importance of early peaceful settlement of the Kashmir problem besides expressing severe hatred against India for her India’s continual unlawful and forced occupation of Kashmir for the past over seven decades.",
  "retrievedAt": "2025-08-11T20:16:25.309Z"
}
