{
  "title": "Justice Shah lauds Pakistan’s unique role at cop29, advocates for global climate justice reforms",
  "link": "https://www.app.com.pk/national/justice-shah-lauds-pakistans-unique-role-at-cop29-advocates-for-global-climate-justice-reforms/",
  "date_published": "2024-12-07T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 7 (APP):Senior Judge of the Supreme Court of Pakistan, Justice Mansoor Ali Shah on Saturday commended Pakistan’s trailblazing contribution at the recently concluded COP29 in Baku.\nSpeaking as guest of honour during the “Post-COP Reflections from Baku to Pakistan” seminar hosted by the Sustainable Development Policy Institute (SDPI), he congratulated Romina Khurshid Alam, PM’s aide for climate change for leading a historic delegation of judges to the global climate summit, said a press release.\nJustice Shah while highlighting that Pakistan was the only country represented by a judiciary-led panel noted that the Global Judges Network also recognized this unprecedented participation, acknowledging the importance of judicial perspectives in addressing climate challenges.\nHe emphasized the intersection of climate justice and human rights, framing it as a crucial lens for addressing environmental crises. “Pollution-related cases have historically been handled through penal actions in courts, but we are witnessing a paradigm shift. Climate justice is no longer just about visible polluters but encompasses broader systemic issues, including extreme weather events like floods, droughts, and glacial melts,” he stated.\nHe further noted that COP29 underscored the urgency of climate finance as an essential pillar of climate justice. “Climate finance is not just a policy goal; it is a human right tied directly to the right to life. Loss and damage demand quick access to funds, while adaptation remains a slower process,” he said, adding that the global discourse on climate finance remains confined to superficial discussions.\nJustice Shah spoke about the establishment of the Climate Change Authority, albeit delayed and stressed the importance of mobilizing innovative financing mechanisms such as Zakat, Waqf (endowments), Sadaqa (voluntary charity) and Sukook Bonds under Islamic laws to address climate funding gaps.\nHe called for a deeper understanding of climate science as essential to framing effective climate finance policies. He also proposed the development of Climate Alternate Dispute Resolution Centers and specialized Climate Courts in Pakistan to tackle emerging conflicts stemming from climate change impacts.\n“Pakistan must take the lead in advocating for a global climate court, akin to the International Court of Justice, to hold the Global North accountable for its disproportionate contribution to climate damage,” he urged.\nJustice Shah concluded with a powerful message, emphasizing that Earth should not be seen as a commodity for exploitation but as a community to which humanity belongs. “We must redefine our approach to environmental stewardship and move towards reparative justice that addresses the historical injustices of climate degradation,” he said.\nRomina Khurshid Alam, the Prime Minister’s Coordinator for Climate Change and Environmental Coordination said, “Pakistan achieved great success at COP29”. “All sectors of Pakistan are represented, including the judiciary, which is now playing a critical role in addressing environmental issues.”\nShe emphasized the importance of Pakistan’s judiciary taking a proactive stance on climate and environmental justice, a move she called groundbreaking.\nAlam said, “Pakistan beyond its own interests, raised voice for other vulnerable nations. We returned with a clear understanding of where future efforts must be directed. We want environmental justice and it’s essential for developing and affected countries to collaborate.”\nShe also commended the leadership of Justice Mansoor Ali Shah, along with Justice Jawad Hassan and Justice Ayesha Malik, for their active participation at COP29.\n“Justice Mansoor Ali Shah’s leadership in championing climate activism within the judiciary is invaluable,” she remarked, acknowledging his dedicated efforts to integrate climate justice into legal frameworks.\nThe coordinator stressed that Pakistan’s unified presence at COP29 marks a significant step toward advancing climate justice and strengthening the country’s position on the global stage.\nDr Abid Qaiyum Suleri, Executive Director of the Sustainable Development Policy Institute (SDPI), described COP summits as a blend of successes and challenges, where true success lies in achieving balanced compromises. Expressing gratitude to Azerbaijan for hosting COP29, he urged for collaborative, innovative strategies leading up to COP30 in Brazil, reaffirming that climate justice is inherently tied to equitable climate finance.\nAmbassador of Azerbaijan, Khazar Farhadov lauded the success of COP29, held in Baku, highlighting the participation of global leaders, including Prime Minister Muhammad Shehbaz Sharif, in advancing the climate agenda. “More than 76,000 people participated in COP29, making it a milestone event,” the ambassador noted.\nExpressing gratitude for Pakistan’s active participation, the ambassador said the country played an important role in shaping discussions at the summit.\nJustice Jawad Hassan of the Lahore High Court underscored the impact of natural disasters, particularly in Sindh, during his reflections on COP29. “Sindh has borne the brunt of climate-induced disasters like floods,” he said.\nHe commended Pakistan’s constitutional framework, specifically Article 9, which guarantees every citizen the right to a clean and healthy environment. Justice Hassan praised Pakistan’s contributions to COP29, describing it as a significant step toward climate justice and environmental sustainability.\nSanjay Vashist, Director of Climate Action Network South Asia, urged South Asia to abandon “business as usual” approaches, advocating for a transition to renewable energy (RE) using indigenous, innovative resources. “Pakistan, Sri Lanka, and others have significant potential to mobilize local funding for RE-initiatives without being bound by global watchdog conditions,” he added.\nDr Sadia Satti, Head of Gender and Climate Action at SDPI, highlighted the gender gap in climate discussions. “Gender was largely absent from the discourse at COP29,” she said, noting that Pakistan was represented by only two women at the highest level—Prime Minister’s Coordinator Romina Khurshid Alam and Supreme Court Justice Ayesha Malik.\nSobiah Becker from the Pak-German Climate Change Partnership underscored the importance of absorptive capacity within indigenous systems while accessing climate finance. “Much finance is available within the system, but ensuring it can be effectively utilized is critical,” she explained. Becker also highlighted Germany’s commitment of close to $1 billion to strengthen NDC partnerships.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T12:52:55.685Z"
}
