{
  "title": "KP CM decides inclusion of liver, bone marrow transplant in Sehat Card",
  "link": "https://www.app.com.pk/national/kp-cm-decides-inclusion-of-liver-bone-marrow-transplant-in-sehat-card/",
  "date_published": "2021-04-24T16:40:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 24 (APP): Chief Minister Khyber Pakhtunkhwa Mahmood Khan decided to include liver and bone marrow transplant in Sehat Card Plus Scheme to provide maximum free medical facilities to people and turn the scheme into a comprehensive package of health protection.\nHe has also decided in principle to enhance the annual health coverage for the tribal districts from the existing 600,000 rupees per family to 1,000,000 rupees per family under the Sehat Card Plus Scheme.\nThe decision was taken in a meeting held under chairmanship here the other day, said an official handout issued on Saturday. The meeting discussed various matters to further improve the health coverage under Sehat Card Plus Scheme.\nProvincial Minister for Health, Taimur Saleem Jhagra, Chairman State Life Insurance Corporation, Shoaib Hussain, Secretary Health, Imtiaz Hussain and other concerned quarters attended the meeting.\nIt was also decided to launch top up programme under the scheme with the aim to offer special packages of medical treatment to government employees and the general masses.\nThe meeting also decided to put in place a third party monitoring mechanism to have an effective monitoring of the entire activities under the scheme.\nOn this occasion, it was agreed to make timely payments to the designated hospitals of the scheme in order to ensure uninterrupted treatment facilities to the patients therein.\nTalking on this occasion, the Chief Minister directed the high ups of health department to take necessary steps to ensure the implementation of the decisions as per the given timelines.\nMahmood Khan maintained that in order to facilitate, free treatment of more and more diseases would be covered under the scheme and would be turned into a comprehensive package of social health protection.\nHe said that all the initiatives of his government ultimately aimed at providing maximum facilities to the masses adding that all the available resources would be utilized to this end.",
  "retrievedAt": "2025-08-11T20:39:21.053Z"
}
