{
  "title": "Int community urged to take notice over fake encounters,extrajudicial killings of Kashmiris in IIOJK",
  "link": "https://www.app.com.pk/national/int-community-urged-to-take-notice-over-fake-encountersextrajudicial-killings-of-kashmiris-in-iiojk/",
  "date_published": "2022-02-03T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 03 (APP): Hurriyat leader Abdul Hameed Lone here on Wednesday urged that international community to take notice on the fake encounters and extrajudicial killings of innocent Kashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJK). He said in a statement issued here regarding upcoming Kashmir Solidarity Day.\n“We are grateful to the 220 million people of Pakistan, the Government of Pakistan and all those belonging to all walks of life for supporting Kashmir cause.” Abdul Hameed Lone said.\nThe expression of solidarity with the Kashmiri people on February 5 was an indication that Pakistan was supporting the Kashmiri people’s struggle for self determination morally and politically, he added.\nFrom 1989 to 2022, 95,776 people had been martyred by the Indian occupying forces, he added.Abdul Hameed said that during this time, 7,000 anonymous graves were discovered and 1,240 women were desecrated.\nThe Internet service had been suspended several times since August 5, 2019, he pointed out.\nUnder the colonial policy, human rights activists and journalists had been targeted, he said.Meanwhile, more than 15,000 citizens, including political leaders and activists, had been detained in jails, he added.\nHurriyat Conference Chairman Musarat Alam Butt, Shabbir Ahmad Shah, Asiya Andrabi, Yasin Malik, Engineer Rashid, Khurram Pervez, Ahsan Onto and other leaders have been arrested, he said.\nAbdul Hameed said that In IIOJK, there were constant restrictions on media and communication institutions.\nHe said Pakistani TV channels, newspaper websites and YouTube channels had been blocked in Occupied Jammu and Kashmir.",
  "retrievedAt": "2025-08-11T14:14:42.168Z"
}
