{
  "title": "Sindhi stresses to enhance Pak-China bilateral exchanges in education, tech",
  "link": "https://www.app.com.pk/national/sindhi-stresses-to-enhance-pak-china-bilateral-exchanges-in-education-tech/",
  "date_published": "2023-11-28T18:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 28 (APP): Caretaker Minister for Education and Professional Training, Madad Ali Sindhi on Tuesday stressed the need to enhance Pak-China bilateral exchanges in the fields of education and technology.\nThe minister expressed these views during a meeting with a high-level Chinese delegation led by Deputy Party Secretary, Deputy Political Comissar of Xinjiang Production and Construction Corps, Liu Jianming who called on the Minister here at his office.\nHe warmly welcomed the delegation and said that he has prioritized the quality of education and reduction of out-\nof-school children.\nSindhi said there should be a collaboration between the universities of China and Pakistan to enhance and broaden the scope of research on diverse and intricate topics and areas of study.\nHe said that there were over 30,000 Pakistani students studying in China and there was still room for further cooperation to increase the bilateral overseas students offshore.\n“It is high time to accelerate bilateral exchanges and take full advantage of the learnings from each other,” the minister said.\nMadad Ali Sindhi directed the heads of HEC and NAVTTC to fully cooperate with Xinjiang Production and Construction Corps (XPCC). “Modernisation and technical education is imperative to solve the problems of today and tomorrow,” he added.\n“In continuation of my visit to China, we heartily welcome the follow-up visit by the Chinese delegation of Xinjiang Production and Construction Corps” he added.\nThe minister said the progress in China in the last 70 years has been exemplary. He appreciated the technical and educational upgradation in China. “Pakistan looks towards China to learn from their road to success. Pakistan and China have an ironclad relationship which is exemplified by China Pakistan Economic Corridor (CPEC),” he added.\nSindhi said the remains of the civilisations of Mohenjo daro and Taxila’s Ghandhara reflected the Buddhist exchange between the two oldest civilisations of the world. He extended the invitation to the delegation to visit the historic sites of the country.\nHe also announced that an MoU would be signed to practically execute plans of cooperation.\nThe minister said: “We have an extensive agricultural potential and through Chinese support we can take full advantage of the natural resources present in our country.”\nLiu Jianming said China was ready to enhance cooperation in modernisation of the Pakistani Agriculture and Technical Education.\nHe said China and Pakistan have a longstanding relationship which will only further strengthen.\nJianming said the purpose of his visit was to enhance cooperation in modernisation of Pakistani Agriculture and Technical Education.\nHe said there are two universities and 10 vocational institutions working under his organisation’s ambit whereas Liu wished to take cooperation further.\nHe said that there are already 1,800 Pakistani students studying in these institutes in the fields of agriculture, medicine and animal husbandry. Similarly, he emphasized on the need to exchange expertise, especially with respect to training of teachers.\nJianming and the education minister agreed to start an exchange program for the training of faculty at the university level.",
  "retrievedAt": "2025-08-11T10:43:56.692Z"
}
