{
  "title": "Ashrafi highlights economic progress in Pakistan through Arab, Islamic countries collaborations",
  "link": "https://www.app.com.pk/national/ashrafi-highlights-economic-progress-in-pakistan-through-arab-islamic-countries-collaborations/",
  "date_published": "2023-11-28T11:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 28 (APP): Prime Minister’s Special Representative on Religious Harmony and Pakistani Diaspora in the Middle East and Islamic Countries, Hafiz Muhammad Tahir Mahmood Ashrafi Tuesday highlighted the improving economic situation in Pakistan attributing progress to the collaborative efforts of Arab and Islamic nations, along with the positive impact of the Special Investment Facilitation Council (SIFC).\nSpeaking to national and Arab media, he expressed that encouraging developments were emerging from Saudi Arabia, Kuwait, Qatar, and other amicable nations, following the substantial financial agreements with the United Arab Emirates (UAE).\nAshrafi, who also serves as the chairman of the Pakistan Ulema Council, acknowledged that foreign investment in Pakistan was made feasible through the trust of friendly countries and the dedicated efforts of Chief of Army Staff General Syed Asim Munir.\nHe mentioned that, following Prime Minister Anwar-ul-Haq Kakar’s directives, the caretaker government extensively collaborated in the affairs of SIFC, leading to significant advancements during its tenure in cooperation with amicable nations.\nFurthermore, he highlighted the restoration of Pakistan’s trust with Islamic countries, attributing this accomplishment to the endeavors of the Commander-in-Chief of the Nation.\nAshrafi emphasized that Pakistan could not afford to repeat past mistakes and animosities, stating, “Islamic brother countries desire a resilient Pakistan.”\nHe highlighted that the SIFC played a pivotal role in attracting investments to Pakistan, with significant participation from important businessmen and groups of friendly nations post-governments.\nHe assured that overseas Pakistanis could now invest confidently, underscoring the government’s responsibility to facilitate and support them.\nIn response to a query, Ashrafi affirmed that Pakistan, as a core member of the Organization of Islamic Cooperation (OIC), maintained an unequivocal stance on the Palestine issue.\nHe emphasized that any solution acceptable to Palestine would find acceptance in Pakistan.\nHe noted the current leadership of the OIC under Saudi Arabia, praising the commendable roles of Crown Prince Mohammad bin Salman and Foreign Minister Faisal bin Farhan. He acknowledged the contributions of Turkiye, Iran, and Qatar, highlighting that the collective pressure from OIC members, including the people, played a crucial role of Europe, America, and Britain, in influencing Israel to cease hostilities.\nAt this time, he asserted that all Islamic nations were in unanimous agreement regarding the extension of the ceasefire and advocated for the establishment of a sovereign and autonomous Palestinian state, designating Al-Quds as its capital.\nAddressing a query, Ashrafi emphasized Saudi Arabia’s pivotal role within the Muslim Ummah, asserting widespread trust in the nation. He affirmed that even if Israel opposed Saudi Arabia for Expo 2030, it would not sway the country from its steadfast stance on the Palestinian matter.",
  "retrievedAt": "2025-08-11T10:44:04.824Z"
}
