{
  "title": "Nature-based solutions, civic sense on water conservation crucial to address Pakistan’s water scarcity: President",
  "link": "https://www.app.com.pk/national/nature-based-solutions-civic-sense-on-water-conservation-crucial-to-address-pakistans-water-scarcity-president/",
  "date_published": "2023-11-28T11:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 28 (APP): President Dr Arif Alvi on Tuesday terming water scarcity a big challenge for the climate-hit Pakistan said taking urgent steps such as nature-based solutions and developing civic sense about water conservation were need of the hour.\nHe regarded water-related disasters including shortages as the major sign of climate emergency and emphasized taking the issue as a major preoccupation by governments, corporate organizations, and citizens.\nIn his video-link address to the closing session of the 6th Karachi International Water Conference, he said there was a need to bring attitudinal changes among the public by educating them to consciously use water.\nThe conference held in Sindh’s capital Karachi gathered local and international experts on environment and food security that highlighted the serious water-related challenges facing the country in the wake of climate change.\nPresident Alvi said adopting the architecture of water bodies on the lines of ancient techniques was important to address the challenge of water scarcity.\nHe said using technology and managing water conservation cycles such as flood and drip irrigation could also overcome the problems of food security.\nThe president proposed the pricing of water to develop a civic sense among the citizens to ensure conversation about the commodity.\nHe said Islam as a religion also focused on being cautious while using natural resources such as water to avoid wastage.\nDr Alvi said a World Bank study in Pakistan showed a link between malnutrition and poor quality of water which inhibited the absorption of healthy minerals in the body.\nHe emphasized that the climate and water emergency had exposed the underlying dysfunctions in global, national, and local economies and showed how these systems failed to produce economic, environmental, and social justice for people.\nHe proposed developing platforms with the involvement of the communities to encourage them to follow preparedness, and resilience initiatives on water conservation.\nThe president lauded the establishment of the Panjwani-Hisaar Water Institute (PHWI) at NED University in Karachi, calling it a demonstration of sincerity and commitment to a national cause and making a difference.\nHe hoped that the deliberations at the two-day conference would contribute significantly to action on the ground on issues related to water, food, and livelihood security.\nPresident Engro Corporation Ghias Khan, Vice Chancellor NED University, Dr Sarosh Lodhi, Chairperson Hisaar Foundation Sami Kamal, and academia attended the conference.",
  "retrievedAt": "2025-08-11T10:44:02.747Z"
}
