{
  "title": "Parents urged to ensure vaccination of children",
  "link": "https://www.app.com.pk/national/parents-urged-to-ensure-vaccination-of-children/",
  "date_published": "2023-11-28T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 28 (APP): Caretaker Federal Minister for Health Dr Nadeem Jan on Tuesday urged parents to ensure vaccination of their children during the ongoing polio immunization drive.\nAddressing the launching ceremony of the third nationwide polio vaccination campaign, Dr Nadeem Jan said that poliovirus has paralyzed five children this year.\nHe added all these children deserved a healthy life and future. “We cannot allow a vaccine-preventable disease to continue to harm our children like this,” he said.\nHe said that protecting children’s well-being was a collective responsibility.\nHe said,”Every country that has eliminated polio so far has done so with the support of communities, parents, religious leaders, and social organizations.”\n“We need the same in Pakistan, for communities to join the government in its fight against polio.”\nThe event was held in Islamabad Model School, I-8/1, where school children presented a short tableau in cultural costumes of provinces. The minister officially launched the campaign by giving polio drops to children under five year of age.\nDr Shahzad Baig, Coordinator of the National Emergency Operations Centre for Polio Eradication, said, “Polio cases are fewer than they have ever been, yet the virus has shown up in sewage samples in several major cities this year, indicating that some population pockets that have missed out on the vaccine.\nThe programme is continuously reviewing and reassessing its strategies and campaigns.\n“We will ensure that we find these missed populations and vaccinate them.”\nOver 44.3 million children under five years of age will be vaccinated in 159 districts during this third and last national campaign of 2023, which is being held in phases across the country.",
  "retrievedAt": "2025-08-11T10:43:59.845Z"
}
