{
  "title": "PPP lawmakers walk out of Senate in protest against contentious canal project - Pakistan - DAWN.COM",
  "author": null,
  "content": "PPP lawmakers staged a walkout of the Senate session on Tuesday in protest against the contentious canal project amid an ongoing dispute with coalition ally PML-N.\n\nChief of the Army Staff Gen Asim Munir and Punjab Chief Minister Maryam Nawaz inaugurated the ambitious Cholistan project to irrigate south Punjab’s lands on February 15 amid public uproar and strong reservations in Sindh. The Sindh Assembly also passed a unanimous resolution against the project in March.\n\nThe past few months have seen nationwide protests from political parties, including the ruling coalition ally PPP, and residents against the proposed project.\n\nSoon after today’s Senate session began, PPP lawmakers gathered in front of the dais in protest before staging a walkout. Amid the growing clamour, Law Minister Azam Nazeer Tarar said any decision regarding the canal project would be made in line with the Constitution and laws of the country, through mutual consultation, especially with coalition partners, including the PPP and the Sindh government.\n\nHe said that Political Adviser Rana Sanaullah had formally contacted the Sindh government and PPP leadership to assure them that the federal government was committed to resolving the issue through constitutional means. “The decision is clear, nothing will be forced,” he added.\n\nTarar urged PPP lawmakers to take part in the parliamentary proceedings, pointing out that they too had submitted a resolution and a call-to-attention notice regarding the issue. “Let’s sit together and address the matter through proper parliamentary channels,” he said.\n\nThe minister stressed that the government was ready to answer questions and hold dialogue and had no intention of bypassing the Constitution or ignoring its allies.\n\nHe criticised the opposition, accusing it of being disruptive and avoiding meaningful discussion. “Maybe they have no questions to raise, or they lack the courage to listen. But if they want to participate in a productive debate, I and senior cabinet members are here to answer,” he said.\n\nTarar further said that the issue had already been discussed with coalition partners on the prime minister’s special instructions. He added that a broader multi-party consultation was also being considered to ensure a comprehensive and inclusive solution.\n\nThe opposition also raised slogans against the PPP’s alleged “hypocrisy” regarding its stance on the canal project.\n\n“The entire coastal belt is about to go barren,” PPP Vice-President Sherry Rehman said while speaking to the media in Islamabad.\n\n“The canals do not have water,” she said, questioning whether anyone cared about what was happening in the delta.\n\nShe said that the PPP would respond appropriately if the party was cornered.\n\n“If you want to resolve this, then announce that the construction has been stopped, which was started without your approval,” she said. “We walked out of the Senate because no one was listening to this.”\n\n“We only engage in such politics when we are backed up against a wall.”\n\nEarlier today, Sindh Chief Minister Murad Ali Shah called on lawyers and opposition parties rallying against the planned six new canals on Indus River to not trouble the public by blocking highways while staging their protests.\n\nResponding to a query during a press conference in Karachi today, CM Murad said: “Please, continue your protest — we support it — but do not cause suffering for the public.”\n\nSaying that the protests by lawyers and opposition parties were “good” as they were for the cause of Sindh’s people, he noted, “But they should also consider the difficulties faced by the people and take care of that.\n\n“Protesting by blocking roads and causing pain to your own people of Sindh — is this a protest?” the chief minister exclaimed.\n\nHe reiterated that he did not mind the protests but criticised individuals blocking the M-9 motorway, highlighting that the Sindh government did not take any action against them to “maintain unity” over the canals project issue.\n\nCM Murad said he saw videos of the protesters at these rallies preventing ambulances from passing by before being allowing them to proceed, adding that cattle owners were also immensely troubled as their goods were halted.\n\nThe chief minister was holding the press conference alongside Cardinal Joseph Coutts, Archbishop Emeritus of Karachi, to express condolences over the death of Pope Francis yesterday and pay tribute to him.\n\nAnswering a question about lawyers expressing a “lack of confidence” in the Sindh government, Murad said: “I trust them [lawyers], as they are doing the same work as we are.”\n\nHe termed such remarks “inappropriate” and asserted that the PPP had “spearheaded” the opposition to the canals project.\n\nCM Murad also claimed that work on the six canals project had been halted since July 2024, rebutting reports of ongoing or recent construction work.\n\nDuring the media talk, he said: “Since last July, there has not been any work done on the project. Even that was not work but just material worth a few hundred thousand was moved there.\n\n“[…] In July [2024], perhaps even you [the media] did not know that there was any such project under way,” he added, claiming the Sindh government had managed to stop the work.\n\nThe chief minister pointed out that the opposition parties began their protests in September 2024 while the Sindh government had raised the issue before the Council of Common Interests (CCI) in June 2024.\n\nHe detailed that his government had also penned letters to the Executive Committee of the National Economic Council (Ecnec) to halt work on the project.\n\nCM Murad clarified that the project had been stalled since July 2024 while the approval has been pending before the Ecnec since November 2024.\n\nThe PPP leader further said the Sindh government was “unhappy with the upper riparian province”, referring to Punjab, which is ruled by his party’s coalition ally, the PML-N.\n\n“They [Punjab] created this misunderstanding by showing the pointless inauguration, which was not even an inauguration,” CM Murad said.\n\nHe appreciated the federal government for not taking the “project further before the Ecnec”. “But I am unhappy that why they have not cancelled it yet? We want the project’s termination to be announced at the earliest,” he demanded.\n\nCM Murad maintained that the canals would neither be beneficial for Sindh nor the country.\n\nResponding to another query, the chief minister detailed that he had yesterday received a letter seeking Sindh’s nomination for its representative in the National Finance Commission (NFC), noting that it had been 14 months since the incumbent government came to power.\n\nSpeaking about the concerns raised by Punjab farmers, CM Murad recalled that the Sindh government bought wheat from farmers last year while the Punjab counterpart did not buy it in 2024 or this year.\n\nWheat farmers across Punjab are protesting against what they say are unjust wheat support prices and poor government procurement policies.\n\n“There is a huge issue of food security right now,” he stressed, highlighting farmers’ threat to switch to other crops if they continued facing losses. “This should open everyone’s eyes.”\n\nThe chief minister called for new seeds, improved practices and laser levelling of land to improve yields.\n\n“We are ready to talk to the Centre on water and food security issues. But they will not be addressed through canals but by increasing our productivity and efficient use of water,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/221930373755949.jpg",
  "retrievedAt": "2025-08-25T14:29:49.030Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905888/ppp-lawmakers-walk-out-of-senate-in-protest-against-contentious-canal-project",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T09:25:56.000Z"
}
