{
  "title": "GB rain, landslides claim one life, leave four others injured - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Human suffering due to rain continued across Gilgit-Baltistan on Monday, as a tourist from Thailand was killed and another female tourist injured when a rockfall hit their vehicle in the Ghwari area of Ghanche district.\n\nA landslide hit a home in Skardu, seriously injuring a woman and her two children. The Karakoram Highway (KKH) was blocked at the Dassu area in Kohistan, and flight operations between Gilgit, Skardu, and other parts of Pakistan remained suspended for the fourth consecutive day.\n\nPolice said six foreigners were heading towards Ghanche from Skardu when their vehicle was hit by a rockfall from a nearby mountain due to rain on Siachen Road in the Ghwari area on Monday.\n\nTasnim Yanya died on the spot while another tourist identified as Saodah Doloh, 48, sustained injuries in the incident. Saodah Doloh was shifted to a hospital in Skardu, where her condition was described as stable. Both belonged to Thailand, officials said.\n\nIn another incident, police said, a woman and her two daughters sustained injuries when landslides hit their home in Olding Koro area of Skardu. They were taken to the regional hospital in Skardu, where the mother’s condition was described as serious while both her daughters were out of danger.\n\nIntermittent rains for past several days have wreaked havoc on the GB area, with landslides damaging roads, public and private infrastructure. The continued showers also led to suspension of flights and electricity supply, besides disrupting mobile phone and internet services in many areas.\n\nFlight operations between Gilgit, Skardu and other cities have remained suspended owing to bad weather. Air and land route access of GB people with other areas has been disrupted since Friday, causing difficulties for locals as well as travellers.\n\nPolice said the Baltistan Road was one of the few roads which were reopened for traffic on Monday.\n\nOn the other hand, the Dassu portion of the KKH was blocked due to flooding, leaving people travelling from and to GB stranded. This is the third time in as many days that the KKH was blocked at multiple locations in Kohistan and Diamer.\n\nOn Monday, too, some high-altitude areas of Astore, Skardu, Shigar, Ghanche, Ghizer, Nagar, Hunza received heavy snowfall, bringing life to a standstill.\n\nPublished in Dawn, April 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6806e08e553b3.gif",
  "retrievedAt": "2025-10-12T02:40:48.921Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905821/gb-rain-landslides-claim-one-life-leave-four-others-injured",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T00:19:56.000Z"
}
