{
  "title": "Dar in Kabul - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE recent visit to Kabul by Deputy PM and Foreign Minister Ishaq Dar is a sign that Pak-Afghan relations may be moving in a more positive direction.\n\nMr Dar’s interactions with the Afghan Taliban leadership were quite cordial, with promises from both sides to improve ties and address the irritants standing in the way of better relations. Ishaq Dar met the acting Afghan PM and the foreign minister, among other top officials. The Kabul authorities assured Pakistan that Afghan soil would not be used against this country, while Mr Dar expressed similar sentiments.\n\nThe high-level exchange comes after a period of relative turmoil, with both sides at times trading fire at the border, and Pakistan expressing frustration with the Taliban authorities for failing to neutralise the Afghanistan-based TTP.\n\nFrom here, the warm smiles and promises to prevent hostile actors from harming either country must be translated into concrete efforts. Pakistan has suffered immensely due to TTP terrorism, and the state rightly feels that the Afghan Taliban have not done enough to prevent the terrorist group from attacking this country. That is why Kabul — as well as the Taliban high command in Kandahar — must ensure that the TTP and other anti-Pakistan groups are put out of business, and not able to harm Pakistan.\n\nA recent BBC report has highlighted a disturbing fact: the banned TTP and other terrorist groups in Afghanistan have managed to acquire many of the weapons left behind by the Americans during their chaotic retreat in 2021. Both the US and the Afghan Taliban have a responsibility to ensure that terrorist groups are not able to access and use such sophisticated weaponry against Pakistan.\n\nMr Dar also said that border management and security issues would be addressed. As these unresolved issues have led to armed skirmishes between both states and frequent closures of frontier crossings, it is imperative that border disputes are resolved justly and speedily.\n\nMoreover, Kabul called upon Pakistan to end the “mistreatment” of Afghan refugees that are being returned to their home country. Mr Dar promised to handle the returning Afghans with respect. While the repatriation process continues, Pakistan should treat these individuals with dignity, while Western states must speed up the process of accepting those Afghans that once worked for them, as they may face dangers to their life if sent back to their homeland.\n\nOn Kabul’s part, ensuring that no group based on its soil is able to harm Pakistan would be the biggest CBM, and lead to a vast improvement in ties. Islamabad, meanwhile, can build bridges with the Afghan side by handling the repatriation process in a more humane manner and listening to Kabul’s concerns regarding trade. Concentrating on these key areas can lead to a more normal and productive bilateral relationship.\n\nPublished in Dawn, April 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:40:47.568Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905824/dar-in-kabul",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T02:54:14.000Z"
}
