{
  "title": "Murad vows to eradicate polio from Sindh as vaccination drive begins - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A week-long polio eradication campaign began on Tuesday in all districts of Sindh to vaccinate 10.6 million children across the province, including 2.76m in Karachi.\n\nSindh Chief Minister (CM) Syed Murad Ali Shah inaugurated the campaign by administering oral polio drops to children at a ceremony held here the CM House.\n\nReaffirming the government’s unwavering commitment to eliminating the crippling disease from the region, CM Shah announced that the campaign aimed at vaccinating children under the age of five.\n\nHe said that 25,360 police personnel had been deployed to ensure security of vaccinations teams and smooth operations across Sindh.\n\nOver 25,000 law enforcers to protect 69,724 frontline workers during week-long campaign\n\nThe CM said the drive would be conducted by a force of 69,724 trained frontline workers, who would go door-to-door, visit schools, shopping malls and transit points to ensure that no child was left unvaccinated.\n\nHe praised the dedication of frontline workers who continued their mission undeterred despite the intense heatwave sweeping across the province.\n\n“To support their tireless efforts, the government is providing water, ORS sachets, and other essential supplies to help them stay hydrated and healthy in the scorching temperatures,” he said.\n\nIn a heartfelt appeal to parents and caregivers, CM Shah urged everyone to welcome the vaccination teams, emphasising that every child under five must receive the polio drops. “Polio has no cure. Vaccination is the only way to protect our children from lifelong paralysis,” he said.\n\nIn an attempt to building trust in the vaccine, the CM also addressed concerns surrounding vaccine safety, assuring the public that it was the same polio vaccine that helped eradicate the virus in most parts of the world.\n\n“It is the same vaccine administered to pilgrims before Haj and Umrah, and it is routinely recommended by paediatricians in private clinics and hospitals,” he said.\n\nMr Shah emphasised that even if a child had been recently vaccinated, it was safe and essential to vaccinate them again during this campaign.\n\n“The government is also ensuring that the cold chain is strictly maintained so that the vaccine remains potent and effective until it reaches every child,” he said.\n\n“Ending polio requires a collective commitment — from leadership to front-line workers, from communities to every household. Sindh stands united in this mission,” he said, adding: “Let us work together to protect every child and secure a healthier, safer future for generations to come. Together, we can end polio and we must not stop until we do.”\n\nSpeaking on the occasion, Health Minister Dr Azra Fazal Pechuho emphasised that the environmental samples showed continued virus circulation. “Vaccination remains our only protection. We must continue with even greater resolve,” she added.\n\nThe ceremony was attended among others by Inspector General of Police Ghulam Nabi Memon, Karachi Commissioner Hassan Naqvi, Health Secretary Rehan Baloch, senior government officials and representatives from the WHO, Unicef and other partner organisations.\n\nPublished in Dawn, April 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6806d6fd1733d.gif",
  "retrievedAt": "2025-08-25T14:30:04.991Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905762/murad-vows-to-eradicate-polio-from-sindh-as-vaccination-drive-begins",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T00:20:22.000Z"
}
