{
  "title": "A question of gender - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT has been nearly a month since Mahrang Baloch was arrested. This previous weekend, the PTI’s Aliya Hamza was also arrested and taken to Adiala Jail.\n\nThe two women were arrested in different parts of the country, participating in political activity that perhaps has little in common. One, after all, is identified as a rights activist, who has opted for street agitation, shunning mainstream electoral politics — though her critics, who are in power, describe her in far harsher terms, denying her any legitimacy. The other is a member of a large political party, which has contested multiple elections allowing her to experience life in the power corridors.\n\nBut both events once again underlined Pakistan’s changing political dynamics, where women are pushing their way to centre stage, traditionally the domain of men. But this trend has largely gone unnoticed, even though the 2024 elections finally forced people to pay attention to the youth bulge, instead of either dismissing it or making light of it. The mobilisation of women, though, still seems to be underappreciated and understudied.\n\nThis is not to say that women’s mobilisation or politics has been missing entirely. There have been ample examples in the past too. Women activists of the PPP and the Bhutto women confronted one of Pakistan’s worst dictatorships. Begum Wali Khan, Kulsoom Nawaz and Maryam Nawaz proved to be no less.\n\nBut the focus tended to be on the known names of established heavyweight families, where crises catapulted the women into leadership positions. While this tradition continues, these women leaders are now being joined by educated, professional middle-class women, who have no legacy to inherit but have nevertheless captured the public imagination in a way we assumed only men could.\n\nNowhere is this more evident than in the case of Balochistan where in the past year or so, Mahrang Baloch has become the face of Baloch anger and discontent. That she was a woman simply means that it took quite some time before the powerful realised her potency — it is only of late that her alleged links to the insurgents have started to be ‘exposed’ vociferously in officialdom’s conversations and speeches. Had her gender been different, the reaction, and perhaps the imprisonment, would have come far sooner.\n\nMen get uncomfortable when women begin to stake a claim to the political stage.\n\nWomen’s leadership has also emerged at other levels. Post-May 9, the PTI has seen women emerge as politicians or political workers in their own right.\n\nBy braving imprisonment, with men — fearful of jail or worse — capitulating, these women have captured the public imagination. It is not without reason that Yasmin Rashid and Aliya Hamza contested elections against the Sharif family and are said to have emerged successful and that their careers and their electoral performance or success is their own or the PTI’s rather than legacy.\n\nSimilarly, in the PTM, too, there was evidence of women mobilisation, be it in terms of organisational efforts or those who turned up at their gatherings to speak. This is all the more remarkable because both the PTM and BYC have mobilised women in societies, which are far more conservative.\n\nWhile the more prominent faces tend to be those of educated women, mostly with university degrees, there are also mothers, sisters, daughters and homemakers, who have suffered loss and displacement, and are no longer willing to suffer in silence. They speak up in whatever way they can; sometimes just by showing up at public gatherings. The change this signifies is not small but it passes unnoticed — because who in Islamabad or Lahore pays attention when a woman from a remote area in KP or Balochistan turns up at a PTM or BYC gathering with the picture of a missing loved one?\n\nThere are other indicators also of this woman mobilisation. Researchers are pointing out ‘deviancy’ in voting behaviour — a word used when women polling stations are reporting a result which is different from male polling stations in the same constituency, contradicting the long-held assumption of women voting the same way as male members of the family.\n\nAfiya Zia, who has researched the issue, wrote in The News in 2019 that the deviancy was 18 per cent in 2018, up from 11pc in 2013. This was based on Fafen’s data. She also pointed out that this trend appeared stronger in KP and Sindh than in Punjab. (Fafen reported a similar 18pc deviancy for 2024 but it is hard to say how useful the data from this election is.)\n\nThese figures would lead (and have led) to sarcastic commentary about the charisma of Imran Khan. If the same screens where male journalists sit and hold forth on women’s choices had an equal number of women commentators, someone perhaps would have pointed out that this, too, reflects misogyny.\n\nFor what else is it when men feel they have the right to say that 50pc of Pakistan’s voters’ choices are irrational or emotionally driven? That their voting choices are driven only by the looks of the candidates?\n\nAnd it continues to be misogyny when it is said that wives compel their husbands to vote for PTI or act in its favour. Because somehow, when male members force their entire families to vote for a party or candidate, due to patronage or caste, it is accepted as culture or acceptable politics but women playing a similar overbearing role fills the men of Pakistan with such dread that they have to ridicule it.\n\nNeither is it new. Just a few years ago, it was said with confidence that Maryam Nawaz influenced her father to take such an inflexible stand against the establishment — apparently, had she not been around, her father would have not run into such trouble politically.\n\nFive years down the line, no one asks what happened to those views. Because it was never fact or serious analysis, just misogyny and fear of change. Indeed, just as much as autocrats fear people, men of all hues and political leanings find it uncomfortable when women begin to stake a claim to the political stage. And the reaction to this is far from over.\n\nThe writer is a journalist.\n\nPublished in Dawn, April 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680706bf82c76.png",
  "retrievedAt": "2025-08-25T14:29:53.136Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905831",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T03:03:13.000Z"
}
