{
  "title": "HBL PSL 2025: Khushdil, Warner help Karachi Kings edge Peshawar Zalmi in thriller - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: Under the blazing lights of the National Bank Stadium, an electric crowd — the largest so far in this HBL Pakistan Super League season — erupted as Khushdil Shah clinched a heart-stopping two-wicket victory for Karachi Kings against Peshawar Zalmi here on Monday night.\n\nWith Kings reeling at 133-8, needing 15 off 12, Khushdil’s (23 not out off 17, three fours) nerveless assault on a tricky, low-bounce pitch turned the tide, providing them with the finishing touch after skipper David Warner’s gritty maiden PSL fifty (60 off 47, eight fours) and a spirited Zalmi fightback led by Luke Wood (3-28).\n\nEntering the match with Kings at two wins from four and Zalmi at one from three, this triumph, in the final game in the metropolis this season, bolstered Kings’ playoff hopes.\n\nThe chase was a rollercoaster, defined by Khushdil’s late heroics and a tense climax. Warner, the season’s biggest signing of the league, set the tone, as the southpaw battled seam and low bounce with deft drives and ramps, notably against Ali Raza (2-32), whom he plundered for three fours in the 14th over, including a ramp to fine leg and a slash past point.\n\nHis fifty, reached with a slice to deep point off Arif Yaqoob (1-18), steadied Kings at 107-5 before Wood’s back-of-the-hand slower ball, however, clean-bowled Warner in the 17th over, sparking Zalmi’s wild celebrations as Kings needed 29 off 21. Abbas Afridi and Aamer Jamal fell quickly, leaving Khushdil to face the pressure at 133-8.\n\nIn scintillating form this season, Khushdil rose to the occasion. Against Ali, he played cautiously, nurdling singles to keep the chase alive, but unleashed his power against Hussain Talat in the final over, as they required nine to win.\n\nA hammered four past backward point off a short, wide ball set the tone, and after a single, Hasan Ali’s (six not out off three) exquisite pull for another boundary sealed the win for Karachi, sparking delirium among the raucous crowd, whose energy outshone the leg’s earlier matches.\n\nEarlier, Tim Seifert fell on the very first ball to Wood, James Vince (11 off nine, two fours) nicked off, and Saad Baig was bowled by Ali. Mohammad Nabi (14 off 11, a four and a six) and Irfan Khan (10 off 16) kept Kings’ hopes alive but Arif’s spin and a run-out tightened the screws, making Khushdil’s composure pivotal.\n\nEarlier after being put into bat, Zalmi posted a fighting 147-8, setting the stage for a tense chase on a bowler-friendly pitch.\n\nThe Zalmi innings, marked by disciplined bowling from Kings and flashes of resilience from Babar Azam and Alzarri Joseph, unfolded as a tale of survival and sporadic defiance.\n\nKings unleashed their pace battery with Mir Hamza (1-14) setting the tone. His opening spell was a masterclass, exploiting early swing and seam to keep Zalmi openers, Babar and Saim Ayub, on a leash.\n\nHamza’s probing lines accounted for Saim, who fell to a rash shot, caught by Vince at backward point. Babar, surviving an early lbw scare via review, battled through a testing powerplay, managing 19 off 25 by the sixth over, but the pitch’s behaviour stifled fluency.\n\nThe middle overs saw Zalmi wrestle for momentum. Tom Kohler-Cadmore’s brief stay at the crease ended with a stunning catch by Irfan off Khushdil (3-20), whose crafty spin dismantled Zalmi’s core.\n\nBabar, anchoring the innings, found rhythm with elegant drives, amassing 46 off 41, including seven fours. Yet, his attempt to accelerate was thwarted by Khushdil’s quicker delivery, trapping him lbw in the 10th over — a crucial blow.\n\nMohammad Haris (28 off 21) injected impetus with audacious strokeplay but Abbas’ (3-30) cunning slower ball sent him packing, caught by Warner.\n\nKings’ bowlers maintained relentless pressure. Abbas excelled at the death, dismissing Hussain (18 off 16) and Wood, while Khushdil’s guile removed Mitchell Owen.\n\nWith Zalmi reeling at 111-5 after 16 overs, Alzarri Joseph’s late flourish (24 not out off 13, two fours and a six) provided a lifeline. His muscular hits, alongside a few wayward deliveries from Hasan, pushed Zalmi close to 150 — a total that, given the pitch’s challenges, proved just short.\n\nSCOREBOARD\n\nPESHAWAR ZALMI:\n\nBabar Azam lbw b Khushdil 46\n\nSaim Ayub c Vince b Hamza 4\n\nTom Kohler-Cadmore c Irfan b Khushdil 7\n\nMohammad Haris c Warner b Abbas 28\n\nHussain Talat c&b Aamer 18\n\nMitchell Owen lbw b Khushdil 5\n\nAbdul Samad c Hamza b Abbas 2\n\nAlzarri Joseph not out 24\n\nLuke Wood c Aamer b Abbas 2\n\nArif Yaqoob not out 1\n\nEXTRAS (LB-1, NB-1, W-8) 10\n\nTOTAL (for eight wickets, 20 overs) 147\n\nDID NOT BAT: Ali Raza\n\nFALL OF WICKETS: 1-9 (Saim), 2-36 (Kohler-Cadmore), 3-67 (Babar), 4-104 (Hussain), 5-111 (Owen), 6-115 (Haris), 7-131 (Samad), 8-136 (Wood)\n\nBOWLING: Hamza 4-0-14-1 (1w), Hasan 4-0-33-0 (3w, 1nb), Abbas 4-0-30-3 (1w), Khushdil 3-0-20-3, Nabi 3-0-28-0 (1w), Aamer 2-0-21-1 (2w)\n\nKARACHI KINGS:\n\nTim Seifert lbw b Wood 0\n\nDavid Warner b Wood 60\n\nJames Vince c Haris b Wood 11\n\nSaad Baig b Ali 9\n\nIrfan Khan run out 10\n\nMohammad Nabi c Samad b Arif 14\n\nKhushdil Shah not out 23\n\nAbbas Afridi c Kohler-Cadmore b Joseph 2\n\nAamer Jamal lbw b Ali 1\n\nHasan Ali not out 6\n\nEXTRAS (LB-5, NB-2, W-5) 12\n\nTOTAL (for eight wickets, 19.3 overs) 148\n\nDID NOT BAT: Mir Hamza\n\nFALL OF WICKETS: 1-0 (Seifert), 2-19 (Vince), 3-42 (Saad), 4-68 (Irfan), 5-89 (Nabi), 6-119 (Warner), 7-132 (Abbas), 8-133 (Aamer)\n\nBOWLING: Wood 4-0-28-3 (2w, 1nb), Joseph 4-0-36-1, Ali 4-0-32-2 (2w, 1nb), Saim 3-0-20-0, Arif 4-0-18-1 (1w), Hussain 0.3-0-9-0\n\nRESULT: Karachi Kings won by two wickets.\n\nPLAYER-OF-THE-MATCH: Khushdil Shah\n\nPublished in Dawn, April 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6806d987abe41.gif",
  "retrievedAt": "2025-10-12T02:40:30.606Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905780/hbl-psl-2025-khushdil-warner-help-karachi-kings-edge-peshawar-zalmi-in-thriller",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T00:20:09.000Z"
}
