{
  "title": "Iran accuses Israel of undermining US nuclear talks - World - DAWN.COM",
  "author": null,
  "content": "TEHRAN: Iran accused Israel on Monday of seeking to “undermine” ongoing talks with the United States on its nuclear programme, a key point of tension with the West.\n\n“A kind of coalition is forming… to undermine and disrupt the diplomatic process,” Iranian foreign ministry spokesman Esmail Baqaei told reporters, saying Israel was behind the effort.\n\n“Alongside it are a series of warmongering currents in the United States and figures from different factions,” the spokesman added.\n\nThe New York Times reported on Thursday that US President Donald Trump had dissuaded Israel from striking Iran’s nuclear sites in the short term.\n\nIsraeli Prime Minister Benjamin Netanyahu has insisted that Israel would never allow Iran to acquire nuclear weapons.\n\nWestern powers and Israel, considered by experts the only nuclear-armed state in the Middle East, have long accused Tehran of seeking nuclear weapons.\n\nIran has always denied the charge, insisting its nuclear programme is for civilian purposes only.\n\nIn 2018, Donald Trump withdrew the United States from a landmark nuclear deal signed three years earlier that eased sanctions on Iran in return for curbs on its nuclear programme. A year later, Iran began to gradually breach the terms of the deal, most notably by enriching uranium to high levels.\n\nAccording to the International Atomic Energy Agency, Tehran has enriched uranium to 60 per cent, close to the 90pc level needed to manufacture weapons, and continues to accumulate large stocks of fissile material.\n\nThe 2015 nuclear deal restricted it to 3.67 percent.\n\nIran and the United States, arch-foes since the 1979 Islamic Revolution, are set to meet for a third round of talks mediated by Oman.\n\nPublished in Dawn, April 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:39:46.716Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905768/iran-accuses-israel-of-undermining-us-nuclear-talks",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T00:19:50.000Z"
}
