{
  "title": "Aurangzeb assures World Bank of govt’s commitment to sustainable economic stability - Pakistan - DAWN.COM",
  "author": null,
  "content": "Finance Minister Muhammad Aurangzeb has reaffirmed the government’s commitment to achieve “sustainable economic stability” in the country as he held a series of meetings with officials from the International Monetary Fund (IMF) and the World Bank in Washington, a press release from the Press Information Department said on Tuesday.\n\nThe meetings, scheduled from Monday, April 21 to Saturday, April 26, were held on the sidelines of the 2025 Spring Meetings of the World Bank Group and the IMF in the US. The forum brings together finance ministers and central bank governors from 191 countries to address global challenges such as sovereign debt, climate finance, and reforming the international financial system. The meetings, held twice a year, provide a rare forum for high-level consultations among global financial institutions and policymakers.\n\nAccording to the press release, in a meeting with World Bank Group President Ajay Banga, the finance minister expressed appreciation for the bank’s historical support to Pakistan, particularly the Country Partnership Framework (CPF).\n\nDuring the meeting, Banga was given a “detailed overview of Pakistan’s macroeconomic turnaround” while Aurangzeb reaffirmed Pakistan’s commitment to “sustainable economic stability”, the statement said.\n\nIn January, Pakistan became the first country to launch a longer-term CPF with the World Bank. According to the World Bank, the new framework aims to “support inclusive and sustainable development through a strong focus on building human capital”.\n\nAurangzeb also held a meeting with IMF Managing Director Kristalina Georgieva, where he expressed gratitude for the global money lender’s staff-level agreement and new arrangements under the resilience and sustainability facility. “The two sides discussed Pakistan’s economic recovery plan, structural reforms, and the future of ongoing programmes,” per the statement.\n\nRecently, Pakistan reached a staff-level agreement with the IMF under a $7bn Extended Fund Facility (EFF), approved in September 2024 for a 37-month period.\n\nAurangzeb extended an invitation to Georgeiva on behalf of Prime Minister Shehbaz Sharif to visit Pakistan.\n\nThe minister also attended a luncheon hosted by the US Pakistan Business Council, where Aurangzeb discussed regional trade and market diversification, inviting collaboration in the mining and minerals sector.\n\n“He thanked the US Pakistan Business Council for participating in Pakistan Investment Minerals Forum 2025, held earlier this month,” the statement added.\n\nThe finance minister also met the Assistant Secretary of the US Department of the Treasury Robert Kaproth, Secretary General of the Climate Vulnerable Forum & Vulnerable 20 (CVF-V20), Mohamed Nasheed, Regional Vice President of the International Finance Corporation (IFC) Hela Cheikhrouhou, along with a Deloitte delegation in separately held meetings.\n\nIn the meeting with CV-V20 General Secretary, Aurangzeb highlighted that “four of its [CPF] six key outcomes directly address Pakistan’s existential challenges of climate change and population pressures.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/221843381830360.jpg",
  "retrievedAt": "2025-08-25T14:29:44.402Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905924/aurangzeb-assures-world-bank-of-govts-commitment-to-sustainable-economic-stability",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T15:07:33.000Z"
}
