{
  "title": "Focus turns to cardinals who will elect new pope - World - DAWN.COM",
  "author": null,
  "content": "VATICAN CITY: With the death of Pope Francis, announced by the Vatican on Monday, the Roman Catholic Church will begin elaborate rituals steeped in tradition that mark the end of one papacy and lead to the start of the next.\n\nMost are governed by a constitution known as Universi Dominici Gregis (Of the Lord’s Whole Flock) approved by Pope John Paul II in 1996 and revised by Pope Benedict XVI in 2007 and 2013.\n\nA cardinal known as the camerlengo (chamberlain), currently Irish-American Cardinal Kevin Farrell, will run the ordinary affairs of the nearly 1.4 billion-member Roman Catholic Church during the period known as the “sede vacante” (empty chair).\n\nHe officially confirms the pope’s death, a simple matter these days involving a doctor and a death certificate. Until sometime in the 20th century, this was ritually done by tapping a silver hammer on the pope’s forehead three times.\n\nThe camerlengo and three assistants chosen from among cardinals under 80 years of age, known as cardinal electors, decide when the pope’s body is to be taken into St. Peter’s Basilica for the public to pay their respects.\n\nThey also make sure the pope’s “Fisherman’s Ring” and his lead seal are broken so they cannot be used by anyone else. No autopsy is performed. The camerlengo locks and seals the pope’s personal residence. In the past, this was in apartments in the Apostolic Palace but Pope Francis lived in a small suite in the Vatican guesthouse known as Santa Marta.\n\nThe camerlengo and the other cardinals cannot make major decisions affecting the Church or change its teachings. The heads of most Vatican departments resign until the new pope confirms or replaces them. Mourning rites last nine days, with the date of the funeral and burial to be decided by the cardinals. Universi Dominici Gregis says they should start between the fourth and sixth day after his death.\n\nPapal funeral\n\nPope Francis, who shunned much of the pomp and privilege of leading the global Catholic Church, modified and simplified the papal funeral rites in 2024. The funeral Mass is still expected to be held in St. Peter’s Square, but unlike many predecessors, Pope Francis asked to be buried in Rome’s St. Mary Major Basilica to be near his favourite icon of the Madonna.\n\nPope Francis also asked to be buried in a simple wooden casket, unlike predecessors who were buried in three interlocking caskets made of cypress, lead and oak. He asked that his body not be put on display atop a raised platform, or catafalque, in St. Peter’s Basilica for visitors in Rome to view, as was the case with previous popes.\n\nCardinals from around the world descend on Rome following the death of a pontiff. They hold daily meetings known as general congregations to discuss Church matters, and lay out the characteristics each believes the new pope should have.\n\nCardinals aged 80 or over can attend the general congregations but are not allowed to enter the conclave to choose the next pope, which is a gathering of cardinals under the age of 80. Much of the discussion takes place in personal interactions between the cardinals. Traditionally, a mourning period of 15 days is observed before a conclave can begin.\n\nBefore he resigned in 2013, Pope Benedict modified the constitution to allow it to begin sooner if the cardinals chose to, or a maximum of 20 days after the death if some cardinals have difficulty getting to Rome.\n\nThe conclave is held in the Sistine Chapel. Until the two conclaves in 1978 that elected John Paul I and John Paul II, the cardinals stayed in makeshift rooms around the Sistine Chapel.\n\nSince the 2005 conclave that elected Pope Benedict, they have voted in the Sistine Chapel but stayed in the Santa Marta guest house, with about 130 rooms. Santa Marta is sealed off and they are taken by bus to the Sistine Chapel.\n\nThe word conclave comes from the Latin for “with a key”. It stems from a tradition that started in the 13th century where cardinals were locked up to force them to decide as quickly as possible and limit outside interference.\n\nWhen the conclave has elected a pope, he is asked if he accepts and which name he wishes to take. If he declines, the procedure starts again. The new pope dons white vestments that have been prepared in three sizes and sits on a throne in the Sistine Chapel to receive the other cardinals, who pay homage and pledge obedience.\n\nThe world will know that a pope has been elected when an official burns the paper ballots with special chemicals to make white smoke pour out of the chapel’s chimney. Black smoke indicates an inconclusive vote. The senior elector amongst the cardinal deacons, currently French Cardinal Dominique Mamberti, steps on to the central balcony of St. Peter’s Basilica to announce to the crowds in the square “Habemus Papam” (We have a Pope).\n\nShazia Hasan adds from Karachi: A Pakistani is also in the race to succeed Pope Francis. He is Cardinal Joseph Coutts, who was archbishop of Karachi from 2012 to 2021.\n\nJoseph Coutts, appointed as cardinal by Pope Francis in 2018, was born on July 21, 1945. Being three months’ shy of his 80th birthday, he qualifies for the conclave to elect a new pope. If Cardinal Coutts wins the election, he will be the first pope from South Asia.\n\nPublished in Dawn, April 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6806dd86eefea.gif",
  "retrievedAt": "2025-10-12T02:39:45.456Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905798/focus-turns-to-cardinals-who-will-elect-new-pope",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T00:20:16.000Z"
}
