{
  "title": "Maulana joins hands with Jamaat-i-Islami for pro-Palestine agitation - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Jamaat-i-Islami (JI) and Jamiat Ulema-i-Islam (JUI-F) on Monday urged all political parties to unite and adopt a firm and clear position on the Israeli barbarity being unleashed on Gaza, as they criticised the Organisation of Islamic Cooperation (OIC) for its weak stance on the issue.\n\nThe remarks came after JUI-F chief Maulana Fazlur Rehman visited the JI headquarters in Lahore on Monday to “discuss the ongoing humanitarian crisis in Gaza and other pressing national issues”.\n\nAfter the meeting, the heads of both parties held a press conference and expressed concern over the ongoing Israeli aggression in Gaza, the silence of Muslim world leaders, and the Organisation of Islamic Cooperation’s weak stance on the matter.\n\nJI emir Hafiz Naeemur Rehman stressed that political parties should openly denounce both the United States and Israel, reiterating that the JI would continue its dialogue and cooperation with other political and religious parties, including JUI-F, but its political struggle would remain independent and platform-specific. He also thanked Maulana Fazlur Rehman and his delegation for visiting Mansoora.\n\nHafiz Naeem rejects 26th amendment, says it has weakened the judiciary\n\nHe announced that the JI would hold a nationwide strike on April 26 in solidarity with the people of Gaza, as part of its ongoing public awareness campaign for Palestine.\n\nMaulana Fazlur Rehman said the entire Muslim Ummah was deeply agitated over the situation in Gaza and called for a stronger and clearer position from the OIC. He also shared that the JUI-F had formed a joint platform, Majlis Ittehad-i-Ummat, for collective efforts in support of Gaza.\n\nSpeaking about the 26th Amendment, the Maulana remarked that different political parties may have varying opinions, which should not be interpreted as major discord. He also stressed that provincial resources should primarily serve the people of the province.\n\nResponding to journalists’ questions, the JI chief categorically rejected the 26th Constitutional Amendment, stating it had weakened the judiciary. He reiterated JI’s long-standing demand for a probe into electoral rigging and asserted that instead of holding new elections, the country needed a thorough investigation into the last polls for electoral transparency.\n\nNaeemur Rehman noted that this was his first meeting with Maulana Fazlur Rehman since becoming party chief and that further engagement would continue in future. Both sides agreed on the importance of upholding constitutional supremacy and stressed that all institutions must operate within their constitutional boundaries.\n\nPublished in Dawn, April 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/22084155b2ba711.jpg",
  "retrievedAt": "2025-08-25T14:30:32.426Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905777/maulana-joins-hands-with-jamaat-i-islami-for-pro-palestine-agitation",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T00:19:50.000Z"
}
