{
  "title": "US looking to sell more energy, defence equipment to India: Vance - World - DAWN.COM",
  "author": null,
  "content": "The United States is looking to sell more energy and defence equipment to India, Vice President JD Vance said on Tuesday on a visit to the country, adding that ties between the two countries will shape the century.\n\n“If India and the United States work together successfully, we’re going to see a 21st century that is prosperous and peaceful,” he said in a speech in the northwestern Indian city of Jaipur.\n\n“But I also believe that if we fail to work together successfully, the 21st century could be a very dark time for all of humanity.”\n\nHe also repeatedly praised Indian Prime Minister Narendra Modi following their dinner yesterday. Vance is on a mostly personal, four-day visit to India along with his wife, who is the daughter of Indian immigrants, and their three children.\n\nThe trip comes at a time when India is rushing to clinch an early trade deal with the US — its largest trading partner — before the end of the 90-day pause on the steep tariffs announced by President Donald Trump’s administration.\n\n“Prime Minister Modi is a tough negotiator. He drives a hard bargain,” Vance said to a big laughter from the audience.\n\nIndia hopes to “positively conclude” the first part of a trade pact by autumn, Indian Finance Minister Nirmala Sitharaman said in San Francisco on Monday.\n\nVance said he and Modi made good progress on trade talks, and confirmed that the two sides had finalised the terms of reference for the trade negotiation.\n\n“It sets a roadmap toward a final deal between our nations,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/22165125680d2a7.jpg",
  "retrievedAt": "2025-08-25T14:29:45.620Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905912/us-looking-to-sell-more-energy-defence-equipment-to-india-vance",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T11:43:04.000Z"
}
