{
  "title": "Fleeing Pakistan, Afghans rebuild from nothing - World - DAWN.COM",
  "author": null,
  "content": "Pushed out of Pakistan where she was born, Nazmine Khan’s first experience of her country, Afghanistan, was in a sweltering tent at a border camp.\n\n“We never thought we would return to Afghanistan,” said the 15-year-old girl, who has little idea of what will become of her or her family, only that she is likely to have fewer freedoms.\n\n“When our parents told us we had to leave, we cried,” added Nazmine.\n\nHaving nowhere to go in Afghanistan, she and six other family members shared a stifling tent in the Omari camp near the Torkham border point.\n\nIslamabad, accusing Afghans of links to narcotics and “supporting terrorism”, announced a new campaign in March to expel hundreds of thousands of Afghans, with or without documents.\n\nMany had lived in Pakistan for decades after fleeing successive wars and crises but did not wait to be arrested by Pakistani forces before leaving, seeing their removal as inevitable.\n\nSince April 1, more than 92,000 Afghans have been sent back to their country of origin, according to Islamabad, out of the some three million the United Nations says are living in Pakistan.\n\nNazmine’s family fled Afghanistan in the 1960s. Her four brothers and sister were also born in Pakistan.\n\n“In a few days we’ll look for a place to rent” in the border province of Nangarhar where the family has roots, she told AFP, speaking in Urdu, not knowing any Afghan languages.\n\nIn the family’s tent, there is little more than a cloth to lie on and a few cushions, but no mattress or blanket. Flies buzz under the tarpaulin as countless children in ragged clothes come and go.\n\nWhen it comes to her own future, Nazmine feels “completely lost”, she said.\n\nHaving dropped out of school in Pakistan, the Taliban authorities’ ban on girls studying beyond primary school will hardly change the course of her life.\n\nBut from what little she heard about her country while living in Punjab, she knows that “here there are not the same freedoms”.\n\nSince returning to power in 2021, the Taliban authorities have imposed restrictions on women characterised by the UN as “gender apartheid”.\n\nWomen have been banned from universities, parks, gyms and beauty salons and squeezed from many jobs.\n\n“It is now a new life… for them, and they are starting this with very little utilities, belongings, cash, support,” said Ibrahim Humadi, programme lead for non-governmental group Islamic Relief, which has set up about 200 tents for returnees in the Omari camp.\n\nSome stay longer than the three days offered on arrival, not knowing where to go with their meagre savings, he said.\n\n“They also know that even in their area of return, the community will be welcoming them, will be supporting them… but they know also the community is already suffering from the situation in Afghanistan,” he added.\n\nAround 85 per cent of the Afghan population lives on less than one dollar a day, according to the United Nations Development Programme.\n\n“We had never seen [Afghanistan] in our lives. We do not know if we can find work, so we are worried,” said 28-year-old Jalil Khan Mohamedin, as he piled belongings — quilts, bed frames and fans — into a truck that will take the 16 members of his family to Kabul, though nothing awaits them there.\n\nThe Taliban authorities have said they are preparing towns specifically for returnees.\n\nBut at one site near Torkham, there is nothing more than cleared roads on a rocky plain.\n\nThe International Organisation for Migration (IOM) believes “greater clarity” is needed to ensure that the sites intended for returnees are “viable” in terms of basic infrastructure and services such as health and education.\n\nIt’s important that “returnees are making informed decisions and that their relocation to the townships is voluntary”, communications officer Avand Azeez Agha told AFP.\n\nLooking dazed, Jalil’s brother Dilawar still struggles to accept leaving Pakistan, where he was born 25 years ago.\n\nHis Pakistani wife did not want to follow him and asked for a divorce.\n\n“When we crossed the border, we felt like going back, then after a day it felt fine,” said the former truck driver.\n\n“We still don’t understand. We were only working.”\n\nHeader image: Afghan refugees with their belongings sit in a truck as they arrive from Pakistan at a makeshift camp near the Afghanistan-Pakistan Torkham border in Nangarhar province on April 20, 2025. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/2211475961bde04.jpg",
  "retrievedAt": "2025-08-25T14:29:50.893Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905879/fleeing-pakistan-afghans-rebuild-from-nothing",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T07:23:29.000Z"
}
