{
  "title": "Qaumi Watan Party’s Sherpao calls for joint plan of action to eliminate terrorism - Pakistan - DAWN.COM",
  "author": null,
  "content": "CHARSADDA: Qaumi Watan Party central chairman Aftab Ahmad Khan Sherpao has said that the government, security establishment and all political parties should sit together and prepare a joint plan of action to eliminate terrorism and establish peace in Khyber Pakhtunkhwa.\n\nHe expressed these views while talking to media persons at the residence of Timber Association president and QWP leader Haji Habibur Rehman Sherpao during his son’s wedding ceremony in Sherpao area.\n\nQWP leaders Sikandar Khan Sherpao, Haji Jhanzeb, Qaiser Jamal Hashtangri and other party leaders were also present on the occasion.\n\nMr Sherpao hailed the restoration of Pak-Afghan trade but said the talks between neighboring countries should continue as negotiations with Afghanistan were the need of the hour to establish lasting peace in the region.\n\nHails restoration of Pak-Afghan trade\n\nHe said that implementation of the Mines and Minerals Bill was a deviation from the Constitution and an attack on provincial autonomy.\n\n“We will vigorously resist this bill and even go to court in protest,” he said.\n\nThe QWP chief said the purpose of the proposed legislation was to deprive a poor province like Khyber Pakhtunkhwa of mineral resources.\n\n“The Mines and Minerals Act, 2017, was passed during our coalition government,” he said, adding that proposed minerals legislation is against provincial autonomy.\n\nMr Sherpao said terrorism was on the rise in the province as an incompetent chief minister was at the helm of affairs.\n\nHe said most areas in southern districts had become ‘no-go areas’ and that in view of the poor law and order situation, the government officials had restricted their movement.\n\n“Only agenda of the PTI government is to get party founder Imran Khan released from jail. It does not care about the province,” he said.\n\nThe QWP chief said the federal government had ignored Khyber Pakhtunkhwa.\n\nHe complained that Prime Minister Shehbaz Sharif had not visited the province in the last one and a half years.\n\n“The people of Khyber Pakhtunkhwa have not only voted for the PTI but for other political parties as well,” he said.\n\nMr Sherpao said Pakhtuns living in Gulf and Arab countries had rejected the call of the PTI founder and sent record amounts of money home, but even then, Pakhtuns were being ignored.\n\nHe said that the increase in petroleum levy would further increase inflation.\n\nThe QWP chief said a meeting of Pakistan, Afghanistan and UNHCR was indispensable for the dignified return of Afghan refugees so that a repatriation mechanism could be devised for the purpose.\n\nHe hailed the visit of Deputy Prime Minister Ishaq Dar to Afghanistan and said the restoration of trade between the two countries was welcome.\n\n“Various channels should be kept open for talks with Afghanistan,” he said.\n\nPublished in Dawn, April 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:40:53.195Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905741/qaumi-watan-partys-sherpao-calls-for-joint-plan-of-action-to-eliminate-terrorism",
  "dateList": "2025-04-22",
  "date_published": "2025-04-22T00:20:36.000Z"
}
