{
  "title": "Govt asked to drop Rawalpindi Ring Road phase-II project after motorway merger plan - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The Rawalpindi Development Authority (RDA) has asked the Punjab government to drop the Rawalpindi Ring Road Project Phase-II (from Thallian to Sangjani on G.T. Road) after the merger plan for traffic on the motorway was approved.\n\nA senior official of RDA told Dawn that the civic body wrote a letter to the Punjab government through its parent department of ‘Housing, Urban Development, and Physical Health Engineering’ to drop the plan as it involved a huge land acquisition.\n\nHe said that the current alignment of Ring Road started from Baanth and ended at Thallian. He said that a plan for traffic merging from the Ring Road to the motorway has been prepared by Nespak and discussed by the National Highway Authority.\n\n“NHA has also principally agreed to the merger plan. It has also been agreed that in order to cater to the increased traffic volume from Ring Road, an additional two lanes will be provided on the motorway,” he said.\n\nRDA says money can be spent on finding optimal route for phase 2\n\nIn light of this merger plan, there will be no need for Phase-II or a feasibility study for Thallian-Sangjani route, he said, adding that they asked the government to cap the scheme.\n\nThe official said if necessary, then a new study could be conducted to determine the optimal route instead of the Thalian-Sangjani route under the second phase.\n\nThe construction of Rawalpindi Ring Road (38.3 km) from Baanth (N-5) to Thallian (M-2) was approved by ECNEC in December 2021.\n\nAccordingly, the administrative approval was issued by the HUD&PHE Department on February 4, 2022, to the tune of Rs26.969 billion.\n\nThe contract was awarded to Frontier Works Organisation as the contractor and the agreement was signed in March 2024.\n\nThe senior official said that a joint venture of Turkish and Pakistani firms was tasked with selecting the route from Baanth to Thallian for third-party validation. However, one of the recommendations by the firm was “to conduct a feasibility study to determine optimal route alignment for Phase-ll of Rawalpindi Ring Road (from Thalian to Sangjani or any other possible termination point on G.T. Road) may be initiated on a priority basis”.\n\nUpon this, he said that the Rawalpindi Ring Road Project Management Unit (PMU) will prepare the feasibility study from Thalian to G.T. Road for Rs52 million and send it to the Punjab Development Working Party.\n\nWhen contacted, RDA Director General Kinza Murtaza said that we recommended the government not spend more money on Phase-II of Ring Road as the NHA had agreed to construct two additional lanes on the motorway, and the traffic will use it to reach G.T. Road.\n\n“If there is a necessity, then conduct a fresh feasibility for the shortest route. There are two routes from Thallian to G.T. Road: one is more than 27 kilometres and the second is 13 kilometres, but the consultant will be hired for the optimal route where less land acquisition is involved,” he said. After the federal government’s agreement to construct two new lanes on the motorway from Thalian to G.T. Road, it would be enough to cater to traffic for the next few years, she said.\n\nPublished in Dawn, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:37:10.090Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893884/govt-asked-to-drop-rawalpindi-ring-road-phase-ii-project-after-motorway-merger-plan",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T01:13:55.000Z"
}
