{
  "title": "Pakistan need big improvement after damaging India loss, says Saud - Sport - DAWN.COM",
  "author": null,
  "content": "Top-order batsman Saud Shakeel said Pakistan must be better in every facet after a six-wicket defeat to arch-rivals India left the hosts on the brink of a Champions Trophy exit.\n\nShakeel top scored with 62 as Pakistan were dismissed for a below-par 241 in 49.4 overs in Sunday’s blockbuster Group A clash.\n\nTournament favourites India overhauled the target in 42.3 overs with a masterly unbeaten 100 by Virat Kohli.\n\nPakistan are hosts of the one-day event but the match took place in Dubai in front of a packed 25,000 crowd after India refused to travel to their neighbour.\n\n“We did not play well in all three departments and that is why this result has come and we have to accept this,” Shakeel told reporters.\n\nPakistan were lifted by a third-wicket stand of 104 between Shakeel and skipper Mohammad Rizwan, who scored 46, but both fell in successive overs in the space of eight runs.\n\nShakeel said those wickets hurt Pakistan.\n\n“We are losing wickets in bunches and are not building big partnerships,” he said.\n\nHe added: “When we were batting the pitch played slow. We tried to bat deep but it did not happen.\n\n“I am sure fans will be disappointed, just like we are.”\n\nThe defeat left Pakistan at the bottom of Group A with two losses in as many games.\n\nThey now need other results to go in their favour to remain in contention for the semi-finals.\n\n“Some things did not go in our favour,” said spinner Abrar Ahmed, but agreed with Shakeel.\n\n“We have to change a lot of things within the group.\n\n“This tournament is like that — you go out if you lose one match. We have to improve our batting and have to do more work on bowling.”\n\nPakistan face Bangladesh in their last group match in Rawalpindi on Thursday, but both will already be eliminated if Bangladesh lose to New Zealand later on Monday.\n\nPakistan is hosting a major international cricket tournament for the first time in nearly three decades.\n\nRizwan said Pakistan’s middle order succumbed to the pressure in the defeat against India.\n\nThe skipper, who scored 46 in a 104-run stand with Saud Shakeel (62), said his team had paid a heavy price for failing to build on the momentum.\n\n“The middle order wasn’t good enough,” Rizwan told reporters.\n\n“The players performed well before this. In our meeting we had discussed that on this pitch around 270-280 would be enough (but) because the outfield was slow, the pitch was slow, the ball wasn’t going into the gaps.\n\n“Saud and I tried to build a partnership and took a lot of time, but after that the shot selection was poor. That’s where they got a chance to take our wickets. Our middle order maybe couldn’t take the pressure.”\n\n“For now, we can say that it’s over. This is the truth. We’ll see what Bangladesh do with New Zealand, what New Zealand do with India, and what we do,” Rizwan said.\n\n“As a captain, I don’t like this (depending on other teams). If you’re good enough, you show it by winning and keeping things in your hands.\n\n“What matters is that India and New Zealand beat us. They played strong and we didn’t play well. If we get a chance (to sneak through) then so be it.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/24120953323928b.jpg",
  "retrievedAt": "2025-10-12T01:37:10.937Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894029/pakistan-need-big-improvement-after-damaging-india-loss-says-saud",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T07:10:34.000Z"
}
