{
  "title": "Ex-German star footballer Ozil goes into Turkish politics with ruling party - Sport - DAWN.COM",
  "author": null,
  "content": "Former Germany, Real Madrid and Arsenal star Mesut Ozil, who retired in 2023, was elected on Sunday to the ruling Justice and Development Party (AKP) party of Turkish President Recep Tayyip Erdogan, the party announced.\n\nThe German-born 2014 World Cup winner became a member of the AKP’s central council at a congress in Ankara where Erdogan was re-elected for the ninth time as head of the conservative party which has ruled Turkey since 2002.\n\nOzil, who ended his club career in Istanbul, is a longtime Erdogan supporter, having chosen him as his best man in 2019 for his wedding to a former Miss Turkey, Amine Glse.\n\nA photo of Ozil and Erdogan with former Germany teammate Ilkay Guendogan, also of Turkish origin, caused controversy, with Berlin accusing the Turkish head of state of repressive drift, while Ozil was criticised by the German far right.\n\nOzil, previously held up as a symbol of a multicultural Germany, turned his back on the German national team, accusing the German Football Association of racism.\n\nAfter months of silence over a controversial photograph with Erdogan in 2018, Ozil erupted.\n\nThe former Arsenal midfielder posted a stinging four-page statement taking aim at German Football Association (DFB) bosses, sponsors and the media.\n\nOzil blamed the DFB management, in particular its president Reinhard Grindel, for failing to side with him against his critics.\n\n“In the eyes of Grindel and his supporters, I am German when we win, but I am an immigrant when we lose,” Ozil had written.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/24204223f02df97.jpg",
  "retrievedAt": "2025-08-25T19:58:45.328Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894073/ex-german-star-footballer-ozil-goes-into-turkish-politics-with-ruling-party",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T15:50:59.000Z"
}
