{
  "title": "Irrigation improvements carry on - Newspaper - DAWN.COM",
  "author": null,
  "content": "A major part of the ongoing upgrade of the colonial-era Sukkur barrage is set to be completed before this flood season of 2025. It includes replacements of the 18 gates of the barrage under a World Bank-funded loan. Such loans aim to ensure the modernisation of both Sukkur and Guddu barrages — both vital structures over the Indus River in Sindh under the Sindh Barrages Improvement Project (SBIP).\n\nOut of the World Bank’s Rs74.6bn sponsored loan, both Sukkur and Guddu barrages would respectively receive Rs43.3bn and Rs31.3bn as per project related document. Physical progress of the Guddu barrage is at 63 per cent, while Sukkur’s is at 21pc. Slow progress at Sukkur is constrained by a delayed start compared with Guddu.\n\nThe Sukkur barrage is a marvel of Pakistan’s irrigation network and is the backbone of Sindh’s agrarian economy. So, its modernisation is crucial. It feeds lower and upper districts through its seven major canals, including the largest ones, Nara and Rohri, on the left bank. The right bank districts that are home to rice production are fed through the Rice and Dadu canals and the North Western Canal. The last one also supplies water to Balochistan as per its share under the Water Apportionment Accord 1991.\n\nAccording to project officials, 16 gates (from 44 to 59) and two left pocket gates 62 and 63 will be replaced by May; the May-June period marks the beginning of flood season depending on upstream discharges in the system.\n\nWork on the Sukkur barrage continues to improve irrigation and deter past water disasters ahead of the 2025 flood season\n\nA visit to Sukkur barrage in early February indicated that a cofferdam — a huge engineering exercise — has been built up and downstream of the barrage for this gigantic task. Old gates had a height of 21ft, but under new specifications, they were raised to 23ft with an addition of one more horizontal girder to buttress the gate structure.\n\nThe new gates’ operation will be automated when the project is completed. By February’s third week, gates no 51-59 had been dismantled, and the removal of embedded parts was awaited, according to barrage official Abdul Samad Dahar. The silt accumulated upstream was being removed to expose the floor of the barrage. Required machinery had been mobilised for the purpose.\n\n“The cofferdam is to be removed by the start of June 2025 to expose the floor in the area where gate replacement is planned. Such floor exposure will enable experts to have a naked eye observation backed by engineering tools as it is important to see the health of the structure,” said Pritam Das, the new project director of SBIP. He explained that the barrage floor in such a large area would be opened for examination for the first time since the barrage started functioning around a century back in 1932.\n\nHistoric peak discharges of Sindh’s three barrages indicate that Sukkur barrage has regularly received a flood discharge between 0.8 million cusecs to 1.2m cusecs from 1955 to 2010. As per one of the barrage’s presentations, the barrage had a maximum designed discharge capacity of 1.5m cusecs when it was built for Rs200m in the 1930s.\n\nHowever, capacity had to be reduced from 1.5m cusecs to 0.9m cusecs because of silt accumulation at 10 of the barrage’s gates (60 to 66). Those gates had to be closed in 1938-40. The gates’ closure was decided under a study conducted in Poona, India at the time. It was in 1976 when the barrage had received the highest flow of 1.2m cusecs as per peak discharges of three barrages of Sindh.\n\nA study is now underway in France under a World Bank-funded project on different hydraulic models for the reopening of ten barrage gates. The study aims to achieve an actual capacity of 1.5m cusec once these gates are opened. “Sindh secretary irrigation Zarif Khero has visited France lately, and another visit is due for ongoing study purposes,” said Mr Das.\n\nAny decision as to reopening those gates or otherwise, he elucidated, depends on the study’s findings. According to his explanation, all 56 gates are to be replaced and such a process would be completed within a span of three years.\n\nHowever, Sattar Sario, a retired executive engineer of the Sindh irrigation department with considerable experience of service at Sukkur barrage, points out that the barrage faces peculiar conditions. The Indus River’s Ultra Jagir dyke creates a backwater curve causing silt accumulation upstream with the result that the path of the main current gets narrowed to develop pressure on the structure. “A study that covers at least 5kms up and downstream area each of the barrage is needed to analyse the actual problem,” he suggested.\n\nA flood of close to or above 1.1m cusecs had passed through this barrage eight times since its inception, with the latest highest upstream discharge of 1.13m cusecs and 1.11m cusecs downstream being recorded on Aug 10, 2010 — a time when floods created chaos and inundated one-fourth of Pakistan. The 2010 super flood had caused the massive and infamous Tori dyke breach upstream of the Sukkur barrage, wreaking havoc in large swathes of right bank districts of Sindh and leading to large-scale displacements of population.\n\nCurrently, cofferdams have been built up and downstream (respectively before gates 43 to 59 and 43 to 60) to dewater the surface of the barrage for civil works ahead of gates’ replacement as Chinese engineers remained busy in the work amidst strict security. All these 18 gates would be manufactured in China and assembled in Sindh.\n\nMajor damages were reported to seven gates, including 44-48 and 52-54 of barrage, on June 20, 2024. Gate-47 was simply washed away and had to be replaced while the remaining gates were strengthened. Prior to damages to these gates, Karachi Shipyard and Engineering Works had replaced six gates, including 31, 33, 34, 35, 39 and 40, between 2021-2022 as they had weakened.\n\nSince June 2, 2024, a trial run of gate-36 manufactured under the project by a Chinese firm was also underway. Historically, June 2024 is the third major damage to the gates of the barrage since 1932. In 1982, gate 31 was damaged on Dec 20, 1982 and replaced by gate 10, one of ten closed gates. A recent presentation of the irrigation department showed that 56 gates were replaced first in 1987-92.\n\nAn enquiry committee commented on SBIP’s performance following the June 2024 damages. SBIP’s former PD, a committee member, disagreed with them in his dissenting note. SBIP’s Sukkur barrage component had already been delayed due to what PD had claimed ‘due to force majeure factor.\n\nPublished in Dawn, The Business and Finance Weekly, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:36:38.622Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893904",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T02:18:20.000Z"
}
