{
  "title": "Zelensky wants to meet Trump before Russia talks; offers to quit - World - DAWN.COM",
  "author": null,
  "content": "• UN chief calls for peace deal respecting ‘territorial integrity’ as US-backed draft resolution makes no such mention\n• Ukraine’s president seeks security guarantees from United States\n• Macron, Starmer to visit Washington to push for support to Kyiv\n\nKYIV: Volodymyr Zelensky said on Sunday that he is ready to quit as Ukraine’s president if it meant Kyiv would be admitted to the Nato military alliance, but he wants to meet Donald Trump before the US president meets his Russian counterpart Vladimir Putin.\n\nZelensky has been calling for Ukraine to be given Nato membership as part of any deal to end the war, but the Wash­ington-led alliance has been reluctant to make a pledge.\n\n“If there is peace for Ukraine, if you really need me to leave my post, I am ready. … I can exchange it for Nato,” Zelensky told a Kyiv press conference on the eve of the third anniversary of Russia’s invasion, adding he would depart “immediately” if necessary.\n\nGuarantees sought\n\n“I want very much from Trump understanding of each other,” he said, adding that “security guarantees” from the US president were “much needed”.\n\nThe Ukrainian leader also called for Trump to meet him before any summit with Putin. He added that there had been “progress” on a deal to give the United States preferential access to Ukraine’s critical resources.\n\nDespite Zelensky’s push for long-term security assistance and Trump talking up a peace deal, it is unclear whether the US moves can bring Moscow and Kyiv closer to a truce.\n\nKremlin’s spokesman Dmitry Peskov ruled out any territorial concessions as part of a settlement and Moscow has repeatedly rejected Nato membership for Ukraine. “The people decided to join Russia a long time ago,” he said, referring to Moscow-staged votes in eastern Ukraine.\n\nUN vote\n\nUN Secretary-General Antonio Guterres called on Sunday for a Ukraine peace deal that respects the country’s “territorial integrity”.\n\nOn the eve of a key UN vote, Mr Guterres said, “I reaffirm the urgent need for a just, sustainable and comprehensive peace — one that fully upholds Ukraine’s sovereignty, independence and territorial integrity within its internationally recognised borders.”\n\nHowever, the UN Security Council vote will be on a US-backed draft resolution that makes no mention of Ukraine’s territorial integrity.\n\nThe US wants the UNSC and UNGA to vote on a short text calling for a “swift end” to the conflict.\n\n‘God willed it’\n\nIn his comments on the eve of the anniversary of his “special military operation on Ukraine”, Putin said “God” and “fate” were behind his “mission” to defend Russia.\n\n“Fate willed it so, God willed it so, if I may say so. A mission as difficult as it is honourable — defending Russia — has been placed on our and your shoulders together,” he told servicemen who have fought in Ukraine.\n\n“Today, at the risk of their lives and with courage, they are resolutely defending their homeland, national interests and Russia’s future,” Putin said in a video released by the Kremlin.\n\nMoscow’s army launched a record 267 attack drones at Ukraine overnight, Kyiv’s air force said.\n\nUkraine shot down or intercepted almost all of them, and there were no reports of major damage.\n\nAs its troops advance on the battlefield and it continues massive aerial attacks, Russia has revelled in the diplomat spat between Trump and Zelensky.\n\n“Zelensky makes inappropriate remarks addressed to the head of state. He does it repeatedly,” Peskov said.\n\n“No president would tolerate that kind of treatment. So his (Trump’s) reaction is completely quite understandable.”\n\nRussia’s TASS news agency reported that US and Russian diplomats would meet in the next week, a follow-up to Riyadh talks between Russian Foreign Minister Sergei Lavrov and US Secretary of State Marco Rubio.\n\nScrambling to respond to Trump’s dramatic policy reversal, French President Emmanuel Macron and British Prime Minister Keir Starmer will travel to Washington this week to make the case for supporting Ukraine.\n\nPublished in Dawn, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67bba468d5fd7.jpg",
  "retrievedAt": "2025-10-12T01:37:08.853Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893889/zelensky-wants-to-meet-trump-before-russia-talks-offers-to-quit",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T01:13:41.000Z"
}
