{
  "title": "Islamabad NAB officer found dead in his room - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A senior official of the National Accountability Bureau (NAB) was found dead inside his room at a guest house, police said on Sunday.\n\nThe body of Additional Director Waqas Ahmed (BPS-19) was recovered from the guest house located in Sector G-6/4 on Sunday. The door of the officer’s room was broken as he was not responding, police said.\n\nThe incident took place in the limits of Aabpara police station and the body was shifted to Polyclinic for autopsy. The cause of the death will be ascertained after receiving the autopsy report, they said.\n\n“Although the family of the deceased has not submitted any application with the police for a legal action, an investigation into the matter has been started to ascertain the reason of the death,” police said.\n\nMr Ahmed was posted in Lahore. However, he was attached with the NAB headquarters in connection with an inquiry.\n\n“The officer’s room was locked from inside and there were no marks of any torture or wounds on his body. Previously, he served as an investigation officer in a case pertaining to the Oil and Gas Regulatory Authority,” a police official said. “We have been investigating the case from different angles and NAB officials have assured us that they will fully cooperate.”\n\nIn January 2013, a rental power projects case took a bizarre turn when a NAB officer investigating the rental power projects (RPP) scam was found dead in his room under mysterious circumstances.\n\nKamran Faisal, 35, who was investigating the scam along with another officer, was found hanging from a ceiling fan in his official residence at Federal Lodges in Islamabad.\n\nIt was learnt that Mr Faisal was investigating the RPP case under and had requested the Supreme Court to exclude him from the matter.\n\nPublished in Dawn, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:37:26.050Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893951/islamabad-nab-officer-found-dead-in-his-room",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T01:44:24.000Z"
}
