{
  "title": "Tarar says Pakistan ‘ably hosting’ Champions Trophy, rubbishes Indian media reports on terror threat - Sport - DAWN.COM",
  "author": null,
  "content": "Information Minister Attaullah Tarar on Monday said that the country was “peacefully and very ably” hosting the Champions Trophy as he rubbished Indian media reports of an alleged terror threat to foreigners travelling to Pakistan.\n\nEarlier today, a report by Indian media outlet News18 said: “Pakistan’s Intelligence Bureau issued a high alert on Monday, warning the country’s security forces about an alleged plot by ‘active covert groups’ to abduct foreign guests attending the ICC Champions Trophy 2025 for ransom.”\n\nIt reported that sources told the outlet about an alert issued against several terror outfits, including the banned Tehreek-i-Taliban Pakistan, Islamic State and other Balochistan-based groups. “In response to the intelligence warning, Pakistan’s security forces have deployed high-level protection teams, including rangers and local police, to ensure the safety of players and their accompanying staff,” it added.\n\nAnother report by India Today singled out the Islamic State Khorasan Province as “specifically targeting Chinese and Arab nationals” for the alleged ransom attempts.\n\nQuestioned about the matter during an interview on Geo News today, the information minister said: “I would like to state on record that Pakistan is peacefully and very ably hosting the ICC Champions Trophy. Our grounds are full, we have fans from all over the world, the crowds are jubilant, our streets are filled with people who are celebrating the victory of cricket but the Indian media, which is a subservient media, is trying to do politics and spreading false propaganda against Pakistan which is unacceptable and totally untrue.\n\n“Pakistan is one of the safest venues and we have been able to conduct the ICC matches very very peacefully and very efficiently.”\n\nHe alleged the reports were another attempt by India to “sabotage” sports in Pakistan.\n\n“They don’t desist from it. They can’t swallow that a major sports and ICC tournament has been held in Pakistan and they are extremely worried about this.\n\n“Before as well they tried to spread a lot of propaganda about this and tried to sabotage the ICC tournament through various excuses so we think they are extremely pained by this.”\n\nTarar said he was present at Lahore’s Gaddafi Stadium for the match between England and Australia, adding that he could not find the words to describe the atmosphere and sentiment on that day with the stadium packed with no place to stand.\n\n“Not just Pakistan, there were a lot of fans from England and Australia and I met a lot of Britishers there. This was a victory for Pakistan that such a great match between England and Australia was held in a Pakistani sports ground.\n\n“Their false propaganda of a low turnout died its own death. Now these false threat alerts that are being run are completely baseless, fake and concocted propaganda. The BCCI cannot stay without mixing sports with politics. They are extremists, fundamentalists and hardliners who attempt to mix sports with politics even in the sports grounds with their venomous propaganda.”\n\nHe brought up another example of reports about a New Zealand cricketer’s phone being stolen. Tarar added that resorting to such propaganda in an attempt to gain success could not be sustained.\n\nTarar said Pakistan rejected such propaganda and reiterated that the country was doing a “great job” about holding the tournament and would continue to do so.\n\n“This is a very important moment for Pakistan and you will see the way cricket is being played in these grounds will be a victory for the citizens of the world and sports. India’s propaganda will fall flat on its face and it will not only be exposed but we will tell the people that India cannot digest that such a great tournament is taking place in Pakistan and we have been able to do it very successfully.”\n\nIndia refused to tour Pakistan due to political reasons and instead are playing all their matches in Dubai, which will host the final if the Asian giants go the distance.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:58:45.338Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894079/tarar-says-pakistan-ably-hosting-champions-trophy-rubbishes-indian-media-reports-on-terror-threat",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T18:34:13.000Z"
}
