{
  "title": "Senior lawyer resigns as JCP member citing ‘controversies’ over judicial appointments - Pakistan - DAWN.COM",
  "author": null,
  "content": "Advocate Akhtar Hussain has resigned as a member of the Judicial Commission of Pakistan (JCP), citing “present controversies” regarding judicial appointments, it emerged on Monday.\n\nUnder the much-debated 26th Constitutional Amendment passed in October last year, the JCP, which approves judicial appointments, was reconstituted to include four members of the parliament.\n\nOn February 14, six judges of the Supreme Court took oaths following their nomination by the JCP. The commission meeting was boycotted by two PTI members part of it over the ongoing controversy on the transfer of judges to the Islamabad High Court (IHC).\n\nEarlier this month, Justice Sardar Mohammad Sarfraz Dogar from the Lahore High Court (LHC), Justice Khadim Hussain Soomro from the Sindh High Court (SHC) and Justice Muhammad Asif from the Balochistan High Court (BHC) were transferred to the IHC. The controversy centres around the alteration of the seniority list following the appointments.\n\nIn a letter dated February 21, a copy of which is available with Dawn.com, Advocate Hussain said: “On present controversies with regard to judicial appointments, I am unable to continue and, hereby, resign as being member of JCP.”\n\nHussain, a senior advocate of the SC, recalled that the Pakistan Bar Council (PBC) had “unanimously nominated” him as a JCP member thrice. “I continued to discharge my responsibilities to the best of my abilities,” he said.\n\nThe lawyer did not specify further details about the reservations, if any, he had about the recent flurry of changes in the apex court and the IHC that followed the judges’ appointments.\n\nPaying his regards to the JCP members, he assured them: “I will continue to make all efforts for [the] development and independence of judicial and democratic institutions.”\n\nA copy of the resignation letter was sent to the PBC as well, the letter said, to make a new nomination for the JCP role under the Constitution.\n\nAs per the Constitution, one of the members was to be a “senior advocate” of the apex court nominated by the PBC for a term of two years.\n\nUnder the 26th Amendment, that lawyer’s experience was specified as an “advocate having not less than 15 years of practice in the SC”, still to be nominated by the PBC.\n\nIn the latest development in the row over judicial appointments, five IHC judges petitioned the SC on February 20 to restrain Justice Dogar from carrying out his duties as the acting IHC chief justice.\n\nThe five judges — Justice Mohsin Akhtar Kayani, Justice Tariq Mehmood Jahangiri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Justice Saman Rafat Imtiaz — had opposed the transfer of judges to the IHC.\n\nAfter the transfers, they had approached Chief Justice of Pakistan (CJP) Yayha Afridi and IHC Chief Justice Aamer Farooq to reclaim their seniority. They also did not attend Justice Dogar’s oathtaking ceremony as the acting IHC chief justice.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/24133016fb43532.png",
  "retrievedAt": "2025-08-25T19:58:51.402Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894042/senior-lawyer-resigns-as-jcp-member-citing-controversies-over-judicial-appointments",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T09:12:49.000Z"
}
