{
  "title": "PM Shehbaz arrives in Baku to warm welcome - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif arrived in Baku on Sunday for a two-day official visit to the Republic of Azerbaijan.\n\nAzerbaijan’s First Deputy Prime Minister Yaqub Abdulla oglu Eyyubov, Deputy Minister of Foreign Affairs Yalchin Rafiyev, Azerbaijan’s Ambassador to Pakistan Khazar Farhadov, Pakistan’s Ambassador to Azerbaijan Qasim Mohiuddin and other senior dignitaries warmly received PM Shehbaz upon his arrival at Heydar Aliyev International Airport, said an official press release issued by the Prime Minister’s Office.\n\nSet to discuss energy, trade, climate change, defence issues with President Aliyev\n\nDuring the visit, the premier will hold high-level meetings with Azerbaijan’s President Ilham Aliyev and other senior officials.\n\nThe discussions will focus on strengthening bilateral relations, expanding trade and investment, enhancing cooperation in the energy sector, synergise efforts to deal with climate change, deepening defence collaboration, and fostering cultural exchanges.\n\nAs part of his engagements, PM Shehbaz and the Azerbaijani leadership will also address the Pakistan-Azerbaijan Business Forum on Monday (today).\n\nPakistan and Azerbaijan enjoy a long-standing bond of brotherhood, underpinned by shared values and common aspirations. The visit underscores the commitment of both nations to deepening bilateral ties, enhancing economic cooperation and fostering regional collaboration.\n\nThe prime minister is accompanied by Deputy Prime Minister and Foreign Minister Ishaq Dar, Minister for Commerce Jam Kamal Khan and other officials.\n\nEarlier, Prime Minister Shehbaz said he was looking forward to productive discussions with Azerbaijan’s leadership for further strengthening deep-rooted bilateral relations.\n\nIn a post on X, he said, “Landed in the beautiful city of Baku, where the past and future converge in a vibrant embrace. The city looks even more enchanting under a blanket of snow!\n\n“Looking forward to productive discussions for further strengthening the deep-rooted bonds between Pakistan and Azerbaijan. We also seek to enhance our trade and investment ties.”\n\nPublished in Dawn, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/24101032400f92b.png",
  "retrievedAt": "2025-08-25T19:58:54.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893893",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T01:13:41.000Z"
}
