{
  "title": "Despite abolition, charged parking still plagues Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: While the Sindh government has abolished parking fee for motorcycles and cars across Karachi, citizens are still being charged between Rs50 and Rs100 in the name of ‘charged parking’ on several thoroughfares and localities in the metropolis, Dawn has learnt.\n\nSenior Sindh Minister Sharjeel Inam Memon announced on Feb 17 that the Sindh cabinet had decided to abolish the fee at all parking places within its jurisdiction whether they were under the management of the Karachi Metropolitan Corporation (KMC) or any other civic body, adding that if any charged parking space was found, it would be considered illegal.\n\nHowever, the fee is still being charged on Garden Road in front of the Star City Mobile Mall by the Karachi Cantonment Board (KCB), Dawn observed.\n\nThis reporter approached one of the people there, who identified himself as a KCB worker and was charging each motorcyclist Rs50 for parking their motorcycle, and asked him as to why the fee was being taken despite the fact that the provincial government had abolished it. He said that he worked under the cantonment board, not the Sindh government and, therefore, the “rule does not apply on them”.\n\nSpokesperson for Sindh govt warns of strict action if illegal parking spaces persist\n\nWhen a traffic police officer standing there was asked to comment on this, he said that one side of the road falls under the KCB while the other side is under the jurisdiction of the Preedy police section.\n\nHe said no such fee was being charged on the other side of the road, that is Saddar Mobile Market. He was right. Nobody was charging parking fee on that side, but there was another problem: a large open van was there on the prowl and its staff was lifting motorcycles parked there one by one.\n\nA man, who was sitting on his parked motorcycle, explained the situation to this reporter: “Although there is no parking fee here, the issue is that you have to keep guard of your vehicle because, otherwise, they [the lifters] will take it away.\n\n“In that situation, just by saving Rs50, one ends up paying around Rs300 to get his vehicle back if it gets lifted.”\n\nSimilarly, the parking fee is also being charged at UP Mobile Market in North Karachi. One of the people there charging the fee said they were “employees of the Town Municipal Committee” in the locality.\n\nWhen told that charged parking had been abolished, he said: “We will still charge it. If you want to film us, do so, or whatever you like.”\n\nCitizens are also paying parking fee at Saima Pari Mall near Hyderi Market in North Nazima­bad. One of the people collecting the fee said they were working for a private contractor. “We are charging the amount because we are protecting people’s vehicles, which is right,” he said.\n\n‘Charging parking fees will not be tolerated’\n\nWhen Dawn approached Sindh government spokesperson Tehseen Abidi in this regard, she said: “The Sindh government has officially abolished the charged parking across the province to provide relief to the public. However, reports of continued parking fees at various locations were a matter of concern.”\n\n“Charging parking fee despite the government’s clear decision is an unfair burden on citizens and will not be tolerated. We call upon the institutions concerned, including the Cantonment Board and local administrations, to immediately stop these collections. If such violations persist, the government will take appropriate legal action,” she warned.\n\nTalking to Dawn, North Nazimabad Town chairman Atif Ali Khan said such illegal activities were stopped but the parking mafia won’t listen and had support of police also.\n\n“It’s not authorised. We removed them several times but they start again after some days. They have blessing of some mafias and police also,” he alleged.\n\nMeanwhile, the Saddar Town chairman was reported to have told the media that the government had abolished charged parking without taking towns into confidence.\n\nHe said that traffic issues would worsen in the city if charged parking is abolished.\n\nPublished in Dawn, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67bbc692bc99a.gif",
  "retrievedAt": "2025-10-12T01:37:26.880Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893933/despite-abolition-charged-parking-still-plagues-karachi",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T01:12:01.000Z"
}
