{
  "title": "Faisalabad police foil mob’s bid to ‘lynch’ murder suspect - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: A mob attempted to lynch a security guard of a pizza shop after he allegedly shot a young man dead over a minor quarrel in Rashid Chowk in Samanabad locality at Faisalabad on Sunday.\n\nPolice’s timely action saved the life of the guard from the angry mob that was demanding that the suspect should be handed over to them.\n\nThe police are not revealing the name of the arrested security guard.\n\nAs per police sources and locals, the guard was on duty at the pizza shop when he exchanged words with a youth, later identified as Safdar Ali, over a trifle.\n\nDuring the quarrel, the suspect got enraged and shot the youth, who died on the spot.\n\nFollowing the incident a mob gathered there and some of the locals tried to overpower the guard, who pointed his gun at them and took position inside the pizza shop.\n\nOn being informed of the incident, a police team led by Samnabad station house officer (SHO) arrived at the scene.\n\nThe SHO started negotiating with the armed guard, while a plainclothesman suddenly over powered the suspect and disarmed him.\n\nHowever, when the police tried to shift the suspect to police station, the enraged mob demanded custody of the guard with an intent to lynch him.\n\nHowever, the SHO calmed down the mob and assured them that the suspect would be punished under the law.\n\nAfter some time, the mob got convinced and let the police shift the suspect to the police station.\n\nPublished in Dawn, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:37:26.291Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893988/faisalabad-police-foil-mobs-bid-to-lynch-murder-suspect",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T02:14:58.000Z"
}
