{
  "title": "Country’s trade with Bangladesh surpasses $1bn: report - Pakistan - DAWN.COM",
  "author": null,
  "content": "Bangladesh High Commissioner to Pakistan Mohammad Iqbal Hussain Khan has revealed that the bilateral trade between the two countries has surpassed $1 billion, a recent news report said.\n\nThe envoy, while speaking to The News, said that the trade between the two sides was bound to increase, as the countries remained keen on enhancing cooperation.\n\nThe two countries have witnessed a thaw in ties after the ouster of India-aligned premier Sheikh Hasina.\n\nIn the years since the split, Dhaka’s leaders — especially the recently ousted regime of Sheikh Hasina — stayed firmly in the Indian camp, preferring to maintain close ties with New Delhi and keeping Islamabad at arm’s length.\n\nHowever, ever since a popular uprising that saw Hasina’s government toppled in August, there has been a thaw in ties between the two capitals, with trade and bilateral relations seeing a marked improvement.\n\nHasina was replaced by Nobel laureate Yunus, who has expressed interest in maintaining cordial ties with Pakistan. During his interaction with the PM Shehbaz, the Bangladeshi leader had highlighted the need to “settle” matters and “move forward”.\n\nIn January, the envoy had also announced that direct flights between the two countries were expected to begin within the next few months, highlighting Bangladesh’s commitment to strengthening business partnerships with Pakistan, emphasising the ease of obtaining Bangladeshi visas online for Pakistani citizens.\n\nThe report also cited Khan as saying that there was a “great demand” for Pakistani products in Bangladesh, while Pakistan, too, benefits from Bangladeshi products.\n\nHe termed the restoration of trade after 15 years between the two countries as “satisfying”, highlighting the demand for Pakistani cotton, sugar, rice, apparel, and fruits — such as mangoes — in Bangladesh.\n\nHe added that Bangladesh could export pineapple, jute, pharmaceuticals, and garments to Pakistan.\n\nThe high commissioner also said that the “sky is the limit for increasing cooperation and trade between the two countries.”\n\nThe report also said that Pakistan “exported the first consignment of rice to Bangladesh amounting to 26,000 metric tons through its national carrier, the first such export in about two decades”.\n\nThe new agreement, finalised earlier this month, sees Bangladesh purchasing white rice from Pakistan at $499 per tonne through the Trading Corporation of Pakistan. The shipment will be delivered in two phases, with the remaining 25,000 tonnes expected in early March.\n\nHowever, the price of rice is higher than that of rice from Vietnam, which Bangladesh has been importing at $474.25 per tonne.\n\nBangladesh has been battling to stabilise the rice market, as prices have risen by 15-20 per cent in recent months, with medium-quality rice selling at around 80 taka ($0.66) per kilo.\n\nTo control rice prices, Bangladesh is importing more rice from international markets, including through tenders, and has scrapped import duties.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:58:49.378Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894028/countrys-trade-with-bangladesh-surpasses-1bn-report",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T07:35:38.000Z"
}
