{
  "title": "COMMENT: Pakistan need a miracle after India loss exposes team’s white-ball shortcomings - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN’S winless return after two mat­ches in their own tournament is an absolute humiliation for the Pakistan Cricket Board (PCB).\n\nI say the PCB because it is they who have overseen the humbling decline of Pakistan’s white-ball cricket.\n\nThe players don’t pick themselves or decide strategy alone; it is the PCB that selects the coaching staff and the players, and therefore, controls how the team will represent the country. What we see on the pitch is a team that is substandard, a methodology that is out of date. What we see now is no different from what we have been seeing for several years.\n\nThe contest itself was a strange one. Pakistan played most of it like a warm-up game, barely rousing themselves to the level required for such a decisive and highly visible contest. Mohammad Rizwan’s team batted without urgency, bowled without penetration, and fielded below current international standards.\n\nRizwan’s men batted without urgency, bowled without penetration and fielded below international standards against their arch-rivals\n\nThe pitch and the conditions played little part in deciding the contest as both teams struggled to find movement from swing, seam, or spin.\n\nIndia, however, bowled with greater discipline and batted with superior expertise. They looked up for the big day; Pakistan let the occasion pass them by. That was that.\n\nPakistan needs a thorough rethink of its whole approach to white-ball cricket. It needs selectors and a coach capable of engineering a revolution of mindset, and a significant upgrade in capabilities. It needs a deep pool of power-hitting batsmen, high-quality specialist spinners, a rewiring of the bowling disciplines of its pace attack, and a fielding side that meets expected standards.\n\nThis is all obvious, but unfortunately nothing seems obvious to a PCB befuddled by politics, money and the limelight.\n\nRizwan won the toss, made a reasonable decision to bat first, and gave Pakistan a chance to dictate the game. India’s bowlers neither swung the ball much nor turned it worryingly, but what they did well — after a wild first over from Mohammad Shami — was to stick to ancient principles of line and length bowling. They read the pitch and bowled accordingly.\n\nPakistan stuttered their way to 241. If the plan was to keep wickets in hand for a late charge, they lost wickets too frequently and they never got close to executing the pushback. Instead, it looked like an innings without particular purpose, featuring some misjudgement and infrequent boundaries. At the halfway mark, on a slow but untaxing track, Pakistan’s total was just competitive.\n\nAfter the openers had come and gone, with Babar Azam again promising but not delivering in a big game, Saud Shakeel and Rizwan patiently rebuilt the innings and placed Pakistan in a strong position. Rizwan rightly decided to accelerate, and went all out.\n\nThis made sense insofar as Saud’s job was to anchor the innings, but when Rizwan was bowled, he made the baffling decision to start attacking himself. That isn’t his natural game and didn’t suit the match situation. Pakistan needed their top scorer to keep going, but he was quickly out and Pakistan’s good start was wasted.\n\nThat phase of play was the decisive one of the match. A total that might have soared comfortably over 250 ended up being below par. Pakistan’s wh­ole batting strategy rema­ins flawed, from the personnel and batting order to how they approach an innings.\n\nShortcomings\n\nSaud is only a contender if he rigidly plays the anc­hor role. Rizwan no longer looks like a top order batsman. Tayyab Tahir seems out of his depth. The tail is too long. Is this the best that Pakistan has to offer?\n\nIn reply, India set off like a train, using the extra pace of Pakistan’s bowlers. And here, at least, there was some encouragement for Pakistan. The three fast men are now that again: a trio with genuine pace. Ha­r­is Rauf is better controlled. Naseem Shah is bow­ling a tighter line. Shaheen Shah Afridi looks fitter and has certainly recovered his speed.\n\nIt was that extra yard of speed that helped him to deliver a perfect yorker to Rohit Sharma, just as India’s captain was stroking Pakistan out of the game. It’s a delivery that Shaheen tried again and again but generally failed to land — and was punished for it by Shubman Gill. Shaheen, then, isn’t yet back to his match-winning best.\n\nUp to that point, India had ridden their luck, streaky boundaries interspersed among the exquisite ones. In walked Virat Kohli, peaking as he often does against Pakistan, and taking control of the momentum of India’s run chase. Pakistan’s job was now to pull back the run rate and build some pressure on their opponents, and the one positive here was Abrar Ahmed’s encou­r­aging spell that helped hold off India for a while.\n\nBut Kohli was not to be denied. The batsman who­se early fall was so decisive in Pakistan becoming the Champions Trophy winners at The Oval, settled that score with infinite calm, exquisite technique, and absolute mastery.\n\nWhen Pakistan won that trophy, it was another strong indicator that Pakistan cricket was heading back to better times. But the decline since then has made Pakistan an ‘also-ran’ in international cricket, a country that makes up the numbers, a country that is dismissed from its own tournament without a hint of defiance.\n\nPCB, j’accuse. Stop fiddl­ing while your country’s cri­c­ket burns. In other wo­­rds: start doing your job.\n\nPublished in Dawn, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/240934144388db1.jpg",
  "retrievedAt": "2025-08-25T19:58:59.628Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893899",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T01:13:35.000Z"
}
