{
  "title": "PTA initiates licencing VPN service providers under class category - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Pakistan Telecommunication Authority (PTA) on Monday initiated the licencing of Virtual Private Network (VPN) service providers under the class licence category for the provision of data services in the country.\n\nA class license allows multiple users to operate under a general set of conditions without needing individual approval. As of December 2024, PTA resumed granting Class Licenses for Data Services, specifically for VPN service providers. Entities offering VPN and related services are required to obtain this license to operate legally within Pakistan.\n\n“As part of this process, PTA has approved the applications of two companies for the grant of Class Licences to provide VPN services,” said a press release issued by the telecom authority today.\n\n“This initiative enables businesses to utilise VPNs for lawful purposes, ensuring data security, privacy, and regulatory compliance while promoting transparency.\n\n“PTA remains committed to supporting organisations in meeting their connectivity needs responsibly,” it said.\n\nIn December last year, the PTA devised a new strategy to ‘register’ VPNs after its previous efforts to ensure compliance failed to yield the desired results.\n\nThe telecom regulator initially decided to ban VPNs over the lack of legal grounds but later withdrew the decision.\n\nVPNs are widely used around the world to access content that may be inaccessible or blocked for internet users in their home country. In the case of Pakistanis, VPNs are used to access X, among other restricted websites.\n\nIn August, the Pakistan Telecommunication Authority (PTA) was clamping down on VPN usage, aiming to prevent access to the already banned social media platform X.\n\nInformation Minister Attaullah Tarar said in September that X had been banned due to national security issues, not to curb freedom of expression. He added that “separatists and terrorists” were using the platform against Pakistan, which could not be allowed.\n\nIn the same month, the PTA dispelled rumours and clarified that VPNs in the country were not being blocked.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:58:49.384Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894041/pta-initiates-licencing-vpn-service-providers-under-class-category",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T08:40:56.000Z"
}
