{
  "title": "Cholistan residents approach LHC over dispossession fears - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: Over 100 residents of a remote settlement in Chol­istan have approached the Lahore High Court (LHC), claiming they are being forced to hand over their land to make way for an official project.\n\nAccording to the petitioner’s counsel, Muhammad Kamran, Justice Asim Hafeez of the LHC Bahawalpur bench has admitted the petition for hearing and sought replies from the relevant parties by tomorrow (Tuesday).\n\nAround 124 residents of Basti Kheer Sir, Chak No.176/DB maintain that they are bona fide Cholistanis, and their ancestors had been in possession of this land for several decades, who had worked to transform it from barren sand dunes into cultivable land.\n\nIn 2024, then-LHC Justice Shahid Jamil Khan had disposed of a plea filed by the same parties after they were granted the first right of refusal in the allotment of the land, which had been placed in ‘category A’ for the purposes of auction.\n\nThe Cholistan Development Authority (CDA) was supposed to auction the land, which the petitioners wanted to purchase. But instead, the petitioners alleged, the Punjab Board of Revenue had reserved 30,000 acres of land in Cholistan — which includes Chak No.176/DB.\n\nThe petitioners asked that the Board of Revenue be restrained from transferring the land for any purpose.\n\nThe petitioner and other inhabitants of the locality are poor people who have no other place of residence and no other source of income except the lands in question, the petition said.\n\nAccording to a court order, seen by Dawn, Justice Asim Hafeez has sought reports from the law officer, while officials of the provincial Board of Revenue have also been asked to appear before the court at the next hearing.\n\nBar elections\n\nMeanwhile, Nadeem Iqbal Chaudhry and Malik Imran Aziz were elected president and general secretary, respectively, of the Bahawalpur High Court Bar Association.\n\nAccording to a late-night announcement by the bar’s election board, Mr Chaudhry secured 1,751 votes against his rival Samina Sohail Qureshi’s 1,451 votes.\n\nMeanwhile, Mr Aziz secured 2,519 votes against his rival Chaudhry Afzal, who managed 675 votes. Saba Ajmal was elected joint secretary, while other office-bearers have already been declared elected unopposed.\n\nPublished in Dawn, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:59:31.346Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893891/cholistan-residents-approach-lhc-over-dispossession-fears",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T01:13:41.000Z"
}
