{
  "title": "People’s assessors in Chinese judicial system - World - DAWN.COM",
  "author": null,
  "content": "China has had more than 341,000 people’s assessors by the end of 2024, a number that tripled the total number of judges, data released by the country’s top court showed.\n\nPeople’s assessors, a part of China’s justice system since the 1930s, are members of the public who assist judges and evaluate evidence in trials. To regulate the selection, duties and behaviors of assessors, China adopted the Assessors Law that was enacted in April 2018.\n\n“This is also the first specialised legislation in our nation’s history regarding the people’s assessor system, which holds significant importance in ensuring people’s democratic rights to participate in the governance of State affairs and in advancing the whole-process people’s democracy in the judicial field,” said Li Chenglin, an official from the Supreme People’s Court.\n\nUnder the law, people’s assessors can attend hearings in civil, criminal and administrative cases involving public interests, attract widespread public attention or have crucial social impact. “It is conducive to effectively guarantee people’s rights to know, attend and supervise judicial activities,” Li added.\n\nTo increase public involvement, the law permits assessors to be part of seven-person benches and participate in a wider range of cases, namely public-interest lawsuits, which usually focus on pollution, home demolitions, food or drug safety and criminal trials in which defendants face at least 10 years in prison or the death penalty.\n\nLi revealed that since the implementation of the law, people’s assessors have participated in over 14.06 million disputes, among which they have been involved in the adjudication of more than 35,000 cases.\n\nFor example, a high-profile case involving Yu Huaying was heard by a seven-person bench comprising three judges and four assessors. Yu has been sentenced to death for abducting and trafficking 17 children between 1993 and 2003.\n\nAccording to the law, four assessors serving on seven-person benches will have more weight when questioning lawyers and defendants and examining physical evidence but will have no say on final rulings or sentencing.\n\nSong Qiaoli, a people’s assessor at the Beijing Intellectual Property Court, said that her major job is to fully utilise her knowledge in physics and semiconductor equipment sectors to assist judges in hearing technical cases.\n\n“Before a trial, I will go to the court in advance to review the case files and discuss the basic facts and key points of the dispute with judges, especially focusing on communicating about the technical solutions involved,” she said.\n\n“Sometimes, I also research similar cases, laws and regulations, as well as industrial standards to help the bench better understand the technical issues,” she said.\n\nShe added that she can question litigants during trials with the chief judge’s consent and express her opinions and share her technical experience during deliberation.\n\nIn 2019, the top court streamlined people’s assessors’ workflows in accordance with the law, urging courts to offer more information and training so that they could better perform their duties.—\n\nPublished in Dawn, February 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67bbcdd473e7c.gif",
  "retrievedAt": "2025-08-25T19:59:18.069Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893963/peoples-assessors-in-chinese-judicial-system",
  "dateList": "2025-02-24",
  "date_published": "2025-02-24T01:43:46.000Z"
}
