{
  "title": "Pakistan Olympic Association announces dates and venues for National Games and Youth Games - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Olympic Association (POA) has announced on Thursday that the 35th National Games and the inaugural National Youth Games will be held in Karachi and Lahore, respectively, later this year.\n\nThe National Games are scheduled to take place from May 6 to 16, while the National Youth Games will be held from Sept 7 to 13. The decision was made during the POA Executive Committee meeting on Thursday, chaired by POA president Arif Saeed.\n\n“The committee approved the first-ever National Youth Games in Lahore,” POA said in a press release. “The event, aimed at athletes aged 14-17, will provide a crucial platform for young talent, with a view to grooming athletes for the Asian Youth Games and the Youth Olympic Games.”\n\nA total of 26 sports for men and 23 for women will be included in the National Games. The POA Sports Commission has also been tasked with evaluating the potential inclusion of six additional sports, following principles approved by the committee.\n\nIn a significant move to support youth sports development, president Arif will present a concept note to the Government of Pakistan, highlighting the need for increased support in nurturing emerging athletes.\n\nThe POA plans to introduce a registration framework through regional and provincial Olympic Associations, alongside scholarships and specialised training programmes.\n\nFurthermore, the POA announced that Mr. Rana Mashhood Ahmad Khan, Chairman of the Prime Minister’s Youth Programme, has been appointed as the Chef de Mission for the 2025 Asian Youth Games in Bahrain.\n\nWhile the announcement of these events marks a step forward in sports development, tensions between the POA, the government and national sports federations have long hindered progress.\n\nSince the introduction of the national sports policy in 2005, the government and federations have struggled to align their priorities, affecting the overall standard of sports in Pakistan.\n\nThe meeting also saw the approval of the Games Schedule and Programme for the 14th South Asian Games, which will be held in Pakistan in January 2026. Representatives of the South Asian National Olympic Committees met in Lahore earlier this week to finalise the details.\n\n“During the meeting, Karachi has been chosen as the host city for the King’s Baton Relay in connection with the Glasgow Commonwealth Games 2026,’ the press release concluded.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:04:39.117Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894853/pakistan-olympic-association-announces-dates-and-venues-for-national-games-and-youth-games",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T03:21:36.000Z"
}
