{
  "title": "Police arrest seven guards accused of torturing citizen in Karachi’s Boat Basin area - Pakistan - DAWN.COM",
  "author": null,
  "content": "Police on Friday claimed to have arrested seven suspects involved in allegedly torturing a citizen in Karachi’s Boat Basin area and recovered weapons from them.\n\nAccording to the Deputy Inspector General (DIG) South Syed Asad Raza, Karachi’s South Zone police “raided two different places late last night and arrested seven guards”, adding that “modern weapons have been recovered from the possession of the arrested guards”.\n\nHe said that the recovered weapons were being examined to see whether they had licences.\n\nAccording to the official, the arrested guards worked for the suspect Shah Zain Marri, who — along with his guards — had tortured a citizen before fleeing to Balochistan.\n\nFurthermore, the police had already contacted the Balochistan government to arrest Marri, while operations were also underway to arrest other people involved in the incident.\n\nEarlier, a video had gone viral, which showed armed men in a four-wheeler vehicle at Boat Basin. As seen in the video, the vehicle bumped against an alto, right after which several armed men got out of the vehicle and began torturing the passengers in the alto.\n\nAccording to the police, the incident took place on February 18 at 3am, prompting the police to register a case against the guards.\n\nWith the help of CCTV footage of the scene, the police were able to identify the suspects and conduct raids to arrest them — with DIG South issuing instructions to the senior superintendent of police Investigation and superintendent of police Clifton “to utilise all resources to solve this case on priority basis”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:04:35.260Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894886/police-arrest-seven-guards-accused-of-torturing-citizen-in-karachis-boat-basin-area",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T09:14:41.000Z"
}
