{
  "title": "Stranded passengers provided food, shelter as KKH develops crack in Dasu - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: Heavy snowfall and downpour continued to lash upper parts of Hazara division for the third consecutive day on Thursday.\n\nThe snowfall and downpour, which broke the prolonged dry spell, caused severe cold in the region.\n\nSnowfall, which had begun earlier this week continued intermittently throughout Thursday in Kaghan, Siren and Konsh valleys and hilly areas of Mansehra as well as Kandia and Spat valleys in Kohistan.\n\nThe plain areas in the division including Mansehra, Torghar, Upper Kohistan, Lower Kohistan and Kolai-Palas continued to receive heavy rainfall for the second day.\n\nMeanwhile, the Upper Kohistan administration provided lodging and food to more than 400 passengers stranded at the district headquarters after a dangerous crack developed on Karakoram Highway (KKH) in the Zero Point area on Wednesday night.\n\nSnowfall, rain continue in hilly areas on third consecutive day; woman and her two children injured in Haripur, a portion of bridge collapses in Shangla\n\n“I want to clarify that KKH in our district is open to all kinds of traffic. However, we have restricted heavy traffic and passenger coaches beyond Dasu after a crack appeared on this strategic artery near Zero Point last night,” Upper Kohistan Deputy Commissioner Tariq Ali Khan told journalists on Thursday.\n\nHe said he chaired a meeting earlier in the day to discuss the situation caused by the heaviest downpour of the season over the past couple of days.\n\n“KKH at Zero Point, Dasu, developed a crack, which we have now repaired and reopened to traffic in the early hours. Around 400 passengers, including approximately 200 women and children, were provided with lodging and dinner,” said Mr Khan.\n\nHe said that the passengers were accommodated in local government schools where they were provided with around 450 blankets and other necessities.\n\n“Volunteers also distributed food and essential supplies among the stranded passengers at Zero Point, Dasu. Everything we did was out of sympathy and concern for the affected travellers,” Mr Khan said.\n\nHe said that traffic was moving smoothly along KKH and no point in the district remained blocked.\n\nIn Shangla, a portion of a bridge on the main Bisham-Swat road collapsed on Wednesday night due to heavy snowfall while rain continued to lash the district for the fourth day on Thursday.\n\nAccording to the Alpuri assistant commissioner, Mohammad Hamid Saddiqui, a portion of the bridge collapsed during heavy snowfall and a vegetable-loaded vehicle fell from it.\n\nHe said that National Highway Authority placed protective fence around the collapsed portion.\n\nThe district administration has also issued an advisory to passengers to adopt precautionary measures while travelling in snowbound areas and avoid unnecessary travel.\n\nIn Swat, temperature dropped significantly due to heavy snowfall in the mountainous areas and continuous rain in the plains. This cold spell, which began on Tuesday morning, continued into Thursday and is expected to last until Friday, according to the Meteorological Department.\n\nSnowfall in areas like Kalam, Utror, Gabral, Matiltan, Mankiyal, Malam Jabba and Gabin Jabba has been attracting a large number of tourists. Snow has blanketed hilltops and visitors from Islamabad, Rawalpindi, Lahore, and Peshawar have been flocking to the region for some winter fun.\n\nThe administration has deployed heavy machinery to clear the roads leading to popular spots like Malam Jabba and Kalam. Special police teams have also been stationed to ensure smooth and safe transportation of tourists.\n\nIn Abbottabad, heavy snowfall and rain continued on Thursday.\n\nOne-foot snow has been recorded in Thandiyani and at least nine inch snow in Galiyat including Donga Gali, Changla Gali, Ayubia, and Bara Gali.\n\nMachinery of GDA was clearing snow from the main Abbottabad-Muree road and other link roads.\n\nIn Haripur, a woman and her two minor children were injured when a heavy stone loosened by rains fell on their house in the remote hilly area of Neelan Bhoto.\n\nPolice said that the family of Adil Abbasi, a local businessman, was sleeping in their house located on a hillock overlooking the village when during the early hours of Thursday a heavy stone slid on the corrugated steel sheeted roof leaving the Adil’s wife Muneeza Bibi and her two minor children injured.\n\nThe injured were rushed to Holy Family Hospital Rawalpindi where they were admitted for treatment.\n\nMeanwhile, the rain that started on Tuesday continued for the third consecutive day on Thursday.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67c100b97319b.gif",
  "retrievedAt": "2025-10-12T01:41:26.333Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894751/stranded-passengers-provided-food-shelter-as-kkh-develops-crack-in-dasu",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T01:38:52.000Z"
}
