{
  "title": "Trump softens tone but Starmer leaves without Ukraine security pledges - World - DAWN.COM",
  "author": null,
  "content": "Donald Trump took a softer tone on Ukraine truce talks on Thursday as he hosted British Prime Minister Keir Starmer — but refused to give any firm commitments on the US security guarantees Europe desperately wants.\n\nIn an upbeat meeting, the US president handed Starmer a win on a possible trade deal, while the British leader pandered to Trump’s love of the royal family with a invitation for a state visit from King Charles III.\n\nTrump, who has alarmed European capitals with his sudden pivot towards Russia, said there had been “a lot of progress” towards a deal to end the conflict in Ukraine and that negotiations were at a crucial stage.\n\n“It’ll either be fairly soon or it won’t be at all,” Trump told a press conference with Starmer.\n\nThe mercurial US president played down an earlier rift with Ukrainian President Volodymyr Zelensky, which had compounded fears that Trump would cut out Ukraine from negotiations with Russian President Vladimir Putin.\n\n“I have a lot of respect for him,” Trump said of Zelensky.\n\nEarlier in the Oval Office he also walked back a jibe that the Ukrainian was a dictator, saying: “Did I say that? I can’t believe I said that.”\n\nBut on the US security “backstop” that Britain and France want in exchange for deploying peacekeepers to Ukraine in the event of a deal with Russia to end the war, Trump remained non-committal.\n\nThe US president said he was “open to many things” in terms of security guarantees but that he wanted to get a Russia-Ukraine deal in place first.\n\nTrump added that he thought Putin would “keep his word” – rejecting Starmer’s warnings that a ceasefire without a US backstop would let Russia invade Ukraine again.\n\nIt made Starmer the second leader in the space of a week to leave Washington empty-handed on Ukraine, after French President Emmanuel Macron also tried to persuade Trump on Monday.\n\n“We have to win the peace,” Starmer said at the joint news conference. “It can’t be peace that rewards the aggressor.”\n\nBut the British premier tried to show that he was willing to step up in Ukraine, as Trump repeatedly urges European nations to contribute more to their continent’s defense.\n\n“I’m clear that the UK is ready to put boots on the ground and planes in the air to support a deal,” Starmer said.\n\nIn an interview later with right-wing outlet Fox News, Starmer praised Trump for spearheading moves toward a truce but said: “We need to defend it.”\n\n“The deal must be a lasting deal,” he said.\n\nBritish officials had earlier called for US support including aerial and satellite intelligence, and air power if necessary.\n\nStarmer will otherwise be heading home happy from a meeting with Trump, who praised him as a “tough negotiator”.\n\nTrump held out the prospect of a “great” post-Brexit trade deal that could help Britain avoid the tariffs he has threatened against other countries at the start of his second term.\n\n“He tried. He was working hard, I’ll tell you that,” Trump said with a chuckle when asked if the British premier had persuaded him not to impose the levies.\n\nIn a carefully choreographed moment in the Oval Office, Starmer also handed Trump a letter from the king inviting him for an unprecedented second state visit by a US president.\n\n“This has never happened before,” said Starmer. “This is truly historic.”\n\nThe US president said he was “honored” and would attend with First Lady Melania Trump.\n\nBut on Ukraine, the world will now be carefully watching Trump’s meeting with Zelensky at the White House on Friday.\n\nThe two leaders will sign a huge deal giving Washington exclusive access to Ukraine’s rare minerals, which Trump has demanded as payback for US military aid to Kyiv.\n\n“We’ll be dig, dig, digging,” Trump told reporters.\n\nZelensky had hoped the deal would contain US security guarantees but it appears to omit them.\n\nTalks between US and Russian officials — launched after a shock phone call between Trump and Putin just over two weeks ago — are continuing with Ukraine frozen out.\n\nPutin said Thursday the initial talks “give some hope” of resolving “problems” like the Ukraine conflict.\n\nBut the Kremlin said giving back Ukrainian regions it claims to have annexed during its invasion — which Trump said was possible as part of a future peace deal — was “nonnegotiable.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/28135329bb5cfde.jpg",
  "retrievedAt": "2025-08-25T20:04:36.272Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894870/trump-softens-tone-but-starmer-leaves-without-ukraine-security-pledges",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T09:02:17.000Z"
}
