{
  "title": "GB cabinet approves establishment of IT Board - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: The Gilgit-Baltistan cabinet on Thursday approved the establishment of the Information Technology Board and new standard operating procedures (SOPs) for the issuance of border passes to local residents travelling to the Xinjiang region of China.\n\nA meeting of the cabinet, presided over by Chief Minister Haji Gulbar Khan, also decided to abolish local holidays for employees of the health and education departments to enhance service delivery.\n\nThe cabinet approved the selection of four members from both the public and private sectors for the IT Board. The initiative aims to promote digital transformation and technological advancement in the region.\n\nThe cabinet approved the SOPs for issuing border passes to the GB residents travelling to Xinjiang via the Khunjerab Pass. Previously, the border pass was valid from April to the end of November, in line with the operation of the pass.\n\nHowever, with the opening of the Khunjerab Pass for year-round trade and travel between the two countries, new SOPs have been introduced. Under the updated SOPs, the border pass will be valid for six months, and applicants will need to submit a bank transaction of Rs5 million to obtain the pass.\n\nThe new SOPs sparked protests from small traders and civil society members in GB, who view the requirement as an “anti-poor policy”, as many local residents cannot afford such a large sum.\n\nThe cabinet also approved the GB Water User Association Act 2024, which aims to establish a modern and comprehensive framework for efficient water usage and management in the region. It approved the recruitment of security staff for the new campus of Cadet College Goharabad and amendments to the GB Finance Act 2024, which includes revisions to the fees for driving licences and character certificates.\n\nThe cabinet approved the introduction of an anesthesia allowance for relevant medical specialists and the establishment of a family park in Skardu.\n\nAn agreement between the British Council and the Higher, Technical and Special Education Department for the establishment of three centres of excellence was also approved by the cabinet.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:41:45.958Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894820/gb-cabinet-approves-establishment-of-it-board",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T02:33:46.000Z"
}
