{
  "title": "Azma Bokhari defends Punjab govt’s 60-page supplement, calls criticism ‘PTI propaganda’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Punjab Information Minister Azma Bokhari on Friday defended the eyebrow-raising 60-page supplement published by the Punjab government, calling the PTI’s criticism against it “propaganda”.\n\nA newspaper supplement published on February 26, 2025, highlighting the Punjab government’s performance in its first year under Chief Minister Maryam Nawaz, generated debate and questions on social media.\n\nFormer PPP senator Farhatullah Babar was among those criticising the move on X, calling the supplement a “monstrosity at the public expense. He also called out the Punjab government for publishing 170 photographs of Maryam in the first 30 pages, terming it a “monstrous disservice to her and her government.”\n\nDuring a press conference today, Bokhari defended the move, saying that, “It’s very important to counter the fake propaganda (around the supplement).\n\n“The performance of the Punjab government, over the last year, has been exemplary,” she stated, adding that it was not possible to go “door-to-door” to make people aware of the government’s health and Kisaan cards, therefore, the government published the supplement to spread awareness.\n\nIn an apparent reference to the PTI, she said, “One political party and its workers were agitated” by the performance of the Punjab government.\n\nShe said that the supplement was not about highlighting Maryam but that it detailed the projects undertaken by the government under her leadership.\n\n“And I will tell you about her projects in a bit,” she said, all the while criticising the advertisement supplement published by former Punjab chief minister and PTI leader Usman Buzdar during Imran Khan’s tenure.\n\nShe pointed out that Buzdar’s supplement was “an empty page” because “the party did not have any projects to be proud of”.\n\n“And during his government’s first 100 days, he published an empty page because they were busy in other things,” she said, adding that the party was busy “taking money from officers for transfers and posting” and in “sugar and wheat scandals”.\n\nHer remarks referred to a 2023 case registered by the Federal Investigation Agency (FIA) against Bushra Bibi’s friend Farhat Shahzadi alias Farah Khan, who allegedly received millions of rupees from some bureaucrats for transfers and postings during Buzdar’s tenure.\n\nShe highlighted that journalists — allegedly a part of the propaganda — had been receiving “instructions” to speak out against the supplement.\n\n“From yesterday, they [PTI] have started this campaign ’projects of Tehreek-i-Insaaf, plaque of Maryam Nawaz, ’” she said. “I have dissected the supplement published by PTI during its tenure — they owned all the projects mentioned therein, but none of the projects had any truth to it, nor was there any follow-up.”\n\nShe stressed that the municipal system and the government hospital’s dialysis programme were already present before PTI’s era.\n\n“This dialysis programme was also not initiated by Buzdar’s [government] — it was started during Shehbaz Sharif’s time, because of which 1,100 people in two weeks got their dialysis done,” she added.\n\nShe also said “slogans of air ambulance” had been chanted before during various governments, but Maryam Nawaz “actually implemented it”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/28121934001af6e.jpg",
  "retrievedAt": "2025-08-25T20:04:36.269Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894880/azma-bokhari-defends-punjab-govts-60-page-supplement-calls-criticism-pti-propaganda",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T08:51:47.000Z"
}
