{
  "title": "Israeli military admits ‘total failure’ on Oct 7 - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: The Israeli military drastically underestimated the capabilities of Hamas before the raids on Oct 7, 2023, and “totally failed in its mission to protect Israeli civilians”, a summary of a military investigation published on Thursday said.\n\nThe perception that Hamas was not interested in a full-scale conflict and that Israel would have ample warning if that changed went unchallenged for years, the summary said, resulting in a lack of preparedness and ability to respond to an attack.\n\n“The belief was that Hamas could be influenced through pressures that would reduce its motivation for war, primarily by improving living conditions in the Gaza Strip,” the report said.\n\nThe investigation looked at Israeli military strategy, battle behaviour and intelligence before, during and after Oct 7, 2023, when Hamas fighters stormed southern Israel and took more than 250 prisoners.\n\nMore than 48,000 Palestinians have been killed in Israel’s assault on Gaza since then and much of the enclave has been laid waste. Most of the territory’s 2.3 million people have been displaced multiple times.\n\nThe military investigation was conducted as calls grow from within the Israeli opposition and civil society for a national inquiry into the government’s failures on the deadliest single day in modern Israeli history.\n\nPrime Minister Benjamin Netanyahu has said a national inquiry would only be appropriate after the “conclusion of the war”. The first phase of a ceasefire that began on Jan 19 is due to expire in two days time.\n\nThe military investigation found Israel had focused its intelligence and military efforts on other fronts, such as Hezbollah in Lebanon, and relied too heavily “on intelligence, barriers, and defensive measures alone”, and was thus caught by surprise.\n\nMilitary commanders did not perceive an urgent threat leading up to Oct 7 raids and did not reinforce the troops along the Gaza Strip.\n\nA statement from the Israeli Prime Minister’s Office on Thursday said that the military had not given the prime minister the findings of its investigations.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:05:05.764Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894808/israeli-military-admits-total-failure-on-oct-7",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T01:38:28.000Z"
}
