{
  "title": "England’s limp exit underlines sharp decline - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: England’s sorry exit from the Champions Trophy following defeat against Afghanistan is painful proof of the end of an era for the former kings of white-ball cricket.\n\nJos Buttler’s men travelled to the 2023 World Cup in India as double world champions following their success at the 2019 50-over tournament and at the T20 World Cup in 2022.\n\nEngland limped home from the tournament in India with just three wins in nine games.\n\nThey were only marginally better in last year’s T20 World Cup in West Indies and the United States before being hammered in the semi-finals by eventual champions India.\n\nThe ongoing Champions Trophy in Pakistan and the United Arab Emirates provided a chance for redemption but defeats against Australia and Afghanistan have ended their interest in the tournament, with a game against South Africa still to come.\n\nSo where now for England, who have sunk to a lowly seventh in the One-day International world rankings? Head coach Matthew Mott carried the can for the last two misfires, sacked last year to make way for Brendon McCullum, with England hoping their Test coach could sprinkle the stardust he has brought to the red-ball team.\n\nThis time captain Buttler, criticised for a lack of tactical acumen, is the man facing the flak.\n\nThe 34-year-old said after Wednesday’s eight-run defeat against Afghanistan in Lahore that he would consider his future following the group-stage exit.\n\n“I need to work out, am I part of the problem or the solution?” he said.\n\nThe destructive Buttler, one of England’s greatest-ever white-ball batters, had the unenviable task of succeeding the highly regarded Eoin Morgan as white-ball captain.\n\nHe led England to T20 World Cup glory in Australia in 2022 but their recent record in 50-over One-day Internationals is terrible — just four wins in 16 matches since the 2023 World Cup.\n\nTIME UP?\n\nFormer England captain Nasser Hussain believes Buttler’s time is up.\n\n“I don’t think as far as the captaincy goes, Jos Buttler has added that much to this England cricket team, but it’s taken away from his batting,” Hussain said on Sky Sports.\n\n“And when you add the two together, if you’re taking so away from a great player and you’re not gaining on the other side with leadership and captaincy and you are considering all options, I think it is probably time to move on.”\n\nMichael Vaughan, another former Engl­and skipper, also believes Buttler will go, but says the team’s problems run “much deeper”.\n\n“In English cricket, we just cannot seem to give full attention to both Test and white-ball cricket,” he wrote in the Telegraph.\n\n“At no stage in our history have we been good at both for any meaningful period of time. That is not good enough and is down to management. Look at Australia, New Zealand, even South Africa now. They can juggle the formats.”\n\nHarry Brook, the team’s vice-captain, is the obvious replacement for Buttler but the 26-year-old Yorkshireman is a Test regular and faces a complicated and testing workload.\n\nBrook himself, one of the standard-bearers for the younger generation, has struggled for form recently, along with other batters such as Phil Salt and Liam Livingstone.\n\nJacob Bethell, who missed the Champions Trophy through injury, and Jamie Smith are exciting prospects but are yet to establish themselves.\n\nOn the bowling front, England put their faith in a pace-dominated attack that lacked variety and ended up conceding 681 runs in two matches in Pakistan.\n\nEngland still boast some serious talent despite the exits of big names in recent years such as Jonny Bairstow, Jason Roy and Moeen Ali.\n\nBut they are an ageing side. Batter Joe Root, leg-spinner Adil Rashid and express paceman Mark Wood are all in their mid-30s.\n\nAnd Ben Stokes’ fitness issues and role as Test captain mean he is likely to have a limited role in future — Stokes was not in the Champions Trophy squad.\n\nThe other, structural problem for the England selectors is that the players do not play much 50-over cricket.\n\nThe domestic competition has been downgraded to “development” status, meaning top players and the best emerging prospects instead focus most of their energies on T20 and franchise cricket.\n\nMcCullum only began his dual role as Test and white-ball coach in January but already he will be acutely aware of the huge task that faces him.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:04:38.484Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894858/englands-limp-exit-underlines-sharp-decline",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T03:38:41.000Z"
}
