{
  "title": "Trump, Zelensky row in Oval Office after dispute on compromise with Russia - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump and his Ukrainian counterpart Volodymyr Zelensky openly argued in the White House on Friday as they clashed on the need for compromising with what the Ukrainian president called Russia’s “killer” leader.\n\nTrump berated Zelensky as they sat in the Oval Office, telling him to be more “thankful” and saying, “You’re in no position to dictate what we’re going to feel.” He told the Ukrainian president that he either “make a deal” with Russia “or we’re out”.\n\nUS Vice President JD Vance, sitting nearby, also attacked Zelensky, calling him “disrespectful”. Zelensky appeared to try to speak but was cut off.\n\nThe extraordinary outburst came after Trump said Ukraine would have to make “compromises” in a truce with Russia, which launched a full-scale invasion of its neighbour three years ago.\n\n“You can’t do any deals without compromises. So certainly he’s going to have to make some compromises, but hopefully they won’t be as big as some people think,” Trump said.\n\nBut showing Trump pictures of war atrocities and referring to Russian President Vladimir Putin, Zelensky said there should be “no compromises with a killer on our territory”.\n\n“Crazy Russians”, he said, deported Ukrainian children and committed war crimes during their three-year invasion of his country.\n\nTrump lashed out at Zelensky, who he said was “not acting at all thankful” and not “nice”.\n\n“You’re gambling with the lives of millions of people,” Trump said. “You’re gambling with World War Three, and what you’re doing is very disrespectful to the country — this country.”\n\nThe dramatic public breakdown in the long-tense relationship between Zelensky and Trump came after their meeting — in front of a large group of journalists — appeared to get off to a friendlier start.\n\nZelensky had said, “I think President Trump is on our side.” He said that he would be speaking to the US president about the “crucial” need for a so-called US security “backstop” to any European deployments of peacekeepers monitoring an eventual truce.\n\n“This is crucial, this is what we want to speak about, this is very important,” he said.\n\nTrump has alarmed Kyiv and European allies with his abrupt U-turn in US policy, ending what had been full-throated support for Ukraine’s attempt to defeat the Russian invasion and casting himself as a mediator between Putin and Zelensky.\n\nTrump said in the Oval Office that he had “spoken on numerous occasions” to Putin — more than has been publicly reported beyond the lengthy call between the two leaders earlier this February.\n\nTrump had told Zelensky that a truce is “fairly close”. He also said that a deal he was set to sign with Zelensky allowing US exploitation of Ukraine’s natural resources would be “very fair”.\n\nThe resources deal is intended to give the United States access to rare earth and other critical minerals as part of an overall plan to help Ukraine recover after a truce.\n\nZelensky told Trump that he should visit his embattled nation. “You have to come and to look.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/2822555729cc365.jpg",
  "retrievedAt": "2025-08-25T20:04:35.447Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894932/trump-zelensky-row-in-oval-office-after-dispute-on-compromise-with-russia",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T18:00:27.000Z"
}
