{
  "title": "Ocalan calls upon PKK to drop weapons, disband in Turkiye - World - DAWN.COM",
  "author": null,
  "content": "• Iraqi Kurdistan president welcomes appeal\n• SDF says group’s disarmament call ‘not related to us in Syria’\n\nISTANBUL: Jailed PKK founder Abdullah Ocalan on Thursday called for his Kurdish fighter group to lay down its weapons and dissolve itself in a landmark declaration read out in Istanbul.\n\n“All groups must lay down their arms and PKK must dissolve itself,” he said in a declaration drawn up in his cell on Imrali prison island where he has been held in solitary confinement since 1999.\n\nThe call came four months after Ankara offered an olive branch to the 75-year-old who founded the Kurdistan Workers’ Party (PKK), which has led a decades-long insurgency against the Turkish state that has cost tens of thousands of lives. “I am making a call for the laying down of arms, and I take on the historical responsibility of this call,” he said in a statement.\n\nHis words were read out by a delegation of lawmakers from the pro-Kurdish DEM party who visited him earlier on Thursday, the declaration sparking spontaneous applause inside the packed hall. In the Kurdish-majority city of Diyarbakir in the southeast, where around 3,000 people had gathered at a square to listen to an audio broadcast of Ocalan’s call, some broke into spontaneous applause while others broke down in tears.\n\n“Ocalan’s call for the PKK to disarm and disband represents a seismic shift. Not just for Turkiye, which has waged a decades-long war against the group, but for the region at large,” said Hamish Kinnear, senior analyst at Verisk Maplecroft. But his words elicited a cautious response from a senior figure within President Recep Tayyip Erdogan’s ruling AKP.\n\n“If the terrorist organisation heeds this call, lays down its arms and dissolves itself, Turkiye will be freed from its shackles,” Efkan Ala, AKP’s deputy chairman was quoted as saying by the state news agency Anadolu.\n\nA welcome move\n\nIraq’s Kurdistan regional president Nechirvan Barzani welcomed Ocalan’s call for the group. “We warmly welcome Ocalan’s message... and we call on the PKK to adhere to and implement this message,” Barzani said on X. “We in the Kurdistan region fully support the peace process,” he added, offering his support to ensure its success.\n\nThe Barzani family is a crucial powerbroker in Kurdish affairs. Earlier in February, pro-Kurdish Turkish lawmakers conveyed a message to Iraqi Kurdish leader Masoud Barzani, the president’s uncle and the veteran chief of the region’s ruling Kurdistan Democratic Party (KDP).\n\nThe other main party in the autonomous region, the Patriotic Union of Kurdistan (PUK), also welcomed Ocalan’s call. “We think it as a responsible and necessary call at this stage to unite the Kurds and resolve issues through peaceful dialogue,” Bafel Talbani, the chief of the PUK, said on X.\n\n‘Not related to us in Syria’\n\nThe commander of the Kurdish-led forces that control northeastern Syria said that the call for the PKK to dissolve did not apply to the group he leads.\n\nSyrian Democratic Forces (SDF) commander Mazloum Abdi said he welcomed the historic call by Ocalan for the PKK to drop its decades-long armed struggle against the Turkish state, which he said would have positive consequences in the region. But Abdi said Ocalan’s announcement applied only to the PKK and was “not related to us in Syria”.\n\nAbdi’s comment signalled Ocalan’s announcement would have no immediate impact on the SDF despite the affiliation of Syrias main Kurdish groups at the core of the SDF — the People’s Protection Units (YPG) — to the PKK.\n\nTurkiye says the YPG is indistinguishable from the PKK and has along with Turkish-aligned Syrian armed factions battled the group. “If there is peace in Turkiye, that means there is no excuse to keep attacking us here in Syria,” Abdi said.\n\nAbdi’s group established control over Kurdish areas of northern Syria after the outbreak of the Syrian civil war in 2011 and later became a major US partner in the fight against Islamic State, further expanding the area under its control.\n\nAbdi has expressed a willingness for his forces to be part of the new defence ministry, but said they should join as a bloc rather than individuals, an idea rejected by the new government. Neither the SDF nor the Kurdish-led administration was invited to a national dialogue conference convened in Damascus on Feb 25.\n\nAbdi said Syrian Kurdish authorities would be organising their own local dialogue on the future of the northeastern region.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67c112371979f.gif",
  "retrievedAt": "2025-08-25T20:05:05.081Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894807/ocalan-calls-upon-pkk-to-drop-weapons-disband-in-turkiye",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T01:38:28.000Z"
}
