{
  "title": "PTI reduces salaries of staff by 50pc amid ‘financial crunch’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After delaying their salaries for so many months, the Pakistan Tehreek-i-Insaf (PTI) has informed its staff that they will have to face a 50 percent cut in their salaries due to a purported financial crunch.\n\nThe staffers, who faced raids and spent months in jail, said that they should be paid 100 per cent of their salaries as they also have to run their households. They alleged that parliamentarians belonging to the PTI increased their salaries, but they were not showing interest to clear the dues of their employees.\n\nPTI Central Information Secretary Sheikh Waqas Akam said that he cared a lot about the party employees and wrote a note opposing the suggestion that the salaries be slashed by 50pc. A staffer, wishing not to be quoted, said that there were 25 to 28 paid staffers of the PTI who get from Rs35,000 to Rs200,000 salaries. He said they were hired for accounts, offices, and the media wing of the former ruling party.\n\n“The overall expenditure of secretariats in Islamabad and Lahore and salaries of paid staff is around Rs4 million per month. However, after the raid in July last year at the PTI secretariat, a number of staffers were arrested. It was unfortunate that our salaries were stopped while we were in jail. Later, when we were released and started working, our salaries could not be released for many months,” he said.\n\nWorker says party should not have taken ‘aggressive stance’ ifit did not have courage\n\nHe said that last year Raoof Hasan arranged some money and cleared some of the dues of employees, but later on, our salaries were delayed again.\n\n“In October 2024, we were informed by the high-ups that the party does not have funds to pay bills of the chairman’s office in Banigala, so the amount of bills will be deducted from the salaries of staff to avoid disconnection of utility services,” he said.\n\n“While the salary of almost five months is pending, we have been informed that the salaries will be slashed by 50pc from November. It is unfortunate that parliamentarians, belonging to the PTI, have increased their salaries, but they are least bothered regarding staff and their families,” he said.\n\nAnother staffer said that if the party did not have the courage to stand against the powers that be, it should not have taken such an aggressive stance. “Now we are suffering because of the aggressive policy of the party,” he added.\n\n“It is also unfair to deduct 50pc salary of those who are getting Rs200,000 and those who are getting just Rs35,000. Founding chairman Imran Khan, last year, directed provincial and federal legislators to contribute Rs 240,000 each, but even that amount could not be collected,” he claimed.\n\nIt is worth mentioning that PTI is considered to be the richest party in terms of getting donations, as it gets donations from within the country and also from abroad. However, the party’s former leader, Sher Afzal Marwat, has many times alleged that there was corruption in party funds, which were generated through donations, and tens of millions of rupees were being paid to ‘favourite’ lawyers in terms of fees.\n\nA senior leader of the party, wishing not to be quoted, said that it was a fact that the party was facing a financial crunch.\n\n“Since May 9 [2023] as many as 10 departments, including the Federal Investigation Agency (FIA), the National Accountability Bureau (NAB) and others, have been taking action against us. They have seized a number of bank accounts and blocked the ways to generate funds. They start investigations into those who give us donations. Because of it, other donors also hesitate to transfer money to avoid a crackdown against them,” he said.\n\nParty’s Central Information Secretary Sheikh Waqas Akram, while talking to Dawn, said that he was aware of the financial crunch being faced by the PTI.\n\n“Founding Chairman Imran Khan had directed all the ticket holders of provincial and national assemblies, whether they won or lost, to deposit Rs240,000 at once [for a year] or in two installments, i.e., Rs120,000 after every six months,” he said.\n\nHe said that, despite that, there were financial issues, but he strongly opposed the summary when it was suggested to reduce the salaries by 50pc. He also agreed that it was unfair to slash salary from the back date. “I hope that situation will improve in the coming days and staffers will be paid. The party really cares about their families,” Sheikh Waqas assured.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:41:28.725Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894735/pti-reduces-salaries-of-staff-by-50pc-amid-financial-crunch",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T01:38:44.000Z"
}
