{
  "title": "What happens if the US pulls out from IMF, World Bank? - Pakistan - DAWN.COM",
  "author": null,
  "content": "LONDON: Alarm is rising over Washington’s potential withdrawal from global institutions, including the Inter­national Monetary Fund (IMF) and the World Bank (WB), with the no-show of US Treasury Secretary Scott Bessent at G20 meetings adding to anxiety.\n\nSo what would happen if Washington pulls out from these two institutions? To understand this, one has to go back in time, as both institutions were formed in the ashes of the Second World War to encourage global integration and forestall future wars.\n\nThe IMF is often called a lender of last resort for countries in trouble. A swathe of emerging market countries rely heavily on the IMF: Argentina could not pay government workers without it, and others from Senegal to Sri Lanka also currently count on its cash.\n\nPakistan, of course, has participated in more than 20 IMF programmes since 1958, including the Extended Fund Facility (EFF) and Extended Credit Facility (ECF), Standby Arrangements (SBA) and one Structural Adjustment Facility Commitment that was availed in 1988.\n\nExperts say Washington’s withdrawal would be a ‘disaster’ for its global influence, but it may prove to be ‘a gift to China’\n\nLending ranges from emergency cash to tackle balance of payment crises to precautionary lines to prevent a crunch. The institution attaches conditions to the loans — dispatched in tranches — to ensure countries enact reforms, usually requiring cuts to wasteful spending, more transparent budgets, rooting out corruption or raising tax revenues.\n\nInvestors use IMF data on GDP and growth as the trigger to determine whether certain debt instruments that link payments to economic performance give them more - or sometimes less — money.\n\nThe World Bank lends at low rates to help countries build everything from railroads to flood barriers, creates frameworks nee­ded for innovative financial tools, such as green bonds, and provides risk insurance.\n\nHaving an IMF programme also assuages investors — both private and bilateral.\n\nDeveloped countries funding the institutions, including the US, have used them to ensure global financial stability and to encourage countries to adhere to fiscally responsible, open economic models.\n\nBoth institutions, at the behest of their biggest shareholder, the US, had backed co­­untries such as Egypt, Pakistan and Jordan, where the US has strategic interests, said Mark Sobel, the US chairman of the Official Monetary and Financial Institutions Forum (OMFIF), a veteran Treasury Department official and former IMF board member.\n\n“If there’s economic instability abroad, it can hurt the US economy,” Sobel said.\n\nBut the IMF often earns the ire of protesters for advocating painful unpopular reforms to balance budgets such as cutting fuel subsidies or raising tax revenues. Some Kenyans denounced the IMF during deadly protests last summer, while the Fund’s response to the 1997 Asian financial crisis was roundly panned.\n\nSo what would happen in case of a US exit? “It would be a disaster,” said Kaan Nazli, emerging market debt portfolio manager at Neuberger Berman.\n\nA founder member, the United States holds the largest single share of each institution — just over 16pc for the IMF and just under that for the World Bank.\n\nThis has given US policymakers strong influence over decision-making that global economic leaders have come to rely on.\n\nUS withdrawal would also surprise experts and investors, as the institutions give Washington that influence at a relatively low cost.\n\nStepping back, they say, would be a gift to China and others seeking to dislodge it as the global leader. Other countries could fill the financial gap; China has been keen for a larger role in global groups.\n\nIt has pushed for a realignment of IMF shareholdings and to strengthen emerging market voices. China’s current share is just over 5pc.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67c1089c98957.gif",
  "retrievedAt": "2025-10-12T01:41:05.792Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894790/what-happens-if-the-us-pulls-out-from-imf-world-bank",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T01:38:09.000Z"
}
