{
  "title": "‘Momentous day’ for Pakistan football as PFF Congress approves constitutional amendments - Sport - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Thursday’s extraordinary meeting of the Pakistan Football Federation Congress was vital. This time, things couldn’t go wrong. And so for this one, after two previous meetings in the last few months couldn’t bring the desired results, the deputy secretary general of the Asian Football Confederation flew in.\n\nVahid Kardany’s presence at the meeting was the key to providing the reassurance and removing the distrust that had seeped in with global football body FIFA and the AFC adamant that the constitutional amendments — that largely centred on the candidacy of the PFF president — were key to holding the PFF elections.\n\nThe Congress had overwhelmingly rejected the proposed amendments earlier this month, prompting FIFA to suspend the PFF. But the change at the helm of the FIFA-appointed PFF Normalisation Committee, perhaps, changed the mood of the congress, which unanimously approved the amendments.\n\n“It’s a momentous day for Pakistan football,” Kardany, who made a day-trip to Lahore for the meeting, told Dawn.\n\n“I’ve never seen the PFF Congress so united, driven towards change. Among the members, there was a realisation of the time lost in the past, which has seen football in the country suffer so much. But soon, we will have an elected PFF which can drive the development of the sport in the country.”\n\nPakistan football has been mired in crisis and controversy since 2015, prompting FIFA to install a normalisation committee to oversee PFF affairs in 2019. There were teething troubles for the NC until it finally moved towards the elections last year. Elections at district and provincial levels were conducted but FIFA wanted constitutional amendments to be made before the holding of the presidential election.\n\nThe bone of contention in the past between the congress and FIFA had been the amendments in Article 38 of the PFF Constitution that deals with the candidacy of the PFF president. It was previously restricted to members of the congress or PFF, AFC or FIFA but will now be open to anyone who has played an active role in football management and organisation at any level.\n\nWith the constitutional amendments done, the path has been cleared for the FIFA suspension on the PFF to be lifted which will allow the national team to return to the international fold.\n\n“It will be, absolutely,” said Kardany, when asked if the upcoming election would be the most democratic in the history of the PFF. The Congress had expressed its reservations over the fact that an open election could potentially pave the way for government interference but Kardany allayed those concerns.\n\n“The PFF NC has played its part to take it this far, and now it will draft an electoral code, which will be approved by FIFA and the AFC, which will decide who will be eligible to run for the PFF presidency,” he said.\n\nPakistan are due to face Syria in their opening Group ‘E’ match of the 2027 AFC Asian Cup qualifiers on March 25. The AFC had earlier told the PFF that it will consider Pakistan to have withdrawn from the qualifiers if the suspension was not lifted by March 4.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:41:30.689Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894851/momentous-day-for-pakistan-football-as-pff-congress-approves-constitutional-amendments",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T03:20:29.000Z"
}
