{
  "title": "Inflation going up in March - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: While playing down falling industrial production and revenue shortfalls in the first seven months (July-January) of 2024-25, the government on Thursday hinted at a spike in the consumer price index next month.\n\n“Inflation is anticipated to remain within the range of 2-3pc for February. However, there are prospects of a slight increase to 3-4pc by March,” said the Ministry of Finance (MoF) in its Monthly Economic Update & Outlook for February, released on Thursday.\n\nOverall, the MoF said the national “economy continued to demonstrate positive developments during July-January FY25, as evidenced by improvements in key economic indicators”. Export-oriented industries grew despite the slow recovery in the Large-Scale Manufacturing (LSM) sector.\n\nThe MoF said the CPI inflation was recorded at 2.4pc on a YoY basis in January compared to 4.1pc in the previous month and 28.3pc in January 2024. “On MoM basis, CPI slightly increased by 0.2pc in January compared to an increase of 0.1pc in the previous month and an increase of 1.8pc in January 2024,” it said.\n\nFinance ministry expects higher remittances and exports to keep current account in check\n\nThe report said major drivers contributing to the YoY increase in CPI include clothing and footwear (14.1pc), health (14.1pc), education (10.4pc), restaurants and hotel (7.6pc), alcoholic beverage and tobacco (5.6pc), furnishing and household equipment maintenance (5.1pc), housing, water, electricity, gas and fuels (1.5pc), transport (0.7pc), and communication (0.1pc).\n\nIt pointed out that a decline in prices was observed in perishable food items (10.3pc) and non-perishable food items (1.9pc). SPI for the week ended on Feb20 recorded an increase of 0.27pc against the previous week as prices of 16 items declined, 24 items remained stable and 11 items increased.\n\nThe ministry expected better crop output, saying the government remained committed to supporting the farmers through various initiatives, although it conceded weather-related impact on the agriculture sector without talking about the removal of support prices to encourage farmers.\n\nQuoting the Pakistan Meteorological Department, the report conceded that “the relatively dry conditions may cause water stress for Rabi crops, especially wheat in rain-fed areas”.\n\nOn the other hand, it said the recent monthly performance of LSM sector suggested a potential recovery in upcoming months. In January, LSM growth was expected to be supported by rising imports of machinery and raw materials, along with increased cement dispatches, the ministry said, adding that a decline in inflation and the accommodative monetary policy were likely to further boost business confidence to support the LSM recovery.\n\nThe report said the government’s fiscal consolidation helped revenue growth outpacing the expenditure rise but did not mention the Rs470bn revenue shortfall in the first seven months. This was chiefly attributable to almost 85pc growth in non-tax revenues originating from record central bank profits on the back of historically high interest rates, besides petroleum levy and so on.\n\nIt said the fiscal performance during 1HFY25 was reflective of the government’s effective consolidation measures, which resulted in better expenditure management and improved resource mobilisation.\n\nThese measures are expected to contain the fiscal deficit while ensuring discipline. Similarly, with contained non-markup expenditures, the primary surplus is expected to improve further in the coming months, the report said.\n\nExports, imports, and workers’ remittances are expected to maintain their upward trend. In the coming months, remittances are likely to increase further due to seasonal factors such as Ramazan, Eidul Fitr and Eidul Azha. Similarly, exports and imports are projected to improve due to the expansion in economic activity. All these factors will help to keep the current account deficit within manageable limits.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:41:51.832Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894798/inflation-going-up-in-march",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T01:38:18.000Z"
}
