{
  "title": "JUI-S leader Maulana Hamidul Haq among 6 dead in Nowshera madressah suicide blast; 15 injured - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least six people, including JUI-S leader Maulana Hamidul Haq Haqqani, were killed and 15 injured when a suicide blast ripped through the Darul Uloom Haqqania seminary in Khyber Pakhtunkhwa’s Nowshera district, according to officials.\n\nThe blast tore through the main prayer hall of the madressah as worshippers gathered for Friday prayers, KP Police Inspector General Zulfiqar Hameed confirmed to Dawn.com. “It was a suicide blast. Three policemen were also injured in the attack,” Hameed said.\n\nA statement from the KP Police Directorate of Public Relations said that the blast occurred at 2pm, adding that police and rescue teams were immediately dispatched to the site of the incident.\n\nIn a statement issued by the office of the hospital director, six people were killed in the attack, while at least 15 were injured.\n\nHowever, according to a Rescue 1122 statement issued after 5pm, the number of people injured in the attack was around 20.\n\nWhile speaking to Samaa TV earlier, the KP IG said it appeared Haqqani — the seminary head — was the target of the suicide blast.\n\nNo group has immediately claimed responsibility for the attack.\n\n“He was a great religious scholar whose immense services to Islam are unforgettable,” said Adviser to KP Chief Minister Barrister Mohammad Ali Saif in a statement.\n\n“Maulana Hamidul Haq’s martyrdom is an irreparable loss.”\n\nRescue officials transported the injured to nearby hospitals. The KP government declared an emergency in all hospitals and health facilities across Peshawar, about 70km away from Nowshera by road.\n\n“The presence of medical staff and necessary medicines be ensured,” read a statement from the KP commissioner’s office.\n\nKP Chief Minister Ali Amin Gandapur ordered an immediate report on the incident and directed officials to “provide the best medical facilities” to the wounded.\n\n“Targeting innocent people in a place of worship is an inhumane act,” Gandapur said, adding that “all available resources should be used to bring the elements involved in the heartbreaking incident to justice.”\n\nHaqqani, the son of assassinated cleric Maulana Samiul Haq, served as vice chancellor of the Darul Uloom Haqqania and chairman of the Jamiat Ulema-e-Islam-Sami (JUI-S) political party. He previously served as a member of the National Assembly from 2002 to 2007.\n\nLast year, Haqqani led a delegation of religious scholars to Afghanistan for “religious diplomacy” meetings with Taliban leaders. He had said the visit helped reduce tensions between Islamabad and Kabul.\n\nAccording to the madressah’s website, it was founded by Maulana Abdul Haq Haqqani, an Islamic scholar, in September 1947.\n\nThe seminary has faced controversy in the past as its students have been accused of involvement in the murder of former prime minister Benazir Bhutto. The madressah has, however, denied having any connection with the suspects.\n\nSome of the alumni of the seminary include Taliban leaders Amir Khan Muttaqi, Abdul Latif Mansoor, Maulvi Ahmad Jan, Mullah Jalaludin Haqani, Maulvi Qalamudin, Arifullah Arif and Mullah Khairullah Khairkhwa, BBC reported.\n\nIn January, Adviser to KP Chief Minister on Information Barrister Dr Saif had paid a visit to the seminary and was given a detailed briefing on construction projects underway in the madressah including the Shariat Hall, a modern academic block among others, according to the state-owned Associated Press of Pakistan (APP).\n\nNo group has claimed responsibility for the attack.\n\nPresident Asif Ali Zardari strongly condemned the “heinous act of targeting worshippers in [a] suicide attack”, according to a statement from the President’s House.\n\n“Targeting innocent worshippers is a despicable and heinous act,” he said. “Terrorists are enemies of the country, nation and humanity.”\n\nHe expressed condolences to the families of the deceased.\n\nPrime Minister Shehbaz Sharif also condemned the incident and prayed for the recovery of Maulana Haq and others who were injured, according to a statement from the Prime Minister’s Office.\n\nHe directed that the best medical facilities be administered to the injured and sought a report of the incident.\n\n“Such cowardly and heinous acts of terrorism cannot dampen our resolve against terrorism,” the PM said. “[We are] resolute to completely eradicate all forms of terrorism from the country.”\n\nInterior Minister Mohsin Naqvi, while denouncing the blast, expressed deep sorrow and regret over the loss of precious human lives, according to the interior ministry’s post on X.\n\n“[He] extends heartfelt sympathy and condolences to the families of the martyrs, prays for the speedy recovery of the injured, including Maulana Hamidul Haq Haqqani.”\n\nKP Governor Faisal Karim Kundi also sought a report of the incident from high-level authorities, calling the explosion a “conspiracy of hostile forces”.\n\n“I don’t know how long the province will bear the consequences of the incompetence and collusion of the provincial government,” he stated, adding it was “important to get rid of the rulers who harbour terrorists in the province”.\n\nAfghanistan’s Taliban government also condemned the blast, AFP reported.\n\n“We strongly condemn the attack, we know them as the enemies of the religion, we have tried our best to eliminate them successfully,” said Afghan interior ministry spokesman Abdul Mateen Qani, blaming the attack that has not yet been claimed on the Islamic State group.\n\nSeparately, two people were killed while five others were injured in a firing incident at a mosque in KP’s Swat district, Regional Police Officer (RPO) Sher Akbar Khan told Dawn.com.\n\nThe suspect who opened the fire was arrested, the RPO said. Subsequently, the suspect was moved to an unknown location for investigation.\n\nSwat district police spokesperson Moin Fayyaz told Dawn.com that no evidence of any terrorist element was found in the incident so far, adding that the suspect was not mentally stable.\n\nFayyaz said the suspect had also allegedly murdered his sister a few days ago, adding that further investigations were underway.\n\nMosques have been targeted in terrorist attacks in KP in the past, too.\n\nOn January 30, 2023, a blast inside a mosque shook Peshawar’s Police Lines area, with officials saying that at least 59 people were killed and 157 were injured.\n\nThe explosion ripped through the mosque in Peshawar’s Red Zone area where between 300 and 400 people — mostly police officers — had gathered for prayers. The suicide blast blew away the wall of the prayer hall and an inner roof.\n\nThis toll rose to 101 two days later, the KP health department said in a statement.\n\nIn 2022, a powerful suicide blast ripped through the crowded Jamia Masjid Koocha Risaldar in the old city. The bomber first killed the policeman deployed at the imambargah’s main gate and then entered the premises to blow himself up inside the main hall, where a large number of worshippers were offering Friday prayers.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/28172931c6f3950.jpg",
  "retrievedAt": "2025-08-25T20:04:35.357Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894895/jui-s-leader-maulana-hamidul-haq-among-6-dead-in-nowshera-madressah-suicide-blast-15-injured",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T09:29:45.000Z"
}
