{
  "title": "Opposition sees fair polls as panacea for all ills - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A two-day opposition conference ended on Thursday with a declaration that the crises engulfing the country could only be addressed through free and fair elections, and ensuring the supremacy of the Constitution and rule of law.\n\nThe moot kicked off in the capital on Wednesday at the Legend Hotel, where opposition parties gathered to discuss issues related to constitutional breaches, human rights violations, freedom of speech, and political instability in the country.\n\nOn the same day, the opposition had alleged that the government wanted to suppress their moot by pressuring the hotel to revoke their registration.\n\nHowever, the conference was held on the second day as well at the same venue, and Tehreek Tahaffuz-i-Ayeen Pakistan (TTAP) leaders were of the view that the obstacles created by the government only helped amplify their gathering at national and international levels.\n\nPTI spox claims govt attempts to ‘scuttle’ moot only amplified its impact\n\n“We are thankful to the government because, if it did not create hurdles, we might not get so much attention at the national and international level. Throughout the day I got calls from international media houses as they were concerned about how a government can deprive people of the right to assembly even behind closed doors,” PTI Central Information Secretary Sheikh Waqqas Akram claimed while talking to Dawn.\n\nAccording to the PTI spokesperson, the JUI-F led by Maulana Fazlur Rehman was not part of the alliance, but Maulana Abdul Ghafoor Haideri attended the conference. He said the JUI-F believed in ‘solo flight.’ Mr Akram hoped that the conference would pave the way for a movement against the federal government after Ramazan.\n\nPTI leader Asad Qaiser termed the conference an attempt to restore democracy. “It was a lawful activity, but the management of the hotel was threatened that not only a fine of Rs10 million would be imposed but the hotel would also be sealed. They [hotel administration] were worried, rather frightened, but we held the conference (anyway),” he said.\n\nThose who attended the conference on Thursday included former prime minister Shahid Khaqan Abbasi, Omar Ayub, Salman Akram Raja, and others.\n\nA heavy contingent of Frontier Constabulary and police was deputed outside the hotel. Mr Ayub said that he was surprised by the intelligence of those who suggested to Prime Minister Shehbaz Sharif and Interior Minister Mohsin Naqvi to stop the conference.\n\nDeclaration\n\nAccording to the declaration issued after the conference, the political parties unanimously agreed that the solution to the country’s problems lies only in the supremacy of the Constitution and the rule of law. They also agreed that elections held on February 8 last year were apparently responsible for the country’s current political, economic, and social crisis. They believed that parliament had lost its moral and political value.\n\nThe participants demanded that the amendments that were alleged to be in conflict with the Constitution must be declared null and void. It may be noted that the recently passed 26th Amendment, which alters the procedure for the appointment of judges to superior courts, has been opposed by the opposition parties, which believe that the amendment was a threat to the independence of the judiciary.\n\nThe opposition leaders also suggested that the government stop violating the constitution and human rights, as it was nothing but evidence of fascism. According to them, the Constitution does not allow citizens to be harassed, arrested, or imprisoned for participating in political activities and demanded the release of political prisoners without any delay.\n\nThey also asked the government to repeal the recently passed PECA amendments, terming them against media freedom. They also stressed that the government give attention to the grievances of people of Balochistan, Khyber Pakhtunkhwa, Punjab, and Sindh. They also suggested that the water should be distributed as per the 1991 Water Accord because otherwise the situation of law and order could not be addressed. It may be noted that the issue of the development of a new canal command had caused a stir in Sindh when approval was granted for six new canals from the Indus last year, leading to widespread protests.\n\nAccording to the opposition leaders, the issues of the country could only be solved through a free and fair election. They vowed to continue their struggle to implement the declaration and address the issues of Pakistan.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:41:08.149Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894793/opposition-sees-fair-polls-as-panacea-for-all-ills",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T01:38:03.000Z"
}
