{
  "title": "Sahiwal woman raped, blackmailed after promise of marriage - Pakistan - DAWN.COM",
  "author": null,
  "content": "SAHIWAL: Ghalal Mandi police have booked three men and a woman in a case of alleged rape and blackmail on the complaint of a woman.\n\nThe police charged two brothers, along with a woman and a man, under section 375 A of the Pakistan Penal Code (PPC), on a complaint filed by a woman of Farid Town.\n\nAccording to the FIR, the complainant ‘I’, the daughter of a widow, Sabrain Bibi, befriended a youth ‘A’ on the phone in February 2023. She alleges that ‘A’ developed physical relations with her, promising to marry her. She said that during their relationship A also raped her and recorded the episode with his phone camera.\n\nShe stated that when she pressurised A for marriage, he sent a woman ‘L’, and a man to her house with a marriage proposal, which her mother accepted.\n\nThe complainant said that A also called her to Lahore on the pretext of shopping for their wedding, where he and L took him to a house in Johar Town. She alleged that she was kept in the house for two days and was repeatedly raped by the suspect, while his friend stood guard.\n\nThe complainant also alleged that she was deprived of Rs30,000 cash and gold ornaments worth Rs375,000 by the suspect. Later the suspect dropped her at her house.\n\nThe complainant alleged that later the suspect refused to marry her and threatened to share her videos and pictures on social media if she reported the matter to police.\n\nShe said that the suspect had been continuously blackmailing her and also attempted to extort money from her.\n\nMAN HUMILIATED: Noor Shah police have booked five suspects for forcefully shaving the head and cutting the mustaches of a political rival at Dadan village to humiliate him.\n\nThe suspects also recorded a video of the episode and showed it to the locals. They also snatched Rs46,000 from the victim Umer Farooq.\n\nNoor Shah police registered a case against the suspects Habib, Qurban, Shama, Lakhain, and Bashir Sanpal under sections 337, 292, 379, 148, and 149, on a complaint filed by the victim’s brother, Imran.\n\nSources say that Umer had political differences with a village landlord, who was behind the episode.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:41:51.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894827/sahiwal-woman-raped-blackmailed-after-promise-of-marriage",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T02:58:55.000Z"
}
