{
  "title": "Profile: Maulana Hamidul Haq Haqqani — the vice chancellor of Jamia Darul Uloom Haqqania - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least five people were killed and several others injured in a suicide blast at the Jamia Darul Uloom Haqqania madressah in Khyber Pakhtunkhwa’s Nowshera district on Friday afternoon. Among the deceased was Maulana Hamidul Haq Haqqani, a political leader and religious scholar.\n\nMaulana Hamid was the son of prominent Pakistani cleric Samiul Haq Haqqani, who was also known as the “father of Taliban”. After his father’s assassination in 2018, Hamid assumed the position of vice-chancellor of the sprawling seminary, located at a distance of 60 kilometres from Peshawar.\n\nThe madressah, one of the country’s largest and oldest seminaries, is home to roughly 4,000 students who are fed, clothed and educated for free, according to AFP. According to the Darul Uloom Haqqania website, several prominent Taliban leaders — including the leader of the Haqqani network, Sirajuddin Haqqani — were among those who graduated from it.\n\nHamid, Sami’s second son from his first wife, received his religious as well as school education from his grandfather, Maulana Abdul Haq, at the Haqqania High School located within the premises of the madressah.\n\nHe completed his Bachelor’s in Islamic Studies from Nowshera Degree College and obtained a Master’s from the Punjab University in Theology in the late 80s. Hamid started his political career by joining the Jamiat Ulema-i-Islam (Sami) student wing Islami Jamiat Taleba as secretary general in 1985.\n\nHe served as a member of the National Assembly from November 2002 to 2007 and was appointed JUI(S) chairman after his father’s assassination in 2018.\n\nHamid also served as the chairman of the Difa-e-Pakistan Council — an umbrella coalition of primarily jihadi groups, such as the Jamaatud Dawa and the Ahle Sunnat Wal Jamaat, which had been dormant for several years. The DPC was established in 2011 in reaction to the killings of Pakistani soldiers by US forces at the Pak-Afghan border. It, however, remained inactive after the murder of its founder Maulana Samiul Haq in 2018. The council, under the leadership of Maulana Hamid, resurfaced in 2023 to warn of ‘conspiracies’ allegedly being hatched by politicians to hurt ‘national interests’.\n\nLast year, he led a delegation of Pakistani religious scholars to Afghanistan as part of “religious diplomacy”, where he met Taliban leaders. Speaking about the visit, Hamid had told Dawn.com that it would help remove mistrust between Islamabad and Kabul.\n\nIn an interview with The Independent in 2021, Hamid said the Jamia Darul Uloom Haqqania had hosted US and Afghan ambassadors and played a “mediating role” between Pakistan and the Afghan Taliban to bring reconciliation and peace to the region.\n\nDuring the same interview, he also dismissed criticism against the madressah, saying: “By labelling us as a ‘terrorist organisation’ campus, they want to scare people off us, and Islam.”\n\nIn another interview with the Daily Times in 2021, he stressed that Pakistan needed to step up efforts “to stabilise the situation”. He added that “although it [Pakistan] has done a lot, it still needs a long-term strategy to curb the resurgence of terrorist militia groups”.\n\n“We need intelligence-based policies, strong anti-terrorism legal framework, and address the grievances of unprivileged people.”\n\nHe was also among the few who called on the world and Pakistan to immediately recognise the Taliban government and establish diplomatic relations with Afghanistan after the fall of Kabul in 2021.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/28173229e036da0.jpg",
  "retrievedAt": "2025-08-25T20:04:31.824Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894899/profile-maulana-hamidul-haq-haqqani-the-vice-chancellor-of-jamia-darul-uloom-haqqania",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T11:37:25.000Z"
}
