{
  "title": "Australia reach Champions Trophy semis after Lahore washout - Sport - DAWN.COM",
  "author": null,
  "content": "Australia sailed into the Champions Trophy semi-finals after their final Group B match against Afghanistan was abandoned at the Gaddafi Stadium on Friday.\n\nAustralia advanced to the knockout stage with four points that include two abandoned matches.\n\nChasing 274 for victory against the plucky Afghans, Australia raced to 109-1 in the 13th over when heavy rain stopped play.\n\nWhile the pitch was kept under cover, the outfield appeared soaked, prompting the match officials to call off the play.\n\nSouth Africa, who have three points and face an already-eliminated England on Saturday, look primed to join them in the semi-finals.\n\nAfghanistan, who have three points but a poor net run rate, are only mathematically alive in the race although they beat England in their impressive Champions Trophy debut.\n\nIndia and New Zealand have made the last four from Group A.\n\nEarlier, Afghanistan’s Sediqullah Atal struck 85 against Australia but it was Azmatullah Omarzai’s enterprising 67 down the order that powered them to 273 all out in exactly 50 overs.\n\nAustralia began briskly in their chase, aided by Afghanistan’s poor catching.\n\nRashid Khan dropped Travis Head, who was on six, and in the next over, Matthew Short (20) was spilled in the deep.\n\nShort could not make the most of the reprieve and fell to Omarzai in the next over, but dropping Head, who was batting on 59 when rain stopped play, proved costly for Afghanistan.\n\nThe left-hander raced to a 34-ball fifty and took Australia past the 100-mark in the 12th over before rain stopped play.\n\nTeams:\n\nAustralia: Steve Smith (captain), Matthew Short, Travis Head, Marnus Labuschagne, Josh Inglis, Glenn Maxwell, Alex Carey, Ben Dwarshuis, Nathan Ellis, Spencer Johnson, Adam Zampa\n\nAfghanistan: Hashmatullah Shahidi (captain), Ibrahim Zadran, Rahmanullah Gurbaz, Sediqullah Atal, Rahmat Shah, Gulbadin Naib, Azmatullah Omarzai, Mohammad Nabi, Rashid Khan, Noor Ahmad, Fazalhaq Farooqi\n\nUmpires: Alex Wharf (ENG) and Kumar Dharmasena (SRI)\n\nTV umpire: Chris Gaffaney (NZL)\n\nMatch referee: Andrew Pycroft (ZIM)",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/28213054fb97495.jpg",
  "retrievedAt": "2025-08-25T20:04:35.487Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894892/australia-reach-champions-trophy-semis-after-lahore-washout",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T09:10:35.000Z"
}
