{
  "title": "UN nature talks in ‘end game’ to break funding deadlock - World - DAWN.COM",
  "author": null,
  "content": "ROME: Brazil spearheaded a last-ditch effort to break the deadlock at UN nature talks in Rome on Thursday, as nations struggled against the clock to agree a deal over money to halt rapid global species loss.\n\nRich and developing countries broadly agree over the scale of the crisis that threatens the ecosystems and wildlife that humans rely on for food, climate regulation and economic prosperity.\n\nBut they are locked in a dispute over how to deliver funding, which caused a previous meeting in Cali, Colombia last year to end in disarray.\n\nThe rebooted COP16 talks in Rome are tasked with bridging those differences, against a backdrop of geopolitical tensions and global economic concerns. In a bid to unlock agreement on what should be the final day of talks, Brazil put forward a new “compromise attempt” text on behalf of the Brics country bloc that includes Russia, China and India.\n\nThis sought to whittle down the document under negotiation and clarify two main goals to be agreed — closing the multi-billion dollar biodiversity financing gap and deciding on the institutions that will deliver that money.\n\nBrazil negotiator Patrick Luna said the proposal was to ensure that while countries were embarking on a marathon global effort, “we are not running on a treadmill, we are advancing towards these goals”.\n\n‘End game’\n\nCOP16 president Susana Muhamad told negotiators in a plenary that the talks were in their “end game”. She warned that progress on ambitious targets to protect nature by 2030 was on the line, urging nations to show “that collectively we can mobilise this change to safeguard biodiversity, which is life”.\n\nScientists have warned that a million species are threatened with extinction, while unsustainable farming and consumption destroys forests, depletes soils and spreads plastic pollution to even the most remote areas of the planet. Young protesters greeted negotiators as they arrived at the building of the UN Food and Agriculture Organisation on Thursday, playing a soundtrack of rainforest noises and handing out flyers urging: “Don’t let silence be our legacy”.\n\nIn a landmark 2022 agreement, countries agreed to halt the destruction of nature by the end of this decade.\n\nThey laid out a programme of 23 objectives to be achieved by 2030, including protecting 30 per cent of the world’s land and seas. Just 17pc and 8pc respectively are protected currently, the UN says.\n\nCountries have already agreed to deliver $200 billion a year in finance for nature by 2030, including $30 billion a year from wealthier countries to poorer ones. The total for 2022 was about $15 billion, according to the OECD.\n\nThe main debate is over developing countries’ demand for the creation of a specific biodiversity fund. Wealthy nations — including the European Union and Canada — are opposed, arguing that setting up multiple funds fragments development aid, which is already under pressure from budget cuts and the slashing of overseas aid by new US President Donald Trump.\n\nPublished in Dawn, February 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:04:51.442Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894812/un-nature-talks-in-end-game-to-break-funding-deadlock",
  "dateList": "2025-02-28",
  "date_published": "2025-02-28T01:39:42.000Z"
}
