{
  "title": "Domestic violence legislation ensures justice delivery, protection of women: CJ FSC",
  "link": "https://www.app.com.pk/national/domestic-violence-legislation-ensures-justice-delivery-protection-of-women-cj-fsc/",
  "date_published": "2022-12-12T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): Acting Chief Justice of Federal Shariat Court (FSC) Dr Syed Muhammad Anwer on Monday said that the recent judgment of the FSC passed in favour of the Punjab Protection of Women against Violence Act, 2016 helped to ensure women’s rights in the country.\nDelivering a lecture on domestic violence at Fatima Jinnah Women University (FJWU), Rawalpindi in collaboration with the Institute of Policy Studies (IPS), he said the provincial laws against domestic violence constituted major steps towards ensuring the delivery of justice and protection of women according to Shariah, which asserted that violence against women was forbidden in all forms.\nHe emphasized that Islam gave rights to women much before the West, but the only problem was that Islamic principles and commands had not been understood, analyzed, and implemented in their true sense.\nIn this context, it was an achievement that such legislation, which was in line with the teachings of the holy Qur’an and Sunnah, had been implemented now to provide comprehensive protection to women in Pakistan against various crimes.\nHighlighting the misconceptions regarding women’s rights he argued that the widespread confusion about women’s rights in Islam was because of the shallow understanding and misinterpretation of Islamic commands.\nHe mentioned that Qur’anic verses demanded a deeper understanding and analysis and it was the responsibility of law students, practitioners, and Muslim society as a whole to learn the teachings of Islam holistically in the context in which these were given which would help to create awareness and formulate informed-decisions.\nCriticizing the influence and wrong dictation of Western thoughts in Muslim societies, he emphasized that Islam allowed women to agitate for every genuine right and contact the relevant authorities for these rights and added that no other nation or ideology would be allowed to dictate Muslim women as Islam itself was a complete code which did not depend on the interpretation of the West.\nDr Muhammad Anwer further stressed that Islam left no lacunae for Muslims to be apologetic or reactionary. Instead, they should analyze the situation deeply, see where they stand vis-à-vis Islamic teachings, devise and implement Shariah law in the true sense, and shoulder responsibility to teach the true meaning of Islam and inculcate good and positive impact in society and the world through their conduct with women.",
  "retrievedAt": "2025-08-11T16:00:21.572Z"
}
