{
  "title": "Imran doesn’t want economic stability, rather chaos & anarchy: Marriyum",
  "link": "https://www.app.com.pk/national/imran-doesnt-want-economic-stability-rather-chaos-anarchy-marriyum/",
  "date_published": "2022-12-12T17:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Monday said Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan did not want the economy to stabilise and for that he desired riots, chaos and anarchy in the country.\nReacting to Imran Khan’s video statement, she said the situation was the worst, but it was not for the country rather for Imran Khan whose “crutches have been broken.” He was worried that the institutions were not becoming part of his dirty politics. “The umpires whom he called animals” were neutral, the minister added.\nMarriyum said the “incompetent and inefficient” person, who had stolen the Toshakhana gifts, was out of his habit dragging the national institutions into his “unholy politics”.\nShe pleaded that it was the responsibility of the Election Commission of Pakistan and the judiciary to hold the “foreign agent” accountable for his wrongdoings, including the Toshakhana theft.\nThe minister said the traders, the business community, and the farmers were fully aware that the country was caught in the vortex of economic collapse caused by the Imran Khan regime.\n“The PTI leader is an insane person who thinks that the whole of Pakistan is crazy,” she added.\nThe minister said the incumbent government was bringing the country back from the bankruptcy where it was left by the PTI government.\nImran Khan would have to be accountable for the looted public money and land taken in bribe, stolen diamonds, theft of Toshakhana gifts and illegal foreign funding, she said. He would also have to answer for his four-year misrule which resulted in economic collapse, unemployment and inflation, the minister added.\nShe said Imran Khan might continue making a hue and cry, but no one would come to his rescue as the institutions were no more part of his conspiracies.",
  "retrievedAt": "2025-08-11T16:00:18.986Z"
}
