{
  "title": "Planning Minister takes on board lawmakers from 20 poor districts",
  "link": "https://www.app.com.pk/national/planning-minister-takes-on-board-lawmakers-from-20-poor-districts-2/",
  "date_published": "2022-12-12T13:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP):Minister of Planning, Development & Special Initiatives, Professor Ahsan Iqbal on Monday formally engaged the lawmakers from the country’s 20 poorest districts and sought their input before the execution of projects.\nLast month, the Ministry of Planning, Development and Special Initiatives had launched a 5-year (2022-27) project comprising special development initiatives for the 20 poorest districts across Pakistan at the cost of Rs 40 billion.\nIdentified on the basis of scores in this MPI, the selected 20 districts include 11 districts from Balochistan, five from Sindh, three from Khyber-Pakhtunkhwa and one from Punjab. Many of these districts have been directly affected by the recent flood disaster, especially in Balochistan and Sindh.\nWhile gearing up the efforts to execute the project, the Minister invited the relevant lawmakers from the 20 poorest districts which includes- Member National Assembly MNA, Mir Ghulam Ali Talpur, Khalid Hussain Magsi, Nawabzada Shazain Bugti, Maulana Abdul Wasay, Salahuddin Ayubi, Mohsin Dawar, Mahesh Kumar Malani and others.\n“The prime objective is to engage you and to get your input before execution of the country’s first-ever projects initiated by the incumbent to uplift the 20 backward and poor districts of the country,” said the Minister, while assuring the members that he will personally visit each district.\nIt is noted that the Central Development Working Party (CDWP) headed by Planning Minister Ahsan Iqbal had already approved the project. 11 districts are from Balochistan which includes Sherani, Kohlu, Jhal Magsi, Barkhan, Killa Abdullah, Zhob, Musakhel, Dera Bugti, Jaffarabad, Ziarat and Killa Saifullah. Five in Sindh — Sujawal, Thatta, Tharparkar, Kashmore and Badin and three in Khyber Pakhtunkhwa — Torghar, Shangla and North Waziristan and one district of Rajanpur in Punjab.\nSpeaking on the occasion, the Minister informed the participants that the study will be conducted in each district in order to know the critical needs in education, health, infrastructure and other sectors. The Minister further added that in the past the survey was conducted province-wise. However, he said that this is the first time in the country’s history that 20 poorest districts were identified. During the meeting, the lawmakers appreciated the efforts of the ministry and shared their recommendations.\nEarlier, Member Social Sector & Devolution Planning Development & Special Initiatives, Rafiullah Kakar gave a detailed presentation to the lawmakers. He said that the poor districts will be uplifted through physical connectivity power digital connectivity, productive sector of livelihood and others. “After consultation with lawmakers and development experts, the Planning Ministry will engage the community representatives before execution of the project, ” said Kakar.\nMeanwhile, the Minister also chaired a roundtable with the entrepreneurs and development experts from the 20 poorest districts to register their feedback on addressing inequality in Pakistan. The Minister underscored the importance of intervention from local bodies and stakeholders to make an effective framework to address the issue at hand.",
  "retrievedAt": "2025-08-11T16:00:10.932Z"
}
