{
  "title": "PM lauds OIC’s principled stance on Kashmir dispute",
  "link": "https://www.app.com.pk/national/pm-lauds-oics-principled-stance-on-kashmir-dispute/",
  "date_published": "2022-12-12T11:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP):Prime Minister Shehbaz Sharif on Monday lauded the Organization of Islamic Cooperation (OIC) for its principled position and consistent support for the resolution of Jammu and Kashmir dispute.\nTalking to OIC Secretary General Hissein Brahim Taha, he mentioned the support of OIC in accordance with the relevant United Nations Security Council resolutions and the aspirations of the Kashmiri people.\nThe OIC secretary general is on his first visit to Pakistan after assuming office in November 2021.\nThe prime minister highlighted the grim human rights and humanitarian situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nWelcoming the secretary general’s historic visit to Azad Jammu and Kashmir (AJK) and Line of Control (LOC), PM Shehbaz underscored that his visit would send a strong message of support from the OIC to the Kashmiri people in their just struggle for the right of self-determination.\nThe prime minister also renewed unwavering support of the people and the Government of Pakistan to the Palestinian people and Palestinian cause.He reiterated that any solution of the Palestine issue must be based on the pre-1967 border with Al-Quds Al- Sharif as its capital.\nRecognizing that the OIC has stepped-up its engagement with Afghanistan since the Extraordinary Session of the OIC Council of Foreign Ministers (CFM) in Islamabad in December 2021, he encouraged the secretary general to accelerate efforts for addressing and alleviating the humanitarian challenges faced by the people of Afghanistan.\nShehbaz Sharif reiterated the need to counter the rising anti-Muslim hatred and attempts to denigrate the sanctity of the Holy Prophet Muhammad (Peace Be Upon Him).\nHe expressed concern over intensifying of Islamophobia campaign, particularly in the region, where anti-Muslim and anti-Islam agenda was being pursued as an instrument of state policy.\nThe OIC secretary general reiterated the OIC’s full support for the resolution of Jammu and Kashmir dispute, in accordance with the relevant United Nations Security Council resolutions.\nHe also offered his condolences over the loss of lives and livelihoods caused by the recent climate-induced floods in Pakistan.\nThe secretary general assured the prime minister of the OIC Secretariat’s full support and cooperation during Pakistan’s remaining term as the Chair of the OIC’s Council of Foreign Ministers (CFM).",
  "retrievedAt": "2025-08-11T16:00:11.220Z"
}
