{
  "title": "President Alvi highlights significance of continuation of policies for economic growth",
  "link": "https://www.app.com.pk/business/president-alvi-highlights-significance-of-continuation-of-policies-for-economic-growth/",
  "date_published": "2022-12-12T17:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 12 (APP): President Dr Arif Alvi on Monday termed the continuation of policies essential for sustainable economic growth, promotion of industrialization and attracting foreign investment.\nHe underlined that digitalization of economy and business processes were vital for enhancing tax collection, promoting tax culture and transparency in the economy.\nThe president expressed these views while addressing the 2nd Rawalpindi Chamber of Commerce and Industry (RCCI) Taxpayer Recognition Awards, at Aiwan-e-Sadr.\nHe said that hurdles in the process of filing taxes by the business community required removal, besides provision of facilitation to the business community and resolution of their grievances and issues.\nThe president regretted that the low tax-to-GDP ratio had been a perennial issue in Pakistan, ever since its establishment, adding that tax culture in the country could be promoted by simplifying and easing the tax regime, reducing hurdles in the taxation system.\nHe also called for encouraging businessmen to pay more taxes, judiciously and honestly spending the collected tax, reducing corruption and pilferage, and ensuring merit and transparency.\nGroup Leader RCCI, Sohail Altaf, President RCCI, Saqib Rafiq, Federal Tax Ombudsman (FTO), Dr Asif Mahmood Jah, representatives of FBR, and members of the business community attended the ceremony.\nThe president said that Pakistan’s economy had been under stress due to multiple internal and external factors, adding that all stakeholders must act responsibly and display a unity of purpose to come out of the present situation.\nThe president also urged the need to focus on the skill development of youth and establishing partnerships between academia and industry, besides providing education to over 20 million out-of-school children.\nHe said that it was the collective responsibility of the state and society to care for the most vulnerable sections of its population and regretted that Pakistan’s education sector had declined, which required efforts to improve the educational standards throughout the country, besides enhancing the enrollment of students in Higher Educational Institutions (HEIs).\nThe president also called upon the members of the business community to enhance the participation of women in businesses and industry, besides providing them safe and friendly environment at the workplace.\nHe also impressed upon the need to establish baseline KPIs regarding the inclusion of women and persons with disabilities (PWDs) in the private sector, instead of merely paying lip service to the cause of women and PWD’s inclusion in the mainstream of society.\nRCCI Group Leader Sohail Altaf highlighted the need for political and economic stability, continuation of policies, providing facilitation to businesses, and taking steps to address their grievances.\nRCCI President Saqib Rafiq said that RCCI was making efforts to promote business activities in the country, enhancing exports, and developing linkages with foreign trading partners in different sectors, particularly the IT sector.\nHe further stressed upon continuation of policies for promotion of industrialization in the country, besides attracting foreign investors to invest in Pakistan.\nEarlier, the president distributed the RCCI awards among the highest taxpayers from the business community in different sectors, including retail, manufacturing, pharmaceuticals, travel, construction, steel, poultry, and import sectors.",
  "retrievedAt": "2025-08-11T16:00:18.517Z"
}
