{
  "title": "May 9 riots cases: LHC sets aside objections to Imran’s seven pleas - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A Lahore High Court two-judge bench on Monday overruled the registrar office’s objections to seven bail petitions of Pakistan Tehreek-i-Insaf (PTI) incarcerated founding chairman Imran Khan in as many cases of May 9 riots, including an attack on the Lahore corps commander’s residence.\n\nThe bench comprising Chief Justice Aalia Neelum and Justice Asjad Javed Ghural took up eight separate bail petitions of Mr Khan filed through Barrister Salman Safdar.\n\nDuring the hearing, the counsel informed the bench that the registrar office raised a similar objection on seven bail pleas, saying they lacked the thumb impression of the petitioner.\n\nHe said the office raised an objection to the eighth plea about the absence of a certified copy of the Iddat case judgment against the petitioner.\n\nBarrister Safdar assured the court that he would submit a new affidavit at the next hearing to address the objections.\n\nThe bench set aside the objections raised by the office on seven bail applications and directed the office to allot diary numbers to the cases for hearing.\n\nHowever, the bench sustained the objection on eighth petition regarding the missing certified copy of the Iddat case judgment, instructing the counsel to attach it with the application.\n\nAn anti-terrorism court had on Nov 27 denied bail to the former prime minister in these eight cases.\n\nThe petitions mainly argued that the prosecution failed to establish the petitioner`s association with the unfortunate occurrences narrated in the FIRs.\n\nThey said the petitioner has been implicated in the May 9 cases as a result of a well-orchestrated plan, merely to harass and humiliate him for political reasons, even though admittedly he was in the custody of the National Accountability Bureau (NAB).\n\nThe arrest of the petitioner was never required in the cases, which was evident from the fact that police remained reluctant to secure his arrest during the period of five months and 12 days after the dismissal of his pre-arrest bail by the trial court.\n\nThe petitions alleged that the indifferent behaviour of police and lack of effort in securing the arrest of the petitioner at a time when he was detained at Adiala Jail, supplement the argument that arrest of the petitioner was not required in the cases.\n\nThe sole allegation against the petitioner in the cases is of ‘abetment’, which has been supplemented by the prosecution most vaguely, the pleas added.\n\nThey argued that the trial judge overlooked the fact that frivolous and baseless allegations related to the May 9 events have already been rejected due to inconsistencies in the story of the investigating agency.\n\nThe petitions asked the court to set aside the trial court’s decision and grant bail to the former prime minister in the eight FIRs.\n\nPublished in Dawn, January 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:40:46.902Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885096/may-9-riots-cases-lhc-sets-aside-objections-to-imrans-seven-pleas",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T02:56:50.000Z"
}
