{
  "title": "South Africa’s Lategan wins Dakar stage eight to consolidate lead - Sport - DAWN.COM",
  "author": null,
  "content": "RIYADH: Toyota’s Henk Lategan of South Africa consolidated his lead atop the driver standings of the Dakar Rally by winning the eighth stage on Monday.\n\nThe 30-year-old, in his fourth Dakar outing, covered the 487km special between Al-Duwadimi and Riyadh in 4hr 51min 54sec.\n\nLategan, who also won the Jan 3 prologue, extended his lead over home hope Yazeed al-Rajhi to 5min 41sec in the general classification.\n\nDespite a two-minute penalty for speeding on the stage, Lategan finished the day’s driving 1min 47sec ahead of compatriot Guy Botterill, also in a Toyota.\n\n“There was one canyon where everybody was getting lost,” said Lategan. “And we were a little bit nervous going into there because you see cars coming from the front and cars coming from all angles out the mountains.\n\n“At the end, we went all the way out the canyon and then finally found our way. So we hopped from, let’s say, seventh or so on the road all the way to first. And then we were opening for quite a while.\n\n“And then we made one or two small navigation errors. We had a puncture earlier on. So, not a bad day. We’re happy to have found that one waypoint, but not the perfect day.”\n\nFrance’s Mathieu Serradori [Century] prevented an all-South African podium by finishing third, five seconds ahead of Brian Baragwanath.\n\nQatar’s five-time champion Nasser al-Attiyah completed the stage 12min 17sec off Lategan’s pace and now sits fourth in the standings, at 34min 14sec.\n\nSweden’s Mattias Ekstrom is third.\n\n“It was a very tough day,” said Attiyah, who has seen fancied rivals Carlos Sainz and Sebastien Loeb withdraw from the gruelling race. “Sometimes when we were opening it was very difficult.\n\n“Yazeed had a good line and when he passed we just followed him, until the dunes when we passed him, but it was really difficult. I am happy to finish this day. We still have four days left and we’ll see. The navigation was very hard. Sometimes we were lucky, other times not, but we made it here.”\n\nArgentinian Luciano Benavides (KTM) won the bike category’s stage, 2min 08sec ahead of French rider Adrien Van Beveren.\n\nSpain’s Tosha Schareina was third, while Australian Daniel Sanders retained the overall lead by just over 11 minutes.\n\nSchareina had initially been named provisional stage winner, but Benavides and Van Beveren were recredited with the time spent assisting Chilean Pablo Quintanilla, who fell after 133km and was forced to withdraw due to a shoulder injury.\n\n“Opening a lot of the stage was good and I had a really good rhythm,” said Sanders. “I think tomorrow’s going to be the last difficult navigation day before we head down to the Empty Quarter.”\n\nTuesday’s stage nine features a 357km special from Riyadh to Haradh.\n\nPublished in Dawn, January 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67857f5fad019.jpg",
  "retrievedAt": "2025-10-12T00:50:50.637Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1884997/south-africas-lategan-wins-dakar-stage-eight-to-consolidate-lead",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T02:14:19.000Z"
}
