{
  "title": "Iran’s envoy, CM discuss steps to boost trade, educational ties - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Iran’s ambassador to Pakistan, Dr Reza Amiri Moghaddam and Balochistan Chief Minister Sarfraz Bugti on Monday discussed steps to promote trade, educational and cultural relations between Pakistan and Iran.\n\nThe discussion took place when Iran’s envoy, along with members of his delegation, called on Mr Bugti at the Chief Minister House here.\n\nMr Bugti welcomed Dr Moghaddam and members of his delegation and said that establishment of peace and order in the region would increase trade activities and curb smuggling and illegal trade of goods between Pakistan and Iran.\n\nThe chief minister said that it is the need of the hour to further strengthen trade, cultural and social relations between the two brotherly countries.\n\nAmbassador offers scholarships for Pakistani students, expresses desire to launch other programmes\n\nHe said that trade relations between Balochistan and Iran would be promoted at different levels to boost up legal trade activities between the two countries and to curb smuggling.\n\nMr Bugti said that effective measures would be taken, in coordination with the federal government, for resolution of problems being faced by traders of the two countries in legal trade activities.\n\nThe chief minister said that the establishment of law and order would increase trade activities between the two countries and this would also end smuggling of goods.\n\nIn this regard, Mr Bugti said, a meeting will be held in Islamabad in which representatives of the chambers of commerce will be invited.\n\nThe chief minister assured members of Iran’s delegation that no legal commercial container or truck of Iranian traders would face any problem in Balochistan.\n\nFor timely resolution of such problems, he said, the Iranian Consulate should appoint one of its representative who will be in touch with relevant authorities of the Balochistan government to help traders.\n\nThe Iranian ambassador offered cooperation in various fields of social development including increasing trade volume, educational scholarships, and technical education.\n\nDr Moghaddam offered scholarships for Pakistani students and expressed Iran’s desire to launch various programmes for Pakistani students.\n\nThe CM appreciated the offer and said that the Iranian Consulate and officials of the Balochistan government would jointly prepare a plan for the scholarship programme.\n\nMr Bugti said that under this offer, a special educational scholarship programme would also be launched for the Hazara community living in Quetta.\n\nDuring the meeting, the Iranian envoy invited the Balochistan chief minister to visit Iran.\n\nMr Bugti accepted the invitation of Dr Moghaddam and said he would soon visit Iran along with a delegation.\n\nDuring the meeting, the Iranian envoy informed the chief minister about the appointment of a Baloch governor in Sistan-Baluchistan province of Iran.\n\nThe chief minister welcomed the Iran’s move and termed it a good omen.\n\nAt the end of the meeting, the two leaders reiterated their resolve to further promote bilateral relations and exchanged souvenirs.\n\nPublished in Dawn, January 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:41:14.605Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885042/irans-envoy-cm-discuss-steps-to-boost-trade-educational-ties",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T02:13:48.000Z"
}
