{
  "title": "64pc of adults now have bank accounts - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Financial inclusion, i.e the share of the adult population operating a bank account, has jumped from 16 per cent in 2015 to 64pc in 2023, according to the State Bank of Pakistan (SBP).\n\nSince 2015, SBP has implemented two National Financial Inclusion strategies (NFIS), 2015-18 and 2019-23, with the goal to improve access and usage of formal financial services by the masses.\n\nIn the NFIS report, issued on Monday with a number of targets set for 2024-28, the central bank said: “As a result, financial inclusion level, broadly defined as the share of adult population having a bank account, has jumped from 16 per cent in 2015 to 64 per cent in 2023,” said the report.\n\nMoreover, in order to catalyse inclusive economic growth and development in the country, specific actions have been outlined to revolutionise priority sector financing in the areas of SME, housing, agriculture, microfinance and sustainable finance, with the ultimate aim to enhance the wellbeing of low income and under-privileged population segments.\n\nSBP financial inclusion report reveals women account holders increased from 13m in 2018 to 31m in 2023\n\n“The headline targets for NFIS 2024-28 have been set to improve the level of financial inclusion in Pakistan to 75pc and reduce the gender gap to 25pc by 2028,” said the report.\n\n“Due to these initiatives the number of depositors has increased from 54 million in 2018 to 88 million in 2023, registering a growth of 63pc during the period,” said the report.\n\nThe number of women depositors grew from 13.1 million in 2018 to 31.2 million in 2023, improving women’s financial inclusion from 23pc to 47pc, the report added.\n\nSimilarly, the share of Islamic banking in the overall banking sector increased significantly, with share in deposits at 23pc, share in assets at 19pc and share in branch network at 29pc.\n\nAccording to the report, the implementation of the two new NFIS-leveraged technologies, supportive regulatory frameworks and enhanced public private partnerships have promoted financial inclusion. In particular, schemes such as the Asaan Digital Account, Asaan Mobile Account, Raast, have provided ease of access to and usage of formal financial services.\n\nExpanding the scope of digital financial services specifically to cater to the needs of the under banked segments of the society remains a challenge due to general preference for cash embedded in the culture, the report said.\n\nIn addition to digitalisation of financial services, SBP’s Banking on Equality Policy (BOE) has also helped in improving women’s financial inclusion in the country.\n\n“As of December 2023, 31 million adult women had at least one bank account as compared to 13 million in 2018, due to which, the gender gap has reduced from 47pc in 2018 to 34pc in 2023,” said the report.\n\nIn order to further advance the financial inclusion agenda, SBP is launching the 3rd edition of NFIS 2024-28, which aims to leverage progress made under the past two strategies, tackle persistent bottlenecks in financial inclusion, and capitalise on further digitalisation efforts to foster new innovations.\n\nPublished in Dawn, January 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:50:49.527Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885077/64pc-of-adults-now-have-bank-accounts",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T02:38:19.000Z"
}
