{
  "title": "RETHINKING THE TALIBAN DOCTRINE - Newspaper - DAWN.COM",
  "author": null,
  "content": "Just one month before the fall of Kabul to the Taliban in August 2021, a closed-door discussion organised by an Islamabad-based security think-tank brought together regional experts, retired military officers and policymakers to assess the potential fallout of the Taliban’s rapid territorial gains in Afghanistan amid the US military withdrawal.\n\nWhile many participants expressed concern over a looming security vacuum and its likely spillover into Pakistan, a few struck a markedly optimistic tone. Among them was a retired senior military official who declared confidently: “The good days are returning. The Delhi-leaning set-up in Kabul is on its way out. With the Taliban back in charge, all Islamabad needs to do is press for the closure of the Tehreek-i-Taliban Pakistan [TTP] and Baloch separatist sanctuaries in eastern Afghanistan, and the Taliban will comply. They owe us.”\n\nHe was not alone. Across Pakistan’s political and security establishment, the Taliban’s return in August 2021 was initially greeted with a cautious but clear sense of opportunity. A friendly regime in Kabul appeared to serve Islamabad’s long-standing strategic goals: rolling back Indian influence, reducing Western presence and restoring Pakistan’s central role in shaping regional outcomes.\n\nThen-prime minister Imran Khan hailed the moment as the breaking of “the shackles of slavery.” Then-interior minister Sheikh Rasheed Ahmed, speaking triumphantly at the Torkham border crossing, predicted the rise of “a new bloc” that would elevate the region’s global significance. Even Khawaja Muhammad Asif, then in opposition and now defence minister, posted a photograph of Taliban leader Mullah Baradar alongside US Secretary of State Mike Pompeo, captioned: “You may have the power, but God is with us. Allah-o-Akbar.”\n\nFour years on from the Taliban’s return to power in Afghanistan in August 2021, the optimism surrounding what was being hailed as a geopolitical victory for Pakistan has vanished. Instead, Pakistan is contending with a rising wave of militant violence from Khyber Pakhtunkhwa to Balochistan, and which threatens to expand inland. What options does Islamabad have to rethink its Afghan strategy?\n\nFour years later, that optimism has all but vanished. As Afghanistan slips from international headlines, Pakistan faces mounting costs from what was once hailed as a strategic win. Instead of securing its western frontier, Islamabad confronts a resurgence of militant violence, a worsening security climate and a strained relationship with a regime it once considered an ally.\n\nDrawing on recent fieldwork in both countries, this article examines how the Taliban’s return has deepened Pakistan’s domestic security crises, exposing the limits of its longstanding strategic assumptions.\n\nACROSS THE BORDER, VIOLENCE RISES AGAIN\n\nFor the political and religious elders of Bajaur, the stakes could not have been higher. With the government poised to launch a new counterterrorism operation in the district bordering Afghanistan against the TTP and the Islamic State of Khorasan Province (ISKP) — the local affiliate of the transnational Islamic State network — they took it upon themselves to negotiate a peaceful resolution through a jirga.\n\nTheir appeal to local TTP commanders was straightforward: either retreat into Afghanistan or relocate to remote mountainous areas to engage security forces. Such a move, they argued, would spare civilian populations from the destruction, displacement and the fear that inevitably follow armed conflict in villages.\n\nYet the militants, sensing a shift in regional power dynamics, refused.\n\nEmboldened by the Taliban’s victory in Afghanistan, the TTP leaders, according to a participant in the jirga, demanded terms that Pakistan could never accept. The talks collapsed, making renewed conflict all but inevitable. The renewed military operation was launched on August 11.\n\nThe Taliban’s triumph in Kabul has emboldened militant groups across Pakistan’s western belt. Alongside the TTP, groups such as the Hafiz Gul Bahadur faction in Khyber Pakhtunkhwa (KP) and Baloch ethno-separatist organisations such as the Baloch Liberation Army (BLA) have exploited the shifting regional balance to intensify their insurgencies against the Pakistani state.\n\nISKP — previously weakened by crackdowns by the US, the former Afghan government, and the Taliban — has also been reinvigorated since the Taliban’s takeover. After facing sustained pressure from the Taliban inside Afghanistan, some ISKP fighters crossed into Pakistan, particularly into Bajaur, where the group has since carried out several high-profile attacks.\n\nThe release of this year’s Global Terrorism Index (GTI) by the Institute for Economics and Peace think-tank coincided with an attempted hijacking of the Jaffer Express passenger train in Balochistan by BLA militants in March, an incident that drew international attention.\n\nAccording to the GTI, Pakistan is now ranked as the world’s second most terrorism-affected country, after Burkina Faso, a name unfamiliar to many Pakistanis. The report also highlighted a troubling reality: three Pakistani militant groups, the TTP, the BLA and the ISKP, are among the world’s 10 deadliest terrorist organisations, posing a formidable challenge to Pakistan’s counterterrorism strategy.\n\nFindings from the GTI, corroborated by statistics from law enforcement agencies and other security research organisations, indicate that Pakistan has witnessed a sharp escalation in terrorism since the Taliban’s takeover of Afghanistan in 2021. In the years since, the country has faced a renewed wave of attacks, including suicide bombings, targeted assassinations, and complex assaults on military installations, political gatherings and mosques.\n\nRESURGENCE OF MILITANT GROUPS\n\nUntil 2020, militant outfits such as the TTP and the Hafiz Gul Bahadur group were under sustained pressure from multiple fronts. Pakistan’s large-scale counterterrorism campaigns, including Operation Zarb-i-Azb launched in 2014, inflicted heavy losses on their ranks. Internal divisions further weakened these groups, while US drone strikes eliminated much of their senior leadership. By that period, many TTP factions had either gone dormant or dispersed into Afghanistan’s eastern provinces, including Khost, Kunar and Nangarhar.\n\nIn Balochistan, too, attacks by the BLA and other major separatist organisations had declined, due to a persistent security crackdown and internal splintering.\n\nHowever, the US-Taliban peace talks in Doha and the subsequent American withdrawal from Afghanistan breathed new life into Pakistani militant groups, particularly the TTP. The anticipation of a Taliban victory triggered a wave of reunifications among previously fragmented TTP factions.\n\nBy mid-2020, several key splinters, including those aligned with al-Qaeda, had rejoined under the leadership of TTP chief Mufti Noor Wali. In internal communications, Wali praised the Afghan Taliban’s unity and urged Pakistani jihadist groups to follow suit, reportedly telling his commanders: “The jihad in Pakistan will not succeed until all mujahideen unite under one flag, as our Afghan brothers have done.”\n\nThe Taliban’s return to full power in August 2021 was a watershed moment for militant ideologues across the region. For the TTP, it was both an inspiration and a validation of their long-term strategy.\n\nSince then, Pakistan has seen a sharp resurgence in insurgent violence. In 2024, terrorist attacks rose 70 percent from the previous year, reaching 521 incidents. These claimed 852 lives, a 23 percent increase in fatalities, according to the Pak Institute for Peace Studies. The surge marks the fourth consecutive year of escalating attacks on security forces and related casualties since 2021.\n\n“PERMISSIVE ENVIRONMENT” IN AFGHANISTAN\n\nThe Pakistani military recently claimed it had killed 47 militants in two separate raids, as they attempted to infiltrate from Afghanistan into Balochistan’s Zhob district, one of the deadliest cross-border clashes in recent months. While the military provided few details, it identified the militants as belonging to Fitna al-Khwarij, a term coined by the military leadership for the TTP and other Islamist militant groups.\n\n“While the US may have ended its presence, it left behind an unstable Afghanistan, making it a sanctuary for regional militant groups,” a senior security official in Islamabad tells me. “Whether it is ideological confidence, access to abandoned US weaponry, or physical sanctuaries, these groups are receiving active support or passive facilitation from the Taliban administration in Kabul.”\n\nA recent report by the UN Security Council’s Analytical Support and Sanctions Monitoring Team echoed these concerns. It noted that the TTP, operating in a “permissive environment” in Afghanistan, now fields around 6,000 fighters and has acquired advanced weaponry, significantly enhancing its operational capabilities with substantial logistical and tactical support from the de facto Afghan authorities.\n\nMuhammad Feyyaz, a Lahore-based academic specialising in terrorism studies, describes the Taliban’s return as “costly” for Pakistan. “Before the takeover, Pakistan faced no existential threat from Afghanistan. Now, Taliban-ruled Afghanistan poses exactly that,” he says. He said that the Taliban administration is actively backing the TTP’s efforts to regain Pakistan’s tribal belt as part of a larger vision for a transnational Islamic emirate.\n\nWhile Pakistan’s military demonstrated during Operation Zarb-i-Azb that it could inflict severe damage on militant networks, the security environment of today is fundamentally different, more fragmented, more complex, and far less conducive to decisive action. The political, security, and economic realities of post-2021 Pakistan are inextricably linked to the dramatic shifts in Afghanistan following the Taliban’s return to power.\n\nPakistan has not been able to mount an effective counterterrorism response against TTP, the Hafiz Gul Bahadur faction and other groups due to the US exit from Afghanistan, fractured relations with the Taliban, divergent postures on the TTP and the growing state-society gap in the areas along with Afghanistan-Pakistan border regions, according to Abdul Basit, an expert at the S. Rajaratnam School of International Studies in Singapore.\n\nPOLITICAL CHAOS, FRACTURED CONSENSUS\n\nIn recent weeks, KP Chief Minister Ali Amin Gandapur has been navigating turbulent political waters. Meeting with jirga leaders from the former tribal districts, he encountered a unified stance against any new military operation and the mass displacement it could trigger. Tribal elders instead proposed a broad-based, empowered jirga, including federal and provincial representatives, elders and key stakeholders, to open dialogue directly with the Taliban administration in Kabul.\n\nGandapur also faces resistance from within his own party. From jail, Pakistan Tehreek-i-Insaf (PTI) chairman Imran Khan has warned against authorising military action in KP, particularly in the merged tribal districts. The party’s stance is explicit: no renewed operations on home soil.\n\nThis is a sharp contrast to 2014, when the Karachi airport attack and the Army Public School (APS) massacre forged an unprecedented national consensus behind Operation Zarb-i-Azb. Political parties, civil society and the media stood united.\n\nToday, however, major political parties, including PTI, Jamiat Ulema-i-Islam (JUI-F) and the Awami National Party (ANP), openly oppose a new offensive, warning of mass displacement and social disruption. Grassroots peace campaigns in KP are already rallying public resistance, underscoring that, without political consensus, the state’s ability to act decisively will remain limited. Since 2008, residents have endured multiple operations under different names, yet neither peace has returned nor terrorism has been eradicated, local activists complain.\n\nCROSS-BORDER SANCTUARIES\n\nA decade ago, the TTP was weakened by internal divisions, defections to the ISKP and the loss of senior leaders to US drone strikes. Today, the picture is starkly different. Since the Taliban’s takeover of Kabul in August 2021, the TTP has consolidated its splinter factions, absorbing smaller outfits linked to al-Qaeda and sectarian militancy.\n\n“They’ve now dispersed across Pakistan, while securing hideouts in Afghanistan,” a senior Peshawar-based law enforcement official says. “The Taliban regime not only shelters them but also arms them with modern weapons and night-vision gear abandoned by US forces.” This level of support marks a significant shift from the previous Afghan government of Ashraf Ghani, which had at times cooperated with Islamabad to capture senior TTP leaders, such as Maulvi Faqir Muhammad of Bajaur.\n\nThe Taliban administration’s release of hundreds of imprisoned TTP fighters from Afghan jails has revitalised the insurgency, allowing the group to regroup, rearm and conduct operations with heightened sophistication, according to officials.\n\nAdding to the complexity is the emergence of a new jihadist alliance, Ittehadul Mujahideen Pakistan (IMP), comprised of the Hafiz Gul Bahadur faction, Lashkar-i-Islam, and Inqilab-i-Islami Pakistan. Since its formation, the IMP has conducted numerous attacks against Pakistani police and armed forces, primarily in southern KP. The alliance has also expressed its intention to expand operations into other provinces, including Punjab.\n\nThe overall conflict has also seen a growing use of drones by both militant groups and state security forces, tactics that have, tragically, increased civilian casualties, including children.\n\nECONOMIC CONSTRAINTS, REDUCED US SUPPORT\n\nPakistan now confronts the challenge of counterterrorism in an environment devoid of the robust external support it enjoyed a decade ago. In 2014, political stability, relative economic health, and American assistance, including funding, intelligence sharing, and targeted drone strikes, played a decisive role in degrading TTP capabilities.\n\nToday, the economic situation is far bleaker. Mounting debt and fiscal instability have left fewer resources for intelligence gathering, advanced technology procurement, and the deployment of specialised manpower, all crucial to effective counterterrorism operations.\n\nAccording to Basit, “The US exit from Afghanistan, which had provided intelligence and financial assistance while also restricting TTP and other groups’ movements into Afghanistan, altered regional dynamics.”\n\nThere are signs of renewed, albeit limited, US cooperation. Washington recently acknowledged Pakistan’s role in capturing a regional ISKP leader linked to the 2021 Kabul airport attack that killed American troops. Chief of Army Staff Field Marshal Asim Munir’s two visits within just one and a half months to Washington underscore Islamabad’s efforts to re-engage with the US security establishment.\n\nOn August 11, the U.S. administration designated the BLA and its suicide bomber unit, the Majeed Brigade, as foreign terrorist organizations.\n\nHowever, Basit warns that it will be nowhere near the coordination we witnessed during the war on terror or the pre-2021 era.\n\n“During that time, it was a US-led, Pakistan-assisted counterterrorism template. Now it is a Pakistan-led, US-enabled counterterrorism equation, where Washington will provide technical support, training and intelligence assistance, and some specialised counterterrorism equipment,” he adds. “But, there will be no funding made available to Pakistan.”\n\nHe says that counterterrorism is no more a top priority for the US; it is a tactical concern, and the Munir-Trump bromance will unlock limited, tactical and transactional cooperation on counterterrorism.\n\nBETWEEN BROTHERHOOD AND BLOWBACK\n\n“It’s easy for Pakistan to demand the expulsion of muhajireen from Afghanistan,” says Qari Jamaluddin, a mid-ranking official in the Taliban administration, using the term to refer to Pakistani militants who sought refuge in Afghanistan after Pakistan launched Operation Zarb-i-Azb in 2014. “But such demands do not align with the jihadist worldview, nor with the principles of Islamic or Pashtun brotherhood.”\n\nWe met in Kabul on a cold evening in late 2023. I had first known Jamaluddin during his Karachi days. A staunch loyalist of the Taliban’s first regime, his family fled to Pakistan following the 2001 US invasion. In exile, he attended a madressah [religious school] and ran a cloth shop, but his conviction in the Taliban’s eventual return never faltered. “It was only a matter of time,” he would often say.\n\nShortly after Kabul fell in August 2021, Islamabad pressed the Taliban leadership to stop the TTP from launching attacks inside Pakistan. The effort failed. Instead, the Taliban urged Islamabad to address the TTP’s so-called “grievances” and offered to mediate peace talks, a proposal that exposed the depth of their reluctance to act against former battlefield allies. Talks began but quickly collapsed, leading to renewed violence.\n\nOfficially, the Taliban administration denies harbouring foreign militants and frames Pakistani concerns as internal political matters. Yet their counterterrorism policy remains selective: while actively targeting the ISKP, they tolerate the TTP. The Taliban refrain from labelling the TTP as terrorists, viewing them instead as ideological kin and historical comrades-in-arms.\n\nJamaluddin characterises Islamabad’s support for the Taliban as strictly transactional. “Pakistan backed us to counter Indian influence but, at the same time, it handed over our leaders to the Americans. We endured it because every insurgency needs sanctuaries in a neighbouring country.”\n\nIn Pakistan, the Taliban once found an enabling ecosystem across segments of society that allowed them to reorganise and mount a lethal insurgency from around 2003 onward. Without that support, Jamaluddin acknowledges, the Taliban’s rise to power would have been far more difficult.\n\n“It was not the Pakistani state, but the TTP, Pakistani religious activists and madressah teachers that stood unwaveringly with the Taliban,” he says. “They fought and died for us while being hunted by US drones in North Waziristan.”\n\nMany Taliban leaders and experts argue that the reluctance to confront the TTP runs deeper than politics. “The relationship between the Taliban and the TTP is built upon shared ideological, historical, and cultural bonds,” says Jabbar Durrani, an Afghan researcher based in Britain. “This connection extends beyond the top leadership to include their rank-and-file members, who often maintain close personal and operational ties.”\n\nFormer-Afghan refugee minister Khalilur Rehman Haqqani, later assassinated in an ISKP attack in December 2024, recounted in a 2023 TV interview how TTP founder Baitullah Mehsud once captured dozens of Pakistani security personnel to secure the release of Taliban prisoners, including Haqqani himself. For many Taliban leaders, such episodes are enduring reminders of shared sacrifice.\n\nThis history reinforces the perception among the Taliban’s ranks in Afghanistan that cutting ties with the TTP would be both ungrateful and dangerous. “Any heavy-handed move against the TTP,” warns Durrani, “could trigger internal dissent and drive their fighters into the arms of ISKP, already locked in a bitter conflict with the Afghan Taliban.”\n\nPAKISTAN’S RESPONSE\n\nFrustrated by a surge in terrorist attacks, Pakistan has adopted a mix of hard and soft power tactics to pressure the Taliban administration in Kabul into acting against the TTP.\n\nSince 2022, the Pakistani military has carried out at least three airstrikes in eastern Afghanistan, the most significant occurring in December 2024, when jets targeted suspected Pakistani militant hideouts in Paktika province.\n\nIn parallel, Islamabad has sought to exert economic and demographic pressure. Since September 2023, it has expelled over one million undocumented Afghans, imposed a strict visa regime at the previously open Chaman border crossing, and tightened Afghan transit trade. These measures, which drew condemnation from UN agencies and human rights organisations, have disrupted bilateral trade and restricted Afghanistan’s access to essential imports.\n\nWhile Pakistan’s Interior Ministry defended the expulsions as a “sovereign right to regulate illegal foreign nationals”, the timing suggested a calculated move to increase pressure on Kabul.\n\nIS PAKISTAN’S AFGHAN POLICY A FAILURE?\n\n“Whether it was the Soviet invasion of Afghanistan in 1979 or the US-led intervention in 2001, Pakistan could not remain neutral,” a senior military official remarks when asked if the country’s Afghan policy has failed, as many critics contend. “Our geographic location has never afforded us the luxury of detachment. Proximity to conflict zones involving global powers has historically required us to take sides, always to safeguard national interests,” he adds.\n\nPakistan’s longstanding policy toward Afghanistan has been a subject of intense debate, often viewed by critics as a series of miscalculations. Yet, officials in Islamabad defend their approach as a necessary response to a complex geopolitical landscape, driven by the country’s unique geographic position. The Taliban’s refusal to act against anti-Pakistan militants now exposes the limits of Islamabad’s longstanding reliance on non-state actors.\n\nFrom arming the Afghan mujahideen against the Soviet Union in the 1980s to supporting the Taliban’s rise in 1996, and even after its ouster in 2001, Pakistan has often viewed Afghanistan less as a sovereign neighbour and more as “strategic depth.” Critics contend this policy has produced severe blowback, fuelling militancy, straining border relations and deepening Pakistan’s diplomatic isolation.\n\nToday, after four years of the Taliban’s rule, Pakistan is attempting a delicate balancing act. While it extended swift recognition to the Taliban regime in 1996, its response to the Taliban’s return in August 2021 has been far more cautious. Islamabad has not formally recognised the new government but has granted it de facto recognition, allowing ambassadorial work to continue. This measured approach reflects lessons learned from the international censure that followed its early recognition in the 1990s.\n\nIslamabad is now advocating for an “inclusive” political settlement in Afghanistan, a position it shares with other regional powers such as China, Russia and Iran. This stance, which emphasises incorporating diverse ethnic and political factions, marks a strategic shift away from an over-reliance on any single group, such as the Taliban, and highlights Pakistan’s effort to align its policy with international consensus.\n\nThe future of Pakistan’s Afghan policy hinges on whether this new approach can navigate the intricate dynamics of internal security, regional rivalries and the push for international legitimacy.\n\nA TASTE OF RESOLVE\n\nThe resurgence of militant groups such as the TTP and Baloch separatists has emerged as Pakistan’s most pressing security challenge in years. The threat is no longer confined to the country’s peripheries, but is steadily encroaching inland.\n\nIn Punjab’s Bhakkar district, authorities have warned government employees to avoid neighbouring areas of KP, amid credible kidnapping threats. In Balochistan, the suspension of internet services until August 31 underscores the severity of the separatist threat and the daily disruption it inflicts on residents.\n\nFour years of the Taliban’s rule in Afghanistan have not led to regional stability but have instead fuelled a complex web of security, political and economic challenges for Pakistan. A stark and uncomfortable comparison arises: while the Taliban, with limited resources, has managed to maintain internal control and weaken ISKP, Pakistan, despite its vast and sophisticated security infrastructure, continues to struggle with resurgent militancy.\n\nThis disparity compels an honest and critical reassessment of Pakistan’s security doctrine. The question is whether the tools and strategies that served Pakistan for decades are still effective against a fundamentally changed, more fragmented and more complex threat.\n\nWith violence escalating in KP, Islamabad may soon be forced to abandon limited, intelligence-led crackdowns in favour of sustained, large-scale military campaigns. For many, ongoing peace talks between local jirgas and the TTP serve a dual purpose: proving that all peaceful avenues have been exhausted and building public support for stronger action.\n\nYet, success will not be measured by force alone. Rebuilding public trust, demonstrating decisive gains and avoiding the cycles of the past will be critical. The path Pakistan chooses in the coming months will not only determine the fate of this insurgent wave. It will shape the country’s security trajectory for years to come.\n\nThe writer is a journalist and researcher whose work has appeared in Dawn, The New York Times and other publications, and has worked for various policy institutes. He can be reached at zeea.rehman@gmail.com\n\nPublished in Dawn, EOS, August 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a1361e35e04.jpg",
  "retrievedAt": "2025-08-26T07:41:26.518Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931382",
  "dateList": "2025-01-14",
  "date_published": "2025-08-17T01:57:02.000Z"
}
