{
  "title": "Aurangzeb eyes joint ventures, secondary listings in Hong Kong: report - Business - DAWN.COM",
  "author": null,
  "content": "Finance Minister Muhammad Aurangzeb has said that Pakistan was looking to explore more joint ventures with Hong Kong and secondary listings for its firms in the city.\n\nThe minister made the remarks during an exclusive interview with the South China Morning Post on Monday, during a two-day visit to attend the Asian Financial Forum 2025.\n\nAurangzeb’s remarks came ahead of his meeting with Hong Kong’s Chief Executive John Lee Ka-chiu. He highlighted that he would express his interest to the city leader about the possibility of having a delegation from Hong Kong visit Pakistan soon to “identify areas for closer collaboration”.\n\nFurthermore, he said exploring opportunities for Pakistani companies to list in Hong Kong would be a high priority during his meeting with the chief executive.\n\n“If there is an opportunity for companies out of Pakistan, as joint ventures with local companies, to come in and do primary and secondary listings in the Hong Kong stock exchange, for instance, I think it can be a real win-win, not only in terms of the investment that we expect back in Pakistan, but also outward investment,” he said.\n\nAccording to the report, Aurangzeb said that Pakistani companies and banks had traditionally opted for secondary listings on the London Stock Exchange, noting that local firms had not been aware of Hong Kong’s reputation for international capital raising.\n\n“I would say that Hong Kong can certainly do more in promoting itself as a destination for companies to raise capital,” he added.\n\nEarlier, Aurangzeb had also said that Pakistan was preparing to launch yuan-denominated bonds (panda bonds) this year to shore up its finances — with the country planning to raise $200 million to $250m from Chinese investors over the next six to nine months.\n\nPakistan is now prioritising Gulf countries for foreign investment, while aiming to unlock greater trade potential with China, Bangladesh, Japan, South Korea, Singapore, Indonesia, Malaysia and Iran. It has also signalled a willingness to normalise trade relations with India under specific conditions.\n\nThe International Monetary Fund (IMF) executive board approved a three-year, $7 billion aid package deal for the country in September to enable the country to “cement macroeconomic stability and create conditions for stronger, more inclusive and resilient growth”.\n\nIn July, global rating agency Fitch also upgraded Pakistan’s long-term foreign-currency issuer default rating (IDR) to CCC+ from CCC on the back of the country’s deal, while Standard and Poor (S&P) maintained its rating of CCC+.\n\nIn the interview, Aurangzeb said he hoped to encourage Financial Secretary Paul Chan Mo-po and city leader Lee to start a dialogue and send delegations to his country, so they could learn more about sectors that could bring benefits to Hong Kong.\n\n“Seeing is believing, that is the only way,” he said. “So I want to make a request to the chief executive to see if he can send a delegation … this is a start and hopefully during the course of this year, we can make progress on this front.”\n\nFurthermore, Aurangzeb stressed security remained a “big priority” for his country and he wanted to assure investors, including those from mainland China and Hong Kong, that the issue was being addressed at the “highest level”.\n\nSecurity has remained a concern for Chinese investors. A bombing in October last year near Karachi’s airport, which killed two Chinese engineers returning to work on a project after a holiday in Thailand, was the latest in a string of high-profile attacks on Beijing’s interests in Pakistan.\n\nAurangzeb added that he had always encouraged people to visit Pakistan, so they could see what conditions were really like for themselves.\n\n“My view would be ‘come and have a look’ and see what is actually the situation on the ground,” he said.\n\n“We are having international conferences, we have people visiting us, we had a number of dignitaries visiting us from various countries. We have the president of Indonesia arriving in Pakistan for a three-day visit with his whole investment team towards the end of the month.”\n\nHe added: “I do think there is a security issue, but not to the extent that you do not feel safe to travel to Pakistan.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/14112032b932b91.jpg",
  "retrievedAt": "2025-08-26T07:40:44.699Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885121/aurangzeb-eyes-joint-ventures-secondary-listings-in-hong-kong-report",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T06:53:38.000Z"
}
