{
  "title": "Sierra Leone declares public health emergency over mpox - World - DAWN.COM",
  "author": null,
  "content": "Sierra Leone declared a public health emergency on Monday to combat mpox, announcing it was stepping up surveillance at its borders after confirming two cases of the deadly viral disease.\n\n“The confirmation of two cases of mpox in the country has prompted immediate action as mandated by the public health act,” Health Minister Austin Demby told reporters in Freetown.\n\n“On behalf of the government of Sierra Leone, I am declaring a public health emergency.”\n\nLast week Sierra Leone reported its first confirmed case of mpox since the world’s highest alert level for the disease was raised last year.\n\nA second case has since been confirmed after a 21-year-old man showed symptoms on January 6, the National Public Health Agency said on social media Monday.\n\nThe public health emergency “allows us to act immediately to mobilise the resources needed to contain the disease, prevent further spread and provide care to those affected,” the minister said.\n\nDemby also announced increased border surveillance and testing, as well as the launch of a national awareness campaign.\n\nHe added that Sierra Leone’s medical system was ready to respond to cases, pointing to experience gained during the Ebola and Covid-19 outbreaks.\n\n“We urge all citizens to remain calm, stay informed and report any suspected cases promptly to healthcare authorities,” Demby said.\n\nMpox is caused by a virus from the same family as smallpox, manifesting in a high fever and skin lesions, called vesicles.\n\nFirst identified in the Democratic Republic of Congo in 1970, the disease had generally been confined to a dozen African countries but began to spread more widely in 2022, reaching developed countries where the virus had never previously circulated.\n\nThe World Health Organisation (WHO) declared its highest level of alert in 2024. Sierra Leone was one of the countries hardest hit by Ebola, which ravaged west Africa a decade ago in an epidemic killing some 4,000 people, including nearly seven per cent of health workers, between 2014 and 2016.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:40:40.240Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885155/sierra-leone-declares-public-health-emergency-over-mpox",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T13:12:22.000Z"
}
