{
  "title": "Officials fear LA fire will take ‘dangerous turn’ today - World - DAWN.COM",
  "author": null,
  "content": "LOS ANGELES: Firefighters were battling massive wildfires on Monday that have ravaged Los Angeles and killed 24 people, with officials warning of incoming dangerous winds that could whip up the blazes further.\n\nThe fires ripped through the second-largest city in the United States for the seventh day, reducing whole communities to scorched rubble and leaving thousands without homes.\n\nMassive firefighting efforts have staunched the spread of the Palisades Fire, which was looming toward upscale Brentwood and the densely populated San Fernando Valley.\n\nBut conditions are set to dramatically worsen, with “extreme fire behaviour and life-threatening conditions” over the coming days.\n\nFrustrated evacuees told they can’t return home before Thursday\n\nWinds up to 110 kilometres per hour mean a “particularly dangerous situation” will occur on Tuesday, said National Weather Service meteorologist Rose Schoenfeld.\n\nThose gusts could fan flames and whip up embers from existing burn zones into new areas, firefighters warned.\n\nA fire department official in Los Angeles said his department had received new water trucks and firefighters from far afield and was primed to face the renewed threat.\n\nAsked whether hydrants could run dry again, as they did during the initial outbreak of fires last week, Mayor Karen Bass replied: “I believe the city is prepared.”\n\nThere was frustration for evacuees who were told they would not be returning home until Thursday when winds subside.\n\nSome have queued for hours in the hope of getting back to homes they fled to pick up medication or a change of clothes.\n\nBut Sheriff Robert Luna said on Sunday escorts into those areas were being suspended because of the winds and dangerous conditions among the wreckage, as well as the need to retrieve victims’ bodies.\n\nTeams with cadaver dogs were carrying out grid searches with the grim expectation that the confirmed death toll would rise.\n\nSeveral more arrests of looters were made, including one burglar who had dressed as a firefighter to steal from homes.\n\nNighttime curfews in evacuated zones have been extended and additional National Guard resources have been requested.\n\nA fire in Palisades, an upscale neighbourhood, has consumed 23,700 acres and was just 13 per cent contained.\n\nVideo footage showed “fire tornadoes”, red-hot spirals that occur when a blaze is so intense it creates its own weather system.\n\nBut containment of the 14,000-acre fire in Eaton, a neighbourhood in Altadena, had improved, with 27 per cent of its perimeter controlled.\n\nThe medical examiner of Los Angeles county published a list of fatalities without giving details of any identities. Eight of the dead were found in the Palisades fire zone, and 16 in the Eaton zone, the document said.\n\nThe sudden rush of people needing somewhere to live has posed a growing problem for the city, with reports of illegal price gouging from opportunistic landlords.\n\nCalifornia Governor Gavin Newsom vowed the city would rebuild, saying there would be a “Marshall plan” _ a reference to the US support that put Europe back on its feet after World War II.\n\n“We already have a team looking at reimagining LA 2.0,” he said.\n\nPublished in Dawn, January 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67859f41bc42e.gif",
  "retrievedAt": "2025-10-12T00:50:51.631Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885019/officials-fear-la-fire-will-take-dangerous-turn-today",
  "dateList": "2025-01-14",
  "date_published": "2025-01-14T02:13:57.000Z"
}
