{
  "title": "Unity imperative to tackle issues confronting Muslim Ummah: NA Speaker",
  "link": "https://www.app.com.pk/national/unity-imperative-to-tackle-issues-confronting-muslim-ummah-na-speaker/",
  "date_published": "2021-02-10T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP):National Assembly Speaker Asad Qaiser Wednesday said that unity and harmony among Muslim countries was the need of the hour for the solution of the problems presently faced by the Ummah.\nHe said that growing Islamophobia was a great challenge for which a joint strategy should be devised to counter it.\nHe expressed these views in a meeting with Chairman of the International Relations Development Forum United Kingdom Mr. Toaha Qureshi. Issues of mutual interest including inter-religious harmony and inter-Muslim unity were discussed during the meeting. Leading religious scholar Qari Hanif Jalandhari was also present in the meeting.\nThe Speaker said that Muslim Ummah should adopt a joint strategy to tackle growing trend of Islamophobia in the world. He said that freedom of expression does not means harming others. In past, there had been negative propaganda against Pakistan and Islam.\nHe said that Pakistan had raised its voice against the growing trend of Islamophobia at the global level.\nReferring to the report published against Pakistan, the Speaker directed that the matter should be brought up for discussion in the National Assembly Standing Committee on Foreign Affairs. He said that the matter would also be taken up with the Speaker of the House of Commons.\nHe stressed the need to formulate a joint strategy by Ummah to counter the trend of Islamophobia and added. The Speaker said that role of religious scholars was of immense importance in that regard.\nThe Speaker said that all possible steps were being taken by the present government of Pakistan to improve the living standards of the common man. He said that Pakistan had been facing economic difficulties for the last three decades. He said that development and prosperity in Pakistan would be possible only with political and economic stability in the country.\nChairman International Relations Development Forum Touha Qureshi apprised the Speaker of the National Assembly about the training of prisoners and the provision of housing for the homeless by his foundation. He said that Ulema and religious scholars could play an important role in spreading the true message of Islam in order to eradicate Islamophobia.\nHe said that political and economic stability in the country was essential to curb the growing trend of polarization in the society",
  "retrievedAt": "2025-08-11T20:20:37.748Z"
}
