{
  "title": "Boycott is no solution to political differences: Pervaiz Elahi",
  "link": "https://www.app.com.pk/national/boycott-is-no-solution-to-political-differences-pervaiz-elahi/",
  "date_published": "2021-02-10T16:10:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 10 (APP): Acting Governor Punjab Chaudhry Pervaiz Elahi on Wednesday said that political dialogue in the parliament helped overcome differences and boycott was not the remedy to grievances between the government and the opposition.\nAddressing journalists at oath-taking ceremony of Punjab Assembly Press Gallery Committee at Governor’s House here, he said parliament was the right platform to achieve consensus on all issues, adding that the opposition parties should take part in the upcoming Senate elections as well as the Local Government (LG) polls.\nPervaiz Elahi recalled that Pakistan Peoples Party (PPP) boycotted the 1985 general elections and the boycott cost PPP dearly on the political front, adding that the PPP leadership regretted the political mistake later.\nHailing decision of the opposition to contest upcoming Senate elections, Chaudhry Pervaiz Elahi said politics was not about winning or losing but staying within the political system, adding that all political parties should take active part in the mainstream politics for the good of democracy.\n“Parliament is the only viable forum to resolve people’s problems besides the political issues,” he said and added that only the path of the parliament should be adopted to address political and public grievances.\nHe said power was not permanent and the politicians should work for the public welfare so that they were remembered and loved by their constituents.\nHe regretted the fact that former chief minister Shehbaz Sharif always put a spanner in the development works started by the PML-Q government of Chaudhry Pervaiz Elahi, adding that Shehbaz Sharif stopped funds of the public welfare projects in Gujrat and other districts as a political revenge.\nAcknowledging the importance of parliamentary reporting in a democracy, he said the parliamentary reporters were vital to the public-welfare legislation in the parliament, adding that the journalists helped the politicians in right decisions in the parliament.\nParliament and the reporters must work in close liaison with each in order to ensure public-friendly legislation and highlight the mistakes of the treasury and the opposition, he added.\nPervaiz Elahi said new building of the Punjab Assembly would be completed by the end of February 2021, adding that Prime Minister Imran Khan would inaugurate the new assembly chambers during the next month.\nHe assured the journalists that he would personally ask Chief Minister Sardar Usman Buzdar to allocate land for Phase II of the Journalist Housing Society in the provincial metropolis.\nEarlier, Acting Governor Chaudhry Pervaiz Elahi administerd oath to the newly elected President Ayaz Shuja and Secretary Shahzad Malik of the Punjab Assmebly Press Gallery Committee.\nSecretary Punjab Assembly Muhammad Khan Bhatti, DG Parliamentary Affairs Anayatullah Lak, President Lahore Press Club Arshad Ansari, and a large number of journalists attended the ceremony.",
  "retrievedAt": "2025-08-11T20:20:35.236Z"
}
