{
  "title": "Nine train accidents occur in last two years",
  "link": "https://www.app.com.pk/national/nine-train-accidents-occur-in-last-two-years/",
  "date_published": "2021-02-10T08:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 10 (APP):Around nine major accidents of passenger and goods trains have been occurred on Pakistan Railways’ entire network across the country in the last two years.\nOut of the total nine mishaps, five accidents had occurred in 2019 and four accidents took place in 2020, an official in the Ministry of Railways told APP.\nIn these accidents, around 153 persons died 179 sustained injuries while the financial damage incurred on the Pakistan Railways was Rs57.708 million.\nIn order to control the accidents, several steps have also been taken including up-gradation of unmanned and vulnerable railway level crossings across the country in collaboration with respective provincial governments, he said.\nHe said road surface of all level crossings was being improved together with improved warning boards and provision of reliable communication (VHF radio) between ground staff and locomotives crew.\nThe Directorate of Public Relations has produced video messages for circulations over social media to inform the public about the dangers associated with railway crossings, he said.\nHe said that all level crossings on Main Line-I (Karachi to Peshawar) would be eliminated by providing under passes and flyovers under China-Pak Economic Corridor (CPEC).\nThe official said timely refresher courses and safety seminars were also being arranged to enhance the professional knowledge of the staff and auto train protection system was also underway to minimize such accidents as this system applies brake automatically if the divers of train fail to respond red signal.\nHe said a professional knowledge testing schedule after every six months for drivers particularly of Multan, Lahore Sukkur, and Karachi divisions should be tested in working of auto block signaling.\nThe joint certificate of this effect would be issued by the Divisional Signal Engineer and Divisional Mechanical Engineer certifying competency of driver especially regarding the knowledge of auto block signaling. The certificate would remain in possession of the drivers, he informed.\nHe said that regular inspections in accordance with prescribed standards and quota were conducted by the officers and officials of Pakistan Railways to maintain safety standards. This process was being constantly monitored at appropriate levels.\nThe official said the office of the Chief Commercial Manager has issued instructions regarding the safety of passengers and to streamline the procedures for the safe travelling of special groups.\nThe instructions have been circulated to all operating divisions and to Railway Police in which special precautionary measures were directed to be adopted regarding checking of luggage and passengers by walk through gates and scanners and ensuring that no dangerous, explosive and inflammable articles would be carried, he said.",
  "retrievedAt": "2025-08-11T20:20:45.616Z"
}
