{
  "title": "JazzCash, Ignite partner to facilitate freelancers",
  "link": "https://www.app.com.pk/business/jazzcash-ignite-partner-to-facilitate-freelancers/",
  "date_published": "2020-07-23T01:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP):JazzCash, Pakistan’s leading mobile account, has partnered with Ignite to facilitate the Ministry of Information Technology & Telecom’s (MOITT) national level training program, Digiskills.pk.\nIgnite CEO Syed Junaid Imam and Mobilink Microfinance Bank President Ghazanfar Azzam signed the MoU under the presence of Federal Minister for IT & Telecom, Syed Amin Ul Haque, Secretary IT & Telecom, Shoaib Ahmad Siddiqui and JazzCash CEO Erwan Gelebart.\nThis partnership enables DigiSkills.pk freelancers to transfer money from their Payoneer accounts into their JazzCash Mobile Account in real time and at the best exchange rates. In addition to this, these freelancers can also register their Payoneer Account from the JazzCash App, eliminating the need for commercial bank accounts.\nOn the occasion Syed Amin Ul Haque said, “With the current COVID outbreak and the overall economic situation, it is all the more relevant that through this partnership, the youth is provided the right enablers to take up freelancing from the comfort of their homes and become self-reliant.”\nHe said that this agreement will be helpful in facilitating the freelancers. This partnership between Ministry of IT’s attached department Ignite and JazzCash will be helpful in increasing IT exports, he added.\nHe said that IT exports in previous financial year reached US $1.11 billion which is exemplary. Now Ministry of IT has set the target of taking IT exports up to US $5 billion in next three years.\nHe said that Ministry of IT is providing different platforms to Pakistani youth for their access to international markets.\n“We realized that international payment retrieval was a painstakingly slow process for freelancers. JazzCash saw an opportunity to use its expertise to introduce convenience and speed up the entire process for the freelance community at DigiSkills.pk,” stated Erwan Gelebart, as he emphasized upon JazzCash’s support for freelancers across the country.\nIn line with its vision to promote freelancing in Pakistan, JazzCash, through this partnership, aims to complete the loop for the freelance ecosystem. Both entities aim to serve the freelance community by raising awareness, equipping them with the right skills, and providing smooth payment options to aspiring freelancing.\nIn his opening remarks, Syed Junaid Imam said, “DigiSkills.pk has imparted 1.2 million trainings to the youth that have enabled them to earn the livelihood and support their academic pursuits. Getting the money in your account is the name of the game hence this partnership will inspire the youth learn online skills to generate the much-needed foreign exchange for their families and the country.”\nA National Level Training Program, DigiSkills.pk was launched by MOITT through Ignite. The program aims to develop key specialized skills besides imparting knowledge about various freelancing and other employment and entrepreneurial opportunities available internationally and locally.\nThe program free of cost 10 online courses including Freelancing, Digital Marketing, Search Engine Optimization, Graphic Design, Digital Literacy, e-Commerce Management, Creative Writing, QuickBooks, AutoCAD and Word-Press.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:31:58.565Z"
}
