{
  "title": "Pakistan’s diplomatic offensive on Kashmir has isolated India: Shibli",
  "link": "https://www.app.com.pk/national/pakistans-diplomatic-offensive-on-kashmir-has-isolated-india-shibli/",
  "date_published": "2020-07-23T04:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP): Federal Minister for Information and Broadcasting Senator Shibli Faraz said on Thursday Pakistan’s diplomatic offensive on the Kashmir issue had isolated India as the entire world was standing with it on the issue of human rights abuses in the Indian Occupied Jammu and Kashmir Prime Minister Imran Khan had forcefully advocating the cause of Kashmir and exposed the real face of Indian Prime Minister Narendra Modi, he said while speaking here at a special Mushaira organized by Radio Pakistan.\nShibli Faraz said on August 5 last year India had rescinding the limited autonomy to Kashmiris by abolishing two articles of its constitution and imposed the worst type of curfew and lockdown turning the state into an open-air prison. He said Modi could not crush the freedom struggle of valiant Kashmiris, who were giving unprecedented sacrifices for their cause. India could not dampen their spirits by martyring the Kashmiri leaders like Burhan Wani and muzzle their voice by use of brutal force.  India, he said, could also no longer befool the world community by stage managed attacks on its armed forces like Pulwama.\nSenator Shibli said Radio Pakistan had always become the voice of oppressed Kashmiris by highlighting their struggle for right to self-determination. It projected the courage, steadfastness and determination of the valiant Kashmiris in the face of naked Indian state terrorism, which was multiplied after the hardliner Modi came into power in New Delhi.\nThe minister said at a time when India had banned the entry of media in the occupied territory, the Pakistan Broadcasting Corporation had become the voice of Kashmiris by highlighting the Indian atrocities being committed in the occupied Jammu and Kashmir.\nThe PBC, he said, would air special programmes from July 26 to August 5 to mark the first anniversary of the unilateral Indian decision to usurp all the fundamental rights of Kashmir people.\nShibili Faraz said the Radio Pakistan was the custodian of strong professional traditions of airing authentic news without indulging in sensationalism. Keeping in mind the geo strategic situation of the region, all resources would be provided to make it a strong organization and its past glory would be revived, he added.  Earlier, PBC Director General Ambreen Jan welcomed the audience at Mehdi Hassan Auditorium in Radio Pakistan. She said the Radio Pakistan with its biggest media network in the country was playing a vital role at national and international level. It had some 250,000 followers on facebook and 600,000 on twitter.\nLIVE #APPNews : Federal Minister for Information and Broadcasting Senator Shibli Faraz addressing a ceremony #Islamabad https://t.co/8l8xMZbn34\n— APP  #StayHomeSaveLives  (@appcsocialmedia) July 23, 2020\nThe Mehfil-e-Mushaira was organized by the PBC to express solidarity with the oppressed people of Indian Occupied Jammu and Kashmir (IOJK). Eminent poets, including Anwar Masood, Mahboob Zafar, Dr Munawar Hashmi, Fakhira Batool, Hassan Abass Raza, Junaid Azar, Rakhshanda Naveed and Shazia Akbar recited their poetry highlighting the freedom struggle and human rights violations in IOJK.  Principal Information Officer Shahera Shahid and Kashmiri Hurriyat leader Abdul Hameed Loan also attended the Mushaira.",
  "retrievedAt": "2025-08-11T19:31:50.120Z"
}
