{
  "title": "Pakistan committed to implement ICJ verdict on Kulbhushan Jadhav: FO",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-implement-icj-verdict-on-kulbhushan-jadhav-fo/",
  "date_published": "2020-07-23T04:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP):Pakistan on Thursday said it was committed to implement the July 17 verdict of International Court of Justice (ICJ) regarding the provision of consular access to Indian spy Kulbhushan Jadhav. Foreign Office Spokesperson Ayesha Farooqi, at a weekly press briefing, said Pakistan, in the spirit of upholding the ICJ decision, had twice granted consular access to Kulbhushan Jadhav on September 2, 2019 and July16, besides offering India a third time access to its national.  She also mentioned that the government had moved the Islamabad High Court to appoint a lawyer for Kulbhushan Jadhav in a bid to give him a fair chance of trial following his death sentence.\nServing Indian Navy Commander Jadhav was arrested from Balochistan in March 2016 and was given death sentence by Pakistan’s Field General Court Marshal on charges of terrorism and espionage on April 10, 2017. The ICJ, in its final verdict, had rejected India’s plea to acquit, release and return Jadhav, however, it asked Pakistan for an ‘effective review and reconsideration’ of the death sentence. Farooqui said India, so far, had not yet responded to Pakistan’s offer of third consular access and also a meeting between Jadhav and his father. “We hope that rather than using its usual dilatory and obfuscatory tactics, India will cooperate with Pakistan’s courts to give effect to the judgment of the ICJ,” she added.\nThe FO spokesperson said President-elect of the United Nations General Assembly Ambassador Volkan Bozkir was arriving in Islamabad on Monday. On situation in the Indian Occupied Jammu and Kashmir, Aisha Farooqui said 353 days had passed since the illegal and unilateral actions taken by India to annex an internationally recognized disputed territory.  Brutalization and subjugation of innocent people in the Indian occupied Jammu and Kashmir, she said, continued unabated along with fake encounters, and phony cordon and search operations. She referred to frequent ceasefire violations on the Line of Control and the Working Boundary by the Indian troops targeting civilian populated areas with artillery fire, heavy-caliber mortars and automatic weapons.\nThis year alone, she added, India had committed 1732 ceasefire violations resulting in martyrdom of 14 civilians and serious injuries to 134 others. She said Pakistan had always urged that independent human rights observers and international media be permitted to get a first hand view of the situation in the IOJK and along the LoC. “Pakistan has consistently called upon India to allow UN Military Observer Group for India and Pakistan (UNMOGIP) access into IOJK in order to fully discharge its mandate given by the UN Security Council,” she said. The FO spokesperson said for its part, Pakistan always provided unfettered access not only to the UNMOGIP but to the international media and independent observers.\nShe mentioned that on Wednesday, once again representatives from diverse international media outlets visited the LoC in the Chrikot Sector and witnessed for themselves the destruction and injuries caused to the civilians along the LoC. “They also witnessed the multi-layered surveillance and defence system along the LoC erected by India, which completely negates the hollow allegations by senior most military and civilian officials of India and the constant propaganda by the Indian media against Pakistan on cross-border infiltration and the so-called launch pads,” she added.\nShe said Pakistan’s position on Palestine was principled and remained the same. The FO spokesperson said Pakistan had invited Afghanistan’s Chief Executive Officer Abdullah Abdullah for a visit, the details of which would be released soon. She mentioned that on July 14, Afghan National Forces fired shells towards Pakistan and also shelled Mohmand and Bajaur again on July 15, causing loss of lives. She said Pakistan was not using artillery and mortars on the Afghan border as a matter of policy. Farooqui said Pakistan supported Libya’s national integrity and sovereignty and desired resolution of the issue in accordance with the UN resolutions.\nOn repatriation of stranded Pakistanis, the spokesperson said 250,000 nationals had been brought back home during the coronavirus pandemic.  To a question on repatriation of students from Gilgit Baltistan stranded in China and desiring to return via Khunjerab Pass, she said details had been shared with the authorities concerned to find out the best possible way to facilitate their return to Pakistan.",
  "retrievedAt": "2025-08-11T19:31:54.069Z"
}
