{
  "title": "Former Mayor of Rugby Dr James Shera condoles demise of Sister Ruth Lewis",
  "link": "https://www.app.com.pk/national/former-mayor-of-rugby-dr-james-shera-condoles-demise-of-sister-ruth-lewis/",
  "date_published": "2020-07-22T23:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP): Former Mayor of Rugby, Councilor Dr James Shera Thursday condoled the sad demise of Sister Ruth Lewis and urged President Dr Arif Alvi to award her a posthumous Sitara-e- Imtiaz, for her services she had rendered for humanity and people of Pakistan. Dr James Shera, in a statement, said Sister Ruth Lewis, affectionately known as ‘Mother of Pakistan’s Special Children’, had dedicated more than 50 years of her life to the children with special needs, who were vulnerable and needed a helping hand – a hand of love and kindness. Sister Ruth fulfilled that requirement with her care and passion.\nShe joined Dar Ul Sakoon, a care home for physically challenged children, in February 1969. She worked there ever since, tirelessly serving her beloved children. Not content with those herculean efforts, she also established homes for socially deprived children in different parts of the country. True to her convictions, she refused to abandon her dearly beloved children when COVID 19 spread among them in the Centre, and in the end succumbed to the deadly virus.\nFormer Mayor of Rugby #DrJamesShera condoles demise of Sister #RuthLewis #APPNews https://t.co/wrfZTMK2RJ via Associated Press Of Pakistan\n— APP  #StayHomeSaveLives  (@appcsocialmedia) July 23, 2020\nDr Shera said, “This is a great loss for the country. Sister Ruth Lewis served the people of Pakistan selflessly regardless of race, colour or religion. The Pakistani Christian diaspora appeals to President Dr Arif Alvi to award her a posthumous Sitara-e- Imtiaz, for her services to humanity and people of Pakistan. “We have noted with appreciation the High Commissioner for Pakistan Mr Nafees Zakaria’s message of condolence on Sister Ruth’s loss and befitting tribute he paid to her.”  The statement was endorsed by the UK Pakistani Christian leaders including Dr Peter David, Dr Noshaba Khiljee, Councillor Morris Johns, Advocate Qamar Shams, Mr Qamar Rafique, Reverend John Bosco and Mr Michael Massey.",
  "retrievedAt": "2025-08-11T19:31:58.033Z"
}
