{
  "title": "CPEC not for any exploitation but to enable Pakistan improve its economy: President",
  "link": "https://www.app.com.pk/national/cpec-not-for-any-exploitation-but-to-enable-pakistan-improve-its-economy-president/",
  "date_published": "2020-07-23T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP): President Dr Arif Alvi Thursday while rubbishing the criticism on China Pakistan Economic Corridor (CPEC), said that the multifaceted gigantic project was not neither meant for exploitation nor overburdening Pakistani’s economy, rather it would enable the country to strengthen its economic position. “There has been criticism that it overburdens our economy. I assure the participants that it does not overburden our economy but improve the ability for the people of Pakistan to improve their economy. So it doesn’t overburden,” the president said addressing a webinar on “CPEC and its Impact on the Region” hosted by Karachi Council on Foreign Relations in partnership with Pathfinder Group and Martin Dow Limited.\n#CPEC not for any exploitation but to enable #Pakistan improve its #economy: President #APPNews @PresOfPakistan @MoIB_Official @ArifAlvi https://t.co/CbC2lY5bsq via Associated Press Of Pakistan\n— APP  #StayHomeSaveLives  (@appcsocialmedia) July 23, 2020\nThe webinar was also addressed by Chinese Ambassador in Pakistan Yao Jing and Chairman CPEC Authority Lt Gen (Retd) Asim Saleem Bajwa, besides Chairman of Karachi Council on Foreign Relations Ikram Sehgal. The president hoped that the CPEC would generate economic opportunities in all sectors including hotelling, banking, finance, insurance, warehousing, food processing, assembly of appliances which would ultimately create jobs for youth and thus help alleviate poverty.\nHe told the participants that Pakistan had made lot of progress on CPEC projects which could further expand keeping in view the future needs related to power generation, road and rail infrastructure and fiber optic network to further enhance communications.\nHe said enhancement of trade links was inevitable for peace as wars always disrupted trade activities. While lauding the Belt and Road Initiative (BRI) of China, the president said the movement of goods from one country to the other always created economic opportunities in the less developed countries.\nHe said once peace was restored in Afghanistan, trade might take place between Gwadar and Afghanistan as Gwadar was the crown jewel of the CPEC. He also mentioned the ongoing and future development projects in Gwadar including Gwadar Expressway, 300MW power plant, Gwadar International Airport and Water Desalination Plant. He said under $62 billion CPEC, 19 projects had been completed, 28 were in different phases of implementation and 41 were in pipeline.\nHighlighting the completed and near completion CPEC projects including motorways, the president said building communication infrastructure was vital to strengthen the trade links.  However, he said Pakistan’s initial focus was on coping with the energy needs as nine power projects were complete to provide 5,300MW of electricity with three more in progress. He said the construction of Diamer Bhasha Dam was also in process that would create 15,000 jobs and 4,500 MW of electricity that would be the biggest water storage dam after Tarbella because Pakistan was well aware of its water conservation needs.\nThe president lauded the Chinese cooperation and guidance to Pakistan to help fight the COVID-19 pandemic and recalled his visit to China during the peak of the coronavirus outbreak.\nHe lauded the government’s approach of smart lockdown to let the industries and businesses work for averting any worst economic scenario, particularly for the low-income group. Even Pakistan had also opened up the construction sector, he added. He said with the situation improving, Pakistan was looking at enhancing its exports as well as tourism activity that had faced a setback, like every sector, due to the COVID-19 pandemic.\nHe believed that once the CPEC projects came to fruition including those of power, health and communications infrastructure, those would ultimately help the country steer its people out of poverty, just like China. The tax havens created in Gwadar and elsewhere would help alleviate poverty.\nHe also called for enhanced Pak-China cooperation in the fields of information technology and software development to create more job openings for the skilled youth. The president hoped that the CPEC would also ensure bringing about peace in the region. He told the participants that while dealing with CPEC development projects, Pakistan was well aware of the Indian interference and belligerence from Indian on borders as well as inside occupied Kashmir and Afghanistan. “We are cognizant of that. There is interference to discourage CPEC work in Balochistan. But we are aware of it and in good political communication with our friends in China we will be able to overcome that,” he remarked.",
  "retrievedAt": "2025-08-11T19:31:49.997Z"
}
