{
  "title": "Pakistan, China resolve to take post-COVID 19 economic recovery measures",
  "link": "https://www.app.com.pk/national/pakistan-china-resolve-to-take-post-covid-19-economic-recovery-measures/",
  "date_published": "2020-07-23T00:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP):Pakistan and China on Thursday held Second Round of Bilateral Political Consultations wherein the two sides reaffirmed their resolve to take relevant measures to support economic recovery in the aftermath of COVID-19 and to deepen bilateral co-operation in the health sector. The bilateral consultation was held between Foreign Secretary Sohail Mahmood and Chinese Vice-Foreign Minister Luo Zhaohui via video-link, a Foreign Office press release said.  During the consultations, a wide range of issues were discussed, including Pakistan-China bilateral ties, regional security situation, deepening co-operation in the wake of COVID-19, China Pakistan Economic Corridor (CPEC), and further solidifying bilateral economic cooperation.\nThe foreign secretary emphasized that Pakistan and China were ‘All-Weather Strategic Co-operative Partners’ and were committed to promote peace, development, and stability in the region based on the principles of respect for each other’s territorial integrity and sovereignty, win-win cooperation and shared development. He reaffirmed that Pakistan remained firmly committed to ‘One-China policy’ and fully supported China on its issues of core national interest, including Hong Kong, Taiwan, Tibet and Xinjiang. Supporting ‘One Country Two Systems’, Pakistan reiterated that affairs of Hong Kong were China’s internal matter.\nThe foreign secretary underscored that Pakistan was grateful to the government and people of China for extending solidarity and material support in the wake of spread of COVID-19 in the country.  He lauded China’s efforts in controlling and containing COVID-19 through rigorous and timely measures. He briefed that fatality rate and new cases of COVID-19 in Pakistan were declining due to the government’s policy of smart lockdown and implementation of standard operating procedures (SOPs). It was underlined that Pakistan was taking requisite steps to start trials of COVID-19 vaccine with China’s co-operation and expertise, and hoped that the vaccine would be soon made available as a “global public good”.\nThe foreign secretary emphasized that CPEC, a flagship project of BRI (Belt and Road Initiative), was a transformational project contributing positively to the national development and regional growth. CPEC had entered second phase and mega projects such as Azad Pattan and Kohala Energy projects would play a major role in deepening economic and commercial ties between Pakistan and China, and solidify Pakistan’s economic development. He underscored that regional security situation was perilous and underlined that India’s belligerent posture and aggressive actions were imperiling peace in the region.\nApart from committing egregious violations of human rights in Indian Occupied Jammu & Kashmir, India was seeking to change the demographic structure of the occupied territory, which was in violation of international law including the 4th Geneva Convention, he added.\nHe also briefed about the intensified ceasefire violations by India across the Line of Control and targeted killing of civilians, and underlined the importance of peaceful resolution of Jammu and Kashmir dispute in line with the United Nations Security Council resolutions.\nThe foreign secretary reaffirmed Pakistan’s consistent support and positive contribution to the Afghan peace and reconciliation process, and stressed that all Afghan sides should honour their respective commitments and seize the historic opportunity to work out an inclusive and comprehensive political settlement in Afghanistan. He expressed satisfaction over the close cooperation between Pakistan and China at multilateral fora, and emphasized to further deepen co-operation for regional peace and security.\nHe reiterated Pakistan’s resolve to continue to deepen and widen communication and exchanges at all levels to build China-Pakistan Community of Shared Future in the New Era.",
  "retrievedAt": "2025-08-11T19:31:58.912Z"
}
