{
  "article_id": "2025-09-06_e52410939a7a439d7ca3db7366608a15",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nazriya-pakistan-hosts-seminar-to-mark-eid-milad-un-nabipbuh/",
    "retrieved_at": "2025-09-19T16:20:53.480Z"
  },
  "metadata": {
    "title": "Nazriya Pakistan hosts seminar to mark Eid Milad-un-Nabi(PBUH)",
    "author": null,
    "date_published": "2025-09-06T18:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 479,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 06 (APP): Nazriya Pakistan, under its auspices, has hosted a seminar to commemorate Eid Milad-un-Nabi (PBUH)-the birth anniversary of the Holy Prophet Muhammad (SAWW). In his address, Council of Islamic Ideology Secretary and renowned scholar Dr. Hafiz Ikram-ul-Haq stated that the Holy Prophet Muhammad (SAWW), the last Prophet, was sent as a mercy to all worlds. \"His mercy encompasses everything, and he is a source of blessing not only for humans and animals but also for plants and inanimate objects,\" he remarked. Dr. Ikram-ul-Haq emphasized that the Prophet (PBUH) possessed the highest morals and the gentlest speech, and that no one could match his stature. He further explained that the life of the Prophet Muhammad (SAWW) had two significant phases: the Meccan and Medinan periods. During the Meccan phase, he lived as a citizen without authority, whereas in Medina, he was a ruler of various tribes. Despite this, even non-Muslims admired the exemplary character of the Prophet Muhammad (SAWW). Chairman of the Nazriya Pakistan Council, Mian Mohammad Javed, remarked that there was a vast difference between the personality of Quaid-e-Azam and the blessed personality of the Prophet (PBUH). He expressed gratitude to Allah for being born into the Ummah of the Last Prophet. Renowned writer and scholar Mahmooda Ghazia, the guest of honor, said that the entire life of the Holy Prophet (PBUH) is illuminated with selflessness, sacrifice, forgiveness, and unparalleled love. The Prophet never sought anything for himself but always sacrificed for others and showed immense compassion toward his Ummah. She described his Seerah as a perfect guide for all. Senior member of the Executive Council of the Nazriya Pakistan Council and author of several English books on spirituality, Major General (Retd.) Muhammad Tahir, said that every aspect of the Prophet's life was a mercy to humanity. Quoting Rumi, he noted that the Prophet considered purification of the heart and self-discipline the highest forms of excellence. Rumi saw the Prophet's Ascension (Mi'raj) as a symbol of the inner journey of love and enlightenment. According to Rumi, the essence of the Prophet's teachings is that a person attains closeness to Allah by annihilating the self and embracing love and selflessness. Famous poet and educationist Professor Sabin Younis said that the qualities of the Holy Prophet (PBUH) are as vast as an endless ocean-describable but never exhaustible. Poet and scholar Nusrat Yaab Nusrat congratulated the Nazriya Pakistan Council chairman and the entire team for organizing the blessed gathering. He said that the sacrifices of the Holy Prophet (PBUH) remind us not only to follow his Sunnah but also to convey his teachings to future generations. Renowned fiction writer and poet Farkhanda Shamim presented heartfelt naat poetry in praise of the Holy Prophet Muhammad (SAWW), earning great appreciation from the audience. Other scholars and intellectuals who spoke on the occasion included Syed Zaheer Gilani, Rifat Anjum, and Naeem Khalid.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}