{
  "article_id": "2025-09-06_3cff2ba8af0aec19cef1e120312c6a62",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sardar-yousaf-hails-scholars-pivotal-role-vows-unwavering-solidarity-with-palestine-kashmir/",
    "retrieved_at": "2025-09-19T16:21:22.819Z"
  },
  "metadata": {
    "title": "Sardar Yousaf hails scholars’ pivotal role, vows unwavering solidarity with Palestine, Kashmir",
    "author": null,
    "date_published": "2025-09-06T16:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 922,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, September 06 (APP):Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf on Saturday lauded the vital role of religious scholars and spiritual leaders in guiding the society towards reform and moral uplift. Addressing the International Seerat-un-Nabi Conference at the Convention Centre here, he expressed gratitude for being part of the Ummah of the Holy Prophet Muhammad (Peace Be Upon Him), Sardar Yousaf and stressed the teachings of Islam were universal and that Pakistan had always extended the invitation of peace and truth to non-Muslims as well. Highlighting the inclusion of children in the conference, he said their participation was aimed at their moral training and education. \"Our faith teaches us that Pakistan and Palestine are one,\" he remarked, while thanking the distinguished guests from Palestine, Bahrain, Egypt, and Bangladesh for their presence. The minister assured that the resolutions adopted at the conference would be fully implemented, reaffirming Pakistan's solidarity with the oppressed people of Palestine and Kashmir. He said the Muslim Ummah was like a single body, sharing each other's pains and challenges. Referring to global crises, he said Pakistan deeply felt the hardships faced by other Muslim nations. He said celebrations of the 1,500th birth anniversary of the Holy Prophet (Peace Be Upon Him) were being organized in line with the OIC resolution. Sardar Yousaf also underlined that the Ministry of Religious Affairs and Interfaith Harmony was actively working to counter incidents of blasphemy on social media, including disrespect towards the Holy Prophet (Peace Be Upon Him) and the Ahl-e-Bait (RA). He expressed the pride that this year, Eid Milad-un-Nabi (12th Rabi-ul-Awwal) coincided with Pakistan's Defence Day, terming it a matter of great fortune. Paying glowing tributes to the martyrs, he said Pakistan had achieved a historic victory in Marka-e-Haq (The Battle of Truth) which was acknowledged worldwide. He paid homage to the armed forces of Pakistan and Chief of Army Staff, Field Marshal Syed Asim Munir for their dynamic leadership in the Bunyan-ul-Marsoos operation, stressing that the nation stood united with the military, ready to make every sacrifice for the defense of the motherland. Meanwhile, Palestinian Supreme Judge and Advisor to the President on Religious and Islamic Affairs, Dr. Mahmoud Sidqi Abdul Rahman Al-Habbash said the hearts, souls, and faith of the people of Pakistan and Palestine are united. Addressing the conference, he stressed that Muslims across the world must collectively defend Masjid Al-Haram, Masjid Al-Aqsa, and Masjid An-Nabawi. He underscored sacred status of Masjid Al-Aqsa, recalling that it was the place where Prophet Muhammad (Peace Be Upon Him) was made the leader of all prophets and ascended to the heavens during the night of Miraj. He reminded that the Prophet (Peace Be Upon Him) was commanded to show patience against the polytheists in Makkah, while in Madinah, Allah ordered him to resist and struggle against oppression. \"In the same spirit, today we must stand united to defend our sanctities,\" he said. The Palestinian supreme judge lamented the immense suffering of Palestinians, noting that thousands have been martyred, while mosques, hospitals, and schools have been destroyed. \"Israel is not only targeting young men but also women, children, and the elderly,\" he said, vowing that Israel would ultimately fail in its designs. \"We will stand like a rock against Israeli aggression, and with the help of Allah, victory will be ours,\" he expressed hope. Quoting the Prophet (Peace Be Upon Him), Dr. Habbash said, \"The Muslims are like one body; when one limb hurts, the whole body feels the pain. Today, Al-Aqsa, and the people of Palestine are in pain, and the entire Muslim Ummah must share that pain.\" Also speaking at the conference, Bangladesh President's Adviser on Religious Affairs, A.F.M. Khalid Hussain, conveyed greetings from the people of Bangladesh to Pakistanis and all participants. He stressed the importance of responsibility in the age of social media, warning against spreading unverified information. \"Even Prophet Muhammad (Peace Be Upon Him) forbade the dissemination of unchecked reports,\" he said, adding that Islamic values leave no space for online abuse and indecency. Member of Bahrain's Shura Council and former Deputy Speaker, Dr. Adel Abdulrahman Almuawda lauded Pakistan's role in safeguarding Islamic values, describing the country as a fortress of Islam. In the conference, he highlighted the unparalleled character, conduct, and teachings of Prophet Muhammad (Peace Be Upon Him), noting that the Prophet connected humanity directly with the Creator. He said Pakistan was established in the name of Islam and remains unique in the world for its religious foundation. \"The mosques and seminaries of Pakistan are strongholds of Islam, and its green flag symbolizes the eternal reward awaiting believers in paradise,\" he remarked. Sheikh Almuawda urged Pakistani youth to embrace the life and teachings of Prophet Muhammad (Peace Be Upon Him) as a guiding principle for their lives. He also emphasized the pivotal role of modern media, calling on journalists and communicators to use it effectively for the promotion of Islamic values and teachings. Federal Minister for Poverty Alleviation and Social Safety Syed Imran Ahmad Shah, Chairman of the Council of Islamic Ideology Dr. Muhammad Raghib Hussain Naeemi, Chairman of the Central Ruet-e-Hilal Committee Maulana Syed Abdul Khabir Azad, Vice President of the Shia Ulema Council Allama Arif Wahidi, Chairman of the Pakistan Ulema Council Maulana Hafiz Muhammad Tahir Mahmood Ashrafi, and General Secretary of Wifaq-ul-Madaris Al-Arabia Maulana Muhammad Hanif Jalandhari were among those who addressed the conference. The event drew a wide audience, including diplomats, religious leaders from different faiths, scholars, seminary students, and members of the public from diverse backgrounds.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}