{
  "article_id": "2025-09-06_6e00ecd45329edbec6654fe38ba66261",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/eid-milad-un-nabi-pbuh-observed-with-religious-fervour/",
    "retrieved_at": "2025-09-19T16:20:50.359Z"
  },
  "metadata": {
    "title": "Eid Milad-un-Nabi (PBUH) observed with religious fervour",
    "author": null,
    "date_published": "2025-09-06T21:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 1263,
    "reading_time_minutes": 7
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 6 (APP):Eid Milad-un-Nabi (PBUH) observed across Pakistan on Saturday with religious fervour and solemnity, with nationwide prayers, processions, and special events marking 12th Rabial ul Awwal. Special prayers were offered after Fajr for the unity of the Muslim Ummah and the country's progress and prosperity. Eid Milad-un-Nabi (PBUH) was observed in the provincial capital of Balochistan Saturday with deep religious fervor and solemnity. Prayers, processions, and special events marked the 12th of Rabi-ul-Awwal, commemorating the 1500th blessed birth anniversary of Holy Prophet Muhammad (PBUH). The main procession commenced from Mian Ismail Mosque on Toghi Road, led by renowned scholar Allama Shehzad Attari along with other respected Ulema. To ensure the safety of participants, the procession was closely monitored through Safe City cameras, and approximately 4,000 personnel from the Police, Frontier Corps (FC), and Balochistan Constabulary (BC) were deployed across the city. The auspicious occasion of Eid Milad-un-Nabi, marking the 1500th anniversary of the birth of Prophet Muhammad (PBUH), was celebrated with great fervor and devotion in Sukkur. A grand procession was taken out, attracting millions of devotees who participated with great zeal and enthusiasm, illuminating the entire city with the light of love for the Prophet (PBUH). The auspicious occasion of Eid Milad-un-Nabi,marking the 1500th anniversary of the birth of Prophet Muhammad (PBUH), was celebrated with great fervor and devotion in Sargodha. According to a spokesperson, a total of 18 procession including a grand procession was taken out, attracting millions of devotees who participated with great zeal and enthusiasm, illuminating the entire city with the light of love for the Prophet (PBUH). The procession began at Commissioner Jahanzeb Khan Awan office site and culminated at the Shaheen Chowk where notable scholars, including Commissioner Sargodha and Deputy Commissioner(DC) Sargodha Muhammad Wasim, and ulma, shared the virtues and teachings of the Prophet (PBUH), filling the hearts of participants with faith and love. The central procession of Eid Milad-un-Nabi was held in Haripur with religious fervor and devotion, concluding peacefully at Darul Uloom Islamia Rehmania. The main procession set out from Darul Uloom Islamia Rehmania in the morning and, after passing through Circular Road (West), Main Bazaar, and GT Road, returned to its starting point. Citizens from Haripur city, adjoining villages, and suburban areas joined the procession in large numbers, making it a citywide celebration. To mark 1500th birthday of Prophet Muhammad (Peace Be Upon Him), Eid Milad-un-Nabi (Peace Be Upon Him) was celebrated across Bahawalpur with traditional zeal and devotion. According to a spokesperson, large processions and gatherings were held in different parts of the city, where participants recited naats and paid homage to the Holy Prophet (PBUH). Mosques, streets and buildings were illuminated, while banners and green flags adorned the city. The main congregations were taken out from Milad Chowk and Serani Masjid. Both congregations concluded at Gulzar-e-Sadiq where a large Milad gathering was held.Markazi Milad Committee had arranged cake-cutting ceremony at Clock Tower Chowk to celebrate 1500th Jashan-Eid-e-Milad-un-Nabi (PBUH) with great religious fervor and devotion in Faisalabad. Assistant Commissioner (AC) city Adil Umar along with members of Milad Committee cut the ceremonial cake while former MPA Mian Tahir Jamil,Munir Ahmed Noorani and Al-hajj Sheikh Zaheer were also present on the occasion. Speaking on the occasion, AC city Adil Umar said that true success in this world and the hereafter lies in adhering to the Sunnah while deep love for the Last Prophet (PBUH) was an integral part of the faith. He said that Seerat-un-Nabi (PBUH) teaches patience, tolerance, peace and love. Governor Khyber Pakhtunkhwa, Faisal Karim Kundi extended heartfelt greetings to Muslims around the world, the people of Pakistan, and especially the patriotic citizens of the province on the auspicious occasion of 12th Rabi-ul-Awwal. In his message, the Governor said the birth of the Holy Prophet Muhammad (PBUH), the last Messenger of Allah, was not only a blessing for the Muslim Ummah but also a source of mercy, guidance, and salvation for all of humanity. Sindh Chief Minister Syed Murad Ali Shah has said that the life of Holy Prophet Mohammad (PBUH) is a beacon of light for all of us. While talking to media persons in Malir, he said that today, 12 Rabi-ul-Awwal, is the birth anniversary of our beloved Holy Prophet Hazrat Muhammad (PBUH). He said that Eid Milad-un-Nabi (PBUH) is being celebrated all over the world including Sindh. Shah said, 'I participated in a procession in Malir today in connection with Eid Milad-un-Nabi (PBUH).' He prayed to Allah Almighty to grant us the ability to follow the teachings of his Prophet Mohammad (PBUH). Interior Minister Mohsin Naqvi, while extending heartfelt greetings to the entire nation and the Muslim Ummah on the joyous occasion of Eid Milad-un-Nabi said that the 12th of Rabi-ul-Awwal is the sacred day when the magnificent personality was born about whom Allah said: \"And We have sent you as a mercy for the entire worlds.\" Interior Minister said that with the blessed birth of the Holy Prophet the world witnessed the face of light, darkness was defeated, and humanity discovered the true meaning of justice and mercy. The birth of Hazart Mustafa was that radiant moment when the gates of the heavens opened, blessings descended upon the earth, and every particle of the universe was illuminated. He stated that as Sadiq (the Truthful) and Amin (the Trustworthy), the Prophet lit the lamp of honesty and integrity in the merciless environment of Makkah. Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf on Saturday lauded the vital role of religious scholars and spiritual leaders in guiding the society towards reform and moral uplift. Addressing the International Seerat-un-Nabi Conference at the Convention Centre here, he expressed gratitude for being part of the Ummah of the Holy Prophet Muhammad (Peace Be Upon Him), Sardar Yousaf and stressed the teachings of Islam were universal and that Pakistan had always extended the invitation of peace and truth to non-Muslims as well. Highlighting the inclusion of children in the conference, he said their participation was aimed at their moral training and education. \"Our faith teaches us that Pakistan and Palestine are one,\" he remarked, while thanking the distinguished guests from Palestine, Bahrain, Egypt, and Bangladesh for their presence. In a heartfelt message on the occasion of Eid Milad-un-Nabi (PBUH) on Saturday, Chairman Prime Minister's Youth Programme, Rana Mashhood Ahmad Khan, extended warm congratulations to the entire Pakistani nation. He emphasized the significance of the Holy Prophet Muhammad's (PBUH) life, which was a beacon of guidance, mercy and love for all humanity. The Chairman highlighted the importance of education in the teachings of the Holy Prophet (SAW), citing his saying, \"Seeking knowledge is obligatory upon every Muslim.\" Chairperson Benazir Income Support Programme (BISP) Senator Rubina Khalid extended heartfelt greetings to the Muslim Ummah on the auspicious occasion of Eid Milad-un-Nabi, emphasizing that the teachings of the Holy Prophet (Peace Be Upon Him) serve as a beacon of guidance and the only path to salvation. Punjab Home Secretary Dr Ahmad Javed Qazi on Saturday visited the central control room of the Home Department in Lahore to review the overall law and order situation and security arrangements across the province on the occasion of Eid Milad-un-Nabi (PBUH). According to a spokesperson,the central control room was actively monitoring 2,306 processions and 601 Milad gatherings across Punjab through a comprehensive surveillance system. During his visit,the secretary established contact via video conference with control rooms in various districts of the province to review on-ground arrangements. Dr Ahmad Javed Qazi said that Eid Milad-un-Nabi (PBUH) was being observed throughout Punjab with deep religious devotion and respect.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}