{
  "article_id": "2025-09-06_f0f0017fd17f05ad18659a93e51bbc29",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/domestic/home-secretary-reviews-security-of-eid-milad-un-nabi-processions-gatherings/",
    "retrieved_at": "2025-09-06T10:58:21.954Z"
  },
  "metadata": {
    "title": "Home secretary reviews security of Eid Milad-un-Nabi processions, gatherings",
    "author": null,
    "date_published": "2025-09-06T10:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 217,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Sep 06 (APP):Punjab Home Secretary Dr. Ahmad Javed Qazi on Saturday visited the central control room of the Home Department in Lahore to review the overall law and order situation and security arrangements across the province on the occasion of Eid Milad-un-Nabi (PBUH). According to a spokesperson,the central control room was actively monitoring 2,306 processions and 601 Milad gatherings across Punjab through a comprehensive surveillance system. During his visit,the secretary established contact via video conference with control rooms in various districts of the province to review on-ground arrangements. Dr.Ahmad Javed Qazi said that Eid Milad-un-Nabi (PBUH) was being observed throughout Punjab with deep religious devotion and respect. He added that the day was a source of joy for the entire Muslim Ummah and was being celebrated with mutual unity and harmony. The secretary emphasized the need for strict compliance with the rules and regulations issued regarding both Eid Milad-un-Nabi and Defence Day,underscoring that maintaining peace and order was the foremost priority of the provincial government. He said that all major processions across Punjab are being closely monitored through surveillance cameras, while security personnel will remain deployed at all venues until the conclusion of processions and gatherings. Special Secretary Home Fazal-ur-Rehman,Additional Secretary Police, Additional Secretary Internal Security, Director Civil Defence and other senior officials were also present.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}