{
  "article_id": "2025-09-06_b632102b0fd3483a3bf7ea16a39787d0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/spirit-of-1965-war-still-inspires-nation-says-defence-minister/",
    "retrieved_at": "2025-09-19T16:20:50.867Z"
  },
  "metadata": {
    "title": "Spirit of 1965 war still inspires nation, says defence minister",
    "author": null,
    "date_published": "2025-09-06T20:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 374,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "SIALKOT, Sep 06 (APP):The Defence of Pakistan Day was observed with traditional zeal, enthusiasm and national spirit here on Saturday. The main Hilal-e-Istiqlal flag-hoisting ceremony was held at the historic Sialkot Fort, where Federal Minister for Defence Khawaja Muhammad Asif performed the ceremonial changing of the national flag. Station Commander Brigadier Owais Tauqeer, Prime Minister's Coordinator for Overseas Pakistanis Hafiz Shahid Ghug, Members of Provincial Assembly Muhammad Manshaullah Butt, Chaudhry Faisal Ikram, Chaudhry Tariq Subhani, Deputy Commissioner Saba Asghar Ali, District Police Officer Faisal Shahzad, Administrator Municipal Corporation Abbas Zulqarnain, Additional Deputy Commissioner General Ayub Bukhari and Assistant Commissioner Khawaja Umair, along with a large number of civil and military officers, dignitaries and citizens, attended the ceremony. On this occasion, contingents of police, Rescue 1122 and civil defence volunteers saluted the national flag. Addressing the gathering, Defence Minister Khawaja Muhammad Asif said that incidents like Operation Bunyan-Al-Marsoos breathe new life into the national spirit. He recalled that even after 60 years of the 1965 war, the memorable victory continues to inspire the nation when the people of Sialkot and the Pakistan Army humbled an enemy many times greater in strength. He added that the Army is still sacrificing lives for the defence of the beloved homeland and that the spirit of martyrdom remains at its peak, making Pakistan invincible. Khawaja Muhammad Asif further said that the Pakistan Army is not only the guardian of the country's geographical borders but is also fulfilling its responsibilities on diplomatic and economic fronts in an effective manner. He said the day serves as a renewal of the pledge to put aside personal interests and work for Pakistan's development and prosperity. Station Commander Brigadier Owais Tauqeer, Deputy Commissioner Saba Asghar Ali and DPO Faisal Shahzad also addressed the ceremony, saying that the brave people of Sialkot have always stood shoulder to shoulder with the Pakistan Army and that the city's sacrifices earned it the honor of **Hilal-e-Istiqlal**. They added that this fertile land produced eminent sons like Allama Iqbal, Faiz Ahmed Faiz and Asghar Sodai, who raised Pakistan's name on the global stage. The ceremony concluded with the cutting of a cake to mark Eid Milad-un-Nabi (PBUH) and special prayers were offered for peace and prosperity of the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}