{
  "article_id": "2025-09-06_e389546b2e9f35ff47e6f1c1bd0ee6a9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/on-pm-instructions-muqam-distributes-relief-cheques-among-flood-victims-of-swat/",
    "retrieved_at": "2025-09-19T16:20:53.460Z"
  },
  "metadata": {
    "title": "On PM instructions: Muqam distributes relief cheques among flood victims of Swat",
    "author": null,
    "date_published": "2025-09-06T17:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 740,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "SWAT, Sep 06 (APP): Federal Minister for Kashmir Affairs, Gilgit-Baltistan, and SAFRON, Engineer Amir Muqam here Saturday distributed relief cheques among flood victims of Swat. The cheques distribution ceremony was held at the District Council Hall in Mingora, on the instructions of Prime Minister Muhammad Shahbaz Sharif. Special Assistant to the Prime Minister Talha Burki, Commissioner Malakand Division Abid Khan Wazir, Deputy Commissioner Swat Saleem Jan Marwat, senior officials of the National Disaster Management Authority (NDMA), CEO Water and Sanitation Company Swat, Additional Deputy Commissioner Relief Swat, Executive Engineer Operations PESCO Swat, local administration, elected representatives, members of civil society, and a large number of affected families attended. Addressing the ceremony, Federal Minister Engineer Amir Muqam said that, on the special instructions of Prime Minister Muhammad Shahbaz Sharif, relief cheques were distributed yesterday in Buner and today in Swat among the families of those martyred in the floods. Engineer Amir Muqam further said that five districts in Khyber Pakhtunkhwa were badly affected by the August floods. \"I was present in Swat on the day the flood struck and has been visiting the affected areas from day one to personally oversee and monitor the situation\". He mentioned witnessing the losses with his own eyes on the first day and said the entire nation is grieved by the human and material losses caused by the flash floods. The Federal Minister for Kashmir Affairs said that he is personally overseeing the relief and rehabilitation efforts from the federal government regarding the flood situation. He added that Prime Minister Shahbaz Sharif entrusted him with the responsibility to look after the affected people of Khyber Pakhtunkhwa and Gilgit-Baltistan. He further stated that from day one, the Prime Minister has closely monitored the flood-related damages and ongoing relief activities, staying continuously informed and directing relevant departments to restore electricity, gas, and roads on top priority basis. Engineer Amir Muqam said the federal government immediately restored electricity, gas, and NHA roads for traffic. He emphasized that helping flood victims is a shared responsibility, and everyone should contribute to it for the sake of Allah's pleasure. He noted that in difficult times, the people of Pakistan always unite, and during this flood too, welfare organizations, government institutions, and most importantly, the public came together to assist the victims wholeheartedly. Engineer Amir Muqam expressed his personal gratitude to the public, welfare organizations, and government departments for tirelessly helping the flood victims day and night. He emphasized that this support is not just for others, but for ourselves and our fellow citizens. Prime Minister Shahbaz Sharif personally visited Buner, expressed solidarity with the fllood victims, and not only assured full assistance but also provided practical support. Engineer Amir Muqam added that today's distribution of relief cheques by the federal government is evidence that the federal government stands with fllood victims and will continue to support them until full rehabilitation is achieved. The Federal Minister also mentioned that the Pakistan Army is playing a leading role in helping flood victims across the country. Field Marshal Hafiz Syed Asim Munir personally visited Buner and offered condolences to the flood victims. The Minister said that the uniformed personnel are working day and night in flood-affected districts across Khyber Pakhtunkhwa, Gilgit-Baltistan, Punjab, and other regions. The federal government, public, government departments, and welfare organizations will work together until complete rehabilitation of the affected people is achieved. In his address, Engineer Amir Muqam emphasized that the current government will not leave the people alone in this difficult time and will ensure relief reaches every family affected by the flood. He also highlighted that the government is not only providing immediate relief for natural disasters but is also rapidly continuing rehabilitation work in affected areas as part of long-term planning. On this occasion, the federal minister said that September 6 marked as Defense and Martyrs Day, is a memorable and inspiring chapter in our history, teaching us the lessons of sacrifice, courage, and national unity. The flood victims expressed their gratitude to the federal government and Engineer Amir Muqam upon receiving the relief cheques. Earlier, Commissioner Malakand Division, Deputy Commissioner Swat, and other senior officials warmly welcomed the federal minister. The leadership of PML-N Swat was also present, including District President Qawi Khan, General Secretary Abdul Karim Khan, Swat Division General Secretary and former provincial minister Muhammad Ali Shah, Provincial Deputy General Secretary Fazal Rahman Nono, Provincial Youth Organizer Irshad Ali Khan, and other party leaders.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}