{
  "title": "Caretaker govt nothing to do with rejection or acceptance of nomination papers: Solangi",
  "link": "https://www.app.com.pk/national/caretaker-govt-nothing-to-do-with-rejection-or-acceptance-of-nomination-papers-solangi/",
  "date_published": "2023-12-30T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 30 (APP): Caretaker Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Saturday categorically rejected the notion that the caretaker government had any involvement in either acceptance or rejection of the nomination papers of the aspiring candidates for the general election.\nThe caretaker government had nothing to do with the acceptance or rejection of nomination papers which was part of the constitutional process, the minister said while speaking in a Television (TV) talk show of the private media.\n“Only the Election Commission has authority to decide on election-related matters,” the minister stressed.\nHe said the caretaker government was committed to assist the Election Commission of Pakistan (ECP) in providing financial and administrative support to the electoral watchdog for the elections.\nSolangi said an amount of Rs17.4 billion had been released to the Election Commission of Pakistan in addition to Rs10 billion which was released earlier for holding elections.\nTo a question, he said the constitutional bodies had been working within their limits.\nThe PTI was a registered political party, he said, adding all political parties were being given due coverage on the national broadcasters in line with their editorial policy.\nHe said negotiations with Baloch protesters resulted in the release of all children and women in the first phase.\nIn the second phase, 163 male individuals were released, he said, adding the remaining 34 individuals were also freed in the third phase.\nHe said peaceful protest was the right of every citizen. However, blocking roads, entering restricted zones, attacking the police, and throwing stones were beyond the scope of a peaceful protest and were not permitted at any cost, he added.\nThe minister said the general elections would be held on February 8, 2024.",
  "retrievedAt": "2025-08-11T11:18:30.243Z"
}
