{
  "title": "120th Midshipmen, 28th SSC Parade held at Pakistan Naval Academy",
  "link": "https://www.app.com.pk/national/120th-midshipmen-28th-ssc-parade-held-at-pakistan-naval-academy/",
  "date_published": "2023-12-30T14:53:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 30 (APP): The Course Commissioning Parade of 120th Midshipmen and 28th Short Service Commission (SSC) was held here at the Pakistan Naval Academy (PNA) on Saturday.\nChief of the Naval Staff Admiral Naveed Ashraf graced the occasion as the Chief Guest. The commissioning contingent comprised 88 Midshipmen out of which 60 were from Pakistan, 01 from the Kingdom of Bahrain, and 27 from the Kingdom of Saudi Arabia along with 44 officers of SSC Course including 12 lady officers, a Pakistan Navy news release said.\nWhile emphasising on geo-strategic environment, the Chief of the Naval Staff asserted that peace and stability in South Asia will remain elusive unless the long-standing issue of Kashmir is resolved in accordance with the aspirations of its people and the UNSC resolutions.\nHe urged the international community to play its role in the cessation of human rights violations and atrocities in the illegally occupied Indian-held Jammu and Kashmir whose citizens must be allowed to exercise their right to self-determination.\nDuring his address, Naval Chief also emphasised the immediate need to end the sufferings in Gaza as indiscriminate use of force on Palestinian civilians is a gross violation of human rights and war crimes that must cease forthwith.\nHe further reiterated that Pakistan would continue its diplomatic, moral, and principled support to Palestinians and urged for a just, comprehensive, and enduring solution to the Palestinian question, in line with relevant UN resolutions.\nHe added that Pakistan looks forward to a stable and secure Afghanistan; which is key to regional integration, growth, and prosperity.\nThe Chief Guest felicitated the commissioning term and their parents. He commended the parents for instilling a spirit in their children to serve the nation, which ultimately led them to join this prestigious Service.\nHe also lauded the Pakistan Naval Academy for imparting quality training and expressed his hope that cadets from friendly countries trained at PNA will serve as our brand- ambassadors to enhance bonds of endearment and affinity.\nChief of the Naval Staff also advised the youth on a new dimension of warfare, which is the use of social media for disinformation, that has become an essential segment of fifth-generation warfare.\nLater, the Chief Guest gave away awards to the distinction holders. The prestigious Quaid-i-Azam Gold Medal was awarded to Lt Muhammad Talha Masood PN for his overall best performance. Midshipman Ayan Yameen claimed the coveted Sword of Honour, whereas Midshipman Sanaullah Safeer clinched the Academy’s Dirk. Officer Cadet Abdullah Waheed was awarded the Chairman Joint Chiefs of Staff Committee Gold Medal, Officer Cadet Sultan Abdulrahman Hamad Saleh Alrowaiei received the Chief of the Naval Staff Gold Medal while Commandant Gold Medal was awarded to Officer Cadet Asia Safdar from the Short Service Commission Course. Proficiency Banner was claimed by Fox’l Squadron.\nEarlier in his welcome address, Commandant Pakistan Naval Academy Commodore Muhammad Khalid highlighted the main characteristics of academic and professional training afforded to Pakistani as well as friendly countries cadets.\nThe parade was attended by senior civil, and military officials and parents of cadets.",
  "retrievedAt": "2025-08-11T11:18:31.263Z"
}
