{
  "title": "Islamabad police mobilize extensive measures for new year’s eve traffic management",
  "link": "https://www.app.com.pk/national/islamabad-police-mobilize-extensive-measures-for-new-years-eve-traffic-management/",
  "date_published": "2023-12-30T06:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 30 (APP):Islamabad Capital Police (Traffic Wing) have made an elaborate plan to ensure smooth traffic flow during celebrations of New Year night and to ensure public safety as well as curb traffic violations.\nUnder the guidance of Islamabad Capital City Police Officer (ICCPO), Dr Akbar Nasir Khan, Islamabad Capital Police is set to enforce strict measures against various traffic offences. These include wheeling, participation in car racing, and any activities that disrupt the flow of traffic. Special attention will be given to motorcyclists with heavy silencers, known for creating noise disturbances on the roads.\nOn the night of New Year’s Eve, a significant deployment of law enforcement personnel is planned. This includes SP Traffic, 4 DSPs, 22 inspectors, and 475 officers, including the specialized squads. These units will be stationed strategically across key roads, intersections, and areas prone to traffic violations.\nChief Traffic Officer Islamabad, Muhammad Sarfraz Virk, has issued an appeal to the citizens. He urged parents not to allow their children to engage in wheeling activities, particularly on motorbikes, emphasizing the importance of ensuring the safety of lives and property during the celebratory night.\nSpecial squads from the Islamabad Capital Police will conduct enhanced patrolling on vital roads and intersections. Checkpoints will be established to enforce traffic laws rigorously, creating an additional layer of security and deterrence against potential violations.\nChief Traffic Officer Muhammad Sarfraz Virk called for cooperation from all road users, encouraging them to adhere to lane discipline. He emphasized the significance of collective efforts in minimizing the risk of accidents during the New Year’s Eve celebrations.\nCapital Police is gearing up for a proactive approach to traffic management, ensuring a safe and secure environment for residents and visitors during the upcoming New Year’s Eve celebrations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:18:31.208Z"
}
