{
  "title": "Misbah Khar briefs Thai envoy on ISC",
  "author": null,
  "content": "ISLAMABAD, Sep 03 (APP): Ambassador and Advisor to the Chairman Senate, Misbah Khar, on Wednesday briefed the Ambassador of Thailand to Pakistan, Rongvudhi Virabutr, on the Inter-Parliamentary Speakers’ Conference (ISC).\nDuring the meeting, Ms. Khar said that the ISC currently comprised on 45 Speakers of national parliaments and that, in the recent elections held in Malaysia, Senate Chairman Yousuf Raza Gillani was unanimously elected as its first President.\nShe also extended a formal invitation to the Speaker of the Thai Parliament to attend the upcoming ISC session, scheduled for November 11–12, 2025, in Islamabad, under the theme Peace, Security and Development.\nThe discussion also touched on women’s leadership and empowerment.\nMs. Khar underlined Pakistan’s commitment to promoting women in decision-making roles, stressing that global platforms like the ISC can amplify women’s voices in parliamentary diplomacy.\nShe emphasised the need to encourage women to enter the workforce and contribute actively to society.\nThe Thai envoy welcomed the initiative and expressed support for efforts that enable women to assume leadership roles.\nIn response, Ms. Khar assured him of Pakistan’s full support in this shared objective, adding that the ISC must be used to highlight the voices of women—particularly those facing suppression—and to create sustainable opportunities for their livelihoods.\nShe further noted that the Senate of Pakistan has introduced legislation to strengthen women’s empowerment and ensure their meaningful participation in national development.\nAmbassador Virabutr affirmed his commitment to encouraging greater efforts toward advancing women’s leadership, while Ms. Khar reiterated her readiness to collaborate closely on initiatives that enhance parliamentary cooperation and gender equality.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:51:32.492Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/misbah-khar-briefs-thai-envoy-on-isc/",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T12:43:00.000Z"
}
