{
  "title": "Urban flooding likely in twin cities, Gujrat, Guranwala, Lahore in next 24 hour",
  "author": null,
  "content": "ISLAMABAD, Sep 03 (APP):The Federal Flood Commission (FFC) has said that urban flooding is expected in Islamabad, Rawalpindi, Gujrat, Gujranwala and Lahore during the next 24 hours.\nAccording to daily FFC report on Wednesday, a fresh exceptionally high flood wave is expected in River Chenab at Marala and Downstream from today while  exceptionally high flood will continue in river Sutlej at Ganda Singh Wala, owing to release from Indian reservoirs.\nSimilarly, River Chenab at Panjnad is expected to attain very high flood from Thursday to Friday 4 while River Indus at Guddu is expected to attain very high flood from 6th to 7th September 2025.\nCurrently, River Indus is flowing in medium flood at Guddu (Steady Condition), River Chenab is in very high flood in Marala- Khanki reach with rising trend.\nMoreover, River Ravi is also running in medium flood at Jassar with rising trend while river Sutlej is flowing in exceptionally high flood at Ganda Singh Wala (Steady Condition).\nTarbela Dam is full to its maximum conservation level (MCL) of 1550 feet. Mangla Reservoir stands at 1227.80 feet which is 14.20 feet below its MCL of 1242 feet.\nThe combined live storage of Tarbela, Chashma and Mangla reservoirs stands at 12.157 MAF, which is 91.30% of the total available live storage capacity of 13.316 MAF.\nFor the next 24 hours Flood Forecasting Division Lahore has predicted scattered hunderstorm/rain with isolated heavy falls over Islamabad and Punjab (Rawalpindi, Gujrat, Gujranwala, Lahore & Sahiwal Divisions) including upper catchments of Rivers Jhelum, Chenab, Ravi & Sutlej.\nIsolated thunderstorm/rain may also occur over Punjab (Sargodha, Faisalabad, Multan, DG Khan & Bahawalpur Divisions), Khyber Pakhtunkhwa (Peshawar, Kohat, Bannu & DI Khan Divisions) and Northeastern Balochistan during the said period.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-06T10:50:59.682Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/urban-flooding-likely-in-twin-cities-gujrat-guranwala-lahore-in-next-24-hour/",
  "dateList": "2025-09-03",
  "date_published": "2025-09-03T17:19:00.000Z"
}
