{
  "title": "NHA vows zero tolerance for corruption in drive for transparency",
  "author": null,
  "content": "ISLAMABAD, Jun 23 (APP): The Member Central Zone National Highway Authority (NHA) Iftikhar Sajid on Monday said that steps have to be taken on a war footing to make the performance of institutions transparent and corruption-free.\nAddressing a high-level seminar titled “Corruption-Free Pakistan,” he emphasized that rooting out corruption demands a collective commitment to honesty and accountability. He noted that sincere alignment with these values is essential to supporting the broader efforts of the National Accountability Bureau (NAB) in ensuring clean governance, said a press release.\nThe event, drew a significant gathering of senior NHA officials, general managers, and representatives from NAB. Muhammad Imran, Director Coordination at NHA, chaired the session, while Muhammad Waseem Director Legal NHA, Imran Sohail Director NAB, Rabia Ikram Deputy Director NAB, Atiya Azmat Additional Director NAB and Muhammad Imran Director Coordination NHA were among the other speakers.\nSpeakers underscored that in the present era, it is necessary to eradicate corruption so that government’s URAAN Pakistan mission can be turned into a reality and added that NAB Pakistan and NHA can jointly create awareness among the public, especially employees, about the eradication of corruption.\nThe speakers also highlighted the importance of embedding Islamic principles of integrity and justice in governance, believing that such values could help turn the long-standing dream of a corruption-free Pakistan into a shared national commitment.\nOn this occasion, souvenirs and shields were exchanged in the service of NHA officers and NAB guest officers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:21:54.514Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nha-vows-zero-tolerance-for-corruption-in-drive-for-transparency/",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T16:49:00.000Z"
}
