{
  "title": "AIOU launches 2-Year Associate Degree Programs in 17 new disciplines",
  "author": null,
  "content": "ISLAMABAD, Jun 23 (APP):Allama Iqbal Open University(AIOU) has taken another significant step towards the promotion of education by announcing the launch of 2-year Associate Degree Programs in 17 new disciplines. These programs will be available for admission from July 1, for the Fall 2025 semester.\nThe primary objective of these programs is to provide students with quality education and connect them to better professional opportunities. Subjects in the social sciences will be offered under the Open and Distance Learning (ODL) system, enabling students living in remote areas to access education.\nOn the other hand, six programs in the field of science will be delivered through traditional face-to-face teaching methods, with special emphasis on laboratory work and practical training.\nFor admission into ODL programs, candidates must have completed FA or an equivalent qualification while science subjects require FSC or an equivalent qualification.\nThe new Associate Degree Programs will include: Business Administration, Economics, Library and Information Sciences, Sociology, English, Gender and Women’s Studies, Mass Communication, Urdu, Education, History, Pakistan Studies, Chemistry, Human Nutrition and Dietetics, Environmental Sciences, Physics, Mathematics and Statistics.\nAccording to the Director of Admissions, Syed Zia-ul-Hasnain Naqvi, a key feature of these Associate Degree Programs is that graduates will be eligible for direct admission into the fifth semester of the four-year BS program. This not only saves students valuable time but also provides them with a golden opportunity for academic and professional advancement.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:23:07.798Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/aiou-launches-2-year-associate-degree-programs-in-17-new-disciplines/",
  "dateList": "2025-06-23",
  "date_published": "2025-06-23T08:32:00.000Z"
}
