{
  "article_id": "2025-03-31_0fa1aa32ff51dcd006453bf0f921bb15",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/strict-security-measures-in-islamabad-parks-during-eid/",
    "retrieved_at": "2025-08-27T14:08:36.182Z"
  },
  "metadata": {
    "title": "Strict security measures in Islamabad parks during Eid",
    "author": null,
    "date_published": "2025-03-31T14:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 223,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 31 (APP): Inspector General of Police (IG) Syed Ali Nasir Rizvi has ordered special security measures for public parks, deploying over 1,500 officers to ensure safety during the festive period. A public relations officer told APP on Monday that more than 500 traffic officers have also been deployed to maintain smooth traffic flow across the city. He said that police quick response teams are actively patrolling different areas, while senior officers, including the Deputy Inspector General (DIG) Islamabad, Chief Traffic Officer (CTO), and Senior Superintendent of Police (SSP) Operations, are present in the field to oversee security arrangements. He said that the mounted patrol unit is also engaged in city-wide patrolling to ensure law and order. A crackdown against reckless driving and one-wheeling continues, with several motorcycles impounded at police stations. He said that only families are being allowed entry into parks, while special police squads have been deployed at entry and exit points. He said that these security measures will remain in place for all three days of Eid, urging citizens traveling to Murree to check road updates before setting out. He said that the Islamabad Police are committed to maintaining peace and security in the city, leaving no stone unturned in ensuring public safety. Senior officers will remain in the field to enhance the effectiveness of these security arrangements.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}