{
  "article_id": "2025-03-31_2a14296625f76ab9e5fcca041fe5c883",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-extends-eid-greetings-to-malaysian-counterpart-discusses-bilateral-ties/",
    "retrieved_at": "2025-08-27T14:09:00.434Z"
  },
  "metadata": {
    "title": "PM extends Eid greetings to Malaysian counterpart, discusses bilateral ties",
    "author": null,
    "date_published": "2025-03-31T12:16:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 210,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Mar 31 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday held a telephonic conversation with his Malaysian counterpart, Dato' Seri Anwar Ibrahim, to extend warm Eid-ul-Fitr greetings to him and the people of Malaysia. During the call, Prime Minister Shehbaz recalled Prime Minister Anwar Ibrahim's visit to Pakistan last October and expressed satisfaction with the strengthening bilateral ties between the two nations. He reaffirmed Pakistan's commitment to enhancing cooperation with Malaysia in various sectors. Prime Minister Anwar Ibrahim highlighted the importance of Prime Minister Shehbaz Sharif's scheduled visit to Kuala Lumpur in May this year, stating that preparations were in full swing to ensure the success of the visit. He expressed hope that the visit would further cement the longstanding ties between Pakistan and Malaysia. Expressing gratitude, Prime Minister Shehbaz said he was looking forward to his visit and anticipated mutually beneficial outcomes for both countries. On this occasion, Prime Minister Anwar Ibrahim also conveyed his Eid greetings to former Prime Minister Muhammad Nawaz Sharif. The two leaders briefly spoke over the phone, exchanging Eid wishes and expressing goodwill towards each other. The conversation underscored the deep-rooted diplomatic relations and friendly ties between Pakistan and Malaysia, with both leaders reaffirming their commitment to fostering stronger cooperation in the future.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}