{
  "title": "PMYP–Lahore Qalandars cricket talent hunt trials kick off from today",
  "author": null,
  "content": "ISLAMABAD, Jun 26 (APP): The Prime Minister’s Youth Programme (PMYP) is launching its highly anticipated cricket talent hunt trials from today (Friday), marking a significant step in identifying and nurturing young cricketing talent across the country.\nAccording to Director Sports of the Higher Education Commission (HEC), Javed Ali Memon, in the first phase the three-day trials will be held at the Balochistan University of Information Technology, Engineering, and Management Sciences (BUITEMS) cricket ground in Quetta. This initiative, aimed at providing a remarkable opportunity for the youth of Balochistan, is being organized through the joint efforts of the HEC, the PMYP, and Pakistan Super League (PSL) champions, Lahore Qalandars.\nMemon stated that aspiring players from various districts of Balochistan will participate in the trials. The goal is to uncover hidden cricketing talent, provide professional training, and prepare them for national and international platforms. This talent hunt is a major milestone in the government’s broader vision of youth empowerment through sports—aligned with opportunities in education, employment, and digital innovation.\nIn a message, Chairman of the Prime Minister’s Youth Programme, Rana Mashhood Ahmad Khan, reiterated PMYP’s commitment to creating groundbreaking opportunities for youth across all sectors—including IT, sports, aerospace, and agriculture. He expressed hope that the young athletes of Balochistan would excel and play a pivotal role in building a bright future for Pakistan.\nChairman of the Higher Education Commission, Professor Dr. Mukhtar Ahmed, also voiced optimism that the talented youth of Balochistan would rise with their abilities and bring pride to the nation. He noted that the HEC and Pakistani universities are working closely with the government to promote sports. These trials represent a major step forward in the development of sports in Balochistan and will open new pathways of opportunity, ambition, and achievement for youth across the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:30:38.250Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pmyp-lahore-qalandars-cricket-talent-hunt-trials-kick-off-from-today/",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T13:46:00.000Z"
}
