{
  "title": "Pakistan to soon launch comprehensive investment plan in energy sector: Leghari",
  "author": null,
  "content": "ISLAMABAD, Jun 26 (APP): Federal Minister for Power Sardar Awais Ahmad Khan Leghari on Thursday said that Pakistan would soon launch a comprehensive investment plan for the energy sector to boost regional connectivity and the opportunities to help in the provision of reliable and cheap energy.\nAddressing the fifth Shanghai Cooperation Organisation (SCO) energy meeting through virtual link, the minister said, “We have taken significant structural reforms, new entities like power planning and monitoring company, energy infrastructure development and Management Company, the national grid company and independent system and market operator are helping us to lay the groundwork to improve governance, grid modernization and ensure transparent market operation.”\nHe said that our goals are bold and they are backed by actions like we are accelerating renewable energy deployment across the country introducing EV friendly tariff structure to promote green mobility, deploying smart meters and transformer monitoring system for data driven efficiency and cost reduction.\nThe minister said most recently laying the ground work for R & D secretariat to foster local innovation and facilitate technology transfer. “This is the transition driven by purpose not just numbers, the transition that puts the people at its center ensuring cheaper and more reliable energy for households, industries and future generations. Our strategic direction is clear 60 percent renewable energy by 2030, 30 percent EV penetration by the same year, modernizing infrastructure through smart grid and digital metering. “\nAwais Leghari said to promote energy efficiency and conservation frameworks all this driven by public-private partnerships that unlock the innovation and financing, adding that regional cooperation is not optional it is a strategic necessity.\nHe said that Pakistan location as natural energy bridge linking Central Asia, South Asia and Gulf, positioned us to drive regional energy integration. “We are committed to expanding the cross boarder inter-connections cooperation on electricity transmission infrastructures and developing joint security frameworks covering both physical and cyber aspects of critical energy systems,” he added.\nIn this regard, he said that we strongly encourage enhanced regional energy connectivity and especially welcome investment in the development of critical infrastructure such as convertor stations in Afghanistan which had vital for the successful realization of regional power corridors and CASA-I000 project remains the symbol of the regional progress.\nThe minister reiterated that Pakistan would soon be launching an aggressive investment plan in large scale energy for such an opportunity for technological advance companies across the globe and ensured guarantee return to investment board to invest with confidence.\n“Our vision extends beyond investment, we are equally committed to indigenization, this means building local manufacturing capacity, strengthening technology partnerships and training a future ready workforce so that our energy transformation is not only sustainable but also self-reliant,” he added.\n“Yet infrastructure alone is not enough, we must also collaborate on ideas and knowledge and  innovation and in this spirit Pakistan puts forward five proposals to enhance SCO energy framework ,1. SCO secretariat for energy innovation and RLD collaboration to align joint research and financing across our members states. SCO energy innovation fellowship programme to empower young researchers working on grid management and renewables 3. Joint demonstration site, Pakistan offers stress beds for hybrid renewables, green hydrogen and smart grid pilots.\nAn integrated energy cooperation dashboard, secure web-based system enables real time monitoring and evaluation and reporting of regional projects. A project prioritization committee to streamline and focus the SCO energy action plan ensuring resources is directed toward high impact and scalable projects.\nThe way forward is clear, innovation is the backbone of the energy transition but it must be nurtured with the investment collaboration and trust. “No nation can do this alone innovation does not thrive in isolation, it flourishing networks of trust and shared commitment. Pakistan stands ready to work with all members SCO states not only exchange technologies and policies but co-create a future that is resilient inclusive and secure,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:30:58.550Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-to-soon-launch-comprehensive-investment-plan-in-energy-sector-leghari/",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T13:27:00.000Z"
}
