{
  "title": "PGGANH organized “Pakistan Girls Empowerment Forum",
  "author": null,
  "content": "ISLAMABAD, Jun 26 (APP): Pakistan Girl Guides Association National Headquarters (PGGANH) organized “Pakistan Girls Empowerment Forum- Pathway to Leadership” from 21st to 26th June 2025.\n110 Guides and their Leaders from AJK, Baluchistan, Gilgit Baltistan, Khyber Pakhtunkhwa, Punjab, and Islamabad Capital Territory participated. The event was organized in collaboration with UNICEF Pakistan.\nPakistan Girl Guides Association has recently launched 4 new badge curricula regarding Nutrition, Environment & Climate Change, Leadership, and Mental and Emotional Wellbeing. During the event, Girls experienced activities of these 4 badges and will cascade these to at least 10 more girls after returning to their home towns. Upon completion of this task, they will become Empowerment Champions.\nMs Cindy Kushner, Deputy Representative (a.i), UNICEF Pakistan, was the Chief Guest of the Event. Mrs. Maria Maud Sabri, National Commissioner, Pakistan Girl Guides Association, welcomed her and the other Guests.\nShe briefed them about the program and activities of the Guiding. She said that Guiding is preparing leaders for tomorrow. While experiencing the Guide program, the girls learn to step forward whenever there is a need. Mrs. Maria Maud Sabri also informed the guests about the new badges. She commended the tireless efforts of Guides, volunteers, and partners for their unwavering commitment to creating safe and inclusive spaces for young women and girls.\nA highlight of the ceremony was a compelling panel discussion moderated by Ms. Fahmida Khan, featuring Girl Guides as panelists. The discussion spotlighted their journeys, insights, and dreams for the future, offering a powerful reflection on leadership, resilience, and the transformative power of girl-led initiatives.\nMs. Cindy Kushner, Deputy Representative of UNICEF Pakistan, graced the occasion as Chief Guest. In her inspiring remarks, she underscored the vital role of partnerships in nurturing girl-led leadership and promoting gender equality. She highlighted the potential of young girls and emphasized that empowering them should not be the responsibility of a single organization—it must be a national priority. She said:\n“This forum does more than just amplify girls’ voices; it reminds us that when we work together, grounded in equality and respect, we shape a future where every girl has the chance to grow, learn, and lead. UNICEF Pakistan is proud to walk this journey alongside PGGA, and together we will continue creating spaces where every girl can realize her full potential.”\nShe also encouraged participants to stay resilient, to keep dreaming, and to use their voices as a source of strength for others.\nThe event also included a soulful empowerment song performed by a Girl Guide, moving the audience with lyrics that echoed the Forum’s themes of strength, unity, and self-belief.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:30:35.322Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pgganh-organized-pakistan-girls-empowerment-forum/",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T15:43:00.000Z"
}
