{
  "title": "PM lauds economic team for balanced budget, highlights Pakistan’s role in Iran-Israel ceasefire",
  "author": null,
  "content": "ISLAMABAD, Jun 26 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday lauded the entire economic team, particularly Finance Minister Muhammad Aurangzeb, for their hard work and dedication in preparing the federal budget for the fiscal year 2025-26.\nHe also expressed gratitude to the federal cabinet and the allied political parties for their support in finalizing the budget.\nChairing the Cabinet meeting here, the prime minister also spoke on the recent regional developments and welcomed the ceasefire between Israel and Iran, terming it a crucial step in avoiding further escalation and loss. He thanked God for the peaceful resolution and acknowledged the important role played by various countries, including Saudi Arabia, in ensuring the ceasefire.\nHe said Iran openly thanked the people of Pakistan, its political parties, military, and political leadership for their role in the ensuring ceasefire between the two countries.\n“The Iranian leadership specifically named the President of Pakistan—himself, and the Field Marshal—for their contribution to the ceasefire efforts”, the prime minister said.\nAs regards the attack by Iran on Qatar, the prime minister said Pakistan had also issued a condemnation statement, reiterating Pakistan’s strong ties with the brotherly nation.\nRegarding Muharram ul Haram, Shehbaz Sharif directed the concerned authorities to ensure strict law and order during processions and majalis across the country. He also instructed the interior minister to coordinate with provincial governments, Gilgit-Baltistan, and Azad Jammu and Kashmir to maintain peace and security during the month.\nEarlier the cabinet offered Fateha for Major Moeez Abbas Shah Shaheed who embraced martyrdom in an operation against the terrorists in South Waziristan.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:28:58.365Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-lauds-economic-team-for-balanced-budget-highlights-pakistans-role-in-iran-israel-ceasefire/",
  "dateList": "2025-06-26",
  "date_published": "2025-06-26T08:44:00.000Z"
}
