{
  "article_id": "2025-09-14_38901d4429da54605ec66fbfa5c63361",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/pakistan-china-to-continue-expansion-in-defence-aviation-collaboration-president/",
    "retrieved_at": "2025-09-19T16:52:54.718Z"
  },
  "metadata": {
    "title": "Pakistan, China to continue expansion in defence, aviation collaboration: President",
    "author": null,
    "date_published": "2025-09-14T15:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 286,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sept 14 (APP): President Zardari on Sunday reaffirmed that Pakistan and China would continue to expand collaboration in defence production and aviation, further deepening their all-weather strategic cooperative partnership. He said the J-10 and JF-17 had greatly strengthened Pakistan Air Force, a fact clearly demonstrated during May 2025's Ma'raka-e-Haq and Operation Bunyan-um-Marsoos. On the 128th day since the ceasefire with India, President Asif Ali Zardari, constitutionally the Supreme Commander of the Armed Forces of Pakistan, visited the Aviation Industry Corporation of China (AVIC), China's flagship aerospace and defence conglomerate engaged in the design and production of a wide range of military and civilian aircraft, President Secretariat Press Wing said in a press release. The President was accompanied by Chairman Pakistan Peoples Party Bilawal Bhutto Zardari, First Lady Aseefa Bhutto Zardari, Senator Saleem Mandviwalla, Pakistan's Ambassador to China Khalil Hashmi and China's Ambassador to Pakistan Jiang Zaidong, who is travelling with the president throughout the visit. During the visit, the president toured the sprawling complex in its entirety, which produces the J-10C fighter jet that played a crucial role during the recent conflict. He also met AVIC's engineers and scientists, listening to their insights on innovation, production and future technologies. President Zardari was briefed on AVIC's advanced capabilities, including the J-10 fighter jet, the co-production of the JF-17 Thunder with Pakistan, as well as progress in the J-20 stealth 5th-generation fighter aircraft, unmanned aerial vehicles, fully automated units, and integrated command-and-control systems for modern multi-domain operations. He lauded AVIC as a symbol of China's technological advancement and of the enduring strategic partnership between Pakistan and China. President Zardari's visit also marked a historic first, as no foreign head of state had previously visited the AVIC complex.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}