{
  "article_id": "2025-09-14_31d650f7081438ac381f537aed3312a9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/choose-either-pakistan-or-fitnaul-khwarij-pm-shehbazs-message-to-afghan-govt-widely-hailed/",
    "retrieved_at": "2025-09-19T16:54:04.992Z"
  },
  "metadata": {
    "title": "Choose either Pakistan or Fitnaul Khwarij: PM Shehbaz’s message to Afghan Govt widely hailed",
    "author": null,
    "date_published": "2025-09-14T10:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 778,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "PESHAWAR, Sep 14 (APP): Prime Minister Muhammad Shehbaz Sharif's unequivocal message to the Afghan interim government to choose between peaceful relations with Pakistan or continued support for the India's proxy terrorist outfit Fitnaul Khwaraj has received widespread support across security, academic and political circles in Pakistan. The prime minister during talks after chairing a high-level security meeting yesterday at Bannu, drew a red line for Kabul, making it clear that harboring terrorists particularly those associated with the banned Tehrik-e-Taliban Pakistan (TTP) and Fitnaul Khwaraj would not be tolerated. \"The Afghan government must make a choice either to live peacefully with Pakistan or continue support for terrorism. The era of ambiguity is over, and terrorists would be dealt with full might,\" PM Shehbaz Sharif declared firmly. Syed Akhtar Ali Shah, former Inspector General of Police and ex-Home Secretary of Khyber Pakhtunkhwa, praised the Prime Minister's bold statement as both timely and clear in the wake of increase of terror incidents in Khyber Pakhtunkhwa. He said the PM's statement underlined a necessary shift in policy that prioritizes national security above all. He said the Prime Minister's bold statement came on an important time when terrorists attacks mostly planned in Afghanistan have increased in Khyber Pakhtunkhwa. Talking to APP, he claimed that the nexus between Indian proxies TTP and Fitnaul Khwaraj elements using Afghan soil for subversive activities against Pakistan become intolerable and should be dealt with full might. Citing the terms and conditions of the Doha Qatar agreement, Akhtar Ali Shah reiterated that the interim Afghan government is obligated not to allow its territory to be used for attacks on neighboring countries. He said that arrest of Indian spy and serving Navy Commander Kulboshan Yadev had testified New Delhi direct involvement in fanning terrorism in Pakistan. He pointed specifically to the recent terrorist assault on a Frontier Constabulary (FC) lines at Bannu as an example of the brutal face of Indian-sponsored terrorism targeting Pakistan. He said that entire world have seen that a terrorist was firing at security forces of Pakistan at FC line Bannu, resulting martyrdom of Major Adnan Aslam and others. Profesdor Dr Ejaz Khan, former Chairman of the International Relations Department at the University of Peshawar, also lauded the clarity of the prime minister's stance against Fitnaul Khwarij and TTP. He said, Pakistan has consistently pursued peaceful relations with all its neighbours, including Afghanistan. However, that peace cannot come at the cost of the lives of our civilians and soldiers. \"The Afghan authorities must act decisively now.\" He said that continued attacks will likely to affect trade cooperation between the two countries. He further emphasized that the TTP and Fitnaul Khwarij are responsible for numerous deadly attacks in Khyber Pakhtunkhwa, and that it is the moral, security and legal responsibility of the Afghan government to deny safe haven to such terrorists groups. Ejaz Khan added that PM Shehbaz Sharif's remarks highlighted the unity of Pakistan's civil and military leadership in confronting the monster challenge of terrorism. In a sign of growing resolve, the prime minister hinted at upcoming legal and administrative actions to eliminate terrorism from its roots. He revealed that a critical meeting of the Federal Cabinet is being planned to implement necessary legal and administrative measures. \"Our enemies want to impose a destructive ideology on our nation. But Pakistan is resilient, and our armed forces are fully capable of thwarting such subversive designs,\" he added. He said great responsibility rest on Afghans Govt to block channels of foreign funding to these India's proxy terrorists outfits and bring them to justice forthwith. Brigadier (R) Mahmood Shah, former Secretary Law and Order of the erstwhile Federally Administered Tribal Areas (FATA), said the Afghan interim government's lack of international legitimacy could worsen if it continues to allow cross-border terrorism. \"Pakistan has hosted over four million Afghan refugees since 1979 out of compassion and goodwill. But now, the time has come for illegal refugees many of whom are involved in unlawful activities to be repatriated immediately,\" Mehmood Shah stressed. He highlighted that a significant number of undocumented Afghan nationals are residing in Khyber Pakhtunkhwa, which could pose a security challenge in the current volatile environment. Across the board, political analysts and former officials agreed that the Prime Minister's statement marks a turning point in Pakistan's counter-terrorism narrative. The strong message to Afghanistan reflects a unified national policy that is no longer willing to bear the burden of external threats operating from foreign soil. As Pakistan braces for decisive action, the message of Prime Minister Muhammad Shehbaz Sharif is clear that only peaceful coexistence is welcomed, but the security and sovereignty of the nation will be safeguarded at all costs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}