{
  "title": "US Airline honors Pak origin employee over punctuality to duty during last 35 years",
  "link": "https://www.app.com.pk/national/us-airline-honors-pak-origin-employee-over-punctuality-to-duty-during-last-35-years/",
  "date_published": "2023-01-15T14:56:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 15 (APP): A US Airline has honored a Pakistan origin employee by inscribing his name on the aeroplane as reward for his punctuality to duty during the last 35 years of service.\nMuhammad Zaheen, who belongs to Peshawar city, has now a days been inscribed on an aeroplane of United Air Line as a reward of his dedication and punctuality to duty.\nSelection of Muhammad Zaheen has been made from among 85,000 employees of the Airline and is considered as an honor for whole Pakistani community and dwellers of Peshawar city.\nThe Airline made two offers including cash gift card of US$10,000 and a paid two weeks vacation trip around the world along with wife to Muhammad Zaheen as reward of his record dedication to duty, but he avoided both the offers and made a request for inscription of his name on the aeroplane.\n“My forename is `Muhammad’ and I wanted to see the name of our Prophet (PBUH) flying high in skies and coming into the notice of people traveling in the plane,” Zaheen told APP.\nIt was a difficult decision for the company because in the history of United Airlines, never any employee’s name is written on the plane, but my CEO finally agreed with my request, he added.\nMuhammad Zaheen who is currently on visit to his ancestral city Peshawar apprised APP that he migrated to USA in 1986 and is serving in United Airlines for the last 35 years.\nDuring the last 35 years of services, I have never been late to office and not availed any leave even the medical, Zaheen told APP.\nHe said he also wanted to portray a good image of Pakistan as people will ask over reading the name on plane and will be informed that the person belongs to Pakistan and is awarded for his punctuality to duty, Zaheen explained.\nHe said his mother used to wake up her children for Fajar prayers and this made his habit of waking up early in the morning and helped me in performing duty on time.\nFurthermore, he continued, his company honored him every year by awarding him which instilled in him encouragement to work more and with more dedication and perfection.",
  "retrievedAt": "2025-08-11T05:44:37.059Z"
}
