{
  "title": "PM kicks off three-day nationwide polio eradication drive, vows to eliminate polio",
  "link": "https://www.app.com.pk/national/pm-kicks-off-three-day-nationwide-anti-polio-drive-vows-to-eradicate-polio/",
  "date_published": "2023-01-15T09:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday inaugurated a three-day nationwide polio eradication drive by administering polio drops to the children.\nIn a brief ceremony held here, the prime minister said that a nationwide drive was being started to overcome the resurfacing of the polio cases.\nThe prime minister said that floods in the summer season had disrupted the national drive, but despite all those difficulties, the polio workers carried out the onus with their hard work and commitment.\nHe further observed that unfortunately, Pakistan was among the few countries where polio cases had resurfaced.\nA few years back, during the government of Muhammad Nawaz Sharif, these cases were completely eradicated, he added.\nThe prime minister said about 20 cases of polio were reported from Waziristan, but due to consistent efforts, these were restricted and controlled and did not spread to other parts.\nThe prime minister also lauded those frontline workers and law enforcement agencies personnel who had laid down their lives for achieving the objective and embraced shahadat.\nHe said that their sacrifices would always be remembered.\n“I have the conviction that all the provincial governments, along with the federal government will continue collaborating to eradicate the disease forever,” he added.\nThe resurfacing of the few cases had certainly raised concerns among the partners including Bill Gates Foundation, World Health Organization (WHO) and other stakeholders, he added.\nThe prime minister said that during a telephonic conversation, Bill Gates had expressed his commitment to support the government’s efforts to eliminate the disease.\nThe prime minister also expressed his gratitude to the WHO, stakeholders, related departments, law enforcement personnel and the daughters of the nation for their continuing efforts and commitments.\nThe prime minister mentioned that he had held meetings with the federal health ministry officials and others, whereas the federal and the provincial governments were all supporting these efforts.\nHe expressed the confidence that they would control the disease with collective efforts.\nEarlier, the prime minister also gave away certificates to the best-performing polio workers.",
  "retrievedAt": "2025-08-11T05:44:40.951Z"
}
