{
  "title": "Railways earn Rs 55 bln in eight months",
  "link": "https://www.app.com.pk/national/railways-earn-rs-55-bln-in-eight-months/",
  "date_published": "2024-03-12T07:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP):Pakistan Railways has earned Rs 55 billion in the first eight months of the current financial year 2023-24, despite facing a financial crisis due to floods in the monsoon season.\nDuring the first eight months of the last financial year (2022-23), the department earned Rs 37 billion, a historic increase in revenue during the same period of the current financial year (2023-24), a ministry official told APP.\nAccording to the data, he said that out of the revenue of Rs 55 billion, revenue was derived from passenger and freight trains while other sectors of the department also contributed to the total revenue.\nThe department is expecting to generate revenues up to Rs 80 billion by the end of this financial year through the consistent efforts and hard work of the Railway workers, the official added.\nAt present, he said that Pakistan Railways is operating 96 passenger trains, up from the previous year when 86 trains were running. Similarly, during the previous year, on average it operated 3.75 freight trains while the number reached seven freight trains this year.\nHe said the department emphasized that the issue of delay in payment of salaries to employees has now been resolved and things will be more streamlined, once work on the Mainline-I (ML-I) project kicks off.\nThe official said that owing to inflationary pressures, led by high fuel costs, Pakistan Railways has increased its fares, both for passenger and freight segments that would help the cash-strapped corporation to fetch better revenues in the next few months.\nTo a question, he said that Pakistan Railways has beefed up precautionary measures to reduce passenger train accidents and only six minor accidents with no causality took place on the entire railway network in the country during the last three months.\n“Only two train accidents have taken place in September, no accident happened in October and four train accidents occurred in November due to effective steps of the department,” he added.\nThe drastic decrease in accidents has been witnessed due to the efforts being undertaken to reduce trespassing at unmanned level crossings and unauthorized locations, he added.\n“Our staff is continuously monitoring the railway tracks across the country and conducting thorough inspection of the trains as the safety of the passengers is the top priority of the department,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:16:45.035Z"
}
