{
  "title": "Gates for entry and exit of Umrah pilgrims allocated at Grand Mosque during Ramzan",
  "link": "https://www.app.com.pk/national/gates-for-entry-and-exit-of-umrah-pilgrims-allocated-at-grand-mosque-during-ramzan/",
  "date_published": "2024-03-12T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP):Saudi Arabia’s General Authority for the Care of the Affairs of the Grand Mosque and the Prophet’s Mosque has allocated a number of gates at the Grand Mosque in Makkah to receive pilgrims, coinciding with the beginning of the blessed month of Ramadan, which witnesses the peak annual Umrah season.\nThe new arrangements were made in coordination with government agencies operating within the Grand Mosque. The holy month of Ramzan is expected to witness huge flow of millions of pilgrims from within the Kingdom and all over the world. The Saudi authorities have mobilized all the arrangements and preparations to ensure the pilgrims and worshipers to perform their rituals in ease and comfort, Saudi Gazette reported.\nThe Umrah pilgrims can enter the Grand Mosque through King Abdulaziz Gate, King Fahd Gate, Umrah Gate, and Al-Salam Gate, in addition to 85-93 doors of the ground floor except door number 88, Ajyad Staircase, Ajyad Bridge, Shubaika Stairways of 65-66, King Fahd Stairways of 91-92, and Stairway 84.\nThe designated exits include side crossings of 78 – 80, stairway 74, regular stairways 71 – 73 – 85 – 88, King Fahd staircase, doors 75 – 77 and 81 – 83 while Al-Shubika staircase is designated for emergency cases. These are in addition to King Abdulaziz Gate, King Fahd Gate, Umrah Gate, and Al-Zubair Gate on the ground floor, Ajyad Bridge, Shubaika Bridge, Othman Bridge, King Fahd Elevators on the first floor, Al-Arqam Stairway elevators, Umrah Gate elevators, Ajyad Stairway elevators, and Marwa Stairway elevators on the second floor and the roof for people with special needs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:16:10.226Z"
}
