{
  "title": "Federal Ministers pay surprise visit at G-6 utility store",
  "link": "https://www.app.com.pk/national/federal-ministers-pay-surprise-visit-at-g-6-utility-store/",
  "date_published": "2024-03-12T12:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP): Minister for Information and Broadcasting Attaullah Tarar along with Federal Minister Rana Tanveer Hussain paid a surprise visit to the utility store at Abpara Market, G-6 Islamabad.\nBoth the ministers visited the utility store on the directives of Prime Minister Shehbaz Sharif and reviewed quality of the edibles being sold at subsidized rates under the Ramazan Relief Package 2024.\nThe federal ministers also interacted with the public at the utility store to get their feedback in that regard.\nAccording to Rana Tanveer, special discounts were being given to consumers at utility store under the Ramazan Relief Package 2024.\nHe said the government was making all-out efforts to ensure uninterrupted supply of food items during the holy month of Ramazan.\nPrices of food items at utility stores were lesser than the market, he said, while expressing the government’s resolve to maintain these rates.\nAttaullah Tarar said the government was taking various measures to provide relief to the poor people during Ramazan.\nHe said the government had announced the Ramazan package under which the poor people were being provided subsidy on various food items.\nSpecial discount was given by the government on flour, ghee, sugar and other items, he added.\nThe federal ministers also reviewed the provision of items under the special subsidy provided by the government to the beneficiaries under the Benazir Income Support Program at the utility stores.\nOn the occasion, the public urged the federal ministers to increase the number of counters at the utility stores.\nThe federal ministers directed to increase the number of counters at the utility stores and speed up the process of providing food items to the people.",
  "retrievedAt": "2025-08-11T01:15:47.411Z"
}
