{
  "title": "Adoption of AI, new technologies imperative to empower youth: Shaza",
  "link": "https://www.app.com.pk/national/adoption-of-ai-new-technologies-imperative-to-empower-youth-shaza/",
  "date_published": "2024-03-12T14:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP): Minister of State for Information Technology and Telecommunication, Shaza Fatima Khawaja on Tuesday stressed the need for adopting artificial intelligence (AI) and machine learning by modernizing the country’s education system and curricula to prepare the youth for skilled jobs to empower and make them at par with rest of the world.\nShe was speaking at a seminar titled, “The Challenges and Opportunities of Artificial Intelligence (AI) and Cybersecurity in Pakistan”, organized by Sustainable Development Policy Institute here, said a press release.\nThe state minister said the world is rapidly adopting AI, but Pakistan lags far behind the comity of nations. Leveraging AI technologies can help in establishing an effective governance system and transparency, and safe city traffic monitoring systems are the big examples in this regard, she remarked.\nExecutive Director, SDPI Dr Abid Qaiyum Suleri said, “We are living in the age of unparalleled information and have become knowledge managers with limitless data, which is easily accessible”. However, with this opportunity, he added, “We must take on the responsibility for the ethical use of information”.\nVice-Chancellor, AIOU Prof. Dr Nasir Mahood underlined the need for corresponding our response speed to the speed of AI transformation, increase investment in AI and ICT sector to promote indigenization to match the pace of rest of the world. He further said that improving the AI ecosystem in Pakistan will also help retain the indigenous talent and boost economic development.\nSenior Advisor Emeritus, SDPI Brig (Retd) Muhammad Yasin said that AI is modernizing industries, agriculture, manufacturing, etc. to boost productivity. “While AI can transform the cybersecurity landscape, its rapid adoption often leaves critical protection gaps causing breaches into critical government and private data. Therefore, it is crucial to modernize cybersecurity infrastructure to meet these emerging challenges.” Referring to research reports in 2023, he said, 25% of Pakistani internet users faced online threats, which demands that an AI-based cybersecurity infrastructure should be set up for users and data protection sooner than later.\nDirector-General, Pakistan Telecommunication Authority, Dr Mukarram Khan said that PTA is using big data and trend analysis to track cybercriminals, improve telecommunication services and has introduced Cybersecurity Strategy 2023-28 to meet emerging cybersecurity challenges.\nVice-President, Jazz Mudassir Hussain said that cybersecurity regulations must take a whole-of-tech approach. He called for avoiding over-regulations for sustainability and creating demand for AI use in public procurement systems and private sector.",
  "retrievedAt": "2025-08-11T01:15:30.388Z"
}
