{
  "title": "Govt urged to reevaluate subsidies in light of health concerns",
  "link": "https://www.app.com.pk/national/govt-urged-to-reevaluate-subsidies-in-light-of-health-concerns/",
  "date_published": "2024-03-12T12:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP): The government of Pakistan is set to continue its tradition of providing subsidies on various food items through Utility Store Corporations, Ramazan Bazars and other means. While this practice has been beneficial in ensuring food affordability during the holy month.\nConcerns have, however, been raised about the nutritional content of some subsidised items like the subsidies given to certain items, such as sugar and banaspati ghee and oils, which are linked to increased risk of obesity and chronic diseases.\nThe evidence suggests that high consumption of sugar and trans-fatty acids present in banaspati ghee and oils are linked with increased risk of heart disease, diabetes, stroke, cancer and several other chronic diseases, a news release said.\nAs part of a broader effort to promote public health and well-being, public health advocates are calling on the government to withdraw its subsidy allocation on sugar and banaspati ghee/oils and prioritise subsidizing healthier alternatives like lentils, fruits and vegetables.\nIn-Country Coordinator for the Global Health Advocacy Incubator (GHAI), Munawar Hussain emphasised the need for a shift in subsidy focus: “While ensuring food accessibility is crucial, we must be mindful of the impact of these subsidies on public health and the behaviour of the people on food consumption.\nSubsidizing unhealthy food items may encourage public to continue consuming such foods without knowing the risks that they pose. The government has an opportunity to make a positive change by redirecting subsidies towards healthier food options that contribute to the well-being of the population.”\nRecognising the importance of this issue, Mukhtar Ahmad, Executive Director of the Centre for Peace and Development Initiatives (CPDI), stated, “It is essential to strike a balance between affordability and health. By incentivizing the consumption of nutritious foods, the government can play a pivotal role in improving the overall health outcomes of the nation.” He further added, “Food subsidies must be linked with nutritional value and dietary risk factor assessment of edible commodities.”\nAfshar Iqbal, Director of Communications and Advocacy at Pakistan Youth Change Advocates (PYCA), added, “World Health Organization in their obesity prevention framework recommend removing subsidies on all types of fats/oils and sugar.\nRedirecting subsidies towards items like lentils, fruits, vegetables and other nutritious options will align with the government’s commitment to the well-being of its citizens and contribute to a healthier, more resilient society.”\nThe call for a re-evaluation of subsidies aligns with global efforts to address the growing burden of non-communicable diseases linked to diet in general and the incidence of industrially produced trans-fats in particular. Public health advocates are hopeful that the government will consider these recommendations and prioritise the health of the nation in its subsidy allocations.",
  "retrievedAt": "2025-08-11T01:15:48.376Z"
}
