{
  "title": "PM for a complete roadmap to enhance IT exports",
  "link": "https://www.app.com.pk/national/pm-for-a-complete-roadmap-to-enhance-it-exports/",
  "date_published": "2024-03-12T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 12 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday directed for submission of a comprehensive roadmap to boost IT exports.\nHe said the government would take steps to fully avail of the billion dollars potential of the country for IT exports, besides, the young people would be provided with required facilities of education, skills development and startups.\nThe prime minister chaired a review meeting on IT and Telecom sector. The meeting was attended by Minister for Finance Muhammad Aurangzeb, Minister for Economic Affairs and Establishment Ahad Khan Cheema, Minister of State for IT Shaza Fatima Khawaja, Governor State Bank of Pakistan Jameel Ahmed, Shahzad Saleem and the relevant senior officials, PM Office Media Wing said in a press release.\nDuring the meeting, the prime minister said that during their previous tenure, positive outcome was witnessed from the initiation of different projects in the IT sector.\nHe stressed upon resolution of all issues of start ups, freelancers and IT companies relating to banking.\nExpressing his satisfaction over the IT export volume of more than $3 billion in the current year, he emphasized upon its further increase.\nFor brining Pakistan’s IT sector at par with the international standards, they would have to work hard, he observed.\nThe prime minister also asked for submission of a comprehensive report regarding special technology zones.\nThe meeting was apprised of progress on IT package announced by the prime minister during June 2023.\nDuring the previous tenure, due to special attention of Prime Minister Shehbaz Sharif, the IT exports witnessed 13 percent increase during the first seven months of the current fiscal year when compared with previous corresponding year.\nUnder the Digiskills programme, a total of 4 million students of 17 batches, comprising 28 percent females, had been imparted training. Pakistan had emerged as the second top country in the world on the basis of numbers of freelancers. Pakistan was exporting IT products to 170 countries of the world, it was further added.\nThe meeting was informed that during the previous year, an investment of $400 million was made in Pakistani startups.\nThe prime minister directed for taking of all necessary, legal and policy related steps to attract investment and boost IT exports.\nHe also asked for expediting work on projects meant to enhance professional and technical training of youth for complete utilization of potential in IT sector.\nThe meeting was also informed about the steps and progress on IT, E Rozgar, startups, cyber security, telecom sector and launch of 5-G.",
  "retrievedAt": "2025-08-11T01:16:10.308Z"
}
