{
  "title": "Iranian ambassador condemns disrespect of Holy Quran in Europe, calls for global action",
  "link": "https://www.app.com.pk/national/iranian-ambassador-condemns-disrespect-of-holy-quran-in-europe-calls-for-global-action/",
  "date_published": "2023-09-03T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, September 03 (APP): Iranian Ambassador Reza Amiri-Moghaddam, in a recent gathering of religious scholars and leaders from various faiths and sects, raised concerns about the increasing incidents of disrespect towards religious symbols, particularly the Holy Quran, in European nations.\nThe event, titled ‘Honoring the Holy Quran from the Perspective of Religions and Sects,’ witnessed a unified call for safeguarding religious sanctity and promoting mutual coexistence.\nAmbassador Amiri-Moghaddam, speaking at the event organized by the Iranian Cultural Consulate in collaboration with Majlis Wahdat-e-Muslimeen, underscored the distressing trend of disregarding the sanctity of religious symbols. He pointed out that over the past six months, the Holy Quran had been desecrated on more than six occasions in Europe.\nExpressing his pleasure in joining the assembly of learned individuals, the Ambassador extended his appreciation to those involved in organizing the event, which brought together scholars and devotees from diverse religious backgrounds, including Shia, Sunni, Christian, Sikh, and Hindu. The event focused on the importance of honoring and revering the Holy Quran from a multi-religious perspective.\nAmbassador Amiri-Moghaddam emphasized its timeliness given recent incidents in European countries that showed disrespect for the Holy Quran. He specifically highlighted the permission granted by the Swedish government for such disrespect under the banner of freedom of expression, labeling it a dangerous precedent. He expressed disappointment over the lack of preventive actions and raised concerns about similar incidents in the future.\nAmbassador Amiri-Moghaddam stressed that the desecration of the Holy Quran transcended religious boundaries, representing an affront to all divine scriptures. He noted that condemnation for such acts came from religious leaders globally, uniting against such unacceptable behavior.\nMoreover, the Ambassador pointed to the violation of international law that prohibits the propagation of religious hatred, highlighting the contradiction between these actions and international agreements and human rights principles.\nHe characterized the act of disrespecting the Holy Quran as emblematic of an agenda seeking to create discord among Islamic nations and expressed concerns about the silence of European nations on these matters within their borders.\nIn the age of technological advancements that amplify ethical and spiritual capacities, Ambassador Amiri-Moghaddam urged scholars to promote positive discourse and create an environment where all religions can effectively counteract the trend of disrespect.\nConcluding his address, he commended Pakistan’s resolute stance against the disrespect of the Holy Quran and praised the country’s commitment to safeguarding religious symbols.\nIranian Cultural Counsellor Ehsan Khazaei echoed these sentiments, stating that defaming the Holy Quran was an affront to all religions and humanity. He quoted Supreme Leader Ayatollah Khamenei’s assertion that such insults revealed an imperialistic agenda aimed at Islam and its sacred text.\nKhazaei expressed gratitude for Iran and Pakistan’s active role in defending the Holy Quran and pledged unwavering resolve to condemn all acts of blasphemy.\nThe religious scholars and leaders, in a unanimous resolution, strongly condemned recent incidents of disrespect towards the Holy Quran and called them attacks on global peace and religious freedom. They urged the United Nations to take prompt action and appealed to Pakistan to convene an emergency session of the Organization of Islamic Cooperation to address the issue comprehensively.\nIn their statement, they emphasized the importance of knowledge, pride, and understanding as means to human excellence, condemning violence and divisive agendas. They pledged to uphold the sanctity and reverence of the Holy Quran, vowing to remain vigilant and steadfast against such actions.\nThe conference, attended by a diverse group of religious scholars, faith leaders, and members of diplomatic communities, concluded with a call for justice in the Jaranwala tragedy and a collective commitment to promote respect and unity among different faiths and sects.",
  "retrievedAt": "2025-08-11T09:25:54.538Z"
}
