{
  "title": "Forcibly displaced to surge by 6.7m in 2025-26: aid group - World - DAWN.COM",
  "author": null,
  "content": "COPENHAGEN: Wars and attacks on civilians are expected to drive 6.7 million people from their homes worldwide over the next two years, while the “devastating” withdrawal of international aid by the United States, UK and Germany has already left millions of vulnerable people without essential support, a humanitarian organisation, Danish Refugee Council (DRC), said on Friday.\n\nThe number of displaced people worldwide was currently 122.6 million, the DRC said.\n\nThe organisation said its Global Displacement Forecast showed a “staggering spike” of 4.2 million people was expected in 2025 — the highest forecasted by DRC since 2021.\n\nCivil wars in Sudan and Myanmar will account for nearly half of all projected displacements.\n\nSudan — “the world’s most urgent humanitarian crisis” — will account for nearly a third of new displacements, it said, noting that 12.6m people had already been displaced inside Sudan and to neighbouring countries.\n\nIn Myanmar, the civil war had intensified and resulted in 3.5m people displaced, and nearly 20m people in need of humanitarian assistance, the council noted.\n\nOf the 6.7 million people forecasted to be displaced by the end of 2026, some 70 per cent will be internally displaced, DRC said.\n\nDRC Secretary-General Charlotte Slente blasted US President Donald Trump’s decision to cancel 83pc of USAID’s humanitarian aid programmes across the world as a “betrayal of the most vulnerable”.\n\n“We’re in the middle of a global ‘perfect storm’: record displacement, surging needs, and devastating funding cuts.”\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:12:29.187Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897959/forcibly-displaced-to-surge-by-67m-in-2025-26-aid-group",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:27:11.000Z"
}
