{
  "title": "Lahore to host Women’s World Cup Qualifier next month - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: The ICC Wo­men’s World Cup Qual­ifier, featuring six teams including hosts Paki­stan, is set to be held here at the Gaddafi Stadium and the LCCA ground April 9-19, the International Cricket Co­u­ncil announced on Friday.\n\nThe sixth edition of the Qualifier sees teams from Bangladesh, Ireland, Pak­istan and the West Indies compete with Scotland and Thailand in the 15-match league tournament that will decide the two qualifiers for the 2025 Women’s World Cup to be held later this year in India.\n\nPakistan take on Ireland at the Gaddafi Stadium wh­ile the West Indies play Scotland at the Lahore City Cricket Association on the opening day of the tournament.\n\nAustralia, England, New Zealand, South Africa and Sri Lanka apart from hosts India, have already qualified for the World Cup by virtue of finishing in the top six of the 10-team ICC Women’s Championship’s 2022-25 cycle.\n\nBangladesh, Ireland, Pa­­k­­istan and the West Indies play in the Qualifier as they finished from places seventh to 10th in the Women’s Champi­onship, while Thail­and and Scotl­and made it as the next two best ranked sides in the Women’s ODI Team Rank­ings as of Oct 28, 2024.\n\nSome high-profile mat­ch-ups in the tournament include Pakistan taking on the West Indies on April 14 in a day-night game at the Gaddafi Stadium, Bangl­adesh going up against the West Indies at the LCCA ground on April 17 and sub-continental rivals Pak­i­stan and Bangladesh clas­h­ing at the same venue on April 19.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:12:01.701Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898035/lahore-to-host-womens-world-cup-qualifier-next-month",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T02:26:29.000Z"
}
