{
  "title": "LHC asks govt to explain its use of X despite ban - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court on Friday sou­ght a detailed report from the interior ministry and the Pakistan Telec­om­mu­n­ication Aut­h­o­rity (PTA) on the petitions challenging the ban on social media platform ‘X’ (formerly Twitter), with a directive to explain which government institutions are still using the banned app.\n\nHearing the petitions, a three-judge bench, headed by Chief Justice Aalia Neelum, also summoned a responsible official from the PTA along with relevant records at the next hearing.\n\nThe bench directed the respondents to provide details about legal status of the use of X in Pakistan along with clarification which government institutions were still using the social media app despite the ban.\n\nJustice Ali Zia Bajwa, a member of the bench, questioned who was responsible if X was still accessible despite being blocked in the country.\n\nThe counsel for the PTA informed the bench that users access X via Virtual Private Network (VPN).\n\nThe bench summoned a report explaining how X continued to be used despite the ban and fixed the next hearing for March 20.\n\nArticle 19 violation\n\nEarlier, the petitions informed the court that the government had imposed restrictions on social media and blocked access to platform X, arguing that access to information was a fundamental right of every citizen and that such restrictions violate articles 19 and 19-A of the Constitution.\n\nThe petitions asked the court to lift all restrictions on social media and declare all government notifications regarding such bans as null and void.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:12:37.295Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897967/lhc-asks-govt-to-explain-its-use-of-x-despite-ban",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:27:05.000Z"
}
