{
  "title": "PIA aircraft’s missing wheel found at Karachi airport - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Authorities on Friday found the missing wheel of the 18-year-old PIA aircraft that landed in Lahore a couple of days ago, raising serious questions on the national flag carrier’s ability to ensure proper upkeep of its fleet before they fly.\n\nIn a rare incident of its kind, the PIA domestic flight PK-306 left Karachi for Lahore on Wednesday evening, but upon reaching the Allama Iqbal International Airport it transpired that one of the six rear wheels of the aircraft was missing. However, it landed safely with no harm to passengers and the crew.\n\nA walk-around inspection by the flight captain after the landing revealed that one out of the six-wheel assemblies on the main landing gear (rear) was missing.\n\nAs per the standard practice, the matter was taken up by the PIA’s Flight Safety and Bureau of Air Safety investigation teams for a thorough probe. The reports have yet to be submitted.\n\nThe episode raises concern over fleet upkeep\n\n“The missing wheel of PK-306 has been located successfully. The wheel was found near the remote parking bay of Karachi’s Jinnah International Airport, adjacent to the Ispahani Hangar,” a spokesperson for the Pakistan Aviation Authority (PAA) said here on Friday.\n\n“Technicians from the airport’s wheel shop discovered the tire next to the landing gear of a grounded Boeing 777,” he said and added the incident was being investigated by the relevant authorities.\n\nAn official source told Dawn that there was a possibility that the aircraft A320’s wheel might have been dislodged during takeoff, falling off at the Isphani Hanger.\n\n“Had the required inspection by the engineering team of the aircraft been properly conducted, the plane might not be cleared for departure,” he said and added that although it seems to be gross negligence on the part of the PIA’s department concerned, a wheel falling off during takeoff was not unusual. Some foreign airlines’ aircraft have also experienced such episodes, he said.\n\nThe source further said that A320 had a capacity to carry 180 passengers and on Wednesday’s flight PK-306 some 104 passengers were aboard. He said the aircraft was 18 years old and currently the PIA has 31 planes — 16 A320s, 12 Boeing 777s and three ATRs — in its fleet.\n\nIt is the responsibility of the PIA’s management to ensure the upkeep of all the aircraft in its fleet. The government, early this month, had ann­ounced that it would complete all necessary steps to privatise the Pakistan International Airlines Corporation Ltd (PIACL) within three months.\n\n“The government has addressed all concerns of the parties interested in buying the national flag carrier and decided to make changes as per their preferences. A new roadmap is being developed to make PIA more attractive for the prospective buyers, and it is expected that all stages of this process will be completed within three months,” the government said.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:58:27.549Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897928/pia-aircrafts-missing-wheel-found-at-karachi-airport",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:27:18.000Z"
}
