{
  "title": "IHC orders probe into denial of lawyer’s access to Imran - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court on Friday appointed court clerk Sakina Bangash to investigate the denial of a meeting between former prime minister Imran Khan and lawyer Mashal Yousafzai.\n\nJustice Sardar Ejaz Ishaq Khan made the ap­p­ointment while hearing a petition seeking co­n­tempt of court proce­edings against jail auth­o­rities for denying Ms Yousafzai access to Imran Khan. However, the jail authorities infor­med the court that the incarcerated PTI foun­der had not consented to the meeting when her name was sent to him.\n\nThe judge directed the Adiala Jail authorities to facilitate the court clerk’s visit to ascertain the facts.\n\nMashal Yousafzai, who appeared in court alongside her lawyer Shoaib Shaheen, argued that multiple petitions had been filed on the matter but were assigned to a different court.\n\nLHC grants ECP more time to file reply in ex-PM’s jail trial case\n\nThe state counsel presented a handwritten list of lawyers allegedly provided by the PTI founder, indicating his refusal to meet certain individuals. However, the court questioned the validity of this claim, noting that jail authorities had previously assured the court that the meeting would take place.\n\nJustice Khan expre­ssed dissatisfaction with the jail authorities’ conduct, noting that the petitioner had been denied access despite clear court directives.\n\nThe court directed that Imran Khan be presented via video link at 2pm or in person at 3pm, warning that failure to comply would prompt action by the Islamabad police chief.\n\nThe court also addre­ssed concerns regarding whether Mashal Yousafzai was indeed Imran Khan’s legal representative, suggesting that the PTI founder provide a written statement confirming or denying her status as his lawyer.\n\nJustice Khan emphasised that the jail authorities’ repeated non-compliance amounted to contempt of court.\n\nWhen the hearing res­umed, Jail Superinte­ndent Abdul Ghafoor Anjum appeared before the court and was questioned about the delay in arranging meetings. He stated that he had been out of town and that Imran Khan had refused to meet Ms Yousafzai.\n\nHowever, Justice Khan highlighted inconsistencies in the authorities’ responses and reaffirmed the court’s commitment to ensuring justice.\n\nAdvocate General for Islamabad Ayaz Shaukat later appeared and informed the court that Imran Khan could not be presented via video link due to security concerns.\n\nJustice Khan directed the jail authorities and Islamabad IG to submit affidavits detailing their compliance with the court orders.\n\nSakina Bangash is required to visit Adiala Jail, meet the PTI founder and confirm whether Ms Yousafzai is his legal representative. She was also instructed to inquire whether the PTI founder’s meetings with his associates are being arranged as per legal provisions.\n\nList of lawyers\n\nDuring the proceedings, a list of six lawyers signed by the PTI founder was presented before the court, raising further questions about whether the power of attorney was lawfully signed.\n\nThe jail superintendent informed the court that a meeting between Imran Khan, his wife Bushra Bibi, and their legal team was scheduled for Tuesday.\n\nExpressing concerns about the fairness of the process, Mashal Yousafzai questioned whether justice would be served.\n\nIn response, Justice Khan reassured her, stating: “The court is here to ensure justice. That is why we are taking these steps to verify the facts and uphold the rule of law.”\n\nThe proceedings were adjourned until March 21 with directives for the court clerk to complete the inquiry and present its findings in the next hearing.\n\nJail trial\n\nThe Lahore High Court on Friday allowed more time to the Election Commission of Pakistan to file a reply to a petition of PTI founding chairman Imran Khan challenging his jail trial in a contempt case by the ECP.\n\nWhen a three-member bench headed by Chief Justice Aalia Neelum resumed hearing on the petition, the ECP counsel explained the reason for delay in submission of the reply, saying that certain documents needed to be included in the case record.\n\nHe sought more time to furnish the reply.\n\nThe bench expressed displeasure over the non-submission of reply by the ECP, but allowed the request and adjourned the hearing.\n\nJustice Shehram Sarwar Chaudhry and Justice Asjad Javaid Ghural were other members of the bench.\n\nThe petition filed by Imran Khan contended that the ECP had on Nov 30, 2023 passed the impugned order to conduct the trial at Adiala Jail on account of unspecified security concerns. It said the ECP failed to appreciate that a jail trial would violate several fundamental rights of the petitioner, adding that the commission incorrectly held that it can order a trial in secret and in jail.\n\nThe petition argued that a jail trial was a violation of Article 10-A of the Constitution, which guarantees the right to fair trial and due process of law. The petitioner asked the court to set aside the ECP decision and direct it to hold an open and public trial with full access to his legal team, media and the public.\n\nWajih Ahmad Sheikh in Lahore also contributed to this report\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:58:47.361Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897965/ihc-orders-probe-into-denial-of-lawyers-access-to-imran",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:27:05.000Z"
}
