{
  "title": "Terrorists, their social media backers cut from same cloth, says Talal - Pakistan - DAWN.COM",
  "author": null,
  "content": "• State minister for interior rebuffs impression of insurgency in Balochistan, calls for holistic review of NAP\n• Zartaj Gul censures defence minister for making political speech in wake of Jaffar Express tragedy\n\nISLAMABAD: Minister of State for Interior Talal Chaudhry on Friday said that those who “facilitated” the outlawed Balochistan Liberation Army (BLA) through social media propaganda will be treated as terrorists.\n\nSpeaking in the National Assembly two days after militants from the outlawed BLA attacked a train in Balochistan and held passengers hostage for over 24 hours, he said that on one side, the banned outfit had attacked Jaffar Express and on the other hand, “social media was being used to attack Pakistan’s security forces”.\n\n“This was facilitation [of terrorists] as these forces were protecting innocent civ­i­lians, including women, children, and gov­ernment employees,” the minister said.\n\nHe warned that those facilitating terrorists through social media would be treated no differently than terrorists themselves.\n\nMr Chaudhry said there was no difference between the banned Tehreek-i-Taliban Pakistan (TTP) and the proscribed BLA.\n\nWhile referring to the use of Afghan soil for launching attacks in Pakistan, he alleged the handlers and training camps of both groups were in a neighbouring country and they also received funding from there.\n\nThe only difference was that members of one of these outfits “sport a beard” while the others were without beards.\n\nHowever, both groups had the same pattern of attacks and “same objective of scaring and dividing the people”.\n\nThe minister rebuffed the impression of an insurgency in Balochistan and said the attacks like the one on Jaffar Express were acts of terrorism.\n\nMr Chaudhary commended the security forces for eliminating the attackers.\n\nHe recalled that at least six terrorist attacks on average were taking place in the country when the PML-N came to power in 2013.\n\n“[But] peace was established under the leadership of [former prime minister] Nawaz Sharif, who took all [parties] on board”.\n\nThe minister attributed the resurgence of terrorism to policy failures after 2018 when the PTI government, led by Imran Khan, came into power.\n\nTerrorists who were brought back by PTI for resettlement for political gains are now killing people, the minister claimed, as he urged all political stakeholders to engage in serious dialogue on issues of national security.\n\n“This is a matter of national security. Let’s sit down and talk—whether about the National Action Plan or any other strategy. But speeches alone won’t solve anything,” Mr Chaudhry said.\n\nHe stressed the urgent need for full implementation of the National Action Plan (NAP) devised after the attack on Peshawar’s Army Public School in 2014.\n\nProvinces’ responsibility\n\nThe minister criticised the PTI government in Khyber Pakhtunkhwa for failing to build institutional capacity to fight terrorism.\n\n“It has been 20 years and Khyber Pakhtunkhwa has received over Rs600 billion in the National Finance Commission Award. Yet, their Counter-Terrorism Department operates from rented buildings and lacks proper resources,” the minister claimed about the province where his political rival has been in power since 2013.\n\nMr Chaudhry said that intelligence agencies provide timely information, but implementation at the provincial level was missing.\n\n“In Punjab, intelligence leads are acted upon, and results are visible,” the minister claimed about the province where his own party is in power.\n\n“But in Khyber Pakhtunkhwa, either there’s no capacity or no will to act,” the minister claimed, without giving any proof of lapse by the KP administration.\n\nCalling for accountability, he challenged PTI leaders to present their 13-year performance in KP.\n\nMr Chaudhry, who was appointed as the junior minister for interior last week, said he was ready to present a report on the one-year performance of his ministry.\n\nFocus on PTI\n\nPTI leader Zartaj Gul, in her speech, censured Defence Minister Khawaja Asif for criticising PTI on the floor of the house even at a time of national tragedy.\n\nMr Asif, she claimed, had “no right to hold the ministerial portfolio” as he “lost to [PTI’s] Rehana Dar” during the 2024 general elections.\n\nAccording to the official results announced by ECP, Mr Asif defeated Ms Dar with a margin of over 18,000 votes.\n\nMs Wazir also slammed the federal government over its “poor performance despite a jumbo cabinet”.\n\nUsman Badini of JUI-F said the grievances of the people of Balochistan should be addressed and called for “practical steps” to solve the issues faced by the province.\n\nSheikh Aftab Ahmad of PML-N said all political parties should sit together to find solutions to challenges faced by Pakistan, especially terrorism.\n\nSehar Kamran of PPP also commended security forces for successfully completing the operation against the terrorists who had attacked Jaffar Express.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:12:36.361Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897966/terrorists-their-social-media-backers-cut-from-same-cloth-says-talal",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:27:05.000Z"
}
