{
  "title": "Pakistan may face travel ban by US if govt doesn’t address ‘deficiencies within 60 days’ - World - DAWN.COM",
  "author": null,
  "content": "Donald Trump’s administration in Washington is considering issuing sweeping travel restrictions for the citizens of dozens of countries as part of a new ban and Pakistan has been placed in a group that would be considered for a partial suspension of visa issuance if their governments “do not make efforts to address deficiencies within 60 days”, according to sources familiar with the matter and an internal memo seen by Reuters.\n\nThe memo lists a total of 41 countries divided into three separate groups. The first group of 10 countries, including Afghanistan, Iran, Syria, Cuba and North Korea among others, would be set for a full visa suspension.\n\nIn the second group, five countries — Eritrea, Haiti, Laos, Myanmar and South Sudan — would face partial suspensions that would impact tourist and student visas as well as other immigrant visas, with some exceptions.\n\nIn the third group, a total of 26 countries that includes Belarus, Pakistan and Turkmenistan among others would be considered for a partial suspension of US visa issuance if their governments “do not make efforts to address deficiencies within 60 days”, the memo said.\n\nA US official speaking on the condition of anonymity cautioned there could be changes on the list and that it was yet to be approved by the administration, including US Secretary of State Marco Rubio.\n\nThe New York Times first reported on the list of countries.\n\nThe move harkens back to President Donald Trump’s first term ban on travelers from seven majority-Muslim nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018.\n\nTrump issued an executive order on January 20 requiring intensified security vetting of any foreigners seeking admission to the U.S. to detect national security threats.\n\nThat order directed several cabinet members to submit by March 21 a list of countries from which travel should be partly or fully suspended because their “vetting and screening information is so deficient”.\n\nTrump’s directive is part of an immigration crackdown that he launched at the start of his second term.\n\nHe previewed his plan in an October 2023 speech, pledging to restrict people from the Gaza Strip, Libya, Somalia, Syria, Yemen and “anywhere else that threatens our security.”\n\nThe State Department did not immediately respond to a request for comment from Reuters.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:11:57.893Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898056/pakistan-may-face-travel-ban-by-us-if-govt-doesnt-address-deficiencies-within-60-days",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T05:48:19.000Z"
}
