{
  "title": "Military vows to crush Balochistan terrorists, abettors - Newspaper - DAWN.COM",
  "author": null,
  "content": "• ISPR director general, Balochistan chief minister point to India as ‘main sponsor of terror’\n• 23 security personnel among 31 casualties; officials fear toll from Jaffar Express tragedy may rise\n• Bugti says no grievances justify such a heinous act; sees TTP and BLA as two sides of same coin\n\nISLAMABAD: The military on Friday vowed to take decisive action against terrorists operating in Balochistan — along with their abettors and facilitators, both inside and outside the country — following the hijacking of the Jaffar Express.\n\nIn a press conference al­o­ngside Balochistan Chief Minister Sarfraz Bugti, Inter-Services Pub­lic Relations (ISPR) chief Lt Gen Ahmed Sharif Cha­u­dhry declared, “We will take them on, their facilitators, and abettors whether inside Pakistan or outside”.\n\n“They will be dealt with sternly and in the way those killing innocent people deserve to be treated,” Lt Gen Sharif said, explaining a statement he made the other day when he posited that the “rules of engagement” have changed after this latest attack.\n\nThe press briefing came after Pakistani special forces successfully cleared the hijacked train. The operation, which lasted over 36 hours, resulted in the rescue of 354 passengers. However, 26 hostages lost their lives, including 18 military and Frontier Corps personnel, three railway employees, and five civilians.\n\nAdditionally, five security personnel were martyred. The casualty count could rise, as 37 of the rescued hostages sustained injuries and are being treated at hospitals.\n\nLt Gen Sharif dismissed claims of an intelligence failure, stating that security agencies consistently work to thwart thousands of threats, but cannot publicly disclose their successes. He emphasised that intelligence gathered before the attack played a crucial role in the operation’s success.\n\nThere was a general threat alert for the Sibi area before the attack, but it was not specific. How­ever, the available intellig­ence helped in the successful execution of the counterterrorism operation.\n\nRescue operation\n\nThe hostages were released in three phases: first, a group of Baloch locals was freed by the terrorists after ethnic profiling, in what the director general of ISPR termed a “deceptive perception manoeuvre”.\n\nThe second group esca­ped when Frontier Corps snipers created an opport­u­nity for them to flee, altho­ugh a couple of passengers lost their lives when terrorists fired at them.\n\nThe third and final group was rescued during the clearance operation by the Special Services Group (SSG), which successfully neutralised the remaining terrorists aboard the train. No hostages were killed during the final assault, he said.\n\nA total of 33 terrorists were eliminated in the operation, though some managed to escape before the clearance phase began. Security forces have launched a sanitisation operation in the area to track down any remaining militants.\n\nLinks to Afghanistan, India\n\nLt Gen Sharif linked the attack to Afghanistan, sta­ting that the hijackers were in constant communication with their handlers across the border. While the operation was underway, Indian media ran an information warfare campaign aimed at glorifying the terrorists, he claimed.\n\n“We must understand that in this terrorist incident in Balochistan, and others before, the main sponsor is your eastern neighbour,” he said.\n\nHe recalled Pakistan’s counterterrorism efforts since 2014, highlighting the formation of the National Action Plan (NAP) as a crucial step in combating terrorism.\n\n“All political parties and stakeholders sat together and developed this consensus, which became the foundation of the National Action Plan. The previous government further reviewed and revised it, resulting in a renewed commitment to counter-terrorism,” he stated.\n\nThe revised NAP includes 14 critical points addressing the root causes and mechanisms of terrorism most of which have now been included in the Azm-i-Istehkam vision that is being currently followed. “If we fo­­cus on implementing these 14 points in letter and spirit, I believe terrorism can be eradicated,” he said.\n\nThe ISPR chief detailed the ongoing counterterrorism operations, revealing that in 2024 alone, security forces conducted 59,775 intelligence-based operations both major and minor.\n\nSo far in 2025, 11,654 IBOs have been carried out. He noted that 1,250 terrorists were killed during 2024 and 2025, while 563 security personnel were martyred.\n\nBalochistan Chief Minister Sar­fraz Bugti characterised the hijacking as a clear act of terrorism, dismissing any notions that it stemmed from economic grievances or political issues. “This was purely an act of terrorism carried out by evil forces that not only want to destabilise Pakistan, but also want to break it,” he stated.\n\nCM Bugti accused India’s intelligence agency, RAW, of orchestrating anti-Pakistan activities through Afghanistan.\n\nHe claimed that while the banned TTP and BLA follow different ideologies, their handlers — a reference to India that funds and trains them to carry out attacks against Pakistan — keep them together.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:11:58.968Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897969",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:27:05.000Z"
}
