{
  "title": "Gold hits record Rs314,000 per tola - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The domestic gold prices for 10-gram and one-tola reached an unprecedented high of Rs269,204 and Rs314,000 on Friday, increasing by Rs4,030 and Rs4,700 day-on-day.\n\nIn the international market, the spot gold hit an all-time high of $3,004.86, before easing 0.1pc to $2,986.26 on profit-taking.\n\nAll Pakistan Sarafa Gem and Jewellers Association (APSGJA) President Qasim Shikarpuri stated that several factors have contributed to the rise in global gold prices.\n\nThe main reasons include the imposition of US tariffs on various countries, retaliatory duties by Canada and China, the ongoing Ukraine-Russia war, and the lack of resolution in the Israel-Gaza conflict.\n\nHe said another panicky situation has emerged as the US has started lifting gold from various countries to pile up its reserves.\n\nThese developments intensified panic buying by investors worldwide for safe-haven purposes. “Investors in Pakistan are also following suit,” he claimed.\n\nRather than consumers, only investors are active in the local bullion market and are involved in buying and selling gold as per the world market situation, he said.\n\nMr Qasim said many consumers cannot buy gold jewellery as they don’t have any surplus cash and are more occupied with managing inflated power and grocery bills.\n\n“After running out of cash, many consumers are coming up for selling out old jewellery sets to manage their daily expenditure and paying their power bills,” he said.\n\nDespite a peak marriage season set to start after Ramazan, the gold markets wear a deserted look as the record high prices restrict families from buying jewellery sets for their daughters.\n\nRegarding the chances of ease in domestic prices, he said bullion rates will continue to shine if issues like the Russia-Ukraine war, the Israel-Gaza crisis, the US gold buying spree, and the tariff war persist.\n\nHe said rupee-dollar stability in the interbank market had averted a significant increase in the domestic gold rate. Otherwise, the price situation would have been more alarming.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d4d9203c733.gif",
  "retrievedAt": "2025-08-25T15:12:16.452Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897993/gold-hits-record-rs314000-per-tola",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:34:47.000Z"
}
