{
  "title": "UN chief promises to do ‘everything’ to avoid food cuts to Rohingyas - World - DAWN.COM",
  "author": null,
  "content": "COX’S BAZAR: UN chief Antonio Guterres said on Friday the organisation would do “everything” to prevent food rations being cut for Rohingya refugees in Bangladesh.\n\nGuterres met Rohingya refugees in the camps in Cox’s Bazar for a show of solidarity and attended Iftar with the mostly Muslim persecuted minority. Many of the one million refugees that live in the squalid relief camps escaped war in neighbouring Myanmar after the 2017 military crackdown and are now threatened by dire humanitarian aid cuts.\n\nGuterres said “dramatic” cuts in humanitarian aid announced by the United States and other countries meant there was a “risk to cut food rations in this camp”. “I can promise that we will do everything to avoid it and I will be talking to all countries in the world that can support us in order to make sure that funds are made available to avoid a situation in which people would suffer even more and that some people would even die,” Guterres said.\n\nMore than 100,000 participated in the fast-breaking sunset meal with Guterres, with a few of them holding placards that said, “No more refugee life” and, “We are Rohingyas, not stateless.” Guterres said it was “essential” that peace is reestablished in Myanmar, the “rights of the Rohingyas are respected”, and that “discrimination and persecution like the one we have witnessed in the past, will end”.\n\nUnicef says youngsters in Bangladesh camps are experiencing the worst levels of malnutrition since 2017\n\nHe was accompanied by members of Dhaka’s interim government, including its chief adviser, Nobel Peace Prize winner Muhammad Yunus. US President Donald Trump imposed a freeze on foreign aid in January pending a review, sending shockwaves through the humanitarian community.\n\nAid funding shortfalls would require a cut in monthly food vouchers from $12.50 to $6.00 per person at the camps, the UN World Food Programme announced this month. Successive aid cuts have already caused intense hardship among Rohingya in the overcrowded settlements, who are reliant on aid and suffer from rampant malnutrition.\n\nThe UN children’s agency Unicef said youngsters in the camps were experiencing the worst levels of malnutrition since 2017, with admissions for severe malnutrition treatment up 27 per cent in February compared with the same months in 2024.\n\nUnicef’s representative in Bangladesh Rana Flowers said that cancelled US grants for Bangladesh accounted for around a quarter of her agency’s Rohingya refugee response costs. Bangladesh has struggled to support its refugee population, and Dhaka has said it is exploring ways to secure additional aid for Rohingya refugees.\n\nGuterres, who held talks with Yunus earlier on Friday in Dhaka, said he appreciated the “close cooperation” between the UN and Dhaka. Rohingya living in the camps around Cox’s Bazar are not allowed to seek employment and are almost entirely dependent on limited humanitarian aid to survive.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d4db587c000.gif",
  "retrievedAt": "2025-10-12T01:58:46.438Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898004/un-chief-promises-to-do-everything-to-avoid-food-cuts-to-rohingyas",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:44:17.000Z"
}
