{
  "title": "Putin calls for Kyiv to surrender in Kursk - World - DAWN.COM",
  "author": null,
  "content": "• Remarks come after Trump urges Russian president to spare Ukrainian troops\n• G7 warns Moscow of new sanctions unless it accepts ceasefire\n• Putin, Saudi crown prince discuss Opec+ agreements, Ukraine crisis\n• Zelensky says there is now a good chance to end war\n\nWASHINGTON: Russian President Vladimir Putin on Friday called on Ukrainian troops fighting in the Kursk region to surrender, after US President Donald Trump urged Putin to “spare” the lives of Ukrainian soldiers.\n\n“We are sympathetic to President Trump’s call,” Putin said in televised remarks. “If they lay down their arms and surrender, they will be guaranteed life and dignified treatment,” Putin added, calling on Ukraine’s leaders to issue an order to their troops to surrender.\n\nHis remarks came after US President Donald Trump urged Putin on Friday to spare Ukrainian troops being pushed back out of Kursk and said there was a “very good chance” the war could end.\n\nTrump posted on social media after his envoy, Steve Witkoff, held a lengthy meeting with Putin on Thursday night in Moscow that Trump described as “very good and productive”.\n\n“There is a very good chance that this horrible, bloody war can finally come to an end,” he said.\n\nThe US president said thousands of Ukrainian troops were “completely surrounded” by the Russian military and “in a very bad and vulnerable position”.\n\nHe added, “I have strongly requested to President Putin that their lives be spared. This would be a horrible massacre, one not seen since World War II. God bless them all!!!”\n\nMilitary analysts have said Ukrainian forces in Kursk are nearly cut off after rapidly losing ground in what had been their only foothold in Russian territory.\n\nKyiv’s military, however, said there was no threat of encirclement, and that its troops were pulling back to better positions.\n\nUS Secretary of State Marco Rubio, at a G7 meeting in La Malbaie, Canada, said Witkoff is returning to the United States and there may be discussions about Ukraine over the weekend.\n\n“But we certainly feel like we’re at least some steps closer to ending this war and bringing peace. But it’s still a long journey,” he told reporters.\n\nMoscow said on Friday that its forces had recaptured another village in their drive to dislodge Ukrainian forces from their last remaining footholds inside Russia’s Kursk region.\n\nThe Kremlin said Putin had sent Trump a message about his ceasefire plan via Witkoff, expressing “cautious optimism” that a deal could be reached to end the three-year-old conflict. White House press secretary Karoline Leavitt told reporters that Trump himself had not spoken to Putin yet.\n\nUkrainian President Volodymyr Zelenskiy also said on Friday that he saw a good chance to end the war with Russia.\n\n“Right now, we have a good chance to end this war quickly and secure peace. We have solid security understandings with our European partners,” Zelenskiy said on X. “We are now close to the first step in ending any war silence,” he said, referring to a truce.\n\nG7 threatens new sanctions\n\nThe Group of Seven powers on Friday warned Russia of new sanctions unless it accepts a ceasefire with Ukraine, in a forceful show of unity after President Donald Trump rattled the club of democracies.\n\nIn a meeting in Quebec, G7 foreign ministers also backed Ukraine’s fight for its “territorial integrity” and spoke of Russia’s “aggression”, terminology earlier eschewed by Trump as he reached out to Moscow.\n\nThe consensus on Ukraine came despite mounting tension within the G7 — Britain, Canada, France, Germany, Italy, Japan and the United States — as Trump slaps punishing tariffs on both friends and foes and questions the very sovereignty of host Canada.\n\nA G7 statement backed a US-led call for a 30-day truce embraced by Ukraine and “called for Russia to reciprocate by agreeing to a ceasefire on equal terms and implementing it fully.”\n\n“They discussed imposing further costs on Russia in case such a ceasefire is not agreed, including through further sanctions, caps on oil prices, as well as additional support for Ukraine, and other means,” such as using frozen Russian assets.\n\nPutin-MBS call\n\nMeanwhile, President Putin and Saudi Arabia’s Crown Prince Mohammed bin Salman agreed on the importance of upholding their Opec+ commitments and discussed moves to bring peace to Ukraine during a phone call.\n\nThe leaders of the two countries reaffirmed their commitment to fulfilling their obligations under the Opec+ agreement, the Kremlin said in a statement on Thursday published after the call.\n\nPutin also thanked the crown prince for Saudi Arabia’s mediation efforts when it came to hosting negotiations between Russian and US diplomats in a meeting in February.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:12:30.489Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897963/putin-calls-for-kyiv-to-surrender-in-kursk",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:27:11.000Z"
}
