{
  "title": "Pakistan urges world to act ‘decisively’ against Islamophobia - Pakistan - DAWN.COM",
  "author": null,
  "content": "Permanent Representative of Pakistan to the UN, Munir Akram, speaking on behalf of the Organisation of Islamic Cooperation (OIC), called on the global community to act “decisively” in countering the rising incidents of Islamophobia and other manifestations of anti-Muslim hate, bigotry and intolerance.\n\nAmbassador Akram remarks came as the UN General Assembly marked the International Day to Combat Islamophobia on Friday.\n\n“Our aim must be to promote a collective effort to combat Islamophobia with unity and empathy,” Akram told the 193-member assembly, which also heard solidarity messages from UN Secretary-General Antonio Guterres and the assembly president, Philemon Yang.\n\n“We should commit to utilising the positive messages of peace, justice, tolerance and compassion that Islam and indeed all religions offer to combat Islamophobia and all other manifestations of hate, bigotry and intolerance.”\n\nIn 2022, the General Assembly adopted a resolution, co-sponsored by Pakistan, designating March 15 as the International Day to Combat Islamophobia, which he called a “defining moment” as the world finally recognised the danger posed by this menace.\n\nThe day was celebrated as the Muslim world was observing the holy month of Ramazan.\n\n“Islamophobia is not restricted to one region — It is resurgent in the West and the East,” Ambassador Akram said, speaking for OIC.\n\n“Islamophobia is now being used as an avenue for political advancement and popularity, feeding the worst human instincts of fear, prejudice and hate [and] in some countries, Muslims are being systematically marginalised and suppressed,” the Pakistani envoy added.\n\nIn this regard, Ambassador Akram urged governments to ensure that their policies and laws reflected an unambiguous commitment to religious tolerance; and media and disinformation are not used to fuel hate.\n\nHe further asked the governments to make sure no law was weaponised to curtail Muslim identity or discriminate against them; and no citizen of any State is relegated to second-class status based on their faith.\n\n“No nation can claim to be a true democracy while it systematically alienates and marginalises its Muslim citizens,” he said.\n\nPointing out the consequences of religious intolerance, mass expulsions, inquisitions, pogroms and genocide, the Pakistani envoy said, “Today, Islamophobic postures, policies and actions follow the same dangerous hate and intolerance have proliferated in recent times, especially against Muslims.\n\n“We witness political narratives that seek to exclude, disenfranchise, and demonise Muslims even in societies that have acted as champions of tolerance, pluralism, democracy and human rights.”\n\nThe manifestations of Islamophobia, he pointed out, included multiple acts of desecration Islam’s sacred symbols and sites; defamation of Holy Prophet Muhammad (PBUH); the suppression of Muslim identity such as hijab bans; and the marginalisation of and discrimination against entire Muslim communities.\n\n“In many places, prejudice against Muslims is being stoked rather than suppressed; resentments are being revived rather than reconciled; and discrimination is being legitimised by policies and pronouncements,” he added.\n\nIn this context, he cited the Christchurch massacre of 15 March 2019 and the Israeli slaughter of Palestinians in Gaza as “vivid illustration of Islamophobia, hatred and racism”.\n\nAmbassador Akram thanked the UN chief for indicating his intention to nominate Miguel Moratinos, a senior Spanish diplomat and the head of UN Alliance of Civilisation, as his Special Envoy on Islamophobia.\n\n“We call for the early approval of the financial resources required to enable the secretary-general and his special envoy to implement the provisions of this general assembly resolution on combating Islamophobia.”\n\nThe OIC, he added, looked forward to working with the secretary-general and his special envoy to develop a plan of action to combat Islamophobia.\n\nSuch a plan of action could include: a definition of Islamophobia and its manifestations, a mechanism to monitor and compile acts of Islamophobia, and a template for national legislation criminalising acts of Islamophobia.\n\nIt might also incorporate an accountability mechanism as well as media and education programmes to counter Islamophobia and propagate tolerance and harmony in societies.\n\nAmbassador Akram expressed his appreciation for the efforts of some Western countries including Sweden and Denmark, which have enacted laws to address Islamophobia such as criminalisation of acts of desecration of the Holy Quran, and to ensure that freedom of expression was not misused to propagate hate and intolerance.\n\nHe noted that Canada had appointed a special representative to combat Islamophobia, while the US launched a national strategy against anti-Muslim hate. Australia also appointed a special envoy to promote interfaith dialogue.\n\n“We urge other nations to follow suit,” he said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:11:56.823Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898065/pakistan-urges-world-to-act-decisively-against-islamophobia",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T08:38:19.000Z"
}
