{
  "title": "SC to hear Imran’s contempt case next week in petition against 2022 Azadi March - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Supreme Court on Saturday set the hearing date of March 21 for a contempt of court petition against PTI founder Imran Khan.\n\nIn 2022, the SC had raised questions on the maintainability of the plea seeking contempt proceedings against the former PTI chairman — for allegedly flouting the top court’s orders regarding his party’s ‘Azadi March’ on May 25 of that year — and observed that the petition, filed by the interior ministry, was “ineffective”.\n\nThe ministry had stated in the plea that the apex court had directed the PTI to hold its ‘Azadi March’ gathering on a ground located between sectors H-9 and G-9, but Imran and his supporters made their way towards D-Chowk in alleged contravention of court orders.\n\nAccording to a fresh development, a five-member constitutional bench headed by Justice Aminuddin Khan will hear the petition on March 21.\n\nThe bench will comprise Justice Jamal Khan Mandokhail, Justice Naeem Akhter Afghan, Justice Hashim Khan Kakar and Justice Aamer Farooq as well.\n\nOn October 13, the interior ministry instituted contempt of court charges against Imran for allegedly flouting the SC’s May 25 order.\n\nIn the May order, the petition recalled, the apex court had directed the PTI to hold its ‘Azadi March’ gathering in a ground located between sectors H-9 and G-9 in view of the categorical assurances on behalf of the party’s top leadership and their counsel that their rally would not cause any inconvenience or blockage of the Srinagar Highway or trouble the public and that the rally would be conducted in a peaceful and lawful manner.\n\nDespite these assurances, the PTI top leadership, acting in blatant disregard for the directions, exhorted its supporters to reach D-Chowk, falsely professing that the court had allowed the march without any conditions.\n\nThe contempt petition pleaded for the implementation of the apex court order for the protection of the fundamental rights of the public, particularly residents of Islamabad and Rawalpindi.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/151610184c8092f.jpg",
  "retrievedAt": "2025-08-25T15:11:56.841Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898076/sc-to-hear-imrans-contempt-case-next-week-in-petition-against-2022-azadi-march",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T11:25:00.000Z"
}
