{
  "title": "Balo­ch­istan MPAs protest power, gas shortages - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Members of the Balo­ch­istan Assembly on Friday stron­gly protested against the persistent electricity and gas shortages during Ramazan, demanding the summoning of officials from the Quetta Electric Supply Company (Qesco) and Sui Southern Gas Company (SSGC) for an explanation.\n\nDeputy Speaker Ghazala Gola, who presided over the session, took serious notice of the situation and summoned the chief executives of both utilities to appear before the assembly.\n\nSoon after the session began, PPP legislator Haji Ali Madad Jattak raised a point of order, stating that Qesco and SSGC had earlier assured uninterrupted power and gas supply during Ramazan.\n\nHowever, he said that in Sariab, both essential services remained unavailable during Sehri and Iftar, while consumers continued to receive hefty bills. He demanded that officials from both entities be summoned immediately.\n\nBalochistan deputy speaker summons Qesco, SSGC chiefs\n\nBalochistan’s Public Accounts Committee Chairman Asghar Ali Tareen expressed concern over the situation in Pishin, where a population of 1.2 million was receiving only two-phase electricity for a few hours a day, depriving residents of access to drinking water.\n\nBalochistan Awami Party member Farah Azeem Shah highlighted the impact of both scheduled and unscheduled gas load-shedding, adding that gas leaks were causing deadly explosions. In response, Deputy Speaker Gola issued a ruling summoning Qesco and SSGC officials to address the crisis.\n\nSeparately, Jamiat Ulema-i-Islam member Mir Zabid Ali Reki raised concerns over the prolonged closure of the border crossing at Mashkel, a Pakistan-Iran border town in Washuk district.\n\nHe said the local population had staged a sit-in protest in Quetta, and despite negotiations to reopen the crossing, it had remained closed for over three months. He urged the government to intervene immediately.\n\nFinance Minister Mir Shoaib Nosherwani assured the house that the concerns of Mashkel and Kha­ran residents would be addressed in consultation with Mr Reki.\n\nMeanwhile, Jamaat-i-Islami me­­mber Abdul Majeed Badini obj­ec­ted to the non-distribution of Zakat funds for the past two years.\n\nHe welcomed the chief minister’s decision to dissolve the Zakat Department and called for the immediate disbursement of pending funds to the needy before Eid.\n\nPDMC decision criticised\n\nThe treasury and opposition me­­mbers also protested the Pakistan Medical Dental Council (PMDC) decision to cut medical seats allotted for students of Balochistan and former Fata districts.\n\nJUI-F member Dr Nawaz Kakar moved a resolution condemning the PMDC’s decision, which was adopted by the house.\n\nIt said the decision to cut seats from 333 to 194 was “unjust and attempt to deprive the youth of education opportunities”.\n\nFormer chief minister Dr Abdul Malik Baloch criticised the federal government for selectively implementing the 18th Amendment and depriving provinces of their due assets. He said the issue of medical seats should be discussed in the Council of Common Interests.\n\nAwami National Party member Engineer Zamrak Khan Achakzai demanded the establishment of a provincial Higher Education Commission.\n\nMinister of Education Raheela Hameed Durrani stated that efforts were being made to address the financial crisis of universities.\n\nProvincial Minister Bakht Muhammad Kakar said the number of medical seats under the federal government’s scholarship programme, initiated in 2018, has been reduced in the past, but the decisions were later revoked.\n\nThe house adopted another resolution, moved by Jamaat-i-Islami MPA Maulana Hidayatur Rehman Baloch for government support for the fishing sector.\n\nHe said mass fishing by trawlers has severely affected local fishermen, who were struggling to make ends meet.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:58:09.216Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898011/balochistan-mpas-protest-power-gas-shortages",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:55:16.000Z"
}
