{
  "title": "Terrorist attacks on 4 police stations in Lakki Marwat, Bannu repelled - Pakistan - DAWN.COM",
  "author": null,
  "content": "Four police stations in Khyber Pakhtunkhwa’s Bannu and Lakki Marwat districts came under attack overnight by terrorists but they were repelled and no casualties were reported, officials said on Saturday.\n\nPakistan has witnessed an uptick in terror activities over the past year, especially in KP and Balochistan, after the banned Tehreek-i-Taliban Pakistan (TTP) ended its ceasefire with the government in November 2022.\n\nAccording to official statements issued by the police, terrorists targeted two police stations in Lakki Marwat last night while two cops were injured in a roadside blast. Meanwhile, another two police stations and a checkpost came under attack in Bannu.\n\nThe outlawed TTP claimed responsibility for all these attacks in the two districts in separate statements.\n\nA statement by the Lakki Marwat police said terrorists attacked the Dadiwala and Pezo police stations on Friday night but “both attacks were repelled due to timely action by the police”. No casualties were reported in either of the assaults.\n\nHowever, the statement added that two cops were injured while one of the attackers was killed in retaliatory action as a roadside bomb targeted a police vehicle on Lakki Marwat’s Landiwah Road.\n\nThe police said militants carried out an improvised explosive device blast on Friday, injuring two policemen, including the driver.\n\nOne attacker was also killed “due to timely action by the police”, the statement said, adding that a search operation was conducted to apprehend his accomplice.\n\nLakki Marwat Deputy Commissioner Zeeshan Abdullah had issued a threat alert yesterday, according to the police.\n\nIn Bannu, unidentified men attacked the Khojri police post, as well as hurled hand grenades and opened fire at the Ghoriwala and Bakakhel police stations on late Friday night, police said.\n\n“Armed motorcyclists hurled two hand grenades at Khojri police post. After the attack on the police post, village elders came out with weapons to protect the police post,” the police said in a statement.\n\nIt quoted the locals as saying that they would protect the checkpost and that the people, along with the cops, “chanted slogans of long live the police”.\n\nRegarding the attack by unidentified armed men on the Ghoriwala and Bakakhel police stations, the statement said the police “responded vigorously and the attackers fled”.\n\nNo casualties were reported in the attacks, the police added.\n\nInterior Minister Mohsin Naqvi commended the police for their timely action and foiling the attacks.\n\n“The unwavering role of the KP Police in the war against terrorism is commendable,” he said in a statement on X.\n\nFollowing the thwarted attacks, KP Inspector General of Police (IGP) Zulfiqar Hameed in a statement paid tribute to the personnel for repelling the assaults.\n\n“Cowardly attacks by terrorists in the dark of night cannot demoralise police personnel,” the KP police chief was quoted as saying.\n\n“The youth of Khyber Pakhtunkhwa Police Force are fighting like a brick wall against the terrorists,” IG Hameed asserted, vowing that “all tactics of the terrorists will be foiled with an iron fist” with the public’s support.\n\n“We will fight steadfastly until terrorism is eradicated,” the IGP said, announcing commendation certificates and cash rewards for soldiers.\n\nEarlier this month, an attack on the Bannu Cantonment in the namesake district left five soldiers martyred while 16 terrorists were killed in the response. Due to the destruction caused by the blasts, 13 civilians, including six children, lost their lives, while another 32 were injured.\n\nIn counterterrorism efforts following the attack, security forces killed three terrorists in the KP’s Tank district. On Thursday, 10 terrorists who attempted to attack a checkpost in KP’s Jandola area were eliminated.\n\nPakistan ranked second in the Global Terrorism Index 2025, with the number of deaths in terrorist attacks rising by 45 per cent over the past year to 1,081.\n\nFebruary saw a marginal increase in terrorist attacks but witnessed a sharp surge in civilian casualties, according to a report published by the Islamabad-based think tank, Pakistan Institute for Conflict and Security Studies (PICSS).",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/15161404cd9be31.jpg",
  "retrievedAt": "2025-08-25T15:11:56.796Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898073/terrorist-attacks-on-4-police-stations-in-lakki-marwat-bannu-repelled",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T11:43:31.000Z"
}
