{
  "title": "Stocks consolidate overnight gains - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Optimism about a successful IMF review kept investors bullish, helping the benchmark index consolidate overnight gains above 115,500 on selective value-hunting despite a dismal volume on Friday.\n\nThe benchmark KSE 100 index added 441.93 points or 0.38pc to settle at 115,536 in the weekend session.\n\nAli Najib, Head of Sales at Insight Securities, noted that sustaining gains above the psychological level of 115,500 will likely unleash further upside in the coming week.\n\nInvestors opted to strengthen their positions before the IMF review’s conclusion, where the street expects the country to sail through it smoothly.\n\nAccording to media reports, the IMF has already agreed to reduce the tax collection target by Rs620 billion from Rs12.97tr to Rs12.35tr, which was an obstacle to the ongoing review.\n\nTopline Securities Ltd said the index extended its gain as the expectation that Pakistan will clear its first review of the $7bn bailout programme and continue to garner investor interest.\n\nThe top positive contribution to the index came from Mari Energies, Fauji Fertiliser, Engro Fertiliser, Systems Ltd, Air Link Communication Ltd and Pak Elektron Ltd, as they cumulatively added 426 points.\n\nHowever, the market activity remained subdued as the trading volume fell 5.83pc to 360.56.63 million shares while the traded value tumbled 17.19pc to Rs21.03bn day-on-day.\n\nStocks contributing significantly to the traded volume included Pakistan International Bulk Terminal (42.70m shares), The Bank of Punjab (36.14m shares), Fauji Foods (25.61m shares), Fauji Cement (18.75m shares) and Maple Leaf Cement (18.45m shares).\n\nThe shares registering the most significant increases in their share prices in absolute terms were Unilever Foods (Rs195.80), Mari Energies (Rs28.04), Pakistan Tobacco (Rs24.95), Murree Brewery (Rs20.24) and Indus Motor (Rs18.01).\n\nThe companies registering significant decreases in their share prices in absolute terms were Rafhan Maize (Rs80.16), PIA Holding Company [B] (Rs71.55), Supernet Techno (Rs39.61), Thal Industries (Rs25.39) and Nestle Pakistan (Rs14.00).\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d4d91cc474d.gif",
  "retrievedAt": "2025-10-12T01:58:09.279Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897994/stocks-consolidate-overnight-gains",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:34:47.000Z"
}
