{
  "title": "Pharma giants face new trial over infant formula - World - DAWN.COM",
  "author": null,
  "content": "MISSOURI: A Missouri judge has ordered Abbott Laboratories and Reckitt Benckiser unit Mead Johnson to face a new trial over allegations that they failed to warn a mother about the risks of their specialised baby formulas for premature infants, re-opening a case that had resulted in a victory for the defendants.\n\nThe Thursday ruling comes months after a St. Louis, Missouri state court found that the companies were not responsible for a young boy’s debilitating intestinal disease. The case had been a victory for the two companies following large losses in similar trials that had rattled investors.\n\nMissouri Circuit Judge Michael Noble in St. Louis, Missouri, said the defendants lawyers had engaged in misconduct that resulted in an unfair verdict from the jury and ordered a new trial. Abbott and Reckitt said they would appeal.\n\nAbbott spokesperson Scott Stoffel said the jury had reached the correct decision, based on evidence from scientists and governmental regulators who have said there is no conclusive link between preterm infant formula and the plaintiff’s son’s intestinal disease.\n\n“We are disappointed by the courts extraordinary decision to set aside the jurys work,” Stoffel said. “This decision is at complete odds with the law and the facts, and we will appeal,” Reckitt said in a statement.\n\nNoble said Abbott and Mead Johnson’s lawyers intentionally and repeatedly violated clear instructions when presenting evidence to the jury.\n\nThe defence attorneys “flooded the zone” with objections, presented evidence that the judge had previously disallowed, and confused the jury by attacking “straw man” arguments and saying that babies would “starve to death” if the products were pulled from the market, according to Noble’s ruling.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:59:01.437Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897998/pharma-giants-face-new-trial-over-infant-formula",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:44:17.000Z"
}
