{
  "title": "Pakistan to make energy transition, investment plan, UN body told - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan has informed the ‘SEforALL Global Forum 2025’ its intention to develop an ‘Energy Transition and Investment Plan’ (ETIP), a strategic initiative aimed at accelerating the country’s shift towards a clean, affordable and sustainable energy future.\n\nThe Sustainable Energy for ALL, an international non-governmental organistaion, was launched by the United Nations Secretary General in 2011 to drive action towards achieving Sustainable Development Goal-7: ensuring access to sustainable energy for all by 2030.\n\nAt the closing plenary session of the two-day event in Bridgetown, Barbados, Adviser to Prime Minister Mohammad Ali spelt out the comprehensive plan, stating that it would serve as a roadmap towards a sustainable, secure and inclusive energy future and would help Pakistan in four broad areas.\n\nThese areas are: to develop a long-term investment roadmap to transition to a cleaner and more resilient energy system; ensure energy security by identifying cost-effective renewable energy solutions that reduce dependency on volatile fuel imports; support a just transition, creating green job opportunities and safeguarding industrial competitiveness in a decarbonising world; and enhance financial viability by attracting investments in energy infrastructure and addressing systemic inefficiencies.\n\nETIP roadmap to help country in four broad areas, says adviser to premier\n\n“The United Nations has been an indispensable partner in our pursuit of sustainable energy solutions and despite demands from a number of countries across the world, SEforALL agreed to work with the government in developing Pakistan’s Energy Transition and Investment Plan,” said the adviser at the forum.\n\nIn February 2016, Pakistan became the first country to adopt the SDGs as part of its national development agenda. The energy pillar has a critical role to play in supporting the country’s industrial growth and creating new employment opportunities, and realising how important energy transition is, Pakistan’s energy reform process is being fast-tracked under the direct supervision of the PM.\n\nPakistan’s participation in the SEforALL Global Forum, one of the leading global platforms on energy transition, underscores the country’s strong commitment to climate action and sustainable development.\n\nThe UN Resident Coordinator’s Office (UNRCO) in Pakistan has played a key role in supporting this initiative, ensuring alignment with global practices and facilitating international collaboration.\n\nLike many other developing countries, Pakistan is also facing significant challenges in its transition towards renewable energy, while continuing to sustain the existing infrastructure, invest in latest technologies and also provide affordable energy to consumers.\n\nOne of the major challenges the country faces is to reduce its annual energy imports of $15 billion, which are being utilised to power mobility, space and water heating and cooling, cooking, and agriculture.\n\nAnd this is not possible without a major shift towards clean energy that can only happen after the preparation of a comprehensive plan covering all facets of society including transportation, industry and agriculture.\n\nThe adviser to the premier thanked UN Resident Coordinator in Pakistan, Mohamed Yahya and CEO of SEforALL, Damilola Ogunbiyi and their teams for their tremendous support to the country in this regard.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/15094405cea0659.jpg",
  "retrievedAt": "2025-10-12T01:58:06.106Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898017/pakistan-to-make-energy-transition-investment-plan-un-body-told",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:55:16.000Z"
}
