{
  "title": "China, Pakistan both focused on KKH, ML-1 completion: Chinese consul general - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Chinese Consul General Yang Yundong said on Friday that both China and Pakistan were focused at the completion of the Karakoram Highway (KKH) and the Main Line-1 (ML-1) project.\n\nPakistan has held strong bilateral relations with China which has supported it through many investments and development projects such as the China-Pakistan Economic Corridor (CPEC), which was termed as a “lifeline” for the country’s economy.\n\nIn September last year, China agreed to assist Pakistan in completing four major projects in the transportation and communications sectors.\n\nBoth countries were set to work together in completing ML-1, M-6 and M-9 projects along with the second phase of KKH and the construction of Kaghan-Naran, Jhal Khand, Babusar Top and Tunnel till KKH.\n\nSpeaking at a press briefing for ‘Two Sessions for 2025’ at the Consulate General of China, Yang said, “Both sides are working very hard to complete these projects.”\n\n“The new international airport in Gwadar, which was completed only last year, will also contribute in opening more opportunities,” he said, adding, “Both China and Pakistan are encouraging more ships to use the Gwadar Port for trade.”\n\nThe ‘Two Sessions’ marked an annual event pivotal to China’s economic and social development. Yang revealed that China achieved the major targets and tasks set for the year’s economic and social development in 2024.\n\n“Chinese modernisation has made significant new achievements, with high-quality development advancing steadily and new productive forces developing robustly,” he said, adding that China anticipated GDP growth of around 5 per cent.\n\n“At the same time, China will continue to expand high-standard opening up to the outside world and promote the deep and substantive advancement of the high-quality joint construction of the Belt and Road Initiative,” he added.\n\n“These important measures will undoubtedly provide new opportunities for the world through the new developments of Chinese modernisation.”\n\nHe further said that major-country diplomacy with Chinese characteristics had opened new horizons, and international cooperation achieved fresh progress for China.\n\n“This year’s government work report emphasised that China will adhere to an independent and peaceful foreign policy, remain committed to the path of peaceful development, and steadfastly pursue an open strategy of mutual benefit and win-win cooperation,” he continued.\n\n“China is willing to work with countries around the world to jointly advance an equal and orderly multipolar world and a universally beneficial and inclusive economic globalisation, uphold and practice true multilateralism, actively address major global challenges, and provide new development opportunities for the world,”\n\nThe Chinese official said that 2025 marked the 10th anniversary of President Xi Jinping’s historic visit to Pakistan, adding that the two countries would celebrate the 75th anniversary of diplomatic relations next year.\n\nChina-Pakistan relations are at an important juncture and development opportunity, he said.\n\nHe continued, “The two countries and their peoples should seize this opportunity to further enhance communication and coordination, deepen practical cooperation in various fields, and upgrade the CPEC.\n\n“Together, we will take firm steps towards modernisation, accelerate the construction of a closer China-Pakistan community with a shared future in the new era, bring more benefits to the two peoples, and jointly create a more prosperous and stable future.”\n\nML-1 railway line, from Karachi to Peshawar, is a crucial component of CPEC. Both China and Pakistan had renewed commitment in October 2024 to advancing the upgrade of the ML-1 line project.\n\nEarlier, Minister for Railways Hanif Abbasi said that the government might fund the ML-1 main line in case no international funding or partners. His statement came at a time when the government and the ministry of railways were expecting a long-awaited visit of the high-powered technical team from China by the end of March.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/151310128350d31.jpg",
  "retrievedAt": "2025-08-25T15:11:56.806Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898066/china-pakistan-both-focused-on-kkh-ml-1-completion-chinese-consul-general",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T09:18:00.000Z"
}
