{
  "title": "Govt imposes ban on use of 12 toxic pesticides - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: In a significant step towards environm­e­ntal sustainability and com­­p­l­i­ance with international agreements, the Ministry of Natio­n­­al Food Security and Research on Friday announ­ced a complete ban on 12 toxic pestici­d­­es, which are excessively used despite their known harm to health and environment.\n\nThe decision was taken at a high-level meeting, chaired by National Food Security Secre­tary Waseem Ajmal Chaud­h­ary, during which key stakeholders and experts engaged in an in-depth discussion on the growing reliance on Methyl Bromide (MB) and its implications.\n\nThese pesticides — previously used for pest control in major crops such as wheat, cotton, rice and vegetables — have been linked to severe environmental degradation, contamination of water sour­ces, and adverse health effects among farmers and consumers.\n\nFood ministry decides to curtail excessive use of Methyl Bromide on imported shipments as well\n\nTheir continued use has been a source of concern for both local experts and international regulatory bodies.\n\nShipments\n\nAnother landmark decision taken by the ministry is to curtail MB’s excessive use on imported shipments.\n\nThe meeting aimed to ensure Pakistan’s adherence to the Montreal Protocol, which restricts the use of MB except for quarantine and pre-shipment purposes only where no viable alternatives exist.\n\nMethyl Bromide usage in Pakistan has surged in recent years, particularly in imported commodities such as lentils, canola, soybeans, betel nuts, and cotton.\n\nExperts at the meeting exp­ressed deep concerns regarding its environmental and health impacts, emphasising the urgent need for regulatory intervention.\n\nDouble fumigation\n\nIt was decided that phytosanitary treatment should be conducted at the country of export to minimise the use of MB upon arrival. The practice of double fumigation would also be discouraged, reducing costs for importers and preventing unnecessary exposure to harmful chemicals, the participants agreed.\n\nIn addition to addressing the excessive use of Methyl Bromide, the ministry also took a decisive action against hazardous pesticides that pose serious risks to human health, biodiversity and agricultural sustainability.\n\nThe government’s decision to phase out these pesticides aligns with global best practices and international commitments to sustainable agriculture.\n\nScientists’ panel\n\nAccording to the ministry’s announcement, a Technical Committee of Scientists will play a crucial role in reviewing and updating regulations to ensure that safer, more environmentally friendly alternatives are adopted.\n\nThe Ministry of National Food Security and Research stated that Pakistan by implementing these reforms aimed to not only protect public health and the environment but also enhance its agricultural sector’s competitiveness in international markets, where compliance with stringent safety and quality standards was increasingly becoming a prerequisite for trade.\n\nThese measures are expec­t­­ed to reduce the cost of doing business, eliminate rent-seeking practices, and modernise Pakistan’s agricultural import policies while reinforcing the country’s commitment to glo­b­­al environmental agreements.\n\nThe food security ministry claimed that it remained dedicated to facilitating trade in a manner that prioritises sustainability, public health, and compliance with international obligations.\n\nPublished in Dawn, March 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:12:10.537Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898014/govt-imposes-ban-on-use-of-12-toxic-pesticides",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T01:55:16.000Z"
}
