{
  "title": "Over Rs260mln disbursed among 552 female entrepreneurs under YES",
  "link": "https://www.app.com.pk/national/over-rs260mln-disbursed-among-552-female-entrepreneurs-under-yes/",
  "date_published": "2020-08-30T01:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): The government has so far disbursed soft loans amounting to over Rs 260 million among 552 female entrepreneurs under the Youth Entrepreneurship Scheme (YES) of Prime Minister’s Kamyab Jawan Programme.\n“It constitutes 30 per cent of the total disbursed loans which are amounting to one billion rupees. So far 2,190 qualified male and female entrepreneurs have received concessionary loans under the Kamyab Jawan Programme,” said a document shared by the office of Special Assistant to the Prime Minister on Youth Affairs Muhammad Usman Dar.\nOut of total disbursed loans, around 70 per cent of the soft loans went to 1,638 male candidates, who were given over Rs 690 million, the document, a copy of which is available with APP, revealed.\nThe ‘YES’ was launched under the banner of Kamyab Jawan Programme in October last year with the seed allocation of Rs 100 billion.\n“The executing banks have so far approved two tier financing of Rs 3 billion for 7,592 eligible businesses. Out of the total approved loans, evaluation of 5,402 businesses is still underway,” said Usman Dar in a recent interview with this agency.\nHe said the Bank of Khyber (BoK), the Bank of Punjab (BoP) and the National Bank of Pakistan (NBP), which deal with the Youth Entrepreneurship Scheme, sanctioned Rs four billion soft loans for 28,859 SMEs after scrutinizing total 58,031, selected for carrying out the businesses’ analysis.\nOut of 28,859 SMEs, Usman said, 14,664 had been rejected by the banks, whereas 6,489 were under processes.\nHe said after evaluating the pre- feasibilities of all the applicants of YES, the banks had initially selected total 58,031 businesses for scrutiny. Scrutiny of some 10,699 was still underway, while 18,473 had been rejected.\nMore than one million applications were received under the Kamyab Jawan Programme, but unfortunately most of the applicants did not come up with practical business ideas, he said in response to a query.\nThe SAPM said the government had recently expanded the soft-loan scheme to benefit maximum number of young people across the country. The loan amount had been raised upto Rs 25 million.\nThree tiers were introduced under the programme for disbursement of loans ranging from Rs 100,000 to Rs 25 million among the youth, having workable business ideas. Third tier for a loan ranging from Rs 10 million to Rs 25 million has been added after the expansion of programme.\nHe said the mark-up rates on initial two tiers had also been halved from 6 per cent and 8 per cent to 3 per cent and four per cent respectively.",
  "retrievedAt": "2025-08-11T19:44:31.793Z"
}
