{
  "title": "Applications under Ehsaas Undergraduate Scholarship Project to open soon",
  "link": "https://www.app.com.pk/national/applications-under-ehsaas-undergraduate-scholarship-project-to-open-soon/",
  "date_published": "2020-08-30T01:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar has revealed that the process of receiving applications under Ehsaas Undergraduate Scholarship Project for the year 2020-2021 would start soon.\nIn a tweet, Dr. Nishtar informed that scholarship would cover 100 percent tuition fee of the student along with paying Rs. 4000 as living expenses.\nAccording to the Higher Education Commission, Phase-II of Ehsaas\nundergraduate Scholarship Project will be open for the students soon who have applied for the admission in any 125 HEC recognized public sector universities of Pakistan.\nThe interested students can visit the HEC website www.hec.gov.pk to get details about the eligibility criteria, list of universities and other important information and updates. The opening date of E-Application form will be announced shortly.\nEhsaas Undergraduate Scholarships Project is a fully funded financial assistance scheme which offers an opportunity to the meritorious and financially deserving students, especially females and persons with different abilities to continue higher education in a choice of their university.\nScholarships will be available for all fields of study in a regular four/five years undergraduate level degree programs only.\nTwo-year post higher secondary or equivalent programs, two years associate degree programs and the nomenclature of BA/BSC programs are excluded.\nIt is to be mentioned here that the project was launched on November 04, 2019, for students belonging from low-income backgrounds with the allocation of Rs. 20 billion for 2,00,000 scholarships over four-year.\nA total of 4.9 billion has been disbursed among 50,700 students in the first phase of scholarship program for the year 2019-2020.",
  "retrievedAt": "2025-08-11T19:44:35.672Z"
}
