{
  "title": "Sacrifice to revivify Islamic values real success: PM",
  "link": "https://www.app.com.pk/national/sacrifice-to-revivify-islamic-values-real-success-pm/",
  "date_published": "2020-08-30T01:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 30 (APP): Prime Minister Imran Khan said that the historic battle of Karbala fought between truth and falsehood had made it clear that the real success and steadfastness was the passion to sacrifice everything for revival and promotion of Islamic values.\nIn his message to the countrymen on Yaum-e-Ashur, the prime minister said that though 10th Muharram was already an important day in the Islamic history, the martyrdom of Imam Hussain (R.A) on the day gave it a unique significance.\nHe said the passion shown by Hazrat Imam Hussain helped enliven the Muslim tradition of faithfulness and truthfulness besides being a source of keeping alive the eternal message of Islam and passion to sacrifice.\nThe prime minister said that Imam Hussain (R.A)’s sacrifice was in fact a guiding principle for the Muslims which taught them to sacrifice everything during the struggle for truth. Only such a passion can lead us to any remarkable stature within the country as well as among the comity of nations, he added.\nPaying tribute to the sacrifices of the Kashmiri people, the prime minister said they had kept the teaching of Imam Hussain (R.A) alive and just like Karbala, they also made Kashmir an example of battle between truth and falsehood.\nHe said that likewise the world, COVID-19 had also impacted Pakistan, but consequent to timely actions by the government and cooperation by the people, the pandemic had been contained to a great extent.  The whole nation must be thankful to Allah for this, he said.\nThe prime minister also appealed the countrymen to adhere to the anti COVID-19 SOPs formulated by the government during the Muharram rituals. He advised the people to observe Ashura peacefully with religious fervor by shunning the sectarian biases.\nHe also called for special prayers for country’s progress and prosperity.",
  "retrievedAt": "2025-08-11T19:44:30.004Z"
}
