{
  "title": "ISSI launches book “Critical Issues Facing South Asia”",
  "link": "https://www.app.com.pk/national/issi-launches-book-critical-issues-facing-south-asia/",
  "date_published": "2024-10-08T15:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP): The India Study Centre (ISC) at the Institute of Strategic Studies Islamabad (ISSI) organized the launch of a new ISSI book, titled Critical Issues Facing South Asia: Politics, Security, and Non-Traditional Challenges here on Tuesday.\nThe book contains research articles by young researchers, prepared under the ISSI’s NextGen program, a news release said.\nFormer Foreign Minister of Pakistan, Ambassador Jalil Abbas Jilani graced the occasion as chief guest. Other speakers included Dr. Shabana Fayyaz, Chairperson, Department of Strategic Studies, QAU Islamabad; and Dr. Asma Shakir Khawaja, Executive Director of CISS AJK.\nIn his special remarks on the occasion, Ambassador Jalil Abbas Jilani congratulated the ISSI on this initiative and appreciated the authors for producing excellent research work, full of innovative ideas. He noted that the subjects forming part of the book included myriad dimensions of Pakistan-India relations and a number of cross-cutting regional issues, which were very relevant and had currency in discussions among diplomatic as well as political circles.\nIn the context of terrorism, for instance, he underlined that Pakistan was not alone in suffering from state-sponsored terrorism, other South Asian states including Sri Lanka, Bangladesh and Nepal were also victims of terrorism inflicted on their lands from the common neighbour.\nHe also highlighted the salience of nuclear issues between Pakistan and India and, recalling the firing of a nuclear-capable missile from India in March 2022, stressed that it could have resulted in a larger conflagration if Pakistan had not reacted with tremendous restraint.\nAmbassador Jilani underlined that for resolving Pakistan-India disputes, and for ensuring durable peace in the region, it was essential to revive the dialogue process, as disengagement could ignite serious conflict in a nuclearized South Asia.\nSpecifically, Ambassador Jilani made six recommendations: (i) resumption of Pakistan-India dialogue; (ii) revival of discussions on all issues — from the core Jammu & Kashmir dispute to Siachen, Sir Creek and terrorism; (iii) revival of Kashmir-related CBMs; (iv) respect for and adherence to the Indus Water Treaty (IWT) in letter and spirit; (v) establishment of permanent mechanism to address nuclear-related issues; and (vi) revival of the SAARC process for regional cooperation.\nIn his remarks, DG ISSI Ambassador Sohail Mahmood stated that engagement with the NextGen scholars was part of the ISSI’s new vision. The Institute recognizes the youth as one of the key stakeholders and seeks to proactively draw the next generation of experts into the policy discourse with new ideas and fresh perspectives.\nThis is important to help them develop a deeper and more nuanced understanding of the intricate issues at hand, enabling the next generation to make informed and insightful evaluations and suggest innovative approaches for addressing long-standing challenges in South Asia.\nIn this context, he added, ISSI is happy to serve as a vital platform for fostering new ideas and amplifying the voices of young scholars, duly mentored by senior academics and seasoned practitioners. Ambassador Sohail Mahmood lauded the innovative methodologies, sharp analyses, and creative solutions offered by the young authors in their papers and thanked the ISC team for spearheading the project.\nDr. Shabana Fayyaz commended the research publication for it was solely an indigenized effort, offering local perspective based on local understanding of the context. She added that emerging technologies had been feeding insecurities of adversaries against one another and causing greater threat perceptions.\nThe message one can draw from this book is that, amid increasingly complex regional scenarios, regional countries need to utilize their indigenized sources instead of looking up to extra-regional powers to bail them out.\nWhile praising ISSI for its NextGen initiative, she stressed that the youth in South Asia must be trained in forward-looking approaches and foresee the region beyond decades.\nDr. Asma Shakir Khwaja argued that the compilation is significant for its topic, freshness of the perspective it offers, and the actionable recommendations it brings forth. Innovative thoughts that young minds have produced on critical issues have the potential to turnaround geopolitical landscape of a most populous, yet least connected region like South Asia.\nDr. Khwaja also presented an overview of the chapters while offering her insights on the subjects. She agreed that drone technology carried both benefits as well as threats in terms of security, and needed to be closely dealt with. Similarly, regulatory framework was required at regional level to prevent security threats stemming out of Artificial Intelligence.\nThe young authors thanked the ISSI for the opportunity provided to them for contributing to the book, which immensely helped their professional development and growth.\nEarlier, Dr. Khurram Abbas, Director ISC, introduced the book. He commended the overwhelming response that the Institute received from young researchers, academicians and writers upon its call for chapters a year ago.\nHe added that while this book launch was the final outcome of the NextGen program 2023-24, ISC plans to further enhance its engagement with young scholars through a number of similar initiatives that are to follow.",
  "retrievedAt": "2025-08-10T19:54:15.790Z"
}
