{
  "title": "Four new Polio cases report",
  "link": "https://www.app.com.pk/national/four-new-polio-cases-report/",
  "date_published": "2024-10-08T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP): The Ministry of Health has made an urgent appeal to parents to vaccinate their children as four new polio cases were reported on Tuesday.\nAccording to health officials, an expanding poliovirus outbreak is posing a public health emergency for children across the country.\nHealth officials have appealed to parents to urgently vaccinate their children at every opportunity to protect them from the crippling poliovirus which has now affected 32 children.\nMaking an urgent call to action for parents, caregivers and communities, Prime Minister’s Focal Person for Polio Eradication Ayesha Raza Farooq said, “This should be a wake-up call for all parents and communities.”\n“Every paralytic polio case means there are hundreds of children who are silently affected by poliovirus and are potentially carrying and spreading it throughout their communities,” she said.\n“Today, every child is at risk, and it is unfortunate that children are facing the real consequences of missing vaccination because of misguided decisions and misperceptions about the vaccine.”\nOn Tuesday, the Regional Reference Laboratory for Polio Eradication at the National Institute of Health confirmed the detection of wild poliovirus type 1 (WPV1) from two children in Jacobabad and one child each from Karachi Malir and DI Khan districts, bringing the total number of cases to 32.\nShe urged parents and caregivers to fulfil their duty of care to their children and ensure their polio vaccination when polio teams visit their homes from October 28 in a nationwide campaign to vaccinate more than 45 million children to protect children from the crippling effects of polio.\nCoordinator of the National Emergency Operations Centre for Polio Eradication Anwarul Haq said WPV1 has been detected from sewage samples of all these districts, indicating that the virus is widely circulating across the country.\n“Our team from the National Emergency Operations Centre is fully engaged and supporting both provinces in their response to the outbreak,” he said.\n“We are conducting joint case investigations, preparing to implement high quality vaccination rounds and providing high-risk communities with integrated health service delivery to build children’s immunity.”\nThere is no cure for polio, and paralysis caused by an infection is irreversible.\nThe Polio Programme is launching a nationwide polio campaign from October 28 to vaccinate more than 45 million children, while a big catch-up initiative, led by the Expanded Programme for Immunization, is also underway in targeted districts to vaccinate those children against 12 childhood diseases, including polio, who have missed their doses or have not completed their vaccination course.\n“We urge parents, communities, teachers, elders and guardians to realize their collective responsibility and ensure complete vaccination for all children under five around them.”",
  "retrievedAt": "2025-08-10T19:54:09.279Z"
}
