{
  "title": "DPM Dar lauds KSrelief’s vital role in delivering humanitarian assistance",
  "link": "https://www.app.com.pk/national/dpm-dar-lauds-ksreliefs-vital-role-in-delivering-humanitarian-assistance/",
  "date_published": "2024-10-08T15:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP): Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar on Tuesday praised King Salman Humanitarian Aid and Relief Center’s (KSrelief) vital role in delivering humanitarian assistance, particularly in response to recent natural disasters in Pakistan, including floods and earthquakes.\nHe underscored that these new initiatives would focus on building and rehabilitating essential infrastructure such as schools, hospitals, and housing.\nThe deputy prime minister and foreign minister was addressing a signing ceremony held for a series of key reconstruction and rehabilitation projects, to be undertaken by the King Salman Humanitarian Aid and Relief Center (KSrelief), marking a significant step in strengthening Pakistan-Saudi humanitarian cooperation.\nThe ceremony was attended by a high-level delegation from KSrelief, led by Eng. Ahmed Ali Abdullah Al-Baiz, Assistant Supervisor General for Operations & Programs, who is currently on a visit to Pakistan, Foreign Office Spokesperson said in a press release.\nIn his opening remarks, the deputy prime minister and foreign minister expressed his gratitude to The Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, and Crown Prince Mohammed bin Salman for their unwavering support to Pakistan during times of crisis.\nHe further noted that the collaboration between KSrelief and Pakistan has intensified over the years, with the humanitarian organization playing a pivotal role in various sectors including healthcare, food aid, and education.\nDae expressed confidence that this new phase of cooperation would further cement the ties between Pakistan and Saudi Arabia and ensure that those most in need receive timely and effective support.",
  "retrievedAt": "2025-08-10T19:54:13.096Z"
}
