{
  "title": "IIUI organizes seminar on ‘Society, State and Nationhood in 21st Century’",
  "link": "https://www.app.com.pk/national/iiui-organizes-seminar-on-society-state-and-nationhood-in-21st-century/",
  "date_published": "2024-10-08T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP):The Directorate of Students’ Affairs (DSA) of International Islamic University Islamabad (IIUI) here on Tuesday organized a lecture titled “Society, State, and Nationhood in the 21st Century” at the male Campus of the university.\nOn this occasion, Chief Guest of the seminar, Brigadier (Retired) Tahir Mehmood, a distinguished figure renowned for his contributions as an author and freelance contributor to the national print media, briefed the students of the university as per the theme of the seminar.\nDuring his presentation, Brigadier (Retired) Tahir Mehmood shed light on the relationship between society, state, and the concept of nationhood within the context of Pakistan and shared history of the sub-continent. In addition he also shared the historical foundations of Pakistani nationhood before and after the creation of Pakistan.\nBrigadier Rtd. Tahir Mehmood, with a rich background of three decades of service in the Pakistan Army and his role as Director Publications and Chief Editor of four distinct monthly magazines within the Inter Services Public Relations Directorate, graced the occasion. His noteworthy achievements also include the launch of two new magazines, including one specifically catered to women’s interests.\nSpeaking on the occasion President (IIUI), Prof. Dr. Muhammad Sarwar appreciated the organizers for arranging the seminar for youth of the university and hoped that in future such seminars would be organized to further foster the ambitions of the students studying at campus.\nHe said that the role of teachers is vital for nation building as teachers are the basic source of nation building. He added that we should give respect to each other, respect for the law and humanity, which are vital for nation building.\nAddressing participants of the seminar Dr. Muhammad Sarwar urged students that the future is based on our learning process so we should focus on our learning to live in a society peacefully.\nThe seminar was also graced by Director General, International Institute of Islamic Economics, (IIIE), IIUI Prof. Dr. Abdul Rashed, Dr. Hafiz Ghufran Ahmed Students Advisor (male), Deputy Students Advisor Dr. Masood ur Rehman Khattak, senior faculty members while a large number of students attended the seminar.\nDr. Hafiz Ghufran Ahmed thanked the speaker, IIUI leadership and students for participation in the event. He vowed that the Directorate of Students Affairs will be eager to work for more activities of dialogue and counselling as well.\nLater, Brigadier Rtd. Tahir Mehmood also called on Prof. Dr. Muhammad Sarwar, President IIUI.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:55:12.677Z"
}
