{
  "title": "Concrete strategy in place to meet future energy demands: Awais",
  "link": "https://www.app.com.pk/national/concrete-strategy-in-place-to-meet-future-energy-demands-awais/",
  "date_published": "2024-10-08T10:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 8 (APP):Minister for Power Division Sardar Awais Ahmed Khan Leghari on Tuesday said that concrete strategy has been put into  place to meet the future energy’s demands of the country.\n“As energy always plays a key role in economy of the country so generation, transmission and distribution system of energy sector is being revamped on modern lines,” he said while addressing a function here at National University of Science and Technology (NUST).\nHe said the environment friendly renewable energy was also being promoted in the country adding that around 17,000 megawatts (MW) were going to be added to the system by 2034. Generation, transmission and distribution were all part of the power sector but in the past the generation part has not been added in healthy manner means at least cost methodology. However, he said we were committed to adding generation on least cost methodology basis in the future.\nHe said issues with Independent Power Producers (IPPs) were being resolved amicably adding that he is grateful to IPPs for their cooperation to revise the contract condition.\nHe was of the views that the power has to be generated by the private sector and there should not be a single purchasers like Central Power Purchasing Agency (CPPA) in the country. There must be a competition which would not only help come down the prices of electricity but also create a competitive environment in the country.\nRegarding, power distribution companies (DISCOs), the minister said that a sum of Rs 595 billion were budgeted every year just for their losses and power theft. “It is unbelievable, unacceptable and also not sustainable and we have Rs 600 billion extra to fund institution like NUST etc,” he added.\nHe said good professional board member were being put in place in Board of Directors of these companies to run it in efficient manners. “It is none of the job of me, a secretary or additional secretaries etc to run these entities,” he said.\nHe went on to say that in next three years, three DISCOs would be privatized while two DISCOs with Rs 150 billion loss would be concessional model reforms.\nRegarding transmission system, the minister said that earlier National Transmission and Despatch Company (NTDC) board was not working but now a senior advisor of LUMS was heading it. The NTDC would be bifurcated into three entities, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:55:30.903Z"
}
