{
  "title": "Saudi Arabia pledges continued support for Pakistan in humanitarian efforts: Ambassador",
  "link": "https://www.app.com.pk/national/saudi-arabia-pledges-continued-support-for-pakistan-in-humanitarian-efforts-ambassador/",
  "date_published": "2024-10-08T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP):The Ambassador of Saudi Arabia to Pakistan, Nawaf bin Said Al Malki on Tuesday underscored the enduring strength of Pakistan-Saudi relations during a signing ceremony for joint cooperation programmes between the King Salman Humanitarian Aid and Relief Centre (KSRelief) and the Government of Pakistan.\nSpeaking at the event, the ambassador expressed his pleasure in attending the ceremony, which formalized projects in education, health, recovery, and rehabilitation.\nHe extended his gratitude to Deputy Prime Minister and Foreign Affairs Minister Senator Mohammad Ishaq Dar for his government’s cooperation, and Assistant Supervisor General for Operations and Programs at KSRelief, Engineer Ahmed Al-Baiz along with the center’s dedicated team.\nHighlighting Saudi Arabia’s continuous support for Pakistan, the ambassador emphasized the Kingdom’s role in humanitarian efforts. “The KSRelief is at the forefront in the service of humanity and performs noble services to the brotherly country Pakistan and its people, standing by them through every thick and thin,” he noted.\nAl Malki reaffirmed the Kingdom’s unwavering commitment to Pakistan, guided by the leadership of the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, and Crown Prince Mohammed bin Salman. “I would like to assure Pakistani brothers of the firm commitment of the Government of the Kingdom of Saudi Arabia, under the leadership of the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, and Crown Prince and Prime Minister, Mohammed bin Salman bin Abdulaziz Al Saud, to always stand by Pakistan and elevate our brotherly relations to new heights,” he added.\nConcluding his address, the ambassador expressed his well wishes for both of the nations and prayed for the peace, prosperity, and stability of both brotherly countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:54:59.105Z"
}
