{
  "title": "KSRelief announces major public facilitation projects worth Rs 4 bln for Pakistan",
  "link": "https://www.app.com.pk/national/ksrelief-announces-major-public-facilitation-projects-worth-rs-4-bln-for-pakistan/",
  "date_published": "2024-10-08T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP): The King Salman Humanitarian Aid and Relief Center (KSRelief) on Tuesday announced a series of key public facilitation projects worth Rs. 4 billion, aimed at rebuilding the communities in Pakistan, affected by natural disasters.\nDuring the ‘Signing Ceremony for Joint Cooperation Programmes and Implementation Contracts for Educational, Health, Recovery and Rehabilitation Projects in Pakistan’, Assistant Supervisor General of Operations at Ksrelief, Engineer Ahmed Ali Al-Baiz signed four different joint cooperation programmes with the National Disaster Management Authority (NDMA), National Commission for Human Development (NCHD), Pakistan Red Crescent Society (PRCS), and State Earthquake Reconstruction and Rehabilitation Authority (SERRA) and above all, eight different contracts for public facilitation projects were formalized.\nDeputy Prime Minister and Minister for Foreign Affairs, Senator Mohammad Ishaq Dar, Saudi Ambassador to Pakistan, Nawaf Bin Said Al-Malki, representative from NDMA, Chairman of PRCS, and representatives and country heads from various UN missions in Pakistan, were the special guests at the signing ceremony.\nThese initiatives reflect KSRelief’s commitment to sustainable recovery and long-term development for communities affected during different natiural disasters in Pakistan. These projects cover various sectors, including housing, education, health, WASH and disaster preparedness.\nOne of the major efforts is the construction of the National Humanitarian Response Facility for NDMA, which will significantly enhance its ability to store and distribute relief supplies during emergencies. In total, 1,000 permanent houses for families displaced by the 2022 floods, will be constructed in a bid to provide safe housing for around 7,000 individuals in Khyber Pakhtunkhwa and the Punjab. Each house is designed to offer two rooms, a kitchen, and a washroom, ensuring a dignified living environment for the affected families.\nIn addition, KSRelief will construct 300 Community Feeder Schools across Pakistan, particularly in underserved regions like Gilgit-Baltistan and Azad Jammu and Kashmir. These schools, equipped with green energy solar power and clean drinking water facilities, will serve approximately 15,000 children, while indirectly benefiting over 100,000 people, including local communities and teachers. Upon completion, these schools will be handed over to the National Commission for Human Development (NCHD), ensuring long-term sustainability and management.\nKSRelief will also reconstruct four government schools in Azad Jammu and Kashmir for SERRA, which were damaged by the 2005 earthquake. These schools will provide a safe learning environment for 3,400 students and contribute to the region’s long-term development.\nAdditionally, 22 critical facilities, including schools, health centers, and water projects previously constructed in response of 2005 earthquake and 2010 floods by the King of Saudi Arabia, will be renovated to improve access to education, healthcare, and clean water.\nFrom these projects, about 360,000 individuals directly and 690,000 individuals will be benefited indirectly. Through these comprehensive projects, KSRelief reaffirms Saudi Arabia’s ongoing support for Pakistan, promoting resilience, recovery, and sustainable development.",
  "retrievedAt": "2025-08-10T19:54:48.911Z"
}
