{
  "title": "President calls for rationalizing interest rates, supporting export-oriented industries",
  "link": "https://www.app.com.pk/national/president-calls-for-rationalizing-interest-rates-supporting-export-oriented-industries/",
  "date_published": "2024-10-08T17:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP): President Asif Ali Zardari on Tuesday called for providing a business-friendly environment by further rationalizing the interest rate, providing cost-effective energy and supporting export-oriented industries in order to improve country’s economy.\nHe urged the business community to invest in the country’s stock exchange, besides focusing on industries that support small and medium enterprises and provide jobs to people.\nThe president expressed these views while addressing the 12th Federation of Pakistan Chambers and Commerce and Industry (FPCCI) Excellence Awards ceremony, held at Aiwan-e-Sadr. The ceremony was attended by members of the business community, and senior government officials, President Secretariat Press Wing said in a press release.\nSpeaking on the occasion, the president said that high interest rates were not beneficial for the country’s economy and businesses.\nHe said that he would ask the government to consider reducing the policy rate to boost business activities, adding that a comprehensive approach was required to steer the country out of its economic challenges.\nRecalling his previous tenure, the president highlighted that despite security challenges and the war on terror, his economic policy of supporting export-oriented industries and providing cost-effective energy led to an increase in the country’s exports.\nThe president said that steps should be taken to provide cost-effective electricity, land and other facilities to help promote trade and industry.\nHe urged the business community and entrepreneurs to continue actively contributing towards the economic transformation of the country.\nPresident Zardari also appreciated FPCCI for awarding Excellence Awards to the country’s top businesses to inspire healthy competition.\nHe urged FPCCI to provide its valuable input to help develop policies that promote exports and stimulate domestic industries.\nPresident FPCCI Atif Ikram Sheikh said that economic challenges were being transformed into opportunities.\nGroup Leader FPCCI Dr Gohar Ejaz said that the country’s economy was improving, adding the business community was making efforts to enhance the country’s exports.\nPresident Zardari also distributed the 12th FPCCI Excellence Awards among members of the business community for their outstanding performance and contributions to the economy.",
  "retrievedAt": "2025-08-10T19:54:09.265Z"
}
