{
  "title": "Saudi Arabia’s aid to Pakistan reaches $12.75 bln, supporting 247 development projects: Al-Baiz",
  "link": "https://www.app.com.pk/national/saudi-arabias-aid-to-pakistan-reaches-12-75-bln-supporting-247-development-projects-al-baiz/",
  "date_published": "2024-10-08T16:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP): The King Salman Humanitarian Aid and Relief Center (KSRelief) on Tuesday reaffirmed its commitment to humanitarian support in Pakistan with the signing of joint cooperation programmes and implementation contracts for various educational, health, recovery, and rehabilitation projects.\nDuring the signing ceremony, Assistant Supervisor General of Operations at KSRelief, Engineer Ahmed Ali Al-Baiz, conveyed the greetings of KSRelief General Supervisor, Dr. Abdullah bin Abdulaziz Al-Rabeeah, who could not attend the event due to urgent commitments.\nHe expressed gratitude on behalf of the Kingdom of Saudi Arabia, emphasizing the strong humanitarian efforts led by the Custodian of the Two Holy Mosques, King Salman bin Abdulaziz Al Saud, and Crown Prince Mohammed bin Salman bin Abdulaziz Al Saud.\nAl-Baiz highlighted KSRelief’s significant global contributions, noting that since its establishment in 2015, the organization has implemented 3,068 projects in over 102 countries, with financial aid exceeding $7 billion. He said KSRelief has also partnered with 450 organizations worldwide, positioning Saudi Arabia as a major force in global humanitarian, relief, and development assistance.\nAl-Baiz announced the launch of new projects in Pakistan worth $14.2 million. These initiatives include the reconstruction of four high schools in Bagh and Poonch, Azad Kashmir, and the establishment of 300 schools under the National Human Development Commission, targeting remote areas lacking public education facilities. He said 22 service facilities across Khyber Pakhtunkhwa, Azad Kashmir, and Punjab will be rehabilitated, including schools, water stations, and health centers.\nIn response to the devastating 2022 floods, Al-Baiz said KSRelief will fund the reconstruction and rehabilitation of 1,000 housing units in flood-affected areas. The center is also preparing to establish a disaster management warehouse to enhance Pakistan’s emergency and disaster preparedness capabilities, he added.\nAl-Baiz underscored that Saudi Arabia’s total contribution to humanitarian and development aid for Pakistan has reached $12.75 billion, covering 247 projects. He expressed hope that the newly launched initiatives would ease the suffering of the Pakistani people.\nIn his closing remarks, Al-Baiz extended his appreciation to the government and people of Pakistan for their cooperation and solidarity in supporting KSRelief’s mission.",
  "retrievedAt": "2025-08-10T19:54:13.064Z"
}
