{
  "title": "President Alvi underlines need to build dams to counter floods",
  "link": "https://www.app.com.pk/national/president-alvi-underlines-need-to-build-dams-to-counter-floods/",
  "date_published": "2022-09-01T14:44:00.000Z",
  "source": "APP",
  "content": "DERA GHAZI KHAN, Sep 01 (APP): President Dr. Arif Alvi Thursday stressed the need to improve flood warning system and highlighted the importance of building big dams to control floods and enhance water storage capacity.\nPresident Alvi expressed these views during a visit to the flood hit areas of Dera Ghazi Khan where the district administration briefed him on floods and the trail of destruction it left behind, according to a statement issued by Media Wing of President House.\nThe president expressed grave concern over the loss of life, damages to standings crops spread over more than 300,000 acre area, thousands of buildings, homes destroyed and cattle heads killed in floods. The president said that compensating the affected people should be the top most priority of the government.\nDr. Alvi said that attention should be paid to building delay action dams to store water from hill torrents in DG Khan. He said that building bigger dams was vital to control floods and enhance water storage capacity.\nThe president said that efforts should be made to ensure compensation is paid to the affected people soonest. He said that farmers should be encouraged to opt for crop insurance which, he added, could be helpful in getting their losses compensated in natural disasters.\nPresident Dr. Arif Alvi also visited a relief camp where he met the flood affected people, sympathized with them and asked them about the level of difficulties being faced by them.\nHe said that he was in DG Khan to meet them, to make them feel they were not alone in these testing times and that government was there to help them out. He said that the first phase largely focused on saving lives which was more important than anything else. The administration made untiring efforts in saving lives and making basic facilities available to people, he said adding that rehabilitation process should begin soon.\nDr. Arif Alvi said that hill torrents from Suleman Mountain Range witnessed extraordinarily high level of water this year that caused deaths, and destruction of infrastructure and buildings. He underlined the need for making boys scouts and girls guides organizations more effective and functional to help in rescue and relief activities carried out by the government and armed forces.\nHe said floods played havoc in all the provinces. He said that Punjab government had provided Rs 800,000 to heirs of each person who died in floods in DG Khan and Rajanpur. President advised officials to remain alert as there was the possibility of disease outbreak in post-flood scenario and bring improvement in their health care systems to provide heath care facilities to the people.\nCommissioner DG Khan informed the president that there were seven hill torrents that usually support water flow in case of rains on mountains. However, this year, unusual water flow in four hill torrents caused destruction which was more than what people had suffered in 2010 floods.\nHe said that so far 48 people had died, 20 of them due to ferocious hill torrent waters and 28 others in house collapse incidents. He said that 90 people suffered serious injuries while another 800 received minor injuries. Commissioner said that floods killed 383 big animals and 1136 small animals. He added that total 11,409 homes were destroyed completely and 13,275 were damaged partially. Floods also damaged 116 school buildings, 33 hospitals, two colleges and 1055 kilometres long road, he added.\nBriefing about rescue operations, commissioner said that 20,000 people were evacuated to safer places by 1183 rescuers and 92 boats. He said that 42 relief camps besides tent villages, 69 medical camps and 70 veterinary camps had been set up. Exactly 12,604 tents were provided to affected people for temporary shelter while 4240 wheat flour bags, 38,484 ration bags were distributed among them and 3532 daigs of cooked food were also provided to them.",
  "retrievedAt": "2025-08-11T15:30:10.952Z"
}
