{
  "title": "Govt trying hard to provide relief to people, despite financial constraints: Abbasi",
  "link": "https://www.app.com.pk/national/govt-trying-hard-to-provide-relief-to-people-despite-financial-constraints-abbasi/",
  "date_published": "2022-09-01T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1 (APP): A senior leader of Pakistan Muslim League Nawaz (PML-N), former Prime Minister Shahid Khaqan Abbasi on Thursday said despite financial constraints, the government was trying its best to provide maximum relief to people.\nAddressing a news conference, he said persistent efforts were underway to stabilize the economy and provide solace to people. Optimum efforts were being made to help rehabilitate flood-hit people.\nThe floods have destabilized the country’s economy in already difficult conditions.\nLambasting former Prime Minister Imran Khan, he said the agreement with International Monetary Fund (IMF) was inked by the former Pakistan Tehreek-e-Insaf (PTI) government, making it binding on the successive government to implement the programme.\nImran Khan repeatedly violated agreements with IMF by decreasing the prices of petroleum products on sensing his impending ouster from the government.\nImran Khan was only interested in promoting his political agenda. The freezing of gas and electricity prices proved detrimental to the country’s economy.\nHe held Imran Khan responsible for current economic woes.\nHe lauded the hard work and dedication of Finance Minister Miftah Ismael and said that the Shehbaz government took difficult decisions to put the economy back on right track.\nHe admitted that some party members did not support some difficult decisions of the government.\nCriticizing former Finance Minister Shaukat Tarin, he said despite knowing the intricacies of the deal with IMF, Tarin conspired against the IMF programme by asking finance ministers of Punjab and Khyber Pakhtunkhwa to sabotage it.\nHe conspired against the IMF programme on directives of Imran Khan.",
  "retrievedAt": "2025-08-11T15:30:17.883Z"
}
