{
  "title": "Interior Minister inaugurates NADRA biker service for speedy process related to NIC",
  "link": "https://www.app.com.pk/national/interior-minister-inaugurates-nadra-biker-service-for-speedy-process-related-to-nic/",
  "date_published": "2022-09-01T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 01 (APP): Minister for Interior Rana Sanaullah on Thursday launched NADRA Biker Service for carrying out all the processes of NIC applied in renewal and modification categories at the door-step of the applicant.\nوزیر داخلہ @RanaSanaullahPK کی @NadraPak ہیڈکواٹر آمد.وزیر داخلہ نے نادرا بائیکر سروس کا افتتاح کیا۔چیئرمین نادرا @ReplyTariq نے وزیر داخلہ کو  ملک بھر میں موجود نادرا آپریشنز، قومی اور جاری بین الاقوامی پراجیکٹس کے بارے میں بریفنگ دی#APPNews pic.twitter.com/1Xnt2HRtZ8\nDuring his visit to NADRA Headquarters, Chairman NADRA briefed the minister about NADRA operations in Sindh, Baluchistan and South Punjab which have been badly affected by devastating floods and heavy rains.\nThe minister was informed that the monsoon rains and floods have caused heavy losses to the most of buildings of NRCs which are inundated under water; however, the equipment has been saved and evacuated. Houses of 150 NADRA employees in those areas have been damaged, the chairman informed.\nDuring the briefing, Chairman NADRA informed the minister that more than 37 million people have been terribly affected due to on-going floods and continuous rain pour.\nHe told that the heavy rains and flooding situation in certain areas had led to the loss of NICs of affected people which would be needed to have an access to governments’ relief disbursement and other relief activities.\nWith regard to Biker service, Malik informed that initially the pilot phase of the service would be started in Islamabad and Rawalpindi. By the end of December this year, NADRA Biker service would be extended to all the districts of the country, he added.\nChairman NADRA told the minister that after rolling out digital online services for the citizens, a home-based NADRA’s Biker service is basically a portable NADRA Centre that will walk into the peoples’ lounges and register them in their premises saving them from the hassle of visiting NADRA centre. Through this service the female registration officers using scooties will also carry out the registration of women only.\nHe apprised the minister that he had been working on out-of-box solutions with a prime focus on creating hand-on facilitation and hassle-free registration for general public in a bid to accommodate more than 125,000 footfall daily at 771 NADRA centres across the country.\nHe informed that the long queues at NADRA registration centers, especially in big and densely populated cities led him to go an extra mile by successfully establishing 97 new NRCs and adding more than 100 new MRVs in the existing fleet within past 10 months.\nLauding the efforts of Chairman NADRA, Interior Minister Rana Sanaullah said Tariq Malik had latterly set a new benchmark globally by creating public facilitation regime through the implementation of international standards and world’s best practices in NADRA.\nSpeaking on the occasion, Interior Minister said that having a wide network of NADRA Registration Centers (NRCs) in total, Mobile Registration Vans (MRVs) and online Pak Identity service/Mobile App across the country to cater for the registration of the people of Pakistan without prejudice on daily basis, the introduction of a NADRA Biker shall bring NADRA services at people’s homes.”\nThe minister directed the Chairman that smart facilities should be introduced in small towns across all provinces. Nadra Biker Service is a great facility and it’s network should be stretched throughout the country, he added.\nHe directed that the scope of online facilities for overseas Pakistanis should also be expanded and urged Chairman NADRA to develop an automated system to register the new born children.\nThe applicants will have to get appointment through website (https://www.nadra.gov.pk), mobile application (NADRA Rahbar) or NADRA Call Centre on 1777 (for subscribers of Mobilink, Ufone, Telenor and Zong) and (051) 111 786 100 (for fixed lines).\nEvery citizen will be able to benefit from NADRA Bikers Service, the senior citizens, women, disabled, sick persons and those, who cannot go to NADRA offices during office hours, will now be able to obtain the ID card from the comfort of their home. Thus, the ID card will be sent to the applicant’s current/permanent address through courier service.",
  "retrievedAt": "2025-08-11T15:30:12.252Z"
}
