{
  "title": "Pakistan welcomes UN’s Ecosystem Restoration Decade, launches four innovative ERIs",
  "link": "https://www.app.com.pk/national/pakistan-welcomes-uns-ecosystem-restoration-decade-launches-four-innovative-eris/",
  "date_published": "2021-06-05T18:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP): Pakistan on Saturday welcomed United Nations Ecosystem Restoration Decade amid hosting World Environment Day with launching four innovative Ecosystem Restoration Initiatives (ERIs) aimed to conserve depleting natural reserves and protecting local communities through green jobs.\nThe global World Environment Day (WED) 2021 celebrations were hosted for the first by Pakistan after the United Nations Environment Programme (UNEP) acknowledged its lead in environmental conservation through ecosystem reviving efforts ahead of the UN Ecosystem Restoration Decade.\nThe event was live streamed across the globe through social media platforms where the first session was presided over by Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam.\nRecorded messages of United Nations Secretary General Antonio Guterres, global dignitaries including British Prime Minister Boris Johnson, World Economic Forum President (WEF) Borge Brende and heads of UN bodies were telecasted at the forum.\nChinese President Xi Jinping’s message was read out by Chinese Ambassador Nong Rong. President Xi extended his full support for Pakistan in its effort for environmental conservation and lauded the Ten Billion Tree Tsunami Plantation Initiative among other conservation efforts.\nBritish Prime Minister Boris Johnson said the outbreak of zoonotic diseases like Covid-19 was the revenge of Mother Nature that called us to improve our course and protect nature for sustainable growth and safe future.\nPrime Minister Imran Khan chaired the second session of the WED 2021 and presented the green vision of Pakistan with a whole of the humanity approach to preserve environment with a collective and unified effort for a better and livable planet for the coming generations.\nAddressing the global WED-2021 event, SAPM Malik Amin Aslam said, “It is an honour for Pakistan to host WED-2021 which will set the direction of the world for next ten years to restore ecosystem.”\nThe SAPM said they did not have to come in conflict with nature rather partner with it to restore ecology and protect our people from hunger and unemployment.\nThe initiatives launched by Pakistan have garnered 85,000 green jobs and it was intended to add 200,000 jobs more to it, he added.\nAmin also announced four key ERIs including new Bonn Challenge of restoring one million hectares of degraded forest which was pledged voluntarily by Pakistan, a dedicated National Park Service to ensure forest protection through local populations’ employment under Protected Areas Initiative boosting existing number of national parks, Recharge Pakistan programme to conserve flood water for reviving dwindling wetlands along Indus River and Green Financing initiative to extend Green Bonds launched by Pakistan earlier.\nHe added that when Pakistan launched its first ever US $ 500 million Green Bonds to the world; it, in return, offered six times more investment of US $ three billion that depicted the country’s credibility among the comity of nations.\nAmin highlighted that the country was also conducting deep carbon stocks study to assess deep sea sequestered carbon that worth around half a billion dollars to capitalize that natural reserve.\n“Third green financing initiative is Nature Bond (Debt for Nature Swap) where no country was ready to step forward and Pakistan volunteered to pilot that project whereas three countries had intended to hold negotiations with Pakistan on the matter,” he highlighted.\nMinister of State for Climate Change Zartaj Gul highlighted the key ERIs implemented by the country including Ten Billion Tree Tsunami Plantation’s first billion tree plantation target achieved by the country including Clean Green Pakistan movement which was a huge behavioural change movement, energy mix shift to clean energy, electric vehicle policy and ban on plastic bags ban.\nShe underscored the vulnerability of women due to climate change and shed light on climate-induced women migration and called the Prime Minister to initiate a policy to enhance their climate resilience.\nMusical performances of artists from Gilgit Baltistan and Balochistan lead by Salman Paras and Qadir Chenal Zehri mesmerized the gathering with their songs highlighting plantation and environmental conservation.\nChairman Pakistan Red Crescent Society and famous singer Ibrar-ul-Haq also presented his famous folk song that enthralled the audience and viewers. Songs on Ten Billion Tree Tsunami Plantation from all the provinces were also screened during the ceremony.\nUNEP Executive Director Inger Anderson, participating online, lauded the ecosystem restoration measures initiated by Pakistan. She said ecosystem restoration was not possible through increasing green cover rather reducing carbonization, pollution, conversion of energy mixes and sustainable practices with employment opportunities for local communities ensuring food security.\nUN key officials including UNFCCC Executive Secretary Patricia Espinosa, Executive Secretary of the UN Convention on Biological Diversity Elizabeth Maruma Mrema, UNCCD Ibrahim Thiaw, UN-Habitat Maimunah Mohd Sharif, DG FAO Dr QU Dongyu, UNDP Administrator Achim Steiner, President IUCN Zhang Xinsheng, Executive Director UNOPS Grete Faremo, German Minister for Environment Svenja Schulze and other addressed the forum virtually and collectively emphasized the need for generation restoration through unified efforts and stakeholder intervention.\nFederal Minister for National Food Security Syed Fakkhar Imam, Governor Khyber Pakhtunkhwa Shah Farman, SAPM on Political Communication Dr Shahbaz Gill, Leader of the House in the Senate, Dr Shahzad Waseem, members of the diplomatic fraternity, INGOs, senior officials of the government and media attended the event.",
  "retrievedAt": "2025-08-11T20:48:55.476Z"
}
