{
  "title": "COVID positivity ratio continues to fall steadily: Dr Faisal",
  "link": "https://www.app.com.pk/national/covid-positivity-ratio-continues-to-fall-steadily-dr-faisal/",
  "date_published": "2021-06-05T15:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 05 (APP):Special Assistant to Prime Minister on National Health Services, Regulations and Coordination Dr Faisal Sultan on Saturday said that the national COVID-19 positivity ratio continued to fall steadily and the average stands at less than 4%.\n“I’m pleased to share that the 3rd wave has gone down steadily”, Dr Faisal said while sharing updates on disease spread, vaccination and fake news in a video statement.\nThis is evidence that the government’s lockdown and enforcement of SOPs, along with greater vaccine uptake and administration has had an impact on the spread of the disease.\n“Our fellow countrymen in Sindh, however, are under pressure as we had expected as the 3rd wave in Sindh began a bit later than it did in the rest of the federating units.”\nHe said that positivity ratio in Sindh hovered between 6% and 7%.\nHe said that the government conducted 47,000 to 55,000 tests per day this week.\nDr Faisal said “We are grateful to all citizens for their cooperation regarding implementation of SOPs but the fight against COVID is not over yet.”\nHe said that the government is regularly monitoring compliance across all sectors in all federating units. The NCOC is deeply concerned and has alerted all industries that compliance is not up to the mark.\nHe said that the national compliance of SOPs stands at 46% which is the average across all provinces and sectors.\nHe said that the SOPs compliance ratio of major sectors was as transport 40%, businesses 40.28%, industry 38%, Mosques and Imambargahs 41%, airport, bus stands, railway stations 50%, public places 42% and hospitals 70%.\nHe said that the vaccination drive is continuing in full swing and almost 2.2 million people have been fully vaccinated as of 4th of June.\nHe added almost 3.7 million people have received at least one dose as of 4th of June. In total, almost eight million doses have been administered.\nThis means that Pakistan is among the world’s top 30 countries in the world in terms of doses administered as the government has administered more vaccine doses than 165 countries.\n“We have administered more vaccine doses than countries such as Australia, Switzerland, Portugal and Belgium.” Daily administration has ranged from 300,000 to 400,000, he added.\nDr Faisal said that walk-in vaccination was opened for above 30 years of age on May 29. He added all 30 plus people should send CNIC to 1166 to register and visit any vaccination centre and get vaccinated.\nHe said that the registration for people aged 18 years and above was opened on the 27th of May and scheduled vaccine administration was started from 3rd of June.\nHe said that walk-in vaccination had also been opened across the country for all teachers and school staff above 18 years age on the 29th of May. “If you are a teacher of any age, you can take your employment letter and go to any vaccination center.”\nSharing details about vaccine procurement, Dr Faisal said that almost 100,000 doses of Pfizer arrived via COVAX last week. He added Pfizer is an American COVID-19 vaccine brand approved for use by the World Health Organization.\nHe said that the Drug Regulatory Authority of Pakistan (DRAP) has granted the emergency use approval to Pfizer. He added NCOC has decided that the Pfizer vaccine will be administered to those traveling abroad for Hajj, work or education in countries where it is compulsory for travelers to show a vaccination certificate upon entry and the country accepts Pfizer.\nIn addition, one million Sinopharm doses purchased by the government have also arrived. He added 11.8 million vaccine doses have arrived in Pakistan so far and 76% was purchased by the government.\nHe said that World Health Organization has given the emergency use authorization to Sinovac.\nHe added Pakistan has been administering Sinovac since 9th of May and we had full faith in the safety and efficacy of the vaccine. WHO’s approval confirms our evaluation and it will encourage more countries to approve the vaccine.\nHe said that all WHO approved vaccines went through rigorous trial and testing phases before being administered to the general public to minimize health risks.\nHe said that the government inaugurated the National Institute of Health facility where PakVac is being prepared. The NIH facility will be formulating, filling and finishing the CanSino-BIO vaccine. “We will be able to prepare three million doses a month.”\nDr Faisal said “We are closely monitoring the conversation about COVID. We also regularly review the complaints made to the 1166 COVID helpline.”\nHe said that a news was being circulated about Nobel Prize winner Luc Montagnier’s claims about COVID vaccines. He made it clear this is completely false and there is no evidence that he said this, and the claim has been discredited by multiple fact-checking organizations, he added.\nHe said that there is no published scientific research that suggests that people will die within two years of receiving the vaccine.\nHe said that a video was circulating that showed a bulb lighting up upon making contact with a vaccinated person’s arm.\nThis video has also been declared fake news as the vaccinated arms do not generate electricity and cannot light a bulb.\nHe said that there is no scientific evidence suggesting this happens, and millions of other people that were inoculated have not experienced any such side effect. Several fact checking platforms produced videos in response debunking this claim.",
  "retrievedAt": "2025-08-11T20:48:58.065Z"
}
