{
  "title": "World has acknowledged Pak efforts to cope with environmental challenges: PA speaker",
  "link": "https://www.app.com.pk/national/world-has-acknowledged-pak-efforts-to-cope-with-environmental-challenges-pa-speaker/",
  "date_published": "2021-06-05T14:01:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 05 (APP):Punjab Assembly Speaker Chaudhry Pervaiz Elahi said on Saturday that today, the International Environment Day was being observed all over the world and it was a matter of great pride that the global community had acknowledged Pakistan’s stable environment policy and its effective role in overcoming the global environmental challenges that was why Prime Minister Imran Khan was mandated to lead the world on environmental front.\nHe was addressing as chief guest at an event, jointly organised by the Punjab Environmental Protection Department and WWF Pakistan on the occasion of World Environment Day at a local hotel. Provincial Minister for Environmental Protection Muhammad Rizwan and Provincial Secretary for Environment Zahid Hussain also addressed the event.\nThe Punjab Assembly speaker added, “It is a great honour for Pakistan for hosting, for the first time in its history, the international environment conference and it is also a matter of great pride for all of us. Today, all Pakistanis must pledge to play their due role in accomplishing Prime Minister Imran Khan’s initiative of planting 10 billion trees at all costs so that we can provide a green Pakistan to our future generations.”\nHe added that it was encouraging that Pakistan had issued 500 million Green Eurobond, and the resources generated from these bonds would be used to provide green energy, citing that green financing was the only way to achieve a green Pakistan.\nHe called for putting in order an effective strategy and joint efforts to create awareness among the people especially the youth about the benefits of tree plantation.\nIn his address, Provincial Minister for Environmental Protection Muhammad Rizwan said that unfortunately, Pakistan was among 10 countries being affected badly due to global warming, asserting that there was dire need to take comprehensive measures at all levels to prevent global warming and everyone should play their role properly.\nHe mentioned that unfortunately, no long-term planning had been made to prevent environmental pollution over the last several decades, and rapid growth in the urban sector along with deforestation and relentless felling of trees had inflicted colossal damages on the environment, ecosystem, biodiversity and human lives and has been causing smog-like conditions for the last two years.\nHowever, he added, the PTI government had since its inception been making serious efforts to control environmental pollution and fruitful results of the initial steps being received. He said that the Punjab government had declared smog as a disaster and a long-term policy was adopted by all stakeholders to eradicate it.\nThe provincial minister mentioned that more than 8,000 brick-kilns across Punjab had successfully been shifted to zigzag, an environment-friendly technology, while the availability of euro fuel was being used in the country to control vehicle emissions.\nIn addition, an Environment Endowment Fund of Rs 5 billion had also been set up in Punjab while two major projects worth Rs 400 million were being implemented to provide clean water.\nAlong with this, Ravi Urban Development Authority was taking important steps to raise the groundwater level, he said and asserted that for the first time in history, the Irrigation Department was preparing a formal policy for this purpose keeping in view that water scarcity due to reckless use of water.\nMuhammad Rizwan stressed that Environmental Protection Department was currently working on a mega project worth 273 million dollar in collaboration with the World Bank, and the Punjab government was in the process of completing a major project with the help of private partners to prevent water loss. He said that the department was also being restructured to improve its working capacity.\nEarlier, in his welcome address, Secretary EPA Zahid Hussain said that purpose of the event was to raise awareness about environmental protection and informed people that how to protect Pakistan from all kinds of environmental pollution.\nRepresentatives of other departments also addressed the ceremony while at the end a memorial shield was presented to the Speaker Punjab Assembly by the Environment Department.",
  "retrievedAt": "2025-08-11T20:48:58.063Z"
}
