{
  "title": "NA speaker invites opposition to sit for electoral reforms",
  "link": "https://www.app.com.pk/national/na-speaker-invites-opposition-to-sit-for-electoral-reforms/",
  "date_published": "2021-06-05T18:29:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 05 (APP): Speaker National Assembly Asad Qaiser has invited the opposition to sit with the government for legislation regarding electoral reforms.\nTalking to media at the Railway Station here on Saturday evening, he said that if the opposition did not support then how would the reforms take place so the opposition should come and give their suggestions for transparent elections.\nTo a question about problem in passing the upcoming budget from the assembly, he said that there was no difficulty in passing the budget. “Political parties have problems and concerns but budget will be easily passed,” he said.\nHe added that allied parties were standing side by side with the PTI government.\nThe speaker said that consultation meetings with parliamentarians were going on for the budget.\nHe said the upcoming budget would be a great relief to government employees, farmers, laborers and the common man.\nResponding to a question about Shahbaz Sharif, he said that it was a judicial matter and he did not want to talk about it.\nSharing his experience of traveling by train from Islamabad to here, he said it was pleasant moment he had passed with the railways. He hoped that the railways would move forward in the journey of development and punctuality.\n“I wish the Pakistan Railways may compete international standards,“ he said.\nHe said that the project of ML-1 would give new life to the Railways.\nPakistan Railways had become a good institution and trains were arriving on time, he said.\nEarlier, he was warmly welcomed by PR Lahore Divisional Superintendent M Nasir Khalili and the Railway band played welcoming music on his arrival. Eight other members of the national assembly also accompanied him.",
  "retrievedAt": "2025-08-11T20:48:55.478Z"
}
