{
  "title": "PM for global efforts, funding to low CO2 emitting countries for ecosystem restoration",
  "link": "https://www.app.com.pk/national/pm-for-global-efforts-funding-to-low-emitting-countries-for-ecosystem-restoration/",
  "date_published": "2021-06-05T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP): Prime Minister Imran Khan Saturday called on the world to fight back for ecosystem restoration during the next decade and particularly retold the rich countries to assist the poor ones bearing the brunt of their immense carbon emissions.\n“Pakistan has minimal contribution in carbon emission. The rich countries responsible for huge carbon emission have the responsibility to at least provide fund so that the countries like ours may fight global warming, improve our environment. The issue is resources gap,” he said addressing the main ceremony of World Environment Day hosted by Pakistan here.\nTelecast globally, the event featured the special messages of Chinese President Xi Jinping, UK Prime Minister Boris Johnson, UN Secretary-General Antonio Guterres and address by Executive Director of the UN Environment Program Inger Anderson besides State Minister Zartaj Gul and SAPM Amin Aslam.\nHeld at the beautifully adorned Convention Center with themed green and themed ambience by plants and decorations, the event was attended by the federal ministers, parliamentarians and diplomats from various countries.\nLIVE #APPNews : Prime Minister Imran Khan addressing World Environment Day 2021 being hosted by Pakistan. #WorldEnvironmentDay #GenerationRestoration @PakPMO @fawadchaudhry https://t.co/oYYkPgA6tE\n— APP  (@appcsocialmedia) June 5, 2021\nA huge number of forest guards was also present who earned huge applause from the audience as the prime minister also paid huge tribute to their efforts and sacrifices to preserve the environment.\nExplaining the resource constraints in Pakistan, the prime minister said during the pandemic, Pakistan with a population of 220 million could only scrape around $8 billion for relief package while 330 million nation of United States doled out a package of 4,000 billion to its people.\nHe told the world that half of Pakistan’s revenue went to debt servicing leaving the government with insufficient resources to support people’s health, education, security and other expenditures.\nHe reiterated that the resource rich countries should support the developing countries who were fighting the war of climate change. He particularly thanked the UNEP and UN Secretary General for repeatedly pressing the rich countries to take their carbon responsibilities.\nHe said Pakistan was also making efforts to further reduce its already minimal emissions by switching 30% of its all vehicles to electric transmission and ensure 60% of its power generation through renewable resources by 2030.\nHe said it was an honor for Pakistan to host World Environment Day which depicted the recognition of Pakistan’s efforts and inclusion among few countries concerned for a better environment for future generations.\nAn honour to join @PakPMO, @aminattock, @zartajgulwazir as we mark #WorldEnvironmentDay today. Huge thanks to Pakistan for leading the global charge to restore the ecosystems on which all life depends. #GenerationRestoration https://t.co/D1AAGpFpUT @PakistanUN_NY pic.twitter.com/ISwTgZ4pMn\n— Inger Andersen (@andersen_inger) June 5, 2021\nThe prime minister also urged the nation particularly youth to take responsibility of the environment friendly initiatives so that the world could fight back for ecosystem restoration during UN Decade for Ecosystem Restoration 2021-2030.\nHe said like the developing countries, the teachers in Pakistan should also teach the importance of trees to inculcate in them the responsibility for environment conservation.\nHe while carrying out any activity, the people must consider its impact on future generations, though some countries had been taking care of their environment since the beginning.\nHe said unfortunately Pakistan was among those countries where environment protection was nowhere among the government’s priorities. He recalled that since its inception till launch of On Billion Tree Tsunami in KP in 2013, the country had planted only 640 million trees.\nHowever, the PTI government, after success of One Billion Tree Tsunami, launched Ten Billion Tree Tsunami and also planted first billion of them.\nThe revolutionary Ten Billion Tree Tsunami project has not only revived forest cover but has also helped local communities in earning sustainable livelihood and provided 83000 jobs amid Covid-19\nWatch the special documentary.#WorldEnvironmentDay #GenerationRestoration pic.twitter.com/oRf0LtlT4i\n— Prime Minister’s Office, Pakistan (@PakPMO) June 5, 2021\nHe lamented the massive deforestation particularly at the Chhanga Manga, Kundian, Chichawatni and Dipalpur forests where the land mafias had occupied the forest land.\nHe said the UN Decade was an opportunity for the world to correct its course by fighting back the pollution, ensure clean water and reduced carbon emissions.\nHe seconded UK Prime Minister’s words that the future generations would have to bear the cost if we failed to protect environment.\nHe said apart from measures introduced by Pakistan, some issues needed world’s attention to reduce carbon emission leading to glacier melting posing threats to countries like Pakistan and Central Asia where rivers were fed by glaciers.\nThe prime minister said COVID-19 pandemic had made it clear that the world was interdependent with nothing bound by borders. Same was the case with global warming which was equally impacting the world in one way or the other, he added.\nHe said the whole nation would have to realize that tree plantation was good for their children’s future which retain water, clean air, and restore wildlife and birdlife.\nHe apprised the gathering of his government’s future initiatives including Recharge Pakistan – to divert flood water to wetland to recharge water table and Mangroves forestation which absorb carbon besides others.\nHe repeatedly called for public participation in the environment projects to make them stakeholders by giving them jobs and incentives, just like the Ten Billion Tree Tsunami which had provided 85,000 jobs so far.\nHe said the government had developed 15 National Parks and special guards would be trained for their protection.\nHe particularly lauded Punjab government for converting brick kilns to zigzag technology to reduce their pollution level.\nDelighted to address the esteemed audience. Affirmed ’s commitment to a sustainable planet. We’ll continue playing a leading role in the league of nations towards the environment. Our focus is unflinching. #WorldEnvironmentDay pic.twitter.com/bzHMvosG2F\n— Zartaj Gul Wazir (@zartajgulwazir) June 5, 2021\nState Minister for Climate Change Zartaj Gul said having planted first billion trees, the government was fully prepared to plant rest nine billion trees.\nThe government was also about to launch a food security program for South Punjab besides introducing a bill to encourage the youth’s participation in tree plantation by giving them an incentive of 20 marks in their studies, she added.\nSAPM Malik Amin Aslam said Pakistan had made a commitment to restore 10 hectares of land and was also increased the protected areas by engaging the population.\nPakistan is hosting #WorldEnvironmentDay today.\nGlobally acknowledged & fully committed to playing a leadership role in #EcosystemRestoration, Pakistan urges the world to join hands to protect environment & reset relationship with Nature.#GenerationRestoration#WEDPakistan2021 pic.twitter.com/MDovNVszi0\nHe also highlighted the Green Bond and Nature Bond initiatives of Pakistan to provide the country with accelerated access to development financing and debt relief in exchange for meeting ecosystem restoration targets.\nEarlier, in his message read out by Chinese Ambassador Nong Rong, Chinese President Xi Jinping congratulated the government and people of Pakistan for hosting the global event.\nHe said the ecosystem restoration was essential in order to live in harmony with nature. He called for international community’s role for environmental protection and ensure the sustainable development.\nReiterating China’s commitment to environment preservation, Xi appreciated Government of Pakistan for environment friendly initiatives and said that his country was ready to work with the host country on the subject.\nPrime Minister of UK Boris Johnson, in his video message also spoke high of Ten Billion Tree Tsunami project saying “I salute what Prime Minister Imran Khan is doing. I think 10 billion trees is a huge campaign,” he remarked.\nHe viewed that the COVID-19 pandemic was mother nature’s revenge on humankind which could not maintain balance with nature. He called for redoubling the efforts to ensure environment protection and make a balance with nature.\nUN Secretary General Antonio Guterres, in his video message, said the world was rapidly reaching the point of no return for the planet.\nHe said the world was faced with a triple environmental emergency –biodiversity loss, climate disruption and escalating pollution.\nHe said the climate change was risking the world in form of shortage food, water and resources as the degradation of the natural world was already undermining the well-being of 3.2 billion people – or 40 per cent of humanity.\nHe said the UN Decade on Ecosystem Restoration would help create millions of new jobs by 2030, generate returns of over $7 trillion dollars every year and help eliminate poverty and hunger.\n“So let today be the start of new decade in which finally we make peace with nature and secure a better future for all,” he remarked.\nExecutive Director UNEP Inger Anderson said the UN Decade was aimed at reversing the damages caused by the world to the environment.\n“Pakistan is showing us a way. Prime Minister Imran Khan recently planted one billionth tree of Ten Billion Tree Tsunami. Bravo to all,” he remarked.\nShe said the test for Pakistan and all nations was to build the momentum and fulfil their commitment.\nReferring to an analysis of Pakistan’s growing inclusive wealth due to forestation, she said Pakistan’s economy was moving on right direction.\nShe urged Pakistan to keep delivering on its ambitious commitments and encouraged all other nations to follow Pakistan’s leadership and make this decade a roaring success.\nPresident Word Economic Forum Borge Brende said the more than half of the world’s GDP was highly dependent with the nature. He said by 2025, an estimated 1.8 billion people would suffer absolute water scarcity and two-thirds of the world will be living under water shortages.\nHe said the UN Decade was set to unleash a global ecopreneurship for a ecosystem restoration. He said the WEF offered youth leaders and innovators of all natures an opportunity to share their best solution for ecosystem restoration.\nThe event also featured the musical performance of artists from Balochistan on theme song of World Environment Day as well as Abrarul Haq who thrilled the audience through his hymn “Tere Rang Rang.”",
  "retrievedAt": "2025-08-11T20:49:00.658Z"
}
