{
  "title": "President orders Banking Mohtasib to probe into unwarranted funds transfer case",
  "link": "https://www.app.com.pk/national/president-orders-banking-mohtasib-to-probe-into-unwarranted-funds-transfer-case/",
  "date_published": "2021-06-05T02:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 5 (APP): To ensure dispensation of justice to the public over their grievances against financial bodies, President Dr Arif Alvi set aside the findings of the Banking Mohtasib for dealing with the complaint of a bank account holder in a ‘causal manner’ and without taking into account the principles of justice and required standards of inquiry.\nPresident Alvi directed the Banking Mohtasib to “process, enquire and deal with the complaint in accordance with law after affording the complainant an opportunity of hearing”.\nThe complainant Mrs Rubi Anwaar, an account holder of Habib Bank Limited, Lahore, had filed a representation with the President of Pakistan with a request to take up the matter after the Banking Mohtasib closed her case without holding a proper inquiry. The Banking Mohtasib closed the case without providing her with an opportunity for a hearing.\nThe complainant had earlier informed the Banking Mohtasib that an amount of Rs.140,000 was transferred from her bank account without her knowledge. She mentioned that on pointing out the maladministration, the bank did not grant her any relief.\nPresident Alvi expressing his displeasure over the handling of the case said the “whole process was lacking, rather absent and the complaint was closed summarily without due care and application of mind”.\n“This type of disposition of the matter is uncalled for and unsustainable. The rights of the people cannot be trampled in an arbitrary manner,” he said in a written observation made on the case.\nThe president stressed that the Banking Mohtasib had the responsibility to give the full opportunity of hearing to complainants and fulfill due process of law as the denial of justice caused pessimism and frustration in the society.\nHe noted that the relevant provisions of the Banking Companies Ordinance, 1962, which meant to be followed in inquiring and processing of such complaints, were ignored.\n“Therefore, the representation is accepted and closure findings are set aside with the direction to the learned Banking Mohtasib Pakistan to process, enquire and deal with the complaint of the complainant/ petitioner in accordance with law after affording an opportunity of explaining her grievance and hearing her,” the President concluded in his order.",
  "retrievedAt": "2025-08-11T20:49:01.538Z"
}
