{
  "title": "Govt. to bring environmental revolution: Fawad",
  "link": "https://www.app.com.pk/national/govt-to-bring-environmental-revolution-fawad/",
  "date_published": "2021-06-05T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 5 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain Saturday said that Pakistan Tehreek-e-Insaf (PTI) government will bring an environmental revolution through forestation restoration and large-scale tree plantation in the country.\nIn his World Environment Day, message he said, for the first time in Pakistan, tree plantation and environmental friendly policies were being promoted at government level.\nThe minister said, every human being on the earth should play their role for improvement of environment.\nHe said that it was need of hour that the international community should jointly play its role in the protection of the environment.\nFawad said that rising global temperatures, deforestation, melting glaciers are growing threat to world.\nImran Khan is the only Prime Minister with environment friendly vision who is running a global movement.\nHe said that Prime Minister Imran Khan was sensitizing young generation and the world regarding importance of improving the environment.\n“PM Imran Khan’s efforts to improve environment and plant trees have been acknowledged globally,” the minister said.\nHe said that for the first time in Pakistan, policy of tree planting and eco-friendliness is being promoted with dedication and diligence. If the efforts of the government continued with the same commitment, significant results will be seen in the environmental sector in Pakistan.\nFawad said that the honor of hosting World Environment Day this year is indeed a global recognition of Pakistan’s eco-friendly initiatives.\nInternational organizations have appreciated Pakistan’s commitment to the environment, the minister said.\nHe said, “Nature has blessed us with all kinds of ecosystems, sea, coast, agricultural land, deserts, rivers and three top mountain ranges Hindu Kush, Himalayas and Karakoram”.\nHe said, that the word “Billion Tree” has become the identity of Pakistan and other countries are following the project.",
  "retrievedAt": "2025-08-11T20:49:00.870Z"
}
