{
  "title": "Malala calls for global commitment to girls’ education",
  "author": null,
  "content": "ISLAMABAD, Jan 12 (APP):Nobel laureate Malala Yousafzai on Sunday urged the international community to uphold the dignity, honour, and respect of girls by ensuring their right to education.\nSpeaking at the closing session of the two-day global education conference on girls’ education here, Malala highlighted the alarming crisis faced by millions of girls around the world, with 120 million girls currently out of school due to various socio-economic and political factors.\nReflecting on her own journey, Malala, who began her advocacy for education in Pakistan, expressed that the country would always hold a special place in her heart.\nShe reaffirmed her belief that every girl has the fundamental right to attend school, stressing that women’s education is an issue she holds dear. “Education is not only a right, it is the foundation for a better future,” Malala said, emphasising the power of education to transform lives.\nDrawing upon Islamic teachings, Malala pointed out that learning is an integral part of faith, highlighting the exemplary roles of women such as Hazrat Aisha (RA) and Fatima Jinnah.\n“These women are beacons of light for us,” Malala stated, noting that Fatima Jinnah’s contributions to the struggle for freedom and justice continue to inspire generations.\nShe urged the audience to recognise the importance of women in shaping history and society.\nMalala also spoke about the crucial role women play in economic development, asserting that their participation in the economy is just as vital as that of men. “We need to ensure that women have equal access to opportunities, as their contribution to the economy is invaluable,” she said.\nThe Nobel laureate also condemned the destruction of schools in Gaza, noting that Israel’s actions have led to the destruction of 90% of the universities in the region. “A Palestinian girl cannot build her future if she is denied access to education,” she lamented, calling for an end to the conflict that continues to hinder educational opportunities for girls in Gaza and beyond.\nMalala expressed her gratitude to the Muslim World League for organising the conference, calling it an important platform to address the pressing issue of girls’ education.\nShe urged world leaders to work together to remove the barriers that prevent millions of girls from accessing education, stressing that empowering girls through education is key to creating a more just and equal world.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:35:02.606Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/malala-calls-for-global-commitment-to-girls-education/",
  "dateList": "2025-01-12",
  "date_published": "2025-01-12T14:26:00.000Z"
}
