{
  "title": "Restrictions tightened ahead of Modi’s propaganda tour to IIOJK",
  "author": null,
  "content": "ISLAMABAD, Jan 12 (APP): Authorities in the Indian Illegally occupied Jammu and Kashmir (IIJK) have further intensified restrictions ahead of Indian Prime Minister Narendra Modi’s visit on Monday, sparking anger and frustration among the territory’s besieged population.\nAccording to Kashmir Media Service, the visit, widely seen as a propaganda exercise, has been criticized as a cruel mockery of the Kashmiri people’s aspirations for freedom and justice.\nThe Special Protection Group (SPG) has been deployed at key locations, including the Z-Morh Tunnel and other strategic segments. Police officials stated that additional checkpoints have been established, and surveillance has been significantly increased, especially in central Kashmir. “A coordinated security grid involving police, paramilitary forces, and the Indian army is in place. These measures will remain effective until January 13,” a senior police official confirmed.\nThe intensified restrictions include the deployment of extra personnel, the installation of CCTV cameras, drone monitoring, and the establishment of frisking points. These measures have severely restricted the free movement of locals, adding to their daily hardships. Officials have also suspended traffic on the Kargil-Srinagar highway and the Zojila Pass.\nThe IIOJK administration has instructed 14 Administrative Secretaries to remain stationed at the Civil Secretariat in Srinagar until January 13 to ensure smooth coordination for the visit. These developments, however, have raised concerns among residents, who view the stringent restrictions as an extension of the suppressive measures in the region under the guise of security.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:34:13.042Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/restrictions-tightened-ahead-of-modis-propaganda-tour-to-iiojk/",
  "dateList": "2025-01-12",
  "date_published": "2025-01-12T06:46:00.000Z"
}
