{
  "article_id": "2025-10-19_67004e551d7b9daed410fc9e587311c4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/china-pakistan-urged-to-deepen-cooperation-for-shared-modernization-global-governance/",
    "retrieved_at": "2025-10-20T18:55:12.582Z"
  },
  "metadata": {
    "title": "China, Pakistan urged to deepen cooperation for shared modernization, global governance",
    "author": null,
    "date_published": "2025-10-19T21:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 632,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 19 (APP):Editor-in-Chief of China International Communications Group (CICG), Gao Anming, on Sunday emphasized the need for stronger cooperation between China and Pakistan to accelerate the building of a community with a shared future in the new era.\\n\\nSpeaking at the Pak-China Think Tank Dialogue on \"Modernization through Partnership China and Pakistan in Global Governance\", jointly organized by the Institute of Peace and Diplomatic Studies (IPDS) and the Academy of Contemporary China and World Studies (ACCWS), Gao said that collaboration across different sectors of society is vital for achieving mutual prosperity and modernization.\\n\\nHe noted that both countries attach great importance to improving the well-being of their people through a pragmatic approach that combines large-scale strategic projects with small but meaningful livelihood initiatives. \"We are delivering tangible benefits at the grassroots level and improving people's lives,\" he said.\\n\\nHighlighting China's Global Governance Initiative (GGI) as a major public welfare effort for the world, Gao said that increasing friendship and connections between China and Pakistan would inspire further cooperation as both nations move forward together on the path of modernization.\\n\\nGao stressed that think tanks and media should act as \"dual engines\" for sharing ideas and exploring practical cooperation. \"Together, they can tell the stories of how China and Pakistan are jointly advancing modernization and global governance,\" he added.\\n\\nHe announced that CICG has signed a Memorandum of Understanding (MoU) with IPDS to establish a joint research centre and knowledge-sharing program, focusing on areas such as the Belt and Road Initiative (BRI), global governance, and regional studies. The centre, he said, will serve as a benchmark for China-Pakistan think tank collaboration and a practical source of ideas for developing countries.\\n\\nGao also revealed plans for a book publishing project to share the stories of China-Pakistan cooperation. Agreements have already been signed with publishers and content agencies in both countries. \"This initiative is not about publishing just a few books; it is a long-term strategy to promote mutual understanding through publishing, translation, and digital media,\" he stated.\\n\\nHe further emphasized that communication networks can play a crucial role in removing barriers and deepening ties between the two brotherly nations. CICG, he said, has built strong partnerships with mainstream Pakistani media to promote news exchanges, joint reporting, and content translation, helping both sides tell their shared stories more effectively.\\n\\nCiting the Gwadar Port livelihood projects as an example, Gao said such initiatives provide rich material for media and symbolize the enduring friendship between China and Pakistan.\\n\\nCharge d'Affaires of the Embassy of the People's Republic of China in Pakistan, Shi Yuanqiang, in his remarks, said that the China-Pakistan partnership demonstrates how mutual trust, respect, and shared sacrifices can build lasting stability and friendship.\\n\\nHe noted that both countries have always stood by each other in difficult times and continue to work together for regional peace, stability, and development. Initiatives such as the China-Pakistan Economic Corridor (CPEC) not only strengthen economic cooperation but also lay the foundation for peace through shared prosperity.\\n\\nShi highlighted that the Global Governance Initiative (GGI), proposed by President Xi Jinping, envisions a more balanced, inclusive, and cooperative international order, guided by principles of sovereign equality, respect for international law, multilateralism, people-centered development, and action-oriented cooperation.\\n\\nHe said the GGI complements China's three other global initiatives, Global Development Initiative (GDI), Global Security Initiative (GSI) and Global Civilization Initiative (GCI). \"Together, these initiatives form the framework for a fairer and more inclusive global order-one that resonates deeply with developing nations,\" Shi said.\\n\\nHe added that CPEC stands as a living example of how strategic partnerships can transform economies, create jobs, modernize infrastructure, and uplift communities.\\n\\nThe event was also addressed by the Vice President of ACCWS, FAN Daqi, former ambassador Masood Khan, President of IPDS, Dr Farhat Asif, among other speakers. The dialogue was attended by senior representatives from Pakistan's leading organizations, media, and think tanks.\\n\\n",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}