{
  "article_id": "2025-10-19_af775c231e5aaf95ff95d2ecad79c0d2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/talha-mahmood-hosts-dinner-in-honor-of-apnec-saudi-diplomat-saeed-al-malki-participates-as-chief-guest/",
    "retrieved_at": "2025-10-20T18:54:58.167Z"
  },
  "metadata": {
    "title": "Talha Mahmood hosts dinner in honor of APNEC; Saudi diplomat Saeed Al-Malki participates as chief guest",
    "author": null,
    "date_published": "2025-10-19T19:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 304,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 19 (APP): Chairman of the Senate Standing Committee on Defence and former Federal Minister Senator Muhammad Talha Mahmood here on Sunday hosted a dinner in honor of the delegation of the All Pakistan Newspaper Employees Confederation (APNEC). The event was graced by Saeed Al-Malki, a senior Saudi diplomat, who participated as the chief guest. The dinner brought together a distinguished gathering, including APNEC Chairman Siddique Anzar, Secretary General Nazia Riaz, senior office bearers of the confederation, parliamentarians, media representatives and prominent personalities from various sectors. Addressing the participants, Senator Talha Mahmood welcomed the chief guest and appreciated the presence of Saeed Al-Malki, terming it a symbol of the deep-rooted friendship between Pakistan and Saudi Arabia. He lauded APNEC's efforts for safeguarding the rights and welfare of media employees, acknowledging their vital role in strengthening democracy, transparency, and public awareness in the country. Senator Mahmood reaffirmed his full support for the media community and emphasized the importance of continued cooperation between the government, media organizations and workers' unions to promote a free, responsible and ethical press. Speaking as the chief guest, Saeed Al-Malki appreciated the efforts of APNEC and the role of Pakistani media in promoting positive narratives and strengthening relations between the brotherly nations of Pakistan and Saudi Arabia. He said that media has a critical responsibility to promote peace, tolerance, and mutual respect among societies. APNEC Chairman Siddique Anzar and Secretary General Nazia Riaz expressed gratitude to Senator Talha Mahmood for hosting the dinner and thanked Saeed Al-Malki for his gracious presence. They reiterated APNEC's commitment to continue working for the welfare of media employees and for upholding journalistic integrity. The evening concluded with expressions of goodwill and mutual commitment to further strengthen cooperation between Pakistan and Saudi Arabia, and to support initiatives aimed at empowering the media sector in Pakistan.\\n\\n",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}