{
  "article_id": "2025-10-19_ae8bf497ac23902cc305bb25a59a6463",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ayaz-felicitates-suparco-scientists-engineers-on-successful-launch-of-hs-1/",
    "retrieved_at": "2025-10-20T18:56:08.413Z"
  },
  "metadata": {
    "title": "Ayaz felicitates SUPARCO scientists, engineers on successful launch of HS-1",
    "author": null,
    "date_published": "2025-10-19T13:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 207,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 19 (APP): Speaker National Assembly Sardar Ayaz Sadiq has extended his heartfelt congratulations to the scientists, engineers, and the nation on the successful launch of Pakistan's first Hyperspectral Satellite (HS-1).\\n\\nThe Speaker expressed his best wishes for the SUPARCO team, saying that the successful launch of the HS-1 mission marks a historic milestone in Pakistan's space research program.\\n\\nHe said that the launch of HS-1 would open new avenues for scientific and technological self-reliance in the country. \"The scientists, engineers, and staff of SUPARCO have made the nation proud,\" he added.\\n\\nAyaz Sadiq highlighted that the HS-1 satellite will bring revolutionary advancements in agriculture, environmental sustainability, and urban planning. \"Through this satellite, Pakistan will be able to effectively monitor crop health, soil moisture, and natural disasters,\" he said.\\n\\nTerming the mission a significant step toward achieving Pakistan's Sustainable Development Goals (SDGs), the Speaker said that this achievement reflects the hard work, vision, and national commitment of the country's scientific community.\\n\\nHe said that SUPARCO's success will inspire the younger generation to pursue research and innovation. \"Parliament will continue to support SUPARCO and other scientific institutions for their development,\" he assured.\\n\\nThe Speaker reaffirmed that all available resources will be utilized to ensure Pakistan's prominent standing in the field of space research.\\n\\n",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}