{
  "article_id": "2025-10-19_1db4aea1fe4860eba45b669ff6203238",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dpm-fm-dar-commends-scientists-teams-on-hs-1-successful-launch/",
    "retrieved_at": "2025-10-20T18:55:57.733Z"
  },
  "metadata": {
    "title": "DPM/FM Dar commends scientists, teams on HS-1 successful launch",
    "author": null,
    "date_published": "2025-10-19T11:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 216,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 19 (APP): Deputy Prime Minister/Foreign Minister, Senator Mohammad Ishaq Dar, Sunday, commended the scientists/technical teams from Pakistan and China working on Pakistan's first Hyperspectral Satellite (HS-1) for their commitment, professional excellence and exemplary cooperation.\\n\\nThe Pakistan Space and Upper Atmosphere Research Commission (SUPARCO) achieved a major milestone with the successful launch of Pakistan's first Hyperspectral Satellite (HS-1) from the Chinese Satellite Launch Centre.\\n\\n\"HS-1 is equipped with advanced hyperspectral imaging technology capable of capturing data across hundreds of narrow spectral bands. This capability will enable precise monitoring and analysis of land use, vegetation health, water resources, and urban development,\" Foreign Office Spokesperson said in a press release.\\n\\nThe satellite is expected to significantly enhance national capacities in areas such as precision agriculture, environmental monitoring, urban planning, and disaster management. Its high-resolution data will support improved resource management and strengthen Pakistan's resilience to climate-related challenges.\\n\\nIn addition, HS-1 will contribute to development initiatives, including the China-Pakistan Economic Corridor (CPEC) by identifying geo-hazard risks and promoting sustainable infrastructure development.\\n\\n\"The successful launch of HS-1 marks a pivotal step forward in Pakistan's space program and reaffirms SUPARCO's commitment to leveraging space technology for national development. This achievement also highlights the long-standing collaboration between Pakistan and China in the peaceful exploration of space and its application for socioeconomic progress,\" it was further added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}