{
  "article_id": "2025-10-19_7b658d0e8c68ae58b822672497b26bd9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/comstech-and-gaza-palestine-universities-consortium-sign-mou-to-strengthen-scientific-and-educational-cooperation/",
    "retrieved_at": "2025-10-20T18:55:48.069Z"
  },
  "metadata": {
    "title": "COMSTECH and Gaza-Palestine Universities Consortium sign MoU to strengthen scientific and educational cooperation",
    "author": null,
    "date_published": "2025-10-19T15:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 496,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 19 (APP): COMSTECH, the Organization of Islamic Cooperation (OIC) Standing Committee on Scientific and Technological Cooperation has signed a landmark Memorandum of Understanding (MoU) with Consortium of Universities, Gaza-Palestine comprising of seven universities of Gaza-Palestine, aimed at fostering long-term collaboration in higher education, scientific research, and institutional rebuilding of Gaza's academic sector.\\n\\nThe MoU was signed by Prof. Dr. Muhammad Iqbal Choudhary, Coordinator General, OIC-COMSTECH, and Prof. Ayman M. F. Sobh, President of Al-Aqsa University, representing the Consortium of Gaza Universities, which includes Al-Aqsa University, University of Palestine, Al Azhar University, Islamic University of Gaza, Gaza University, Israa University, and Al-Quds Open University.\\n\\nUnder the MOU, COMSTECH and the Consortium of Universities, Gaza-Palestine will cooperate to promote joint educational and scientific programs, organize international conferences and training courses, and facilitate exchange visits of faculty, researchers, and technical experts.\\n\\nThe initiative also includes the integration of Gaza universities into the COMSTECH Consortium of Excellence (CCoE) and their registration in the OIC Technology and Innovation Portal, expanding access to collaborative opportunities across the Muslim world.\\n\\nCOMSTECH will further support Gaza's universities through faculty development, sabbatical visits, and short-term training programs in cutting-edge fields such as Artificial Intelligence, Cybersecurity, Medicine, Allied Health Sciences, Natural Sciences, and Information Technology.\\n\\nThe MoU underscores the commitment of both parties to strengthen institutional capacity and academic resilience in Gaza through cooperative research, innovation, and scientific exchange.\\n\\nSpeaking on the occasion, Prof. Dr. Muhammad Iqbal Choudhary, Coordinator General, OIC-COMSTECH, stated \"This important step will be greatly helpful in connecting universities from Gaza-Palestine with more than eighty leading higher education and research institutions across OIC member states.\\n\\nCOMSTECH will continue to assist the universities of Gaza in their rebuilding and rehabilitation through close academic and research collaborations.\"\\n\\nHe emphasized that the partnership aligns with COMSTECH's broader mission of empowering OIC member states through scientific and technological cooperation and using education as a tool for sustainable recovery and development.\\n\\nEarlier, the delegation from Gaza-Palestine spent a very busy day at the OIC-COMSTECH Secretariat in Islamabad. They attended an important meeting chaired by Prof. Dr. Muhammad Iqbal Choudhary, Coordinator General, OIC-COMSTECH, during which they were briefed on various COMSTECH-led initiatives and programs aimed at fostering scientific cooperation among OIC member states.\\n\\nThe delegation showed keen interest in these initiatives and appreciated COMSTECH's ongoing efforts for capacity-building and institutional support in Gaza,Palestine.\\n\\nThe first-ever delegation comprising Vice Chancellors and senior representatives of universities from Gaza-Palestine is currently on a week-long visit to Pakistan on the invitation of OIC-COMSTECH During the visit, the delegation is meeting with leadership of leading Pakistani universities in Islamabad, Faisalabad, and Lahore, which are member institutions of the COMSTECH Consortium of Excellence (CCoE).\\n\\nThe visit aims to explore avenues of academic collaboration, scientific exchange, and institutional partnership to support the rebuilding and strengthening of the capacity of higher education institutions in Gaza, Palestine.\\n\\nThe delegation members expressed deep appreciation to COMSTECH and Pakistani universities for their continued support in promoting educational and scientific and expressing solidarity with Gaza-Palestine 's academic community at this critical time.\\n\\n",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}