{
  "title": "Country heading towards sustainable growth: Farrukh Habib",
  "link": "https://www.app.com.pk/national/country-heading-towards-sustainable-growth-farrukh-habib/",
  "date_published": "2021-10-22T16:43:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 22 (APP):State Minister for Information and Broadcasting Farrukh Habib said on Friday that the incumbent government under the able leadership of Prime Minister Imran Khan has dedicated special attention to augment the agriculture sector in the country.\nTalking to media along with Special Assistant to Punjab Chief Minister on Information Hasaan Khawar here, he regretted that past governments badly neglected the agriculture sector.\nHowever, the credit goes to Pakistan Tehreek-e-Insaf (PTI) government for giving unprecedented subsidies to promote agriculture in the country,he said.State minister said that the present government not only focused on uplifting agriculture, but increasing exports as well.\nHe elaborated that far-sighted policies of the present government resulted in increased yields of major crops. He said that sugarcane crop yield increased by 25 percent, rice upto 18 percent, while yield of cotton crop increased by 60 percent. He said that price of sugar would get reduced with the start of sugarcane crushing season.\nFarrukh Habib said that price of urea per bag was between Rs 1700 to Rs1800, adding that subsidy on gas was also being provided. He said the country was self sufficient in urea and farmers were getting it at lower price as compared to other countries.\nHe stated that the opposition, while commenting on country’s economic situation, must recall PML-N’s tenure when country’s exports were at 24 billion dollars ,while the current account deficit was 20 billion US dollars.\nHe said that remittances at that time were at 18 billion dollars.Farrukh Habib said that last year the country’s exports were at 25.4 billion dollars and if services were added in it, the figure would touch the mark of 31 billion dollars.\nHe said that at present country’s remittances were 29.5 billion dollars. During the last three months country’s remittances were at 8 billion dollars, exports were 7 billion dollars and in the month of August large scale manufacturing increased by 12.5 percent.\nAbout tax collection, Farrukh Habib said,” it’s was more than our expectations”.He said facts reveal that country’s foreign remittances increased, and textile exports increased by 28 percent.\nHe said that the country’s economic indicators were improving and the country was heading towards sustainable growth.\nAbout price hike he said that its “an international phenomenon” and the country was also facing its impact therefore. He said that petroleum prices in the country were less as compared to other countries.\nHowever, he highlighted that Prime Minister Imran Khan would soon launch a ‘Food Support Programme’ under which subsidised food ration would be provided.To a question, he said that opposition had nothing to do with the welfare of the people,adding that they were raising hue and cry just for their personal gains. He called the opposition ” politically jobless” ,saying they were trying to hoodwink the people.\nFarrukh Habib said Prime Minister Imran Khan directed stern action against hoarders and illegal profiteers.\nHe also said that Health cards were provided to the entire population of Khyber Pakhtunkhwa, adding that soon people of Punjab would be able to avail health card facility.",
  "retrievedAt": "2025-08-11T21:30:12.286Z"
}
