{
  "title": "Data exposes FATF’s “politicised” approach targeting Muslim states; appeasing even non-compliant West",
  "link": "https://www.app.com.pk/national/data-exposes-fatfs-politicised-approach-to-targeting-muslim-states-appease-even-non-compliant-west/",
  "date_published": "2021-10-22T17:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP): Contrary to its claims of acting under no influence, the Financial Action Task Force (FATF) is exposed to be toeing “politicised” approach particularly targeting the Muslim states, data reveals.\nOn Thursday, the terror financing watchdog decided to retain Pakistan in the grey list asking the country to complete concurrent action plans, though it already had complied with 30 of 34 recommended items.\n“Overall, Pakistan is making good progress on this new action plan. Four out of the seven items are now addressed or largely addressed,” FATF President Dr Marcus Pleyer told media.\nAccording to the infolytics issues compiled by the Islamabad Policy Research Institute (IPRI), Pakistan is one of the few countries which had the lowest ratio of non-compliance of FATF action plan.\nBut ironically, the country continues to remain on the grey list despite having sacrificed around 80,000 lives and suffering the economic loss of $150 billion after joining the US-led war against terrorism.\nContrary to Pakistan, the non-compliance ratio of France – home to FATF headquarters – is 25% but the watchdog has turned a blind eye.\nSimilarly, other countries including US with a non-compliance ratio of 22.5%, Japan 27.5%, New Zealand 30%, Georgia 32.5%, South Korea 20% and Russia 12.5% are out of the grey list.\nPakistan has long been observing that the watchdog was being used as a political tool to serve the vested interests of some countries and the recent enlistment of Turkey in the grey list has substantiated the claim.\nThe firm stance of Turkish President Recep Tayyip Erdogan particularly on Muslim world issues like Kashmir, Palestine and specifically Islamophobia has been pinching the western powers. He has also been\nSimilarly, Prime Minister Imran Khan is also among a few Muslim world leaders who strongly fought the case of Islamophobia across the world including the UN General Assembly.\nHe is the only leader who blasted India at the UNGA exposing the so-called biggest democracy for its massive human rights abuses in Indian Illegally Occupied Jammu and Kashmir.\nRecently, the Indian External Affairs Minister S. Jaishankar confessed to influencing the FATF to keep Pakistan on the “grey list” which raised serious questions on the integrity of the watchdog.\nReacting strongly Foreign Minister Shah Mehmood Qureshi said “manipulating an important technical forum for narrow political designs against Pakistan is disgraceful but not surprising for the Modi Government.”\nIndian news agency ANI quoted Jaishankar on Sunday as saying; “Due to us, Pakistan is under the lens of FATF and it was kept in the grey list.”\nThe Foreign Office Spokesperson Zahid Hafeez Chaudhry said “the Indian statement not only exposes its true colours, but also vindicates Pakistan’s longstanding stance on India’s negative role in FATF”.\nSpecial Assistant to PM Raoof Hassan took to Twitter to criticize the FATF’s decision on Pakistan saying, “FATF has lost whatever credibility it still had. It is no longer a fair arbiter. Instead, it has become a veritable arm of western imperialist agenda to subdue the less powerful countries, Pakistan being one of them. It is time to stop pandering. It is time to stand up for rights.”\nIn a statement, a government spokesperson, the Action items that have been completed include amendments in the Mutual Legal Assistance Act, 2020, AML/CFT supervision of Designated Non-Financial Businesses and Professions (DNFBPs), transparency of beneficial ownership information and implementation of Targeted Financial Sanctions for Proliferation Finance by DNFBPs.\nThe remaining action items in the 2021 Action Plan include investigation & prosecution of ML cases, confiscation of assets and UN listings.\nConsiderable work has already been carried out on the remaining items of both Action Plans. FATF will undertake next review of Pakistan’s Progress in February 2022.\nIn a tweet, Energy Minister and Chairman National FATF Coordination Committee Hammad Azhar who also represented at the virtual FATF meeting, said, “Now only some countries do not agree with the majority on progress made by Pakistan on the TF action plan. We are getting closer to consensus numbers in spite of “challenges”. Our technical stance will be vindicated soon InshAllah.”\nAnalysts say that the global financial watchdog has become selective in targeting countries where banks have weak compliance or controls to stop the illicit flow of funds.\n“If they were fair in their treatment of all the countries, they would have put the UK in the FATF grey list,” said Hassan Aslam Shad, a Middle East-based lawyer who has studied the watchdog for years, according to TRT World. “But they will not do it. They have made up their mind and preconceived notions drive their decisions,” he added.\nFATF’s decision on Pakistan has highlighted how powerful countries are influencing the global money-laundering monitor.\n“FATF has become deeply politicised,” Shad said.\nAPP Digital Report by Ishtiaq Ahmed",
  "retrievedAt": "2025-08-11T21:30:12.294Z"
}
