{
  "title": "President asks HEC to further improve online distance learning policy",
  "link": "https://www.app.com.pk/national/president-asks-hec-to-further-improve-online-distance-learning-policy/",
  "date_published": "2021-10-22T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP): President Dr Arif Alvi Friday asked the Higher Education Commission to further improve its online distance learning policy keeping in view the fast-changing requirements of the modern era and by adopting the international best practices.\nThe president, during a briefing on the said policy of the HEC, highlighted that the importance of distance learning education had increased manifold, particularly during the COVID-19 pandemic.\nHe also called for integrating distance learning programmes into the mainstream education system.\nExecutive Director of HEC, Dr. Shaista Sohail and senior government officials attended the meeting whereas Dr Atta-ur-Rahman and members of HEC’s committee on the said policy participated via video-link.\nThe president was informed that the main objective of the policy was to provide rules, guidelines, and minimum quality standards under which the universities would be allowed to offer online and distance education.\nIt was told that the ODL policy would provide a platform to the institutions which wanted to provide affordable online education to the students. It is also aimed at putting in place a uniform assessment system for the students to maintain the quality of education.\nThe meeting was briefed that the policy was formulated after consultations with the stakeholders from public and private universities and experts in distance education and e-learning.\nAppreciating the online and distance learning education programmes being offered by the Virtual University (VU) of Pakistan, the president urged the need for multiplying the efforts of institutions like VU to increase the enrollment of students.\nHe also highlighted the fact that the content of the online or distance learning courses should be devised according to the requirements of the market.\nHe further underlined the need to increase the number of students at higher education institutions for the socio-economic development of the country.",
  "retrievedAt": "2025-08-11T21:30:12.345Z"
}
