{
  "title": "Foreign Sec. for enhanced coordination to implement quadrilateral trade, transit agreement",
  "link": "https://www.app.com.pk/national/foreign-sec-for-enhanced-coordination-to-implement-quadrilateral-trade-transit-agreement/",
  "date_published": "2021-10-22T18:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP): Deputy Chairman of the Security Council of Kyrgyz Republic Friday met with the Foreign Secretary Sohail Mahmood here wherein the latter stressed for stepped-up coordination for implementation of Pakistan-China-Kyrgyzstan-Afghanistan Quadrilateral Agreement on Trade in Transit Agreement (QTTA).\nDuring the meeting, the foreign secretary reiterated Pakistan’s support for ongoing projects such as CASA-1000 power transmission line.\nThe two sides discussed a wide range of subjects, including bilateral relations, regional peace and security, and cooperation at the international fora.\nExpressing satisfaction on status of existing ties, Sohail Mahmood underlined the importance of enhanced bilateral exchanges, trade and economic ties, and regular interactions of institutional mechanisms.\nThe two sides reaffirmed their cooperation at the regional and international fora, including at the UN, OIC, SCO and ECO on all matters of mutual interest.\nOn the situation of peace and security, the foreign secretary highlighted the importance of a peaceful and stable Afghanistan for Pakistan and the region.\nHe emphasized the need for the international community to pursue a pragmatic approach and take practical steps in order to seize the opportunity for sustainable peace and stability in Afghanistan.\nThe foreign secretary stressed the need for relief efforts and humanitarian assistance to Afghanistan, release of Afghanistan’s frozen financial assets, and steps for economic stability.\nHe said that sustainable peace in Afghanistan was essential for the neighboring countries, to preclude security challenges and refugee outflow and to reap the benefits of regional connectivity through implementation of CASA-1000 and Trans-Afghan Railway projects.\nThe Kyrgyz Deputy Chairman shared Kyrgyzstan’s perspective on the evolving situation and appreciated Pakistan’s efforts in support of peace and development in Afghanistan.\nHe also reaffirmed Kyrgyzstan’s commitment to further enhance bilateral cooperation in all areas of mutual interest.The Deputy Chairman of the Security Council of Kyrgyz Republic is on a three-day visit to Pakistan from October 21-24, 2021.",
  "retrievedAt": "2025-08-11T21:30:12.242Z"
}
