{
  "title": "Pakistan eager to develop blue economy with EU’s help: NA Speaker",
  "link": "https://www.app.com.pk/national/pakistan-eager-to-develop-blue-economy-with-eus-help-na-speaker/",
  "date_published": "2023-01-16T16:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP): National Assembly Speaker Raja Pervaiz Ashraf on Monday expressed Pakistan’s desire to advance its blue economy with the technical and financial support of the European Union.\nTalking to a parliamentary delegation from Belgium, he said Belgium and Pakistan had warm relations based on a common commitment to democracy, pluralism, and trust.\nThe delegation — which has come to Pakistan on a week-long visit at the special invitation of the NA Speaker — comprised Allessia Claes, Senator /Chairperson of the Belgium-Pakistan Parliamentary Friendship Group, Karl Vanlourve, State Senator Philippe Courard, PS, State Senator, Georges Dallemagne, Les Engages, Member of the Belgian Chamber of Representatives, and senior officers of Belgium Parliament.\nIts visit is intended to further promote parliamentary cooperation between the two sides in a bid to provide all necessary support to maximize gains in trade and promote people-to-people contacts.\nThe speaker said Pakistan had consistently demonstrated its readiness and commitment to upholding both its constitutional and international commitments for a more secure, environment-friendly, peaceful, and progressive world.\nAccording to Quaid-e-Azam Muhammad Ali Jinnah’s vision, Pakistan had always supported the peaceful and diplomatic settlement of all international problems, he added.\nPervaiz Ashraf, in response to a query concerning the continuing conflict between Russia and Ukraine, from one of the visiting delegates, said Pakistan was in favor of a peaceful resolution to all problems. “We had learned from history and our own experience that the only way to achieve enduring peace was via communication. Instead of concentrating all of its efforts on bringing about peace in just one area, the world should do its share to resolve other ongoing conflicts, including the issue of Jammu and Kashmir being illegally occupied by India, with equal vigour,” he added.\nHe emphasised that parliaments may play a significant part in educating the populace about the urgent need for a new world order based on shared ideals of democracy and equality for everyone.\nDespite producing less than 1% of the world’s greenhouse gases, he highlighted that Pakistan was at the epicenter of the global climate issue.\nHe went on to explain that the nation had been experiencing extreme weather conditions, including droughts, forest fires, intense and protracted heat waves, and extraordinary and prolonged monsoon rains that caused devastating floods.\nAllessi Claes thanked the speaker profusely for the invitation and offered sympathy for the flood victims.\nShe underlined the importance of letting the world know the real narrative of Pakistan, which battled valiantly against all odds to become a stable, tranquil, and peaceful nation.\nShe and her colleagues would unquestionably serve as Pakistan’s ambassadors in Europe and work to promote the nation as much as possible, Allessi Claes added.\nEarlier, a “quite fruitful” meeting was held between the visiting delegation and the National Assembly’s Pakistan-Belgium Parliamentary Friendship Group.\nThe meeting covered a wide range of topics, including human rights, terrorism, and climate change. It also addressed how both parties could work together and make their economic contributions to further improve bilateral and regional trade through ongoing facilitation and cooperation through their respective parliaments. Both parties highlighted the importance of PFGs meeting on a regular basis, both in person and online, to follow up on the topics discussed during the meeting.\nLater in the day, the delegation also paid a visit to the Women Parliamentary Caucus, where they were informed about the steps the Caucus had taken to empower Pakistani women through appropriate legislation and to use its influence to ensure that the country’s existing laws were implemented aptly for the benefit of more than half of its population.",
  "retrievedAt": "2025-08-11T05:44:50.407Z"
}
