{
  "title": "UN chief calls renewables energies  ‘only credible way’ to avoid climate catastrophe",
  "link": "https://www.app.com.pk/national/un-chief-calls-renewables-energies-only-credible-way-to-avoid-climate-catastrophe/",
  "date_published": "2023-01-16T03:20:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, Jan 16 (APP): :UN Secretary-General Antonio Guterres said in a video message to the 13th Session of the Assembly of the International Renewable Energy Agency (IRENA), which is being held this weekend in Abu Dhabi, that renewable energies are “the only credible way” to avoid a climate catastrophe.\n“Only renewables can safeguard our future, close the energy access gap, stabilize prices and ensure energy security,” the UN chief said, while outlining a five-point plan for a just transition.\n“Together, let’s jumpstart a renewables revolution and create a brighter future for all.”\nThe world is still addicted to fossil fuels and the goal of limiting global temperature rise to 1.5 degrees Celsius is fast slipping out of reach, Guterres warned.\n“Under current policies, we are headed for 2.8 degrees of global warming by the end of the century. The consequences will be devastating. Several parts of our planet will be uninhabitable. And for many, this is a death sentence,” he said.\nRenewable energy sources currently account for about 30 per cent of global electricity.\nGuterres said this must double to over 60 per cent by 2030, and 90 per cent by mid-century.\nHis Five-point Energy Plan first calls for removing intellectual property barriers so that key renewable technologies, including energy storage, are treated as global public goods.\nCountries also must diversify and increase access to supply chains for raw materials and components for renewables technologies, without degrading the environment.\n“This can help create millions of green jobs, especially for women and youth in the developing world,” said Mr. Guterres.\nThe Secretary-General urged decision makers to cut red tape, fast-track approvals for sustainable projects worldwide and modernize power grids.\nHis fourth point focused on energy subsidies. He stressed the need to shift from fossil fuels to clean and affordable energy, adding “we must support vulnerable groups affected by this transition.”\nThe final point highlighted how public and private investments in renewables should triple to at least $4 trillion dollars a year.\nNoting that most investments in renewables are in developed countries, the Secretary-General urged countries to work together to reduce the capital cost for renewables and ensure that financing flows to those who need it most.\nMultilateral development banks must also invest massively in renewable energy infrastructure, he added, while richer nations must work with credit agencies to scale up green investments in developing countries.\nThe President of the UN General Assembly, Csaba Korosi, underlined how success in climate protection depends on the transition to clean energy.\n“But the energy transition we have foreseen was a peace time agenda,” he said in a pre-recorded message. “How will it work in times of major political confrontations when energy supplies are turned into a tool of conflict?”\nAlthough setbacks might occur in the short term, along with a probable rise in the greenhouse gas emissions that drive global warming, Mr. Kőrösi pointed to the long-term benefits of green energy.\n“If we look into the investment trends, the long-term impact of the conflict might be the opposite. From solar to wind, wave, and geothermal, renewable energy sources are available for every climate. Their use has a potential of strengthening energy sovereignty,” he said.\nWeather and climate-related disasters – extreme floods, heat and drought affected millions of people and cost billions in 2022, as tell-tale signs and impacts of climate change intensified.\nThe General Assembly President outlined steps that must be taken for renewable energy to comprise 60 per cent of global power generation by 2030.\nThey include investing in scientific tools of measurement, creating a follow-up mechanism to assess progress, removing intellectual property barriers, and bolstering partnerships for sustainable energy initiatives.\nKorosi stressed the urgency to act now.\n“We are in a desperate race against time. We need bold transformative action to curtail climate change,” he said. “We have the knowledge. We have the means. We should only have the will.”",
  "retrievedAt": "2025-08-11T05:44:59.723Z"
}
