{
  "title": "Japanese government extends loan for Punjab Transmission Grid Stations Project",
  "link": "https://www.app.com.pk/national/japanese-government-extends-loan-for-punjab-transmission-grid-stations-project/",
  "date_published": "2023-01-16T11:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP): The Japanese Government has extended the project loan effective period upto 31 December 2024 of the ongoing loan project “Punjab Transmission and Grid Stations Project (Phase I)”.\nThe loan agreement was signed on 3rd May 2008 under which Japan International Cooperation Agency (JICA) provided a project-based loan of Japanese Yen 11.943 billion (approx. US$ 119.1 million).\nIn this regard, the letter of amendment of the loan agreement has been signed between JICA Headquarters, Tokyo, Japan, and the Ministry of Economic Affairs, Government of Pakistan. Additionally, JICA also accepted the utilization of the remaining project loan amount for flood response, said a press release issued here by the Japanese Embassy in Islamabad on Monday.\nThe extension of the loan utilization period will enable National Transmission and Dispatch Co Ltd (NTDC) to utilize the remaining balance for the procurement of necessary materials as replenishment of essential materials in NTDC Warehouses which were urgency utilized for repair and maintenance of national transmission lines affected in the devastated flood 2022 across Pakistan.\nThe main objectives of this project were to improve the reliability and quality of power supply through the reduction of outages and voltage fluctuation and to meet the fast-growing load demand by strengthening transmission systems in Punjab province.\nThrough JICA support, NTDC has built one 500 kV grid station in Rahim Yar Khan, a 500/220 kV grid station at Faisalabad West along with an associated transmission line, and a 220kV GIS grid station at Shalamar, Lahore along with associated transmission lines. The newly constructed 500/220 kV grid station at Faisalabad West along with the associated transmission line will be expected to be operationalized soon.\nFurthermore, the sub-stations and transmission lines constructed under JICA supported project contributed to mitigating the capacity ratio of neighboring substations and transmission system.",
  "retrievedAt": "2025-08-11T05:44:59.988Z"
}
