{
  "title": "Jamal Shah for facilitating children with local literature, storytelling to promote reading",
  "link": "https://www.app.com.pk/national/jamal-shah-for-facilitating-children-with-local-literature-storytelling-to-promote-reading/",
  "date_published": "2023-08-21T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): Federal Minister for National Heritage and Culture Jamal Shah on Monday stressed the importance of facilitating children with local literature and storytelling to arise their interest in reading to enhance their intellectual caliber as juvenile literature played crucial part in education providing both knowledge and entertainment.\nThe Minister made these remarks during his visit to National Library of Pakistan (NLP) and Department of Museum and Archeology (DOAM) to review the working and performance of the attached departments of the division.\nOn the occasion, Director General NLP Asif Iqbal Khan gave a detailed overview of history, functioning, performance and future plans of the NLP.\nMinister for National Heritage and Culture Jamal Shah underscored that proper ramps should be established for the facilitation of differently-abled person at National Library.\nHe said that his division would adopt all measures to equip the library with modern facilities.\nLater, the Federal Minister for National Heritage and Culture Jamal Shah presided over a meeting to review the progress on various projects of DOAM.\nSecretary National Heritage and Culture, Humaira Ahmed and other senior officials were also present in the meeting.\nThe Director General DOAM Dr. Azeem Khan briefed the Federal Minister about all matters pertaining to DOAM, archeological sites, various projects, initiatives and current matters.\nFederal Minister Jamal Shah said that Takht-e-Bahi which is an ancient Buddhist monastery and one of the most important world heritage site which is extremely important for its integrity, unique state of conservation; and also for its antiquity.\nThe Minister said that he would specially consult with Khyber Pakhtunkhwa government for a joint venture program for the promotion and preservation of Takht-e-Bahi site.\nHe said that he would also hold a meeting with Capital Development Authority (CDA) for the cultural sites being maintained by the civic body.\nHe said that all the cultural and archeological sites should be maintained and preserved by National Heritage and Culture Division.\nJamal Shah said that the promotion of national heritage and culture among the people can only prevent the society from social ills, hatred and intolerance and bring peace and stability.\nThe DOAM officials informed the meeting that 38 Archeological sites and monuments have been identified in Islamabad Capital Territory. Later, the minister also visited Islamabad Museum at Sir Syed Memorial.",
  "retrievedAt": "2025-08-11T09:15:18.118Z"
}
