{
  "title": "Chairman NDMA reviews damages caused by ongoing floods in Sutlej River",
  "link": "https://www.app.com.pk/national/chairman-ndma-reviews-damages-caused-by-ongoing-floods-in-sutlej-river/",
  "date_published": "2023-08-21T14:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): Chairman National Disaster Management Authority (NDMA) Lieutenant General Inam Haider Malik on Monday reviewed the situation of damages caused by the ongoing floods in Sutlej River, the situation of major Dams, and the regulation of river flows during the ongoing monsoon spell.\nThe NDMA Chairman presided special National Emergencies Operations Centre (NEOC) session with key stakeholders on the current flood and monsoon situation, a news release said.\nThe session was attended by representatives of Armed Forces, Pakistan Meteorological Department (PMD), Federal Flood Commission (FFC), Provincial, State, and Gilgit Baltistan Disaster Management Authorities (PDMAs, SDMA, GBDMA), Flood Forecasting Division (FFD), Pakistan Space and Upper Atmosphere Commission (SUPARCO), Pakistan Commissioner for Indus Waters (PCIW), Rescue 1122 Punjab, Tarbela and Mangla Dam Management.\nThe PMD briefed about the previous days’ rainfall observed in the country. They also apprised about the expected rainfall in the North Eastern parts of the country from August 23 to 25.\nThe PDMA Punjab and Rescue 1122 Punjab briefed about the evacuation, rescue, and relief efforts conducted along the Sutlej River.\nThe FFD reported that Sulemanki headworks would attain a very high flood level by 22 August and a peak in the flow of River Jehlum will be observed from 23 to 25 August which will affect the Mangla dam levels.\nThe Mangla and Tarbela Dam management briefed that the water level in dams and contingency measures are in place.\nThe PCIW briefed about the mechanism in place for information sharing between Pakistan and Indian dam management.\nThe Chairman NDMA instructed relevant departments to carry out flood damage assessment and gather accurate data.\nHe also instructed PDMAs, GBDMA, and SDMA to increase awareness among the masses about the remedial measures to be taken during the season and to monitor the changing situation vigilantly.\nHe reiterated that the settlements and encroachments in river beds of all major rivers must be cleared by all concerned to minimize the damages.",
  "retrievedAt": "2025-08-11T09:15:09.009Z"
}
