{
  "title": "PM Kakar reiterates govt’s resolve to protect minorities",
  "link": "https://www.app.com.pk/national/caretaker-pm-reiterates-govts-resolve-to-protect-minorities/",
  "date_published": "2023-08-21T12:33:00.000Z",
  "source": "APP",
  "content": "JARANWALA , Aug 21 (APP): Caretaker Prime Minister Anwaarul Haq Kakar on Monday assured all the minority communities in the country that the government was committed to protect their lives and properties, and the perpetrators of heinous attacks against them would be brought to justice.\nAddressing a gathering of the Christian community members, he said, “We are the followers of the Holy Prophet (Peace Be Upon Him) and the Founder of the Nation, and it is also binding upon us under the Constitution, which encourages us to respond to such atrocities.”\nThe prime minister said that they would never condone the persecutors of minorities, and stressed that if anyone caused harm to the minorities, the law of the country would take its course by ensuring that such like incidents should not happen in future.\nThe entire society and the government would not cower down before the dark forces but would stand shoulder to shoulder with the victim communities, he said, adding that they would become voice of the voiceless with the tangible and meaningful support.\n“Our actions will speak louder than our speeches,” PM Kakar said.\nThe prime minister arrived here to express solidarity with the victim families of Christian community. Punjab Governor Baligh-ur-Rehman and Caretaker Chief Minister Syed Mohsin Naqvi,  caretaker federal ministers, senior officials and members of the Christian community were present on the occasion.\nPM Kakar further said that the minorities in Pakistan were struggling for the protection of the rights of their communities across the region, adding that the people who had attacked the Christian community in the area were the enemies of humanity.\nHe said that they were assuring them of the government’s support not out of any compulsion, but due to their conviction.\nThe incident that occurred in the area alluded to a pervasive issue in the society which had been experiencing extremism, radicalism and aggressive behaviour, and manifested that such behaviour did not belong to any religion, sect or group rather indicated an innate human behaviour which spread like a cancerous disease, he opined.\nThe prime minister regretted the unfortunate incident that occurred after the caretaker government took oath.\nReferring to Islamic history, he said that under the Quaid’s vision, it was their utmost responsibility, to protect the minorities. It was the duty of Muslims to protect the honour, life and properties of the Christian community, he added.\nThe prime minister said a society could thrive under rule of law, and become stable on the basis of one principle, the sense of justice among the masses, which ensured a society and state to survive.\nHe also expressed his gratitude to the upcoming Chief Justice of Pakistan, the caretaker chief minister and the military leadership for their support to the victims and reiterated that there would be no compromise on the minorities’ rights.\nThe prime minister warned that no one could predict the future, but in case, any miscreant or group that harboured evil designs against the minorities, including Sikhs, Hindus, or others, would find the authority of the government on the side of the affected segments, shielding them against any harm.\nRecalling the Christian community members’ contributions in the society, the prime minister also recollected his early education imparted by the Christian teachers.\nThe caretaker prime minister said white was not only a colour of the National Flag, but it showed the perfection of the country in which the minorities filled that beauty of harmony and unity.\nHe further assured that they would resist the majoritarianism and such like agenda at the domestic, regional and global levels.\nSpeaking on the the occasion, the Punjab governor said that such incidents should be curbed and let not recur, adding the places of worships were worth respected and the regard for all communities should be maintained.\nThe chief minister, on the occasion, said that the main culprits were already in the custody.\nHe assured that the damaged churches would be restored while the compensation cheques would be handed over to all the affected families.\nEarlier, the prime minister also distributed cheques among the affected families.\nCaretaker Minister for Human Rights Khalil George, in his remarks, regretted the unfortunate incident and thanked the Muslim families of the area for protecting their Christian neighbours.\nDuring his visit to a church, the prime minister reiterated that they would not allow anyone to target the minorities on the basis of religious differences, adding the the government, with full might, would stop the hands of aggressors.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:15:35.530Z"
}
