{
  "title": "ICT admin holds six agents outside Excise Office",
  "author": null,
  "content": "ISLAMABAD, Jul 25 (APP):A surprise inspection by the Assistant Commissioner of Islamabad’s Industrial Area led to the arrest of six agents operating outside the Excise Department.\nThe action was taken as part of an effort to curb illegal activities around government offices.\nAccording to the spokesman of ICT administration, the Assistant Commissioner (AC) Industrial Area conducted an unannounced visit to the premises outside the Excise and Taxation Office in Islamabad.\nDuring the inspection, six individuals identified as agents were taken into custody on charges of unauthorized operations and public disturbance.\nThe arrested persons were allegedly involved in offering unofficial services to citizens visiting the excise office for vehicle registration, license renewals, and tax-related tasks. Authorities stated that these agents often charge citizens extra money under the pretext of speeding up government procedures.\nFollowing their arrest, the agents were shifted to the police station for further legal action. According to the administration, the presence of these individuals creates difficulties for the public and disrupts the orderly functioning of the department.\nOfficials said the action was taken to discourage the use of middlemen and ensure transparency in public service delivery.\nThe Assistant Commissioner noted that such visits would continue in the future to maintain discipline around government offices.\nThe administration has urged citizens to avoid dealing with unauthorized individuals and to use only the official counters for any excise-related services. Signboards and warnings are also being placed near the premises to inform visitors about the risks of using agents and the legal consequences for those found engaging in such practices.\nAuthorities emphasized that the goal of such operations is to ensure that all government services are provided directly to the public without interference or exploitation. The Assistant Commissioner further stated that the crackdown is part of a broader initiative to improve public access and reduce complaints related to delays and overcharging.\nIn the coming days, more inspections are expected in other parts of the city to identify and stop similar activities near other government offices.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:06:21.500Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ict-admin-holds-six-agents-outside-excise-office/",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T14:45:00.000Z"
}
