{
  "title": "COAS visits China, meets senior Chinese political, military leadership",
  "author": null,
  "content": "RAWALPINDI, Jul 25 (APP): Chief of Army Staff (COAS) Field Marshal Syed Asim Munir, NI (M) undertook an official visit to the People’s Republic of China and held a series of high-level meetings in Beijing with senior Chinese political and military leadership, reaffirming the ironclad strategic partnership between Pakistan and China.\nThe COAS called on His Excellency Han Zheng, Vice President of the People’s Republic of China and Wang Yi, Foreign Minister of China, said a news release issued by Inter Services Public Relations (ISPR).\nDiscussions focused on the evolving regional and global political landscape, connectivity initiatives under the China-Pakistan Economic Corridor (CPEC), and the need for coordinated responses to shared geopolitical challenges.\nBoth sides expressed satisfaction over the depth of bilateral engagement and reiterated their shared commitment to sovereign equality, multilateral cooperation, and long-term regional stability.\nThe Chinese leadership lauded the Pakistan Armed Forces as a cornerstone of resilience and a vital contributor to peace in South Asia.\nOn the military side, Field Marshal Asim Munir held meetings with General Zhang Youxia, Vice Chairman of the Central Military Commission (CMC), General Chen Hui, Political Commissar of the PLA Army and Lieutenant General Cai Zhai Jun, Chief of Staff of PLA Army. Upon arrival at the PLA Army Headquarters, the COAS was presented with a guard of honour, symbolizing the longstanding camaraderie between the two Armed Forces.\nThese engagements featured comprehensive exchanges on defence and security cooperation, including counterterrorism collaboration, joint training, defence modernisation, and enhanced institutional linkages. Emphasis was placed on improving operational interoperability and strategic coordination to confront hybrid and transnational threats.\nThe Chinese military leadership reiterated full confidence in the strength of the bilateral defence partnership and acknowledged Pakistan’s pivotal role in promoting regional peace.\nField Marshal Asim Munir appreciated China’s consistent support and reaffirmed Pakistan’s commitment to further expanding military-to-military cooperation across all domains.\nThe visit reflects the growing depth of politico-military ties between the two brotherly nations and underscores their shared resolve to advance regional security through sustained high-level dialogue and engagements.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:07:51.068Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/coas-visits-china-meets-senior-chinese-political-military-leadership/",
  "dateList": "2025-07-25",
  "date_published": "2025-07-25T09:57:00.000Z"
}
