{
  "title": "Jam Kamal bids farewell to Japanese Ambassador, discusses trade, industry collaboration",
  "link": "https://www.app.com.pk/national/jam-kamal-bids-farewell-to-japanese-ambassador-discusses-trade-industry-collaboration/",
  "date_published": "2024-11-13T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP):Federal Minister for Commerce Jam Kamal Khan on Wednesday met with Mr. WADA Mitsuhiro, the Japanese Ambassador to Pakistan, as he prepares to conclude his tenure in Pakistan.\nDuring the meeting, Minister Jam extended his best wishes for the Ambassador’s upcoming assignment and recognized his contributions toward strengthening bilateral relations and enhancing trade ties between Japan and Pakistan, said a press release issued here.\nAmbassador WADA expressed gratitude for the warmth and hospitality he experienced throughout his time in Pakistan, describing his stay as an enriching and memorable period. He praised Pakistan’s vibrant culture and highlighted the country’s potential for continued economic growth, noting the productive collaboration between the two nations across diverse sectors, from technology to trade.\nThe Osaka Expo 2025, set to take place in Japan, was a key topic of discussion.\nJam Kamal Khan proposed organizing Business-to-Business (B2B) meetings during the event in April 2025, creating opportunities for trade collaboration between Pakistani and Japanese businesses.\nDiscussing the automotive industry, Minister Jam emphasized Pakistan’s commitment to supporting local manufacturing over imports to boost industrial growth.\nJam highlighted Japan’s pivotal role in Pakistan’s automotive sector, particularly in promoting electric vehicle (EV) technology. Acknowledging Japan as a pioneer in this field, he noted the promising future of EVs in Pakistan.\nMinister Khan also appreciated the longstanding relationship between Japan and Pakistan, particularly in the exchange of technology and industrial knowledge, which has consistently benefitted both nations.\nAmbassador WADA echoed these sentiments, noting that he leaves Pakistan with a deep respect for the resilience and entrepreneurial spirit of its people, and he looks forward to continued cooperation between the two countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:16:48.823Z"
}
