{
  "title": "Saudi Arabia’s Grand Mosque offers high-tech support for Umrah pilgrims",
  "link": "https://www.app.com.pk/national/saudi-arabias-grand-mosque-offers-high-tech-support-for-umrah-pilgrims/",
  "date_published": "2024-11-13T12:55:00.000Z",
  "source": "APP",
  "content": "MAKKAH, Nov 13 (APP):The General Authority for the Care of the Affairs of the Grand Mosque and the Prophet’s Mosque has introduced a suite of innovative high-tech services to enhance the experience of Umrah pilgrims.\nThese advancements are designed to make the ritual journey smoother and safer for millions of visitors from around the globe, ensuring that they can focus on their spiritual practices without logistical concerns.\nAmong the latest developments is a state-of-the-art interactive map, available in multiple languages, which guides pilgrims through the expansive mosque complex. This map offers precise directions to various service facilities, such as restrooms, health centers, Zamzam water distribution points, carts, and other essential amenities. By catering to a diverse range of languages, this interactive tool helps bridge any communication barriers that international pilgrims might face, facilitating a more seamless experience within the holy site.\nIn a move to enhance child safety, the authority has introduced specialized children’s bracelets. Available at the Ajyad Gate and King Fahd Gate, these bracelets contain parents’ contact information, allowing mosque authorities to quickly reunite children with their families should they become separated in the crowds. This initiative reflects the authority’s commitment to family-friendly services, to minimize stress for families and caregivers.\nWith these offerings, the General Authority for the Care of the Affairs of the Grand Mosque and the Prophet’s Mosque is taking a proactive approach to meet the needs of millions of pilgrims. This combination of digital navigation tools and family-centric safety measures showcases the authority’s dedication to adapting modern technology in service of tradition, making the sacred pilgrimage to the Grand Mosque safer, easier, and more inclusive.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:16:55.657Z"
}
