{
  "title": "IG Islamabad orders strict measures to combat crime, boost capital security",
  "link": "https://www.app.com.pk/national/ig-islamabad-orders-strict-measures-to-combat-crime-boost-capital-security/",
  "date_published": "2024-11-13T15:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP):Inspector General of Police (IGP) Syed Ali Nasir Rizvi presided over an important meeting at the Central Police Office regarding the security and crime situation in the federal capital on Wednesday.\nA police spokesperson told APP that, the meeting was attended by all divisions DIGs, AIGs, SSPs, and SPs.\nHe said divisional officers provided briefings on city security and crime matters, and an audit report of the Islamabad Police force was presented.\nThe IG Rizvi also collected suggestions from officers and gave further instructions for improvement.\nIG highlighted the need to improve investigation standards through the use of modern technology and called for optimal utilization of available resources to enhance performance.\nAdditionally, IG Rizvi directed concrete actions to control crime and strengthen security in the city.\nThe performance of all patrolling units should be improved and made more effective.\nOfficers should take steps to enhance the welfare of the force to boost their morale, IG Rizvi added.\nDuring the crime meeting, the IG Rizvi directed all officers to ensure crime prevention, effective patrolling, and prompt emergency response.\nIG also emphasized intensifying crackdowns on snatchers, missing gang members, proclaimed offenders, habitual criminals, accused involved in serious crimes, and court absconders.\nIG Rizvi further said that if any crime incident occurs within the jurisdiction of a police station, the relevant officer will be held accountable.\nIG affirmed that all possible measures would be taken to ensure the safety of Islamabad citizens’ lives and property and to maintain public order, adding that citizen safety remains the top priority.\nIslamabad police will leave no stone unturned to make the federal capital a haven of peace.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:16:22.202Z"
}
