{
  "title": "Senate panel expresses dissatisfaction over Railways Ministry’s repeated failure in providing requested information",
  "link": "https://www.app.com.pk/national/senate-panel-expresses-dissatisfaction-over-railways-ministrys-repeated-failure-in-providing-requested-information/",
  "date_published": "2024-11-13T15:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP):The Senate Standing Committee on Railways expressed dissatisfaction towards the Ministry of Railways on Wednesday for failing to provide requested information on theft, embezzlement, and accidents within the railways, marking the third consecutive time this has occurred.\nWhile chairing the meeting, Senator Jam Saifullah Khan criticized the ministry’s intent to withhold information and instructed them to provide all relevant details in the next meeting.\nThe committee discussed the issue raised by Senator Shahadat Awan concerning cases of theft, embezzlement, and accidents within the railways over the past five years, along with the status of the audit report and the ongoing FIA investigation.\nThe mover Senator Shahadat Awan expressed dissatisfaction with the ministry’s failure to provide the requested details for the third consecutive time, noting significant discrepancies between the information given in the last and current meetings and accusing the ministry of reluctance to share necessary details.\nSenator Shahadat Awan highlighted the encroachment of thousands of acres of railway land by private individuals, leading to significant losses from theft and embezzlement.\nHe argued that the railways could be profitable if the ministry took strong action against these issues.\nThe Committee recommended appointing a Minister for Railways to address operational losses and instructed that the heads of NAB and FIA be invited to the next meeting.\nThe Committee discussed the closure of the Loop Section railway line, which once connected the districts of Umerkot, Tharparkar, and Mirpurkhas, raised by Senator Poonjo Bheel.\nOfficials explained that the 183 km line, running from Jamrao to Pitharo (meter gauge) and built during the British era, was previously served by 10 steam-powered trains. However, it was closed due to its outdated design and commercial non-viability.\nSenator Poonjo Bheel suggested that the section could be made commercially viable and benefit thousands if the government took the necessary steps. The Committee recommended that the next meeting be held in Karachi.\nIn attendance were Senators Saifullah Sarwar Khan Nyazee, Shahadat Awan, Dost Ali Jessar, Poonjo Bheel, Liaqat Khan Tarakai, Secretary for Ministry of Railways Syed Mazhar Ali Shah, Inspector General Railway Police Rao Sardar Ali Khan and other senior officials from relevant Departments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:16:16.896Z"
}
