{
  "title": "Muhammad Younas assigned look after charge of MD NTDC",
  "link": "https://www.app.com.pk/national/muhammad-younas-assigned-look-after-charge-of-md-ntdc/",
  "date_published": "2024-11-13T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP):The Board of Directors of National Transmission and Despatch Company Limited (NTDC) has assigned the look-after charge of the post of Managing Director to Engr. Muhammad Waseem Younas, Deputy Managing Director (SO) NTDC, with immediate effect and until the appointment  of a regular incumbent.\nEngr. Muhammad Waseem Younas holds a Master degree in Electrical Engineering from the University of Engineering and Technology, Lahore. He has over 34 years experience of power sector mainly in the fields of Power System Analysis, Transmission Planning and System Operation, said a press release issued on Wednesday.\nHe has made significant contributions to the energy sector, such as development of short, medium and long term power system expansion plans, cross border studies, proposing interconnection schemes for power evacuation of conventional and renewable energy generation projects, resolution of grid system constraints and system stability improvement, review of feasibility study reports from consultants,  preparation of PC-1s and PC-IIs for NTDC projects, development of Indicative Generation Capacity Expansion Plan (IGCEP) and Transmission System Expansion Plan (TSEP), preparation of Grid Code, supporting DISCOs and KE on network expansion, facilitation of the enactment of the Competitive Trading Bilateral Contract Market (CTBCM) along with the execution of system operator functions under the CTBCM roadmap.\nEngr. Waseem Younas also has extensive experience in negotiations with international donor agencies, project developers, consultants, contractors, federal and provincial government entities on future transmission projects and grid performance improvement plans. He has also received trainings from both national and International institutions.\nFollowing the notification, Engr. Muhammad Waseem Younas has officially assumed the charge of Managing Director at NTDC.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:15:52.633Z"
}
