{
  "title": "DPM/FM calls upon developed nations to honour climate finance pledges",
  "link": "https://www.app.com.pk/national/dpm-fm-calls-upon-developed-nations-to-honour-climate-finance-pledges/",
  "date_published": "2024-11-13T13:31:00.000Z",
  "source": "APP",
  "content": "BAKU, Nov 13 (APP): Deputy Prime Minister/Foreign Minister Mohammad Ishaq Dar on Wednesday called on the developed nations to honour their climate finance pledges to provide accessible and grants-based climate financing to achieve developing counties’ climate goals.\nThe deputy prime minister/ foreign minister attended a high-level event convened by the United Secretary-General on ‘Delivering Early Warnings for All (EW4All) and Addressing Extreme Heat’ on the sidelines of the 29th Conference of the Parties to the United Nations Framework Convention on Climate Change (COP29).\nAddressing the high-level event, the deputy prime minister/foreign minister reaffirmed Pakistan’s commitment to safeguarding lives and protecting communities from the unpredictable and severe impacts of climate change.\nHe emphasized the importance of early warning systems for climate-induced hazards, including floods, glacial lake outbursts, droughts, and extreme heat.\nDPM/FM Dar outlined Pakistan’s key initiatives to reduce projected greenhouse gas emissions including Green Pakistan Project, an Electric Vehicle Policy, a large-scale mangrove rehabilitation project, and BRT mass transit systems across major cities.\nHe also appreciated the UN Secretary-General’s leadership in launching the EW4All initiative in 2022.\nDar said the meeting was being held to discuss the role of early warning system and the increasing risk posed by rising heat.\nHe said that they stood united in their commitment to safeguard the livelihood, lives, protect communities and ensure that no one was left unprotected from the unpredictable and severe impacts of the climate change.\nOver a decade Pakistan was consistently being ranked among the top ten countries mostly impacted by climate change, he said, adding the devastating floods of 2022 were the harsh reminder of their vulnerability resulting in a catastrophic loss of over $30 billion and affecting 33 million people in the country. Homes, buildings and essential infrastructure were swept away.\nIf we had any early warning system, much of these impacts could have been mitigated, enabling them to respond proactively and to avoid such immense sufferings, he added.",
  "retrievedAt": "2025-08-10T15:16:29.391Z"
}
