{
  "title": "Gilani calls for creating more social cohesiveness to boost investors’ confidence",
  "link": "https://www.app.com.pk/national/gilani-calls-for-creating-more-social-cohesiveness-to-boost-investors-confidence/",
  "date_published": "2024-11-13T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): Chairman Senate and former Prime Minister, Syed Yousaf Raza Gilani on Wednesday called for creating more social cohesiveness to boost investors’ confidence and strengthening democratic credentials.\nAddressing the inaugural session of Margalla Dialogue 2024, of Islamabad Policy Research Institute (IPRI) here, he underscored the need to re-equip youth with education to make them a capable workforce in a changing and competitive world order, said a press release.\nHe said that new realities are shaping the world at large, and we are living in an era of alliances, including those that are breeding conflict and militarization such as AUKUS and QUAD in the region and beyond.\nThe Chairman Senate said that Pakistan looks forward to more democratisation, and an inclusive order where in economic resilience and security decorum come to adjust transitional changes.\nHe referred to the Founder of the Nation, Muhammad Ali Jinnah and said that “Pakistan is the pivot of the world,” and even our existence at such an important geographic crossroads had proved vitality for our neighbours.\nHe talked about global tensions echoing in the region, and touch-based on internal security and challenges that Pakistan faces in the form of terrorism.\nGilani said that Pakistan’s vision is based on strength and strategic location, along with resilient people and good governance.\nEarlier, President IPRI Amb. Dr Raza Muhammad introduced the audience about the journey that his think tank has undertaken and the meticulous process of holding one of Pakistan’s finest dialogue, Margalla Dialogue.\nHe said that Indian arrogance of not talking to Pakistan is at the root cause of problems, and said that we are living in an era where trade with Russia looms large despite sanctions on several member states of the region. He talked about the emerging realities of China Pakistan Economic Corridor (CPEC) and Belt and Road Initiative (BRI).\nDr Raza said that great powers competition is also transforming into conflicts, and the new challenges are drugs and terrorism. He said that Meta, Google and Artificial Intelligence is on the minds of all and sundry, and this phenomenon has transformed the world.\nThe first distinguished panel discussion titled, “Great Power Competition and its Impact on Peace and Security in Global South,” moderated by former ambassador to the US, Aizaz Ahmad Chaudhry, Chairman Sanober Institute, Pakistan.\nThe keynote address was delivered by Senator Mushahid Hussain Syed, Chairman Pakistan-China Institute and former federal minister. Prof. Vali Reza Nasr, Majid Khadduri Professor of International Affairs and Middle East Studies, Johns Hopkins University, USA; Prof. Dr. Igor Panarin Nikolaevich, Member of the Academy of Military Sciences, Russian Federation; and Prof. Dr. Victor Zhikai GAO, Vice President Centre for China and Globalisation, People’s Republic of China were other elite speakers.\nMushahid Hussain Syed referred to his concept of Three Ds, democratising international relations through equality and the rule of law; demilitarising global interactions to avoid Cold War tensions; and depolarising the financial system to reduce the political power of the US dollar. He believed that there are concerns that the world is slipping into renewed confrontation.\nMushahid said that we are living in a world of turbulence and transformation, and quoted a scholar to recall that 300 years of Western hegemony is coming to an end.\nDr Vali Nasr talked about the psychology of sanctions, and referred at length to the trial and tribulations of Obama and Biden administrations in dealing with China.\nThe two-day international conference themed, “Emerging Global Realities: Challenges and Response,” will continue deliberations on International Law and Economics on Thursday.",
  "retrievedAt": "2025-08-10T15:16:32.002Z"
}
