{
  "title": "CRTF to work for upcoming plantation drive in Sindh: Usman Dar",
  "link": "https://www.app.com.pk/national/crtf-to-work-for-upcoming-plantation-drive-in-sindh-usman-dar/",
  "date_published": "2020-08-07T05:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 7 (APP): The federal government on Friday decided to activate Corona Relief Tiger Force (CRTF) in Sindh for carrying out the upcoming plantation drive in the province.\nThe decision to this effect was taken during a meeting between Governor Sindh Imran Ismail and Special Assistant to the Prime Minister (SAPM) on Youth Affairs Muhammad Usman Dar, said a news release issued here.\nPrime Minister Imran Khan has announced to observe the tiger force day on August 9 to appreciate the efforts of CRTF volunteers during the coronavirus pandemic. On this day, the government has a plan to plant more than one million trees in every nook and cranny of the country.\nUsman Dar said all the arrangements had been finalized to mark the ‘Tiger Force’ day across the country on August 9. Following the instructions of Prime Minister Imran Khan, all the provincial governments had finalized all the arrangements for celebrating the day with zeal and fervor, he added.\nHe said the day would also commemorated in Sindh despite non-cooperation of the provincial government. The volunteers of CRTF from Sindh would perform their duties under the leadership of Imran Ismail.\nHe regretted that the Sindh government had been doing politics on the matter pertaining to the national interest. The federation had requested the Sindh government to refrain from politicizing the matter, he added.\nUsman said the CRTF members in Sindh would be provided full support in performing the voluntary work.\nGovernor Sindh Imran Ismail assured Usman Dar of his full support for the Sindh-based CRTF volunteers. “I will personally take part in the plantation drive to encourage the tiger force volunteers.”\nThe CRTF was announced in March after the coronavirus pandemic broke out in the country. Initially, it was assigned as a task of assisting the local administrations in carrying out rescue and relief activities across the country.\nLater, additional tasks were added to their assignments including tree plantation drive, locusts’ surveillance and other services that required more human resource.",
  "retrievedAt": "2025-08-11T19:37:22.966Z"
}
