{
  "title": "FM stresses ASEAN’s collaborative role during COVID-19 pandemic",
  "link": "https://www.app.com.pk/national/fm-stresses-aseans-collaborative-role-during-covid-19-pandemic/",
  "date_published": "2020-08-07T06:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): Foreign Minister Shah Mahmood Qureshi has stressed the greater role of Association of South East Asian Nations (ASEAN) during the COVID-19 pandemic, saying the unprecedented crisis calls for harnessing the spirit of cooperation and collaboration for greater good of humanity.\nIn a message on the 53rd ASEAN Day, he commended the ASEAN members for effectively and admirably handling the COVID-19 pandemic.\nThe foreign minister said August 8, 1967 marks the historic day when five South East Asian nations forged a common platform premised on the basic principles of cooperation, amity and non- interference.\n“Today, ASEAN is a dynamic organization of ten members, spanning an area of 4.4 million square kilometers, a population of over 649 million, and a GDP exceeding US$2.9 trillion,” he said.\nHe emphasized that the ASEAN Community Vision 2025, comprising the ASEAN Political-Security, Economic and Socio-Cultural components provided a blueprint to further integrate, synergize and harness the immense potential of the peoples and economies of the region.\nHe said Pakistan enjoyed close, friendly ties with all the ASEAN members.\n“Our historic and deep-rooted relations pre-date the modem era, harkening back to abiding linkages forged during the time of the Gandhara Civilization,” he said.\nHe said this enduring and unique relationship finds expression today in Pakistan’s association with ASEAN as a Sectoral Dialogue Partner, and an active member of the ASEAN Regional Forum (ARF).\n“We remain committed to upgrading our partnership with ASEAN to higher levels,” he said.\nQureshi said in line with its ‘Vision East Asia’ policy, Pakistan would continue to deepen and further strengthen political, economic and cultural ties with ASEAN and its members.",
  "retrievedAt": "2025-08-11T19:37:22.748Z"
}
