{
  "title": "President for evolving strategy to lower population growth in country",
  "link": "https://www.app.com.pk/national/president-for-evolving-strategy-to-lower-population-growth-in-country/",
  "date_published": "2020-08-07T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 7 (APP): President Dr Arif Alvi chaired the third meeting of the Federal Task Force on Alarming Population Growth in Pakistan to evolve strategy to lower population growth in the country.\nThe meeting, held here the other day, extensively discussed various proposals to contain the increasing population.\nAll the provincial governments, including Azad Jammu and Kashmir and Gilgit Baltistan, briefed the meeting about the steps taken by them about family planning, a press release issued by the President’s Media Office here Friday said.\nThe provinces informed they had been taking serious measures to check increasing population.\nBalochistan Chief Minister Jam Kamal Khan proposed that financial incentives for the people would help reducing population growth.\nSindh Chief Minister Murad Ali Shah suggested that the provinces, which would lower population growth, needed to be incentivised financially under the National Finance Commission Award.\nThe meeting agreed to seek the cooperation of media and Ulema to play their role in educating the people about the implications of fast-growing population.\nIn order to create public awareness, the meeting underscored the need to launch national campaign on family planning and reproductive health through print, electronic and social media.\nIt emphasized that all provincial governments needed to seek support of Ulema to sensitize the people about the importance of family planning.\nThe meeting tasked Ministry of Religious Affairs and Interfaith Harmony and Council of Islamic Ideology to convene meeting of the Ulema within a month to seek their cooperation with regard to population growth.\nIt also directed the Ministry of National Health Services, Regulations and Coordination to study population models of the countries which have succeeded in controlling their population and submit report to the Task Force based on the findings.\nThe meeting stressed the need to integrate family planning and primary health care services to achieve the objectives of family planning.\nIt also recommended to increase funds for the family planning-related programs.\nThe President assured that he would ask the Prime Minister to increase funds in this regard. It was agreed to convene the next meeting of the Task Force after 45 days.\nHe advised the provincial governments to include mother & child healthcare in their education curriculum.\nThe president asked all federal and provincial governments to implement the decisions of the Task Force on fast track basis so as to check growing population.\nThe meeting was attended by Federal Minister for Religious Affairs and Interfaith Harmony Pir Noor ul Haq Qadri, Advisor to Prime Minister on Commerce, Textile, and Investment, Abdul Razak Dawood, SAPM for Poverty Alleviation and Social Protection/Chairperson Benazir Income Support Program (BISP), Dr Sania Nishtar, SAPM for National Health Services, Regulations and Coordination, Dr Faisal Sultan, Chief Minister Sindh, Syed Murad Ali Shah, Chief Minister Balochistan, Jam Kamal Khan, Caretaker CM GB, Mir Afzal, Chairman, Council of Islamic Ideology, Prof Dr Qibla Ayaz, Chief Secretary Sindh, Mumtaz Ali Shah, Chief Secretary KP, Dr Kazim Niaz, Chief Secretary Balochistan, Capt (R) Fazeel Asghar, Country Director Population Council Islamabad, Dr Zeba Sathar, Representative UN Population Fund (UNFPA), Ms Lina Mousa and provincial ministries and secretaries of population welfare departments.",
  "retrievedAt": "2025-08-11T19:37:17.886Z"
}
