{
  "title": "Future of our planet depends on addressing issue of climate change: Shazia Marri",
  "link": "https://www.app.com.pk/national/future-of-our-planet-depends-on-addressing-issue-of-climate-change-shazia-marri/",
  "date_published": "2022-11-27T13:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP):Federal Minister for Poverty Alleviation and Social Safety and Chairperson BISP Shazia Atta Marri on Sunday emphasised that the future of earth in all aspects depends on addressing the issue of climate change.\nShe was speaking at the meeting of the 26th Socialist International Congress held in Madrid, Spain.\nIn her speech, she expressed solidarity with the women and children affected by the wars and conflicts globally and also highlighted the catastrophic impact of Climate Change in Pakistan in detail.\nShazia Atta Marri while addressing the Socialist International Congress said, “We are expressing solidarity with the women and children of Palestine, Jammu and Kashmir and all around the world where they were being tortured and harassed as the result of the wars and conflicts.”\nShe said that the climate change that inundated Pakistan this summer has affected the country’s population badly.\nMore than 33 million people have been affected, 650 thousand pregnant women and about 4 million children have been affected.\nShazia Marri said that climate change was probably the greatest threat being chased by the planet earth and mankind.\n“A few years back, many around the world including Socialist International members were debating on the issue of climate change, as the debate continues, the climate-related disasters kept wreaking havoc around us,” she added.\nShe said that climate change had become a reality and hoped that the global community, which was now showing some seriousness towards it, will take some real actions this time.\nFederal Minister Shazia Marri said that it was important to understand that climate change was not just an environmental issue if we take the example of recent floods in Pakistan. Climate change is a threat to health, livelihood, agriculture, peace and security and the overall economy of the world.\nShe added that climate change is a threat beyond the imagination of the common man, but the truth is that the future of our planet in all aspects is dependent on addressing the issue of climate change.",
  "retrievedAt": "2025-08-11T15:55:47.457Z"
}
