{
  "title": "Over 33 mln people affected due to rains, flash floods in Pakistan: Shazia Marri",
  "link": "https://www.app.com.pk/national/over-33-mln-people-affected-due-to-rains-flash-floods-in-pakistan-shazia-marri/",
  "date_published": "2022-11-27T12:17:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 27 (APP): Federal Minister for Poverty Alleviation and Social Safety and BISP Chairperson Shazia Atta Marri has said that over 33 million people have been affected owing to heavy rains and flash floods in Pakistan.\nShe said this while attending a meeting of 26th Socialist International Congress held at Madrid, Spain, according to a communiqué here on Sunday.\nIn her speech, she expressed solidarity with the women and children affected by the wars and conflicts globally and highlighted the catastrophic impact of climate change in Pakistan in-detail.\nShazia Marri said, “We are expressing solidarity with the women and children of Palestine, Kashmir and all around the world where they are being tortured and harassed as the results of the wars and conflicts.”\nShe said climate change had wreaked havoc on Pakistan this summer and affected more than 33 million people, including 0.65 million pregnant women and about 4 million children.\nThe minister said climate change was probably the greatest threat being faced by humanity today. “A few years back, many around the world, including Socialist International members were debating on the issue of climate change, as the debate continues, the climate-related disasters kept wreaking havoc,” she added.\nShe said that climate change had become a reality and it feared the global community which was now, showing some seriousness towards it and “I hope, this seriousness of the world community would be changed into taking some real actions this time”.\nShazia Marri further said by taking the example of recent floods in Pakistan, it was important to understand that climate change was not just an environmental issue, but a threat to health, livelihood, agriculture, peace and security and the overall economy of the world.\nShe said climate change was a threat beyond the imagination of the common man, which had endangered the future of our planet.",
  "retrievedAt": "2025-08-11T15:55:48.390Z"
}
