{
  "title": "Pakistan is benefactor and only hope of oppressed Kashmiris: APHC leader",
  "link": "https://www.app.com.pk/national/pakistan-is-benefactor-and-only-hope-of-oppressed-kashmiris-aphc-leader/",
  "date_published": "2022-11-27T05:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP):The senior leader of All Parties Hurriyat Conference, Ghulam Ahmad Gulzar on Sunday said that Pakistan is the benefactor and only hope of the oppressed people of occupied Jammu and Kashmir who have been facing the worst Indian state terrorism for the last over seven decades.\nAccording to Kashmir Media Service, Ghulam Ahmad Gulzar in Srinagar maintained that at a time when Narendra Modi-led fascist Indian government is hell-bent on eliminating every Kashmiri and snatching their land, Pakistan is playing an important role in highlighting before the world the Indian brutalities in IIOJK.\nHe felicitated the newly appointed Army Chief General Asim Munir and Chairman Joint Chiefs of Staff Committee General Sahir Shamshad Mirza.\nHe thanked the political and military leadership as well as the people of Pakistan for their consistent support of the Kashmiris’ struggle for the right to self-determination.\nThe Modi regime is taking one step after another to implement the Hindutva agenda of RSS and disempower the Muslims in IIOJK.\nIn its latest move, it has added over 7 lac new voters, the majority of them non-local Hindus and retired personnel of Indian forces, in the final electoral rolls of the territory. The move is aimed at benefiting the Bharatiya Janata Party in the so-called assembly elections in IIOJK in future installing a Hindu chief minister.\nMeanwhile, the occupation authorities shifted, today, the illegally detained senior APHC leader, Molvi Bashir Ahmad Irfani from Humhama police station to Srinagar Central Jail. He was arrested by the Indian police in Sopore town of Baramulla district on the 3rd of this month.\nThe authorities also confiscated several properties belonging to Jamaat-e-Islami of the occupied territory in South Kashmir’s Islamabad district. The properties including orchards, shopping complexes, agricultural land and residential houses were confiscated in the Danjipora, Mattan and Sarai areas of the district.\nOn the other hand, political experts and analysts in their statements and interviews in Srinagar deplored that the Modi regime is victimizing journalists for reporting the grim human rights situation to the world.\nThey said that for the last over a week several media persons were being summoned to the police stations daily and harassed in the name of questioning.",
  "retrievedAt": "2025-08-11T15:55:50.221Z"
}
