{
  "title": "CPEC paving foundation of sustainable development of Pakistan: Chinese CG",
  "link": "https://www.app.com.pk/national/cpec-paving-foundation-of-sustainable-development-of-pakistan-chinese-cg/",
  "date_published": "2023-12-06T10:10:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 06 (APP): Pakistan and China achieved concrete progress under the China-Pakistan Economic Corridor which is paving the foundation of sustainable development and economic growth of Pakistan.\nThe people of Pakistan started reaping the benefits of the CPEC journey as several major projects have been completed while many more were in the completion process.\nThese views were expressed by the Consul General of the People’s Republic of China in Karachi, Yang Yundong in an exclusive interview with the Associated Press of Pakistan here at the Consulate.\nRegarding progress on CPEC projects, Yang Yundong said the Gwadar Port had become operational for a few years, free zones were also in operation while the New Islamabad Airport, Sukkur – Multan Motorway and other major projects have been completed under the Economic Corridor.\nThe Consul General said the Havalian-Thakot section of Karakoram Highway, Jakla-DI Khan Motorway, Optical Cable, Eastern Expressway and Orange Line Metro Train Lahore projects were also completed which had started giving fruits to the common men.\nHe said that so far 14 energy projects including the Qasim Port Coal Power plant, Hub Coal power plant and Thar Coal power plant have been completed and the people of Pakistan were reaping the benefits of the projects.\nHe informed that in Gawadar, the Pak China Friendship Hospital project and China Aid Seawater Desalination plant were also completed and inaugurated for the facilitation of the people of the area.\nApart from the above projects, several solar, wind and Hydro power plants had also been completed and the electricity was being generated from them these projects were contributing to the socio-economic stability of the country, Yang said.\nHe said after the completion of the Sukkur- Multan Motorway, the travel time had reduced from 11 hours to less than 5 hours while the Lahore Orange Line Metro project has also been put into operation and several Industrial and Special Economic Zones became operational under the Corridor projects, attracting investment from China and other countries.\nHe said the Chinese and Pakistani leaders in the meeting held in Beijing last month, have shown commitment and consensus for further fast-paced progress on the CPEC projects so that future cooperation could be enhanced. He said these projects are people-centric and would solidify the economic foundations of Pakistan.\nWhile replying to a question, the Chinese Consul General said the CPEC will prove to be a livelihood-enhancing corridor where new technology would be used to make the project more sustainable and environment and climate-friendly. He also invited other parties to join the corridor to benefit from it.\nResponding to a query regarding the Thar Coal power plant, the Consul General said the Chinese companies made sizeable investments in the project that had become operational and power generated from the project was being added to the national grid.\nDue to its dependence on local mineral resources rather than on imported ones, the Thar Coal project will provide sustainable foundations for Pakistan’s economic growth, he noted.\nOn another question regarding cooperation in the field of education, the Consul General said that over 30000 Pakistani students were getting education in Chinese universities, colleges and other educational institutions. Moreover, several Chinese Engineers were also working on CPEC projects here in Pakistan, while Pakistani Engineers were obtaining training in China to gain expertise, he added.\nThe CG advised that more Pakistani students should go to China to get higher as well as technical and high school education so that they could become more beneficial for their homeland.\nChina was increasing the quantum of scholarships for Pakistani students and conducting exchange programs between universities of both countries to provide Pakistani students more educational opportunities in China, he said adding that we would like to see Chinese students come to Pakistan to get an education here as well.\nHe said Karachi University and other Pakistani Educational Institutions had started Chinese language courses for those who want to learn the Chinese language.\nHe expressed hope that such kind of skill development programs would prove beneficial for people of both countries as more and more Pakistanis were showing interest in learning the Chinese language with the intent of working with CPEC projects, enhancing cooperation and strengthening traditional friendships. We need a young generation of both countries to learn from each other for the bright future of their countries, he stressed.\nReplying to a question regarding Pakistan’s premier news agency, Associated Press of Pakistan, the Chinese Consul General said APP was playing a very important role in vast-scale coverage of China-Pakistan friendship and cooperation and there was a permanent journalist of APP in Beijing.\nHe hoped that cooperation of the media of both countries would be beneficial for Pakistan and China and it would keep playing a key role in reporting for Pak China’s friendship, CPEC and other matters related to the development of both countries.",
  "retrievedAt": "2025-08-11T10:53:02.380Z"
}
