{
  "title": "6th Maritime Security Workshop commences at PN War College",
  "link": "https://www.app.com.pk/national/6th-maritime-security-workshop-commences-at-pn-war-college/",
  "date_published": "2023-12-06T17:08:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 06 (APP):Sixth edition of Maritime Security Workshop (MARSEW-6), a national level forum being organized by Pakistan Navy (PN), with the theme ‘Secure Seas, Prosperous Pakistan’ commenced here at Pakistan Navy War College (PNWC) on Wednesday.\nCommandant Pakistan Navy War College Rear Admiral Javed Iqbal inaugurated the workshop aimed at generating understanding on dynamics of maritime security, awareness of the blue economy and exploring the untapped maritime potential of Pakistan. The workshop also seeks to highlight challenges and opportunities available in maritime sector of Pakistan and the manner it may support country’s economy. This national level forum brings together participants from public and private sectors and military which include senators/parliamentarian, senior bureaucrats, maritime sector, business community, academia/think-tanks and media.\nIn his welcome address, the PNWC Commandant highlighted rundown of workshop activities including familiarization on maritime potential of Pakistan in the context of policy formulation. He dilated on the need to reposition ‘our strategic gaze towards sea and comprehend the transpiring developments in the wider Indian Ocean which casts bearing on Pakistan’s national security’. He alluded to wide ranging challenges and formidable role of Pakistan Navy to shield the country’s maritime interests.\nMaritime Security Workshop is designed in two phases, the first being academic session at the campus and second field tours to various maritime organizations, Pakistan Navy commands and coastal/creeks installations. The participants will also have an opportunity to visit Gwadar port and witness various on-going development projects under CPEC.\nMaritime Security Workshop is being held annually at Pakistan Navy War College since 2017. The workshop aids in cultivating integrated approach in developing the maritime sector and Blue Economy of Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:52:51.284Z"
}
