{
  "title": "Army Chief’s  vision sparks $9 million donation from Tanweer Ahmed to NUST in boost for Pakistan’s IT",
  "link": "https://www.app.com.pk/national/army-chiefs-vision-sparks-9-million-donation-from-tanweer-ahmed-to-nust-in-boost-for-pakistans-it/",
  "date_published": "2023-12-06T07:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 06 (APP): Tanweer Ahmed, a prominent businessman of American-Pakistani origin, has contributed $9 million to Islamabad’s National University of Science & Technology (NUST), motivated by the dedicated vision for Pakistan’s IT sector expressed by Army Chief General Asim Munir.\nHouston-based businessman Tanweer Ahmed has donated $9 million to NUST to help students from poor backgrounds gain access to quality education through scholarships.\nNUST has confirmed that Tanweer Ahmed has entered into a partnership with the university through an Endowment Fund for unprivileged students which will benefit nearly 200 students who would be able to get scholarships every year.\nUniversity – $9 million is one of the single largest donations by any overseas Pakistani for any Pakistani.\nExpressing enthusiasm, Tanweer Ahmed stated, “Learning about the visionary stance of Chief of Army Staff (COAS) General Syed Asim Munir, particularly his fervour for the IT sector, left me excited and thrilled. I firmly believe that the active involvement of the Army in the Special Investment Facilitation Council (SIFC) is a brilliant strategy to unleash Pakistan’s genuine IT potential.”\nTanweer Ahmed added: “I have conceived the idea of the NUST Information Technology (IT) Tower for the youth of Pakistan for which COAS General Asim Munir is leading the effort to harmonize our endeavours. The steps taken by General Asim Munir are commendable and inspiring. No army chief has done as much as Gen Munir has done in just one year for the IT sector of Pakistan and a clean national economy. He has taken excellent steps to put Pakistan’s economy on the right course.”\nThe business entrepreneur said Pakistan has essential infrastructure available along with significant public sector investment in resource development. “Pakistan has untapped digital potential of USD 59.6 billion (PKR 9.7 trillion) and FinTech potential of USD 35 billion by 2025. IT base potential is evidenced by a 47% growth in freelancing which stands at 4th in the world. Pakistan’s youth is 64% of the population under 30 years which is our biggest resource,” he added.\nTanweer Ahmed, who made his fortune in the US food industry, said that only quality education can transform Pakistan into making Sam Altman, Larry Page and Elon Musk.\nTanweer Ahmed said he will be taking more initiatives to help Pakistan’s IT and quality education sector. He said: “The infrastructure being built at NUST will enable Pakistan to host global IT companies who can establish their IT development & IT enabled services base in Pakistan with NUST IT Tower providing a jumpstart. We have to contribute to Pakistan’s prosperity, bit by bit, cent by cent. We Pakistanis can do it and we must come together to serve our nation.”\nTanweer Ahmed said deserving students would get scholarships annually from his $9 million donation through the Higher Education Commission (HEC). The system to obtain scholarships will be purely on merit and aimed strictly at those students who are unable to afford quality and expensive education.\nTanweer Ahmed is an American-Pakistani businessman, investor, entrepreneur and philanthropist who works with major companies, not-for-profit organizations and hospitals. He is the owner of the largest cricket complex in Houston, the Prairie View Cricket Complex and the owner of the Houston Hurricanes cricket franchise. The multi-millionaire businessman is the founder of a brand of food chains and also owns many food chain franchises like Pizza Hut, Taco Bell and KFC. He owns California’s largest transport company and has business interests in the energy sector and medicine industry. Tanweer Ahmed is credited for taking over 50 million dollars in aid to Pakistan during the 2022 devastating floods in Pakistan.\nOriginally from Sialkot, he started on a humble note in the US when he migrated as a student and worked in a restaurant. He was then promoted as a manager at the same restaurant. He then started his own restaurant business and has now set up multiple businesses and successful companies.\nTanweer Ahmed says that overseas Pakistanis owe it to Pakistan to serve the country of their origin and identity. “We owe to our motherland because we are where we are because of Pakistan. Our best contribution can be made through empowering our youth with modern education and knowledge. I am happy to play my part in helping Pakistani youth in achieving their goals in life.”\nNUST Rector Engineer Javed Mahmood Bukhari said in a statement that the project is going to perpetually benefit thousands of brilliant Pakistani boys and girls towards seeking world-class university education in the coming years.\nThe NUST Rector said: “Tanweer Ahmed, a well-known Pakistani American, philanthropist-businessman from Houston USA, has partnered with NUST to support the financially challenged students. This is a unique initiative being the first of its kind, in any public sector university of Pakistan. Mr Tanweer is making approximately nine million dollars’ worth of investment in the university’s science and technology park, such that 50% income of the project will go into a specially formed endowment for students with humble financial backgrounds. The initiative has the potential of remarkable societal impact in terms of altering the lives of thousands of Pakistani families.”\nEngineer Javed Mahmood Bukhari added: “NUST takes pride in this transformational partnership with Tanweer Ahmed, which reflects on a shared commitment to advancing educational equity while creating a positive economic impact. With approximately twenty thousand-student population, National University of Sciences and Technology (NUST) Islamabad is one of the most sought universities of Pakistan.”",
  "retrievedAt": "2025-08-11T10:53:09.154Z"
}
