{
  "title": "PAJCCI expresses concern over closure of Pak-Afghan border for trade at Torkhem",
  "link": "https://www.app.com.pk/national/pajcci-expresses-concern-over-closure-of-pak-afghan-border-for-trade-at-torkhem/",
  "date_published": "2023-12-06T11:38:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 06 (APP):Pak-Afghan Joint Chamber of Commerce and Industry (PAJCCI) has expressed concern over closure of Pak-Afghan border at Torkhem for trade for the last almost 24 hours.\nIn a press statement issued here on Wednesday, Coordinator PAJCCI, Zia ul Haq Sarhadi said the border crossing at Torkham has been closed for goods laden trucks at around 4:00 p.m of Tuesday.\nRegarding reason behind closure, Zia shared that the decision of closing border has been taken after erection of a signboard at zero point inscribed with wording of `Goodbye Pakistan’.\nHe also informed that pedestrian crossing is open, but trucks are not allowed to cross border from both the sides.\nCoordinator PAJCCI said it is very concerning for business community because closure of border inflicts heavy losses on business community of both the countries.\nHe said a lot of trucks are carrying perishable goods which can be rotten if delayed for a couple of days, burdening businessmen with huge losses.\nZia said already the volume of Pak-Afghan trade has shrank by around 70 percent after restriction over import of a number of items for transit trade, shifting large portion to Bandar Abbas port.\nHe said in the prevailing scenario closing of border for trade is very detrimental for promotion of commerce in the region and between Pakistan and Afghanistan.\nHe urged the concerned authorities to take up the issue with Afghan government for resolution of the problem and opening of border trade at the earliest.\nZia said queue of trucks has been started to appear on international crossing and if it became long, would take a lot of time in clearance and passage.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:53:19.749Z"
}
