{
  "title": "Masses to decide in February 8 elections who will rule Pakistan: Solangi",
  "link": "https://www.app.com.pk/national/masses-to-decide-in-february-8-elections-who-will-rule-pakistan-solangi/",
  "date_published": "2023-12-06T13:35:00.000Z",
  "source": "APP",
  "content": "Multan, Dec 06 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi said on Wednesday that general elections would be held on February 8, 2024 and full preparations were underway to accomplish the task in a fair and transparent manner.\nTakling to media persons at the inaugural ceremony of the 24-hour regional transmission of Pakistan Television Multan, he said that the people would ultimately decide the next government of the country and formally give the mandate on elections day through the ballot. He dispelled any doubt by some quarters about the holding of general elections.\nHe pointed out that Preamble of the Constitution had indicated that elected representatives would ultimately run the affairs of the country.\nAnswering a question, he said the media was free and the judiciary was independent in the country.\nSolangi said that multiple voices and slogans were the hallmark of democracy and no one should worry about the democratic norms. “Democracy does not harbour sheer silence just like a graveyard,” he remarked.\nHe said at the moment, the performance of the next parliament and government could not be assessed in advance.\n“We will hand over affairs of the country to the next government in a better state than the point when the caretaker government took over the charge,” he added.\nHe categorically stated that fundamental decision-making was not the task of caretaker government, and it was surely the responsibility of an elected government and elected parliament. However, he said the present caretaker regime would do whatever the possible within next two months for the betterment of the country.\nTo a question, he said that Ministry of Food Security was doing its job in an efficient manner, and steps were being taken for agriculture sector development under SIFC.\nHe said the Federal government would work with provinces for the development of this sector despite the fact that agriculture was the provincial subject.\nHe said that Pakistan Television has officially commenced the 24-hour regional broadcasting from Multan Center.\nThe minister said that the PTV Multan Center would broadcast eight current affairs programmes in a week. Moreover, it would also produce music, literature and children programmes from PTV Multan.\nHe said that PTV Multan broadcasts would be seen in over fifty countries of the world.\nHe said that when he was Director General Radio Pakistan, it initiated Saraiki news bulletin for the first time.\nHe opined that PTV Multan will play an important role in the promotion and projection of regional culture and heritage in addition to promoting the economic and cultural rights of the people of region.\n“We wish PTV Multan to be the voice of the real problems of the people of this region,” he added.",
  "retrievedAt": "2025-08-11T10:52:54.609Z"
}
