{
  "title": "FGEHA invites bids for horticulture and landscaping in sectors G-13, G-14",
  "link": "https://www.app.com.pk/national/fgeha-invites-bids-for-horticulture-and-landscaping-in-sectors-g-13-g-14/",
  "date_published": "2023-12-06T07:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 6 (APP):The Federal Government Employees Housing Authority (FGEHA) has invited sealed bids from reputed firms for Operation and Maintenance (O&M) of horticulture and landscaping development work in sectors G-13 and G-14/4 of the federal capital.\n“The horticulture and landscaping development work in the sectors included green belts, parks, playground and the green areas,” an official in the FGEHA told APP here.\nAbout the conditions, he said the firms should be eligible to handle the work and to   have valid registration with Pakistan Engineering Council (PEC) in relevant fields of specialization along with valid income tax registration with the Federal Board of Revenue (FBR).\nThe official said the detail of tender notice can be seen on the FGEHA website www.fgeha.gov.pk and PPRA website www.ppra.org.pk while the valid PEC registration in category C-5 and above along with relevant codes CE-09 CE-10 (v).\nHe said the Single Stage Two Envelope (SSTE) Bidding Procedure would be adopted and the envelopes containing technical information of bids must be clearly marked as ‘Technical Bid’, and the envelopes containing the bid price must be clearly marked as ‘Financial Bid’.\nThe official said the envelopes of financial bids must be accompanied with minimum three percent of bid amount as bid security in shape of deposit at call in favor of Deputy Director (DD) Maintenance FGEHA in Islamabad.\nIt should have an undertaking in technical bid that security is sealed with the envelope of financial bid issued from any scheduled local bank (Islamabad / Rawalpindi only) against firm’s account.\nHe said, “The interested firms and bidders may purchase the bidding documents upto December 18 during working hours.”\nThe official said, “The bidding documents can be obtained through draft and pay order Rs 10,000 non-refundable against written request along with attested copies of NTN Certificate, valid Professional Tax Certificate for the year 2023.”\nHe said, “The envelopes of financial bids of the bidders who fail to qualify technically shall be returned unopened.”\nThe decision of FGEHA would be final and binding on all the bidders.\nThe FGEHA would not entertain any claim whatsoever for cost incurred by the bidders for preparation and submission of the bids. The envelops of Financial Bids of only responsive and technically qualified firms would be opened in the presence of bidders or their authorized representatives at date and time to be determined and communicated later.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:53:30.415Z"
}
