{
  "title": "President for utilizing mosques to educate 28mn out-of-school children",
  "link": "https://www.app.com.pk/national/president-for-utilizing-mosques-to-educate-28mn-out-of-school-children/",
  "date_published": "2023-12-06T13:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 06 (APP): President Dr Arif Alvi on Wednesday called for making collaborative efforts with the Masajid to impart education to 28 million out-of-school children and said that Masajid and Madaris could play an important role in promoting ethical values, besides creating awareness about important social and health issues at the grassroots level.\nThe president expressed these views while chairing a follow-up meeting on Masajid and Madaris, at Aiwan-e-Sadr.\nThe meeting was attended by Minister for Religious Affairs and Inter-Faith Harmony Aneeq Ahmad, Chairman of the Council of Islamic Ideology Professor Dr Qibla Ayaz, provincial ministers and representatives of the Auqaf and Religious Affairs departments as well as the Ministry of Federal Education and Professional Training, President Secretariat Press Wing said in a press release.\nSpeaking on the occasion, the president said that imparting education to almost 28 million out-of-school children in Pakistan was a huge challenge, which would require thousands of new schools and additional resources.\nHe emphasized the need for innovative and non-traditional solutions and collective efforts by society to provide education to out-of-school children.\nThe authorities of ministry of Federal Education and Professional Training informed the meeting that it had launched an Accelerated Learning Programme to educate out-of-school children.\nThe president said that Masajid and Madaris could play an instrumental role in reforming society and overcoming social evils by promoting ethical values, brotherhood, tolerance, peace, inter-faith harmony and respect for each other’s rights through the Friday sermons.\nHe also underscored the need for raising awareness, through mosques, about mental and general health issues, population welfare, inter-faith harmony, women’s rights, and malnutrition at the community level.\nThe president further called for adopting an integrated approach by the ministries of health, education, and religious affairs at the federal and provincial levels by involving the Masajid and Madaris to educate the people about social and health issues.",
  "retrievedAt": "2025-08-11T10:52:56.182Z"
}
