{
  "title": "Last days of Ramazan: Islamabad police chalk out plans to tackle traffic",
  "link": "https://www.app.com.pk/national/last-days-of-ramazan-islamabad-police-chalk-out-plans-to-tackle-traffic/",
  "date_published": "2023-04-14T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 14 (APP): Islamabad Capital Police (Traffic) has chalked out a comprehensive plan to ensure a smooth flow of traffic during the last Ashra of Ramazan when markets and shopping centres will be thronged for Eid shopping.\nFollowing the directions of Inspector General of Police (IGP) Islamabad Akbar Nasir Khan, Chief Traffic Officer Dr. Syed Mustafa Tanveer chaired a special meeting at traffic police headquarters to look into parking and traffic-related issues outside main markets and shopping centers during Ramzan.\nThe meeting was also attended by SP (Traffic) Ch. Abid Hussain, all Zonal DSPs and it reviewed all traffic-related arrangements for the convenience of citizens, particularly during last Ashra of Ramazan.\nTraffic arrangements were finalised by Chief Traffic Officer Dr. Syed Mustafa Tanveer after consultation with heads of various zones and ITP’s sections.\nIt was decided to deploy additional police personnel around the main markets and shopping plazas in the federal capital to ensure convenience for the citizens and keep flow of traffic normal during the holy month of Ramazan.\nThe meeting decided to make the traffic congestion unit more effective and functional. It was directed to improve traffic flow and provide all possible travel facilities to the citizens.\nIt was decided that additional police personnel would be deployed around shopping malls, restaurants and business outlets.\nIt was decided to take strict action against people doing wrong parking and violating the traffic rules.\nChief Traffic Officer urged the policemen to perform duties with dedication and said that commitment to facilitate the public would have a great reward for policemen during this holy month.",
  "retrievedAt": "2025-08-11T08:18:46.619Z"
}
