{
  "title": "Samarkand moot endorses Pakistan’s stance on Afghan soil being used by militant groups",
  "link": "https://www.app.com.pk/national/samarkand-moot-endorses-pakistans-stance-on-afghan-soil-being-used-by-militant-groups/",
  "date_published": "2023-04-14T11:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 14 (APP): The Fourth Ministerial Conference of Afghanistan’s Neighboring Countries held in Samarkand on Thursday pointed out that the presence of terrorist groups in Afghanistan continued to pose threats to regional peace – a stance Pakistan has long been advocating.\n“The Parties pointed out that all terrorist groups, namely the Islamic State of Iraq and the Levant (ISIL), Al-Qaeda, the Eastern Turkistan Islamic Movement (ETIM), the Tehreek-e-Taliban Pakistan (TTP), the Balochistan Liberation Army (BLA), Jundallah, Jaish al-Adl, Jamaat Ansarullah, the Islamic Movement of Uzbekistan (IMU), and other terrorist organizations based in Afghanistan continue to pose a serious threat to regional and global security,” according to the declaration of the neighboring countries’ meeting.\nRecently, in its report, Radio Free Europe also said that after the United States pulled out its troops from Afghanistan, it left behind military equipment and weapons worth $7 billion which later boosted the military capabilities of the banned Tahreek-e-Taliban Pakistan (TTP) and Baloch separatist groups.\nAccording to the report, the US left behind weapons and equipment including firearms, communications gear, and even armored vehicles which gave the militants a “vast war chest.”\nAttended by the foreign ministers and senior officials of China, Iran, Pakistan, Russia, Tajikistan, Turkmenistan and Uzbekistan, the neighboring countries’ meeting noted that the terrorism-related security situation in Afghanistan was still severe and reaffirmed their commitment to enhance cooperation on counter-terrorism and security among neighboring countries and to develop a united front against terrorism.\nPakistan always maintained that the success of any regional or international effort to mitigate the current situation of Afghanistan will remain subject to IAG’s seriousness for ensuring that Afghan soil is not used against any country.\nSince the Taliban takeover, Pakistan also called for the establishment of an inclusive political structure, the adoption of moderate domestic and foreign policies, and safeguarding basic rights of all Afghans, including ethnic groups, women and children.\nThe Afghan authorities would also have to take visible steps to ensure that Afghanistan would never again serve as a breeding ground, safe haven or source of proliferation for terrorism.\n“Terrorism is a common enemy and peace and stability is a collective responsibility. Any action by IAG to rein in anti-Pakistan elements and not to let Afghan soil against Pakistan would strengthen brotherly relations between the two countries,” a security analyst said.\nMinister of State for Foreign Affairs Hina Rabbani Khar, who also addressed the meeting said, “We also believe that more needs to be done to eradicate the foothold of terrorist organizations from Afghanistan, without distinction and in a concerted and uniform manner. Greater cooperation and coordination with the interim Afghan Government remains critical. We look forward to working closely with the neighbouring states and the international community to this end.”\nShe said the menace of terrorism continued to blight the lives of Afghan people on a daily basis and the threat posed by terrorist organizations to the neighbouring states and the region, had accentuated.",
  "retrievedAt": "2025-08-11T08:18:46.222Z"
}
