{
  "title": "Marriyum, media action committee resolve to enact legislation for curbing fake news",
  "link": "https://www.app.com.pk/national/marriyum-media-action-committee-resolve-to-enact-legislation-for-curbing-fake-news/",
  "date_published": "2022-04-23T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb and delegation of the Media Joint Action Committee (JAC) in a meeting on Saturday decided to enact a legislation for curbing the fake news.\nThe meeting also decided to add a provision in the Pakistan Electronic Media Regulatory Authority (PEMRA) law to end fake news which had not only harmed the national interest, but also had an adverse impact on the national cohesion and unity.\nMarriyum Aurangzeb assured the JAC members that the present government, underthe leadership of Prime Minister Shehbaz Sharif, would not compromise in any way on the right of freedom of expression.\nPM Shehbaz Sharif was striving to promote the constitutional and fundamental right of freedom of expression, she added.\nLashing out at the previous regime for the media gag, she said only democratic leaders valued and believed in the right of freedom of expression. “Free and independent media provides shield to the politicians and we will strengthen it further,” she added.\nShe regretted that the last four years proved to be devastating for the people, politics and journalism. Attempts were made to deprive people of their independence by muzzling the media through closure of television channels and programmes, she added.\nThe minister said the media industry was destroyed by the previous government which also created the worst economic issues for the country.\nShe said the incumbent government was fully cognizant of the problems faced by the journalist community and intended to reverse the damage caused by the previous government to the media industry and economy.\nMarriyum accused the previous Pakistan Tehreek-e-Insaf government of hatching a conspiracy against the country by bringing the national economy to the verge of bankruptcy.\nShe strongly condemned the serious allegations hurled against some journalists by the PTI under the pretext of so-called foreign conspiracy.\nShe supported the Pakistan Federal Union of Journalists’ (PFUJ) demand and assured all-out efforts to curb the malicious campaigns against the institutions and media in the name of foreign conspiracy.\nThe minister said PTI chairman Imran Khan even declared those persons traitors who did expose his misdeeds and corruption.\nShe urged the media to play its role in countering such propaganda campaigns against the institutions and journalists.\nThe delegation congratulated Marriyum Aurangzeb on assuming the charge of Information Minister and appreciated her initiative of repeal black media laws of the previous government era including Pakistan Media Development Authority.\nThey hoped that the present government would continue to promote democratic values and norms in the country.",
  "retrievedAt": "2025-08-11T14:44:49.526Z"
}
