{
  "title": "Development of Balochistan among top priorities: PM",
  "link": "https://www.app.com.pk/national/development-of-balochistan-among-top-priorities-pm/",
  "date_published": "2022-04-23T10:35:00.000Z",
  "source": "APP",
  "content": "QUETTA, April 23 (APP): Prime Minister Muhammad Shehbaz Sharif Saturday said that the development of Balochistan province was among the top priorities of the government.\nThe prime minister said that the talented manpower of the province had been a precious asset for the country and directed to ensure monitoring of the ongoing uplift projects in the province.\nThe prime minister chaired a meeting to review the administrative situation of the province. Federal Minister for Planning and Development Ahsan Iqbal, Minister for Communication Maulana Asad Mehmood and Minister for Housing and Works Maulana Abdul Wasey, Nawabzada Shahzain Bugti, Israr Tareen, Acting Governor Jan Muhammad Jamali, Chief Minister Abdul Quddus Bizenjo, provincial ministers and relevant authorities attended the meeting.\nThe chief secretary gave a detailed briefing to the prime minister over the ongoing development projects and law and order situation.\nThe prime minister was apprised that a huge chunk of the population in the province was living below the poverty line due to lack of employment opportunities.\nThe government was undertaking different development projects and giving priority to the locals in job opportunities.\nThe participants of the meeting presented various proposals and suggested for making of an announcement over a comprehensive package for the province. The proposals also pertained to the promotion of tourism around the coastal highway, and the establishment of professional training institutions for imparting education and training to the local manpower.\nThey also welcomed the prime minister on his first visit to the province and lauded him for including the development of the province among the government’s top priorities.\nThe prime minister opined that through off-the-grid projects, the power shortage problem in the province could be resolved and assured that he would not rest till the province was brought at par with the rest of the provinces in terms of development.\nThe prime minister also sought the cooperation of the provincial cabinet as it would ensure implementation of the projects.\nHe said the people of Balochistan had rights over the natural resources, adding that he would also relaunch the stipend programme for the students of the province.\nHe said that they would have to work for the collective uplift of the whole province, especially its backward areas.",
  "retrievedAt": "2025-08-11T14:44:53.012Z"
}
