{
  "article_id": "2025-09-16_2ca5c0991fffa372266cfcb0444d73ff",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pal-hosts-book-launch-ceremony-of-renowned-author-gul-mohammad-betab/",
    "retrieved_at": "2025-09-19T16:57:08.652Z"
  },
  "metadata": {
    "title": "PAL hosts book launch ceremony of renowned author Gul Mohammad Betab",
    "author": null,
    "date_published": "2025-09-16T17:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 399,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 16 (APP):Pakistan Academy of Letters (PAL) hosted a book launch ceremony of renowned author, poet, and master of Pashto character sketches, Gul Mohammad Betab, to unveil his latest work titled \"Da Abaseen Pa Ghara\", here on Tuesday. The book, a collection of literary sketches, marks another significant milestone in Betab's distinguished literary career. The event was organized by the Pashto Literary Society Islamabad and was chaired by the Society's Chairman, Syed Mehmood Ahmed. Prominent personalities who graced the occasion as special guests included Major Amir, an expert on Pakistan-Afghanistan affairs and well-known defense analyst; acclaimed writer Dr. Faseehuddin Ashraf and Professor Dr. Gulzar Jalal Yousafzai, honorary director of PAL, Peshawar. The proceedings were conducted by Sardar Yousafzai, Secretary General of the Pashto Literary Society Islamabad. Several noted literary figures, including M. R. Shafaq, Professor Dr. Manzoor Muztar Afridi, Dr. Dawood Jan Momand, Abdul Hameed Zahid, Syed Javed Iqbal Gilani, Zakir Yousafzai, Fajji Gul, Khursheed Ibn Labid, Ehsas Khattak, and Hayat Swati, paid glowing tributes to Gul Muhammad Betab's literary contributions through poetry and prose. It is pertinent to mention that Gul Mohammad Betab, born in 1965 belongs to the Shinwari tribe. He resides in the village of Chamakni, near Peshawar. He received his early education in government schools and later obtained a Master's degree in Pashto from the University of Peshawar as a private candidate. His literary journey began during his college years. He has been associated with several prominent literary organizations. Initially known for his poetry, Betab later expanded his work to include prose writing. He also has an extensive background in journalism, having worked as a reporter, translator, and editor for various Pashto and Urdu newspapers, including Bang-e-Haram, Wahdat, Hewad, Khabaruna, Kasoti, Ghazi, as well as Urdu dailies Inqilaab and Subh. From 1990 to 2022, he served as a regular political analyst for Radio Pakistan Peshawar. He wrote approximately 600 radio dramas, including the highly acclaimed serial \"Nmar Pa Chinaruno\", which aired in 223 episodes over several years. Moreover, Betab has made significant contributions to Pashto sketch writing, with over 100 literary sketches to his name. He has also been a frequent columnist in various newspapers. To date, Gul Mohammad Betab has authored eleven books, including Qafila (Poetry), Roshan Chehray (Sketches), Da Dastar Sarray (Sketches), Tareekhi Markay (Interviews with literary figures), Bacha Khan (Drama), Khushal Khan Khattak (Drama), Da Abaseen Pa Ghara (Sketches), and others.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}