{
  "title": "Pakistan foreign policy must respond to shifting trends: Qureshi",
  "link": "https://www.app.com.pk/national/pakistan-foreign-policy-must-respond-to-shifting-trends-qureshi/",
  "date_published": "2021-12-29T08:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 29 (APP): Foreign Minister Shah Mahmood Qureshi Wednesday said that Pakistan’s foreign policy must respond adequately to the shifting trends and must navigate through this external environment to ensure the security of Pakistan’s sovereignty, territorial integrity and independence, and advancement of development agenda.\nThe foreign minister, addressing the passing out ceremony of Foreign Service Probationers, said for the first time, Pakistan had re-oriented the thrust of its diplomatic efforts towards economic benefit and prosperity of the masses.\n“Economic Diplomacy is not just a buzzword, but a blueprint to leverage our diplomatic assets in the service of our development agenda. We have put in place a “Strategic Engagement Plan” with the European Union and the “Strategic Economic Framework” with Turkey,” he remarked.\nHe said in order to explore untapped markets and opportunities, the government had launched the “Engage Africa” Initiative.\nGoing forward, our pivot towards Economic Diplomacy will gather further momentum as new avenues are opened, and existing ones gain greater traction, he added.\nCongratulating the probationers passing out of the 41st Specialized Diplomatic Course, the foreign minister said they had had a brief taste of the work related to the recent OIC CFM in Islamabad and did an admirable job.\nThe foreign minister advised the probationers to strive to serve Pakistan and its people to the best of their ability as their primary focus throughout their careers.\nQureshi said the consular services being provided by the Foreign Office here and abroad through Missions were a critical function. The Government of Pakistan is committed to giving due esteem to overseas Pakistanis and serving them wholeheartedly, he added.\nSecondly, he urged them to work hard and be eager to learn, and not restrict themselves to the files on their desk rather keep them updated even if they were assigned a non-political desk.\n“Always keep your chin up and do not lose motivation. Be innovative and think outside the box amidst resource constraints. Be mindful of the opportunities and challenges presented by the digital age. Being tech-savvy is no longer optimal,” he said.\nThe foreign minister asked the participants to be conscious of the importance of their work and responsibilities. “You will be part of the first line of Pakistan’s defence. You will have to match wits with better-resourced adversaries. You must rise to the challenge,” he remarked.\n“A new world is upon us, through which we have to navigate with caution and foresight with multiple centers of power and constant realignment, diplomatic work has multiplied and become more difficult. The unipolar world has now become a rear-view vista. Multilateral mechanisms that were set up for mediation and conflict resolution are losing their efficacy,” he said.\nThe foreign minister said the COVID-19 pandemic has laid bare the shortcomings of the public health systems. It has upended the global economic systems and has also served as a catalyst for long-term geopolitical shifts.\nHe said the traditional means of conducting international relations and foreign policy had been overtaken by the fast-paced global perception industry Soft power has already replaced conventional warfare.\n“The world has entered into the era of battles of narratives and information/disinformation warfare. We see a huge shift in the role of media, its impact on all spheres of life and modern technology is being used to influence opinions and push agendas,” he told the gathering.",
  "retrievedAt": "2025-08-11T21:46:39.372Z"
}
