{
  "title": "Pakistan simplifies process of investment in SEZs for Chinese companies, foreign investors: Asad",
  "link": "https://www.app.com.pk/national/pakistan-simplifies-process-of-investment-in-sezs-for-chinese-companies-foreign-investors-asad/",
  "date_published": "2021-12-29T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 29 (APP):Federal Minister for Planning, Development, and Special Initiatives, Asad Umar on Wednesday said that Pakistan has simplified the process of investment in the Special Economic Zones (SEZs), not only for the Chinese companies but also for other international investors.\nAddressing the Award Ceremony of the 27 outstanding Pakistani staff of the CPEC Projects here at Chinese Embassy, he said two days ago the prime minister has approved the simplified approval process for industries and companies which are willing to invest and operate in SEZs.\nIn addition to this, both federal and provincial government have developed a mechanism to facilitate the companies which are interested to invest in SEZs.\nHe said that despite of Covid-19, the year of 2021 has seen remarkable progress in CPEC.\nHe said, “We have seen the completion of projects and most importantly broadening of the CPEC that is through the industrial cooperation framework work and now its showing results such as construction work at AIlama Iqbal, Rashakai SEZs as well as expansion of Special Economic Zone in Gwadar.\nThe north zone which the prime minister inaugurated few months back is 35 times larger than the south zone and that shows the confidence of Pakistan’s commitment towards progress and future of CPEC.\nHe said in the second phase of CPEC both countries are focusing on agriculture and science and technology sector.\nAsad Umar said in the 10th JCC meeting Pakistan and China signed to work in domain of information technology. China has made tremendous progress in information technology domain and Pakistan is now starting to see significant progress in this area such as during the last year the export of Pakistan’s information technology services outside of Pakistan is grew by 47% and this year, hoping38 percent.\nTherefore, there are tremendous opportunities for Pakistani and Chinese companies in information technology.\nThe minister said that CPEC is broadening in all fields and many projects started in first phase has been completed or about to complete. This is testimony of not just the quality of relationship between Pakistan and China but evidence of our strong bond and commitment for completion of CPEC projects, he added.\nHe said that the BRI is truly historic as it was conceived for the development and propensity for all the humanity.\nThe minister further said that President XI Jinping’s vision to enhance prosperity through connectedness among the countries and shared prosperity is a remarkable model for the world.\nAsad Umar also appreciated China for supporting Pakistan during the Covid-19 pandemic.\nAnswering to a question, he said that the opponents of CPEC are not only opposing CPEC through words but also sponsoring terrorism. However, Pakistan is taking effective security measures and no CPEC project has been spoiled by the terrorist activities. Moreover, the Prime Minister is personally reviewing security of Chinese projects and workers.\nThe minister also congratulated the Pakistani staff working for CPEC projects and said that Chinese companies would have seen the quality of the Pakistani professionals is as good as the world because they are hardworking and willing to learn.\nCPEC continues to be a flagship of the overall development strategy of Pakistan as well as a cornerstone of economic relationship between China and Pakistan, he added.\nSpeaking on the occasion, Khalid Mansoor, Special Assistant to the Prime Minister on CPEC Affairs, said this year was 70th years of vibrant growing diplomatic relations between China and Pakistan.\nPreviously it was limited to bilateral relationship but now it is long-term economic partnership through shared future through the CPEC.\nHe said despite disruption of normal life all over the world because of the pandemic, the CPEC projects have not faced any constraint due to firm mutual commitment of both countries.\nYing Xiong, Director General, National Development and Reform Commission (NDRC) of China said that all-weather strategic cooperative partners, China and Pakistan have continuously strengthened strategic communication and safeguarded common interests.\nChina’s development and growth is in the interest of Pakistan, and it is also China’s sincere hope that Pakistan can enjoy stable development for its prosperity.\nAddressing the ceremony, Chinese Ambassador to Pakistan, Nong Rong said that this year marks the 70th anniversary of the establishment of diplomatic relations between China and Pakistan. The CPEC project despite the challenge of pandemic, has made great achievement.\nDuring this year, CPEC has always been the focus of our two countries. President Xi Jinping called Prime Minister Imran Khan telephonically on October 26, this year and both expressed their will to jointly build the CPEC, to promote cooperation in agriculture, digital economy and people’s livelihood, and bring more benefits to the local people.\nHe said both the leaders reiterated their resolve to comprehensively build the health, industrial, trade, digital, and green corridors, so as to build the CPEC into a demonstration project for high-quality development of the Belt and Road Initiative.\nHe said that the 10th JCC meeting was successfully held, setting the path for the future cooperation, and added one more Joint Working Group on Information Technology Industry, opening up new areas of great potential for cooperation.\nThe Ambassador said that the Prime Minister Imran Khan attaches great importance to the CPEC.\nThe Pakistan government established the China-Pakistan Relations Steering Committee to coordinate and resolve CPEC issues;\nintroduced the special visa policy for CPEC to facilitate investment; set up a Foreign National Security Cell to strengthen security measures. These practical measures have injected more confidence in the development of the CPEC.\nHe said with joint efforts of both countries, the Matiari-Lahore HVDC Transmission Line has brought Pakistan into a new era of AC-DC power grid, the Karot Hydro power Project started water storage and the Gwadar Technical and Vocational Institute was completed.",
  "retrievedAt": "2025-08-11T21:46:36.492Z"
}
