{
  "title": "Overseas Pakistanis valuable asset for country: Sadiq Sanjrani",
  "link": "https://www.app.com.pk/national/overseas-pakistanis-valuable-asset-for-country-sadiq-sanjrani/",
  "date_published": "2021-12-29T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 29 (APP): Chairman Senate Muhammad Sadiq Sanjrani on Wednesday said that overseas Pakistanis were a valuable asset for the country’s economy as they contributed millions in the shape of remittances besides projecting the soft image of the country abroad.\nThe Chairman Senate expressed these views in a meeting with office bearers and representatives of overseas Pakistanis from different countries, said a news release.\nHe said that government was making all out efforts to encourage Pakistani diaspora in different countries towards creation of an enabling environment in the  field of trade and investment.\nHe said that investment friendly policies are being framed and more robust approach has been adopted to facilitate investment.\nHe called for diversifying the multifaceted ties with global trade partners for the social and economic development of the country.\n“Overseas Pakistanis are a vital source of bridging the gap between imports-exports”, said the Senate Chairman while emphasizing the role of OPs in national development.\nHe further called upon the diaspora to come forward and work with unison as it is a collective responsibility to contribute and work for the national prosperity and growth.\nHe said that Pakistan offers conducive environment for investment and there is huge scope for investment in tourism, fishery, meat processing and other sectors. Pakistani community must come forward and play role in encouraging foreign investors to invest in Pakistan.\nRepresentatives of the delegation from different countries which included, Intekhab Ali Khan from South Africa, Malik Yaar Awan, Japan, Jawad Rehman Slehria, Russia, Muhammad Ozair , KSA and other countries briefed the chairman Senate about the role being played by Pakistani diaspora in projecting the soft image of the country.\nThey informed that foreign investors are taking keen interest for investment in various sectors. The delegation called for deepening trade and economic links through enhancing trade volume.\nThey proposed establishment of display centers to showcase Pakistani products with detailed information on investment options in different countries.\nMembers of the delegation also emphasized direct flights between Russia and other destinations to facilitate the people besides establishing bank channels for investment purposes.\nChairman Senate said that business community has to interact for exploring avenues of investment and enter into joint ventures.\nHe said that Parliament would play its role by formulating policies and introducing legislation, however, private sector has to play a more active role in augmenting trade and economic activities at global level.\nThe Chairman Senate, meanwhile, emphasized that we need to introduce out of box solutions to address the hardships being faced by Pakistanis living abroad and the government has introduced a number of initiatives for inclusive growth.\nHe called for putting industrial sector on the track of growth through more export oriented policies and injects dynamism for boosting national development.\nChairman Senate also mentioned opportunities for investment in Gwadar.He said that Gwadar is an emerging port city and vast opportunities exist for multidimensional investment.\nThe delegation thanked the Chairman Senate for candid views.Senators Gurdeep Singh and Faisal Saleem Rahman were also present during in the meeting.",
  "retrievedAt": "2025-08-11T21:46:32.711Z"
}
