{
  "title": "Minister calls for premarital testing to combat thalassemia in Pakistan",
  "link": "https://www.app.com.pk/national/minister-calls-for-premarital-testing-to-combat-thalassemia-in-pakistan/",
  "date_published": "2024-12-30T12:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 30 (APP):Housing and Works Minister Mian Riaz Hussain Pirzada on Monday emphasized the need for legislation, awareness, mandatory premarital lab tests, and modern research to combat thalassemia in Pakistan.\nDuring his visit to the Thalassemia Centre of Sundas Foundation in F-9 Park, Islamabad, the minister praised the dedication of the senior management in serving humanity.\nHe inaugurated the Activity Room established for thalassemic children and the electric cart donated by Allied Bank to facilitate the transportation of children from the outer gate.\nThe minister, while addressing the ceremony as chief guest, deeply praised the selfless work of the foundation that being a pioneer non-profit organization of its nature, is providing free-of-cost blood transfusion services to thousands of children countrywide.\nHe also remembered the humanitarian work of the founding chairman Muneer Ahmed Qureshi alias Munnu Bhai who demonstrated profound involvement in the treatment of patients suffering from Thalassemia.\nOn this occasion, the minister distributed gifts among the children.\nDirector Sundas Foundation Islamabad Air Vice Marshal HI(M) Aftab Hussain described the functions and operations of the foundation, its current services and its challenges.\nHe said that the foundation has been working for the last 26 years and nowadays it has expanded its services to nine major cities in Pakistan with twelve established centers.\nThis organization is transfusing 30,000 blood bags every year and supplying 250-300 units of healthy and screened blood and blood products daily, he added.\nHe said the center in Islamabad since its inception six years ago, has benefited 52,243 patients with any sort of blood disease or disorder.\nThe Centre provides free-of-cost blood transfusion services, medicines, testing, and investigation facilities.l, he added.\nHe further informed that to provide a holistic environment an activity room for religious, academic, and extracurricular activities for the thalassemic children has been established. This is the first thalassemic center in the world to have this facility.\nHe counted escalating inflation and varying blood donation trends in society as the major challenges of the organization.\nIn the end, senior actor and Director Khalid Abbas Dar gave a vote of thanks and expressed gratitude to the organizers, donors and the chief guest.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:09:54.237Z"
}
