{
  "title": "PM Shehbaz Sharif hails PML-N’s legacy on Founding Day",
  "link": "https://www.app.com.pk/national/pm-shehbaz-sharif-hails-pml-ns-legacy-on-founding-day/",
  "date_published": "2024-12-30T13:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 30 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday extended his heartfelt congratulations to the Pakistan Muslim League-Nawaz (PML-N) on the occasion of the party’s founding day.\nReflecting on the party’s historical significance, the prime minister emphasised the pivotal role of the All India Muslim League and its leaders, including Quaid-e-Azam Muhammad Ali Jinnah, in the creation of Pakistan, a Prime Minister’s Office news release said\nIn his message, the prime minister stated, “The formation of the Muslim League 118 years ago reignited the desire for an independent homeland for Muslims. Through persistent struggle, the Muslims of the subcontinent were granted the gift of a separate and free nation, Pakistan.”\nHe further added, “In line with the vision of Pakistan’s founding fathers, it is our collective responsibility to work together for the country’s progress and prosperity.”\nPrime Minister Sharif also highlighted the contributions of Pakistan Muslim League (N) under the leadership of former Prime Minister Nawaz Sharif, noting that the party has been dedicated to the country’s development for over three decades.\n“The history stands testimony to the fact that the PML-N and its leader, Nawaz Sharif, have always prioritized the welfare of the people and upheld principled politics,” said the Prime Minister. “To safeguard Pakistan, the PML-N made sacrifices, placing the nation’s economy and security ahead of its political interests.”\nThe prime minister expressed his gratitude towards party workers and political leaders, who, alongside the party, boldly stood against military rulers and raised the banner of truth.\nHe also acknowledged the challenges faced, including imprisonment, but reaffirmed the PML-N’s commitment to unity and national interest over divisive politics.\nDespite efforts to sideline Nawaz Sharif from politics, the Prime Minister praised the former leader’s political wisdom and unwavering commitment to the nation. “The sacrifices made by Nawaz Sharif and the PML-N have strengthened the foundations of Pakistan,” he said.\nDuring the PML-N’s tenure, significant strides were made in the development of industries, agriculture, and the economy.\nThe prime minister also lauded the party’s success in improving diplomatic relations with friendly nations, which contributed to the welfare of the common man.\n“Today, under the leadership of Nawaz Sharif, PML-N continues to represent the aspirations of the people, working tirelessly for the nation’s progress,” said Prime Minister Sharif.\nWith the continued support of the people, the prime minister assured that the government would remain steadfast in its efforts to build a prosperous Pakistan for future generations.",
  "retrievedAt": "2025-08-10T14:09:10.460Z"
}
