{
  "title": "Pakistan’s Bookme partners with flyadeal to launch affordable flights to Saudi Arabia",
  "link": "https://www.app.com.pk/national/pakistans-bookme-partners-with-flyadeal-to-launch-affordable-flights-to-saudi-arabia/",
  "date_published": "2024-12-30T14:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 30 (APP): Pakistan’s leading digital travel platform, Bookme, has become the first and only Pakistani platform to integrate flyadeal, Saudi Arabia’s rapidly growing low-cost airline, into its system.\nThe partnership comes as flyadeal prepares to launch flights from Pakistan to Riyadh and Jeddah, marking a significant milestone for travelers between the two countries.\nAligned with Bookme’s collaboration with the Saudi Tourism Authority, this integration promises affordable flight options and a seamless booking experience for flights to and within Saudi Arabia. Passengers can now use local and international payment channels, including transactions in Pakistani Rupees, to avoid foreign transaction fees.\nStarting February 2, 2025, travelers will be able to book flyadeal’s Pakistan-Saudi Arabia route as well as domestic flights within the Kingdom. This move is set to benefit both Pakistani travelers and expatriates in Saudi Arabia, offering enhanced convenience and cost-effective options. Known for its value-for-money fares, flyadeal’s entry into Pakistan is expected to transform the travel landscape.\nFaizan Aslam, Chief Executive Officer (CEO) of Bookme, expressed his enthusiasm, stating, “By integrating flyadeal, we continue our mission to simplify travel for Pakistanis heading to Saudi Arabia. This is also part of our commitment to Saudi Vision 2030, as we expand our partnerships across the Kingdom. flyadeal’s entry into Pakistan with new flights starting soon is great news for travelers, and we look forward to being close partners with flyadeal in their success story out of Pakistan.”\nSteven Greenway, CEO of flyadeal, added, “flyadeal is delighted to welcome Bookme as a key travel partner in Pakistan, a market with huge demand for travel to and within Saudi Arabia. Our new Karachi flights serving Jeddah and Riyadh are a stepping stone for further planned expansion in Pakistan.”\nBookme’s extensive reach and integration with over 20 banks, fintech platforms, and super apps make it a trusted travel partner. The platform offers streamlined bookings for flights, buses, and events, serving over 14 million users. With this partnership, tickets to Saudi Arabia and domestic flights within the Kingdom can be booked through Bookme’s website, app, and partner platforms.\nOperating from its bases in Riyadh, Jeddah, and Dammam, flyadeal serves nearly 30 domestic and international destinations across the Kingdom, Europe, the Middle East, and North Africa. Pakistan marks the airline’s first market in South Asia, underscoring its ambitious international expansion plans for 2025.\nFlyadeal’s domestic network spans 16 destinations, including Abha, Al Bahah, Al Hofuf, Bisha, Gizan, Hail, Madinah, Neom, Qassim, Tabuk, and Taif. New routes to Najran and Yanbu will be added starting January 1, 2025.\nFounded on September 23, 2017, flyadeal began operations with its inaugural flight from Jeddah to Riyadh, coinciding with Saudi Arabia’s National Day. As a pioneer in digital-first distribution, the airline has served over 30 million passengers to date.\nFor more information, visit www.bookme.pk or explore flyadeal’s services through Bookme’s digital platforms.",
  "retrievedAt": "2025-08-10T14:09:09.349Z"
}
