{
  "title": "Virus takes 74 lives, infects 3,232 more people",
  "link": "https://www.app.com.pk/national/virus-takes-74-lives-infects-3232-more-people/",
  "date_published": "2021-05-17T08:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): The national tally of total active COVID-19 cases on Monday recorded 68,223 with 3,232 new cases during the last 24 hours.\nAccording to the latest update issued by the National Command and Operation Centre (NCOC), 3,754 virus patients recovered and 74 died. Sixty-three (63) were under treatment in the hospital, 36 of them were on ventilators and 11 out of the hospital in their respective quarantines or homes. Most of the deaths were occurred in Punjab followed by Khyber Pakhtunkhwa.\nThere were 4,443 Covid infected patients under treatment in critical care among 67 admitted during past 24 hours in various Covid dedicated healthcare facilities.\nThe national Covid positivity ratio during past 24 hours was recorded 7.82 percent.\nThe maximum ventilators were occupied in four major areas including Lahore 57 percent, Multan 73 percent, Bahawalpur 48 percent and Peshawar 38 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) were also occupied in four major areas of Gujranwala 66 percent, Peshawar 44 percent, Bahawalpur 44 percent and Multan 60 percent.\nAround 584 ventilators were occupied elsewhere in the country while no Covid affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 36,725 tests were conducted across the country on Sunday, including 14,792 in Sindh, 15,543 in Punjab, 3,724 in Khyber Pakhtunkhwa (KP), 1,372 in Islamabad Capital Territory (ICT), 604 in Balochistan, 319 in GB, and 371 in AJK.\nAround 792,522 people were recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 880,362 cases were detected that also included the perished, recovered and under treatment Covid patients so far, including AJK 18,258, Balochistan 23,866, GB 5,423, ICT 79,221, KP 127,038, Punjab 327,362 and Sindh 299,194.\nAbout 19,617 deaths were recorded in the country since the eruption of the contagion.\nAround 4,801 were perished in Sindh among six of them died in hospital and one out of hospital on Sunday. 9,411 in Punjab had died with 44 deaths occurred in past 24 hours. 34 of them in the hospital and 10 out of hospital. 3,786 in KP where 20 of them died in hospital on Sunday, 731 in ICT, 267 in Balochistan among three of them died in the hospital on Sunday, 107 in GB and 514 in AJK succumbed to the deadly virus.\nA total of 12,480,767 corona tests were conducted so far, while 639 hospitals were equipped with Covid facilities. Some 4,886 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:44:09.083Z"
}
