{
  "title": "NA strongly condemns Israeli aggression against Palestinians, calls upon UNSC to take necessary action",
  "link": "https://www.app.com.pk/national/na-strongly-condemns-israeli-aggression-against-palestinians-calls-upon-unsc-to-take-necessary-action/",
  "date_published": "2021-05-17T16:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): The National Assembly on Monday, while unanimously passing a resolution to strongly condemn the apartheid Israeli regime naked aggression against innocent Palestinian people, called upon the UN Security Council (UNSC) to take necessary action under Chapter-VII of the UN Charter to bring an end the ongoing crimes against humanity being perpetrated against the Palestinians.\nThe resolution was moved by Foreign Affairs Minister Shah Mehmood Qureshi on behalf of all parties in the House.\nThe House also called upon the UN to ensure Israel’s compliance with resolutions of UN Security Council, United National General Assembly and the Human Rights Council, reaffirming the right to self-determination of the Palestinian people.\nThe house called upon the UN to ensure immediately halt Israeli aggression which has violated the sanctity of Al Aqsa Mosque, a holy site for more than 1.5 billion Muslims, and respect their freedom to worship and allow unfettered access to Muslims to repair any damage done to the religious holy site by Israel’s criminal actions.\nIt also called upon the UN Secretary General to establish an independent Inquiry Tribunal to investigate the crime of genocide by the Apartheid Israeli regime against the Palestinian people.\nIt also called upon to ensure Israel’s compliance with the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War and its Additional Protocol 1.\n“The House expresses deep concern over the increasing violence and brutality perpetrated against the Palestinian people by the apartheid Israeli regime; strongly condemns the systematic and brutal disenfranchisement, exclusion and ethnic cleansing of the Palestinian people; strongly denounces the attacks by the apartheid Israeli regime on worshipers in al Aqsa mosque during Ramazan and attempts to stop the Azaan.\nThe National Assembly also called upon the international community to take immediate cognizance of and action against the ethnic cleansing, genocide and forced displacement of the Palestinian people; and to establish international protection mechanism for the Palestinian people.\n“The House demands that the international community ensure accountability for all past and present grave human rights violations and crimes against humanity being perpetrated against the Palestinians through fair, impartial and independent accountability and trails,” the resolution said.\nIt also called upon the OIC to take immediate decisive steps for the protection and safety of the Palestinian people, and to break the illegal Israeli blockade of Gaza in order to provide humanitarian assistance.\nThe House reaffirmed Pakistan’s unwavering support for the realization of the right to self-determination and other fundamental rights of the Palestinian people as well as for the two-State solution, based on the pre-1967 borders, and a free, secure, viable, independent and contiguous State of Palestine, with Al-Quds Al Sharif as its capital.\nThe House also reaffirmed and expressed Pakistan’s unwavering political and diplomatic and moral support to the brave and resilient Palestinian people.\nIt also conveyed prayers and condolences to bereaved Palestinian families and prayed for the recovery of injured.\n“The National Assembly denounces and rejects the continuing practice of expanding settlements through forced evictions by the apartheid regime, which are in violation of Article 49 of the Fourth Geneva Convention; support the Palestinian people in their struggle for right of self-determination.” the resolution said.\nIt also denounced the practice of dehumanizing and delegitimizing the Palestinian struggle for self-determination through use of terminology, by the government and media, attributing the responsibility for the war crimes to victims of those war crimes.\nThe House condemned the deliberate destruction of buildings housing local and international media outlets in Sheikh Jarrah and Jerusalem, carried out with the intent to erase evidence of the genocide being committed against the Palestinian people.\n“The House recalls relevant resolutions introduced by Pakistan in the United Nations regarding Occupied Palestinian Territories (OPT), especially the seminal UNSC Resolution 271, that was adopted after the incident of burning of Al-Aqsa mosque in 1969”.",
  "retrievedAt": "2025-08-11T20:44:04.517Z"
}
