{
  "title": "International cooperation on digital technology essential to achieve 2030 agenda: Amin ul Haque",
  "link": "https://www.app.com.pk/national/international-cooperation-on-digital-technology-essential-to-achieve-2030-agenda-amin-ul-haque/",
  "date_published": "2021-05-17T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Minister for Information Technology and Telecommunication Syed Amin ul Haque on Monday said that international cooperation on digital technology is essential to help defeat COVID-19 and achieve the 2030 agenda for Sustainable Development (SD).\nIn his statement on World Telecommunication and Information Society Day, the minister said “Today the World is different because of the pandemic, evolving technology, the times have changed. We are in an information society where information is the most significant aspect of society.”\nHe said that digital and Information communication technology is a beacon of hope, progress, enabling billions of people around the world to connect and interact.\nHe said the main objective of World Telecommunication and Information Society Day is to raise global awareness of social changes brought about by the internet and new technologies he said added, ”It also aims to help reduce the digital divide”.\nSyed Amin ul Haque said, the day reflects on the ICT advances for transition to smart and sustainable development. It focuses on specific ICT-enabled solutions and emerging trends for fostering economic, environmental, and social sustainability, innovation, partnership and acceleration Digital transformation in the challenging times.\nHe said that during the COVID-19 pandemic, connectivity became the foundation of all sustainable development pillars and the use of Telecommunication and Internet came as a utility.\nUnder current ongoing pandemic connectivity with loved ones, with schools and colleges, with workplaces, with healthcare professionals and essential supplies– are more important than ever.\nAmin ul Haque said that the International Telecommunication Union continues to work with the information and communication technology community and UN agencies to help manage and end this crisis, and recover better.\nPointing on current scenario, the Minister said that Telecommunication technologies, from real time broadband connectivity and big data to cloud computing and artificial intelligence, are powerful tools and means to tackle the world’s most pressing challenges, including the pandemic diagnostic, monitoring and standard operating procedures.\n“We need to collaborate and multiply our efforts to connect everyone to the global digital economy, and that for those connected, more must be done to ensure that connected life is safe and trustworthy with inclusion of technology” he said.\nOn this Day and for this new decade, let’s harness information and communication technology to accelerate social, economic and environmentally sustainable growth and inclusive development for everyone, everywhere during the challenging times of pandemic.\nIT Minister while highlighting the efforts said Pakistan , specifically with the focus of the SDG’s and with the focus on un-served and underserved areas has contributed approx Rs. 30 billion to ensure connectivity and broadband services with the aim of Internet for all as utility in collaboration of Universal Service fund that will serve millions of underserved citizens in the remote and rural areas of Pakistan in ongoing program of Ministry of IT & Telecommunication under vision of Prime Minister citizen centric vision of Digital Pakistan.\nThe minister said, “Pakistan has reached the mile stone of more than 100 Million + Internet subscriber and 181 Million + connected subscribers with the status given to telecom Sector as Industry in 2021.\nBringing societies and economies together by the ways to bridging the digital divide is the main agenda of the government to accelerate digital transformation in challenging times.”",
  "retrievedAt": "2025-08-11T20:44:08.532Z"
}
