{
  "title": "Shehryar Afridi urges prosperous world to raise unified voice for Palestine issue",
  "link": "https://www.app.com.pk/national/shehryar-afridi-urges-prosperous-world-to-raise-unified-voice-for-palestine-issue/",
  "date_published": "2021-05-17T14:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Chairman Parliamentary Committee on Kashmir Shehryar Khan Afridi Monday called on the Ambassador of Palestine Ahmed Amin Rabei and expressed full support of the Pakistani nation to the Palestinian nation in these difficult times.\nHe said that Pakistan attached special connection with Palestine and all political parties were one over Palestine.\n“We have been closely observing developments taking place in Palestine. OIC was established immediately for protection of Palestine. The so called champions of human rights are nowhere to be seen over the killings of Palestinians,” he said.\n“Except for a few voices supporting the Palestinians, the prosperous world is standing with the illegal Israeli administration,” he said and added that western world’s public was speaking up to free Palestine while their governments were supporting Israel.\nHe urged them to shun the double standards and speak for Palestine who were rightful owners of their lands occupied by the Israeli government.\nHe said that pragmetic approach needs to be adopted by the Muslim Ummah and Israeli atrocities need to be stopped immediately against the people of Palestine.\n“Muslim Ummah needs to stand united and convey a message to the world that no more Israeli terrorism against Palestinians would be tolerated,” he said.\nAfridi said Prime Minister Imran Khan was standing tall to support the Palestinians.\n“Demographic terrorism is being implemented by the illegal occupational regime against Palestinian people.\nIt’s unfortunate that Muslims today stand divided on sectarian and regional lines. Prime Minister Imran Khan has taken steps to bridge misunderstandings between the gulf states.\nPakistan stands right behind you and it would keep raising its voice for the cause of Palestine,” he said.\nAmbassador Ahmed Amin Rabie expressed gratitude to Prime Minister Imran Khan and entire Pakistani nation for supporting Palestinians. The Ambassador said the Palestinians were very pleased with Prime Minister Imran Khan over his diplomatic overtures to support Palestine. We have strong resolve to defend our land and our people, he added.\n“PM Imran Khan speaks from his heart on Palestine issue. Palestine and Pakistan have deep-rooted ties since decades,” he said.\nHe said that around 300,000 Palestinians were attending prayers in Al Aqsa mosque during Ramadan which made the occupational regime concerned.\nHe said the occupational regime of Israel was involved in replacing Palestinians from Sheikh Jarrah area.\n“200 Israeli jets have destroyed around 1000 houses and 200 Palestinians martyred including women and children.\nThey were targeting civilian people and using sophisticated weapons. Western world says occupational regime of Israel has right to defence but they don’t accept the right of defence of Palestinian who are rightful owners of Palestine,” he said.",
  "retrievedAt": "2025-08-11T20:44:08.382Z"
}
