{
  "title": "President directs bank to refund Rs 423,556 to deceased account holder’s heirs",
  "link": "https://www.app.com.pk/national/president-directs-bank-to-refund-rs-423556-to-deceased-account-holders-heirs-2/",
  "date_published": "2022-03-01T12:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 1 (APP): President Dr Arif Alvi on Tuesday upheld the decision of Banking Mohtasib of Pakistan (BMP) ordering the Bank of Punjab to refund an amount of Rs 423,556 to the legal heirs of a deceased borrower, which the bank had unilaterally and unfairly encashed.\nThe president observed that the bank had unnecessarily complicated a routine matter, though its own SOPs empowered it to give financial relief in such cases.\nLate Mian Allah Wasaya had availed a loan of Rs 3 million in 2015 from the Bank of Punjab and deposited Regular Income Certificates (RICs) issued by the Central Directorate of National Savings, valuing Rs 3.5 million, as Liquid Security with the Bank.\nAs Allah Wasaya passed away on January 27, 2017, the Bank on its own encashed the RICs then worth Rs 4.155 million and charged a mark-up of Rs 480,489 till October 22, 2018, while the accumulated mark-up at the time of his death was only Rs 57,294.\nThe widow of Allah Wasaya (the complainant) requested the bank to charge mark-up till the period her husband was alive and waive off the mark-up thereafter.\nThe bank, however, did not accede to her request after which she approached the Banking Mohtasib for redressal of her grievance.\nAfter hearing the case and perusing the available record, the Banking Mohtasib noted that at the time of death the principal outstanding amount was Rs 2.889 million and the accumulated mark-up was Rs 57,294 only.\nIn the given circumstances, it was the fiduciary responsibility of the bank to guide the legal heirs for adjustment of outstanding liability at this level against encashment of RICs, the BMP observed.\nIt further noted that instead of exercising its statutory obligation to set off the loan against liquid security, the bank continued to linger on recovery and unnecessarily piled-up mark-up on the principal outstanding amount which was unfair as per the State Bank’s guidelines.\nThe Mohtasib termed the claim of the bank as “absurd and unprofessional” that the matter pertained to the year 2018 and its books have been closed, therefore, it was not in a position to provide financial relief.\nIt added that no rule, regulations, law, or accountant standard was referred which barred the bank to revisit the old/closed cases as such types of transactions were a routine matter.\nThe Ombudsman held that unilaterally charging and recovering mark-up without justification beyond Rs 57,294 was an injustice to the deceased borrower’s family.\nIt ordered that the Bank had committed maladministration and malpractice by not exercising its rights without any valid reason even though holding fully cashable liquid security under the loan agreement documents and piling up mark-up liability unnecessarily.\nThe bank, subsequently, filed a representation against this decision of the BMP with the President.\nThe president upheld Mohtasib’s decision and held that bank had not provided any justification to upset the original order of the BMP.\n“The representation is rejected as it is devoid of any merit and the bank had failed to discharge the burden and statutory liability cast upon it under the law,” the president noted in his decision.",
  "retrievedAt": "2025-08-11T14:26:45.613Z"
}
