{
  "title": "UNEP terms PM Imran Khan’s TBTTP vision as ‘Global Leader’ initiative: Amin",
  "link": "https://www.app.com.pk/national/unep-terms-pm-imran-khans-tbttp-vision-as-global-leader-initiative-amin/",
  "date_published": "2022-03-01T12:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 1 (APP):Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam Tuesday said the United Nations Environment Programme (UNEP) once again termed Prime Minister Imran Khan’s Ten Billion Tree Tsunami Plantation (TBTTP) vision as “Global Leader” initiative.\nIn a tweet, the SAPM shared the video clip of his virtual address at the UNEP’s Ministerial dialogue on Ecosystem Restoration.\n“#Pakistan @ImranKhanPTI vision of #10BillionTreeTsunami is once again termed by @UNEP as a global #Leader initiative at the Ministerial dialogue on #EcosystemRestoration at #UNEA yesterday,” Amin said.The SAPM added that the country had gone totally into restoring and investing in nature. “It has been an interesting journey that paid billions of rupees worth dividends all along.”\nThe SAPM also extended his gratitude to the UNEP for allowing Pakistan to host World Environment Day during such an important year. “And it was a very important year that kicked off the world ecosystem restoration decade that we are all living in,” he underlined.\nHe elaborated that Pakistan’s journey started three years back in 2014 when it started investing in planting trees in one of the province of the country.\n“The province in the north of Pakistan (Khyber Pakhtunkhwa) that set a target of one billion trees achieved it in 2018. After assuming power at the federal level we started TBTTP,” the SAPM said.\nHe informed that the TBTTP initiative was going all over the country and it helped restore over one million hectares of degraded land all across Pakistan so far.\nHe highlighted that this journey of ecosystem restoration taught Pakistan one important message that when someone invests in nature; it always pays back more in response.",
  "retrievedAt": "2025-08-11T14:26:42.290Z"
}
