{
  "title": "Middle-calss to reap benefits of PM’s Industrial Package: Fawad",
  "link": "https://www.app.com.pk/national/middle-calss-to-reap-benefits-of-pms-industrial-package-fawad/",
  "date_published": "2022-03-01T12:13:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 01 (APP):Federal Minister Information and Broadcasting Chuadhry Fawad Hussain has said the middle-class will be main beneficiary of the Prime Minister’s Industrial Package as it would increase jobs and expand industry.\nIn a media briefing prior to the announcement of the Prime Minister’s Industrial Package outside the Governor’s House here on Tuesday, he said the government would also give a monthly stipend of Rs 30,000 to graduate students besides offering loans to the youth to start their businesses.\nFawad Chaudhry said the social reforms programme started by the Pakistan Tehreek e Insaaf (PTI) government was unparalleled in the country’s history despite the fact that the government was faced with grave financial challenges when Prime Minister Imran Khan took reins of the country.\nHe said the government had repaired the impaired economy brick by brick today, adding that the governmentwas thankful to China and the United Arab Emirates (UAE) for the gracious timely financial aid which saved the country from bankruptcy.\nThe information minister said it was through the able leadership of Prime Minister Imran Khan that Pakistan was rated among the top three countries of the world which economies recovered in the post novel-coronavirus (Covid-19) scenario. He credited foreign remittances of 29 billion dollars, increase in textile exports, booming construction industry and five mega crops in agriculture last year for saving the country’s challenged economy.\nHe said the Covid-19 pandemic was followed by the Afghan crisis, but the country still withstood theill effects of coronavirus through visionary policies, adding that the foreign remittances had reached anew high of 31 billion dollars this year.\nThe information minister said all the above factors had enabled the government to cut down oil and electricity prices, adding that it had been made possible when the prices were soaring due to the Russia-Ukraine war.Fawad Chaudhry said:” Prime Minister Imran Khan understands pain of the poor strata of society and will always stand by the poor and the middle-class,” adding that Pakistan will make progress by leaps and bounds.\nTo a query, he said the PTI would hold meetings with the PML-Q and MQM leadership, adding that Prime Minister Imran Khan was close contact with Chaudhry Shujaat Hussia, Chaudhry Parvez Elahi and Federal Minister for Water Resources Chaudhry Moonis Elahi.\nTo another query regarding PTI MNAs contact with the opposition, the minister said PTI MNAs Riaz Fatiana, Khurram Shahzad and Ghulam Bibi Bharwana had issued their statements on the claims of the opposition, adding that they will also move a privilege motion in the National Assembly (NA) on the issue.\n“If the government is stable, nobody will desert,” he added. However, he said let three months pass and one is not sure whether opposition leader in the Punjab Assembly Hamza Shehbaz will apply for PML-N ticket or not.Regarding 1000 billion rupees package prior to the budget, Fawad said: “We are a political party and cannot leave people in the lurch,” adding that the government had made adjustments in the existing budget without new expenditures to provide relief to the masses. He said that the finance division would elaborate on the relief.\nOn taking down PPP pana-flexes from city roads, the information minister said the pana-flexes were illegally installed by the PPP, adding that the PPP leadership should pay to the municipal corporations and theflexes will not be removed.\nTo a question on the prices of the daily commodities, Fawad Chaudhry said the government had subsidized the flour, ghee and pulse prices. He said the people owed credit to the PTI government for not raising prices of the basic commodities despite the fact wheat prices had soared internationally.Fawad Chaudhry said the government had introduced relief for the poor Ehsaas Progrmme previously but it was working to provide respite to the middle-class now.",
  "retrievedAt": "2025-08-11T14:26:41.390Z"
}
