{
  "title": "Govt to introduce technology to improve judicial system: Farogh",
  "link": "https://www.app.com.pk/national/govt-to-introduce-technology-to-improve-judicial-system-farogh/",
  "date_published": "2022-03-01T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 01 (APP):the government wanted to further improve the judicial system through the use of modern technology.\nHe expressed these views while chairing a meeting regarding implementation of law reforms in Khyber Pakhtunkhwa. The meeting was attended by Khyber Pakhtunkhwa Law Minister Fazal Shakoor Khan, Foreign Ministry officials, Khyber Pakhtunkhwa Woman Ombudsperson Rakhshanda Naz, Advocate General Islamabad and Parliamentary Secretary for Law and Justice Barrister Maleeka Bukhari.\nThe meeting discussed the Civil Procedure Code, issuance of inheritance certificate through NADRA, women’s inheritance property rights law and anti-rape law.\nDr Farogh Naseem said if any better amendment was proposed by the provinces, it would be considered. The government wanted similarities in laws being implemented in Islamabad and in the provinces, and wanted to use technology to improve the judicial system, he added.\nHe said it would be ensured to publish all court decisions on the websites.\nThe law minister asked the participants to come up with proposals to bring the use of technology in the judicial system.\nHshe said there was a need to take further steps to reduce the workload of courts. NADRA’s inheritance certificate issuance system was out of the courts jurisdiction and that was why it was working so well and people are getting inheritance certificate and letter of administration in 15 days where it used to take years.\nIn response to a query from the Law Minister, the Foreign Ministry representative said 13 more NADRA counters had been set up abroad and work continued to establish more.\nThe KP representative briefed the meeting about the issuance of Inheritance Certificate and Letter of Administration through NADRA and presented the statistics.\nThe KP woman ombudsperson informed the law minister about the difficulties encountered during the work.\nThe minister was briefed on the implementation of anti-rape law in Khyber Pakhtunkhwa and statistics were also presented.",
  "retrievedAt": "2025-08-11T14:26:34.540Z"
}
