{
  "title": "Foolproof security arrangements finalized for Pak-Australia cricket matches: Sh Rashid",
  "link": "https://www.app.com.pk/national/foolproof-security-arrangements-finalized-for-pak-australia-cricket-matches-sh-rashid/",
  "date_published": "2022-03-01T12:49:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 01 (APP):Federal Interior Minister, Sheikh Rashid Ahmed here on Tuesday said that Pakistan has finalized foolproof security arrangements for Pakistan-Australia cricket matches.\nSheikh Rashid after reviewing all the arrangements including security here at Rawalpindi Cricket Stadium while talking to media persons said that Pak Army, Rawalpindi and Islamabad police and rangers were deployed to make the security foolproof for the Australian cricket team tour.\n“The cricket lovers are very happy on the Australian cricket team’s tour to Pakistan. We welcome the Australian team. It’s a great honor for Pakistani nation and excellent arrangements were made by the Pakistan Cricket Board (PCB).\nFoolproof security arrangements have also been made by Pak Army, Rangers, Rawalpindi and Islamabad police. Best possible arrangements were finalized by the administration to facilitate the teams and the cricket lovers as well,” he added.\n“We are giving the Australian cricket team, the protocol of head of state. Some people especially the Indians are not happy with this tour. They did same what they had done during New Zealand tour to Pakistan. But, this time, they failed in their nefarious designs and could not achieve the target,” the minister said.\n“The entire Pakistani nation welcomes the Australian team to Pakistan. Pakistanis are cricket lovers. The Australian players are our guests and we would host them up to April 6,” he added.\nHe felicitated PCB for organizing the tour. Appreciating the arrangements including security, Sheikh Rashid said that Pak-Army, Rangers, Rawalpindi district police, Islamabad Police, and administration of the twin-cities had finalized excellent arrangements for the tour.\nHe said, India once again tried to achieve its nefarious designs as it did not want to see international cricket to restore in Pakistan and the Pakistani people who are big fans of cricket, could enjoy international cricket matches in Pakistan.\nSheikh Rashid said that Pakistani nation loves cricket and the international cricket matches are watched in all areas of the country even far-flung areas.\nHe said, Australian cricket team would enjoy the hospitality of Pakistanis. Federal and Punjab governments were utilizing all available resources to provide them foolproof security cover, he added.\nSheikh Rashid informed that Prime Minister Imran Khan had ordered the authorities concerned to construct a modern cricket stadium with five star hotel in Islamabad.\n“I have also directed the Capital Development Authority to start work to construct state of the art stadium and a five start hotel on priority basis and the project could be materialized as soon as possible,” he added.\n“We are grateful to Australia for sending its team despite all the conspiracies. They are here in Pakistan and the cricket matches would be played as per the schedule announced,” Sheikh Rashid said.To a question he said, other teams including England would also come to Pakistan.\nHe further informed that foolproof security arrangements were also made for the tour of New Zealand cricket team but, they became the victim of conspiracy of India.\nDifferent cities of the country would enjoy the cricket matches of Australian cricket team, he added.",
  "retrievedAt": "2025-08-11T14:26:42.694Z"
}
