{
  "title": "Farrukh for dissociation of Akbar S Babar from PTI foreign funding case",
  "link": "https://www.app.com.pk/national/farrukh-for-dissociation-of-akbar-s-babar-from-pti-foreign-funding-case/",
  "date_published": "2022-03-01T09:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 1 (APP):Minister of State for Information and Broadcasting Farrukh Habib on Tuesday asked the Election Commission of Pakistan (ECP) to dissociate the petitioner Akbar S. Babar from PTI foreign funding case for his failure to produce any authentic or verifiable document before the scrutiny committee.\nIt has been clearly stated in the report of ECP scrutiny committee that the petitioner had failed to produce any authentic evidence, there there was no justification for him to proceed the case further, said the minister while addressing a press conference here outside the ECP.\nHe said Pakistan Tehreek-e-Insaf (PTI) was ready to extend every possible cooperation to the ECP scrutiny committee as it demonstrated during past by providing record of some 40,000 donors of the party.\nHe said PTI was the only party that had introduced concept of political fund raising by mobilizing overseas Pakistanis, sending some $30 billion remittances annually.\nHe said the PTI had raised party funds in accordance with the laws. “We have the record of each rupee collected and also provided details of forty thousand donors to the Election Commission of Pakistan,” he added.\nFarrukh said Pakistan Muslim League Nawaz (PML-N) and JUI-F chief Maulana Fazl-ur-Rehman had no record of party funding and it was seemed that they received funds from abroad through illegal means.He asked Pakistan Peoples’ Party (PPP) chairperson Bilawal Bhutto Zardari and PML-N vice-president Maryam Nawaz to give details of his party accounts that had kept secret from ECP scrutiny committee.\nThe cases of all three parties including PTI, PML-N and PPP were of ‘same nature’, he said, adding the scrutiny committees were formed in light of the apex court’s decision which stated that all the parties’ bank accounts would be scrutinized in accordance with the law and without any discrimination.\nThe state minister asked the ECP to make functional the scrutiny committee so that the progress could also be seen in the cases of PML (N) and the PPP. He said the two parties should tell as to why they hid their accounts.\nHe was of the view that the ECP should hear the cases pertaining to all the three parties’ accounts on equal grounds so that the court orders could be implemented in letter and spirit.\nFarrukh said the mega package announced by the Prime Minister would provide major relief to the people. The resources had been diverted to the welfare of people.\nHe said the prices of petroleum products in the international market had gone up due to Russia-Ukraine conflict.\nHowever, the decision of reducing the prices of petrol and diesel by ten rupees per liter and that of the electricity by five rupees per unit has been taken keeping in view the interest of the public.",
  "retrievedAt": "2025-08-11T14:26:49.479Z"
}
