{
  "title": "SC issues notices to ECP, AGP in Faisal Vawda’s disqualification case",
  "link": "https://www.app.com.pk/national/sc-issues-notices-to-ecp-agp-in-faisal-vawdas-disqualification-case/",
  "date_published": "2022-03-01T14:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 01 (APP):The Supreme Court on Tuesday issued notices to the Election Commission of Pakistan (ECP) and the Attorney General for Pakistan in an appeal filed by PTI leader Faisal Vawda against his disqualification for life.\nA three-member SC bench comprising Chief Justice Umar Ata Bandial, Justice Sajjad Ali Shah and Justice Muhammad Ali Mazhar heard the case filed by former Federal Minister Faisal Vawda against his disqualification on the basis of dual nationality under Article 63(1)(c) but not banned for life under 62(1)(f) of the Constitution.\nThe ECP had disqualified Vawda on account of holding dual nationality at the time of the 2018 general elections and de-notified him as a member of the Senate.\nDuring the course of proceedings, Advocate Waseem Sajjad counsel for Faisal Vawda requested the court to stop the election being held on March 9 on the seat left vacant after disqualification of his client.\nChief Justice Umar Ata Bandial asked the petitioner to wait for the verdict in the case. The result of the election on the seat left vacant by Vawda would be subject to the outcome of the case, he added.\nHe said the court would consider the petition submitted by Vawda as it raised queries over ECP’s powers in the case.\nHe said that the important aspect of this case was the jurisdiction of the ECP and the bench would consider whether the ECP had the authority to disqualify elected lawmakers for life.\nThe Chief Justice asked the counsel if his client had submitted a false certificate to the ECP ahead of the 2018 polls. The counsel responded affirmative and said “Yes, sir”.\nHe said that the bench would look at the conduct of Faisal Vawda while considering the use of powers by the ECP to disqualify the former lawmaker.\nThe bench also observed that the former lawmaker had also used delaying tactics when his case was in the high court.\nWaseem Sajjad while discussing the disqualification for life said that even death sentences handed by courts were confirmed by the high court. Upon this, Justice Bandial responded that this was not a case against the death sentence.\nChief Justice Bandial said that the court would not go into that. He said that the court in this case was concerned whether the ECP had powers to disqualify lawmakers for life.\nJustice Muhammad Ali Mazhar asked why no intra-court appeal was filed against the decision of the high court? He said if the court did not consider the jurisdiction then there was matter of false affidavit.\nWaseem Sajjad said that Sadia Abbasi was disqualified in the dual citizenship case temporarily. Upon this, the Chief Justice said that he had been a part of that bench. Faisal Vawda’s lawyer, referring to various court decisions, said that the Election Commission was not a court of law.\nThe Election Commission had the power to hear election petition cases and check the eligibility of a candidate before the election, he added.\nWaseem Sajjad said that Faisal Vawda was born in the United States and he did not apply citizenship himself.\nLater, hearing of the case was adjourned till date in office.",
  "retrievedAt": "2025-08-11T14:26:28.555Z"
}
