{
  "title": "Breathe Pakistan: Experts bring attention to air pollution’s transnational threat, urge greater regional cooperation to tackle issue - Pakistan - DAWN.COM",
  "author": null,
  "content": "Experts at a conference on tackling the issue of air pollution brought attention to its transnational threat and urged greater regional cooperation to tackle it.\n\nThe moot was held at the Expo Centre in Lahore on Saturday as part of DawnMedia’s ‘Breathe Pakistan’ initiative.\n\nThe conference was held with the aim of shedding light on actionable solutions, fostering high-level dialogue, and driving collective action for cleaner air in Pakistan. Sessions covered a broad range of themes, including governance and policy frameworks, financing clean air, smog and industrial responsibility, judicial activism, public health impacts, nationwide air quality standards, and regional cooperation on transboundary pollution.\n\nA press release issued said: “Concluding the event, participants agreed that Pakistan’s fight for clean air must now move from promise to policy and from data to delivery. DawnMedia reaffirmed its commitment to continue convening dialogue through Breathe Pakistan, keeping the spotlight on collective action for cleaner skies and healthier futures.”\n\nIt said the day-long event brought together ministers, superior court judges, and international experts to discuss solutions for air pollution with Punjab, the province hardest hit by smog, remaining central to the conversation, “even in the chief minister’s absence”.\n\nFind out more about the agenda for today’s conference here.\n\n6:47pm — Session on the health crisis amid smog\n\nWorld Health Organisation Representative in Pakistan Dr Dapeng Luo said breathing clean air was a basic human right.\n\nHe said 256,000 people died in Pakistan every year due to air pollution, adding that they were not just numbers but ‘‘brothers, fathers, sisters, mothers, sons’’ who all had unique stories and dreams.\n\nLuo said the impact of air pollution was very real.\n\n‘‘What are we going to do about this? The good news is that it is in our hand.’’\n\nHe stressed that air pollution was a threat without borders and had severe impact on the most vulnerable with access to less resources.\n\n‘‘Air pollution does not distinguish between social classes. No one will be safe until everyone is safe. Pakistan faces severe air pollution.’’\n\nDr. Saima Saeed, director of the Lung Health Programme at Indus Hospital and Health Network, said 60 per cent of patients referred to the hospital for respiratory symptoms had asthma. ’‘There’s a huge burden of respiratory disease due to air pollution,“ she said, adding that various other health-related issues were also caused.\n\nUnicef Representative in Pakistan Pernille Ironside said air pollution was a “direct preventable killer” with children uniquely vulnerable to it. She said the issue had become the number two killer of children worldwide under the age of five.\n\n6:20pm — Pakistan Air Quality Initiative founder Abid Omar\n\nAbid Omar said there was a need to go beyond just the data and talk about what the policies should be.\n\n‘‘Even today in Pakistan and the Punjab government, the policymaking is weak because … the evidence-based policymaking] in more advanced cases is not mature enough.’’\n\n6:09pm — Urban Unit CEO Dr Omar Masud\n\nQuestioned whether research was driving interest in policy and if that could be replicated at the national level, Dr Omar Masud said local action was being increasingly driven by monitoring data at the city level.\n\n‘‘We are about to come to a crossroads when it comes to sensor level monitoring. We need cooperation and integration and less competition. We will see more data streams in this season and in coming years that will be telling us of air quality. Now it is up to the government and non-government sector as to how they integrate this data.’’\n\nHe said the biggest challenge was in communicating the data to the public.\n\n“Without behavioral change, you can’t tackle the problem of air quality and behavioral change can only come when necessary information is presented in a very cogent way.’’\n\n6:04pm — Dr Naveed Arshad, director of LUMS Energy Institute\n\nQuestioned about how institutions were informing policy about major sectors, Dr Naveed Arshad said the LUMS Energy Institute looked at the whole energy ecosystem and mapped it to the challenges being faced in the country before going to the government for policy advocacy.\n\nHe said the goal’s institute was to help achieve implementation of policies and solutions.\n\n6pm — Session on developing National Air Quality Management Framework\n\nClimate and sustainability expert Dawar Butt said there were initiative from the federal and provincial governments that showed they understood the importance of pollution.\n\nHe said air pollution really started to become a problem again for Pakistan in 2012 when the country’s supply of natural gas ran out.\n\n5:53pm — Shazia Rafi, president and convenor of AirQualityAsia\n\nAirQualityAsia president Shazia Rafia said in a video message that air pollution was a silent killer and an accelerator of climate change.\n\n‘‘All air pollution is transboundary as the air knows no borders, it is visible from space.’’\n\n5:31pm — Nazifa Butt, director of climate action and sustainability at WWF-Pakistan\n\nWWF-Pakistan director Nazifa Butt said Karachi, Dhaka, Lahore and New Delhi were all cities that were facing challenges of extreme weather conditions and climate impact.\n\nShe said populations were growing and that would need more energy and thus more burning of fossil fuels. ‘‘We are all sitting in a geographic zone that is very risky in terms of development, economic growth and climatic impacts.’’\n\nButt said among the main drivers of air pollution in South Asia were rapid urbanisation and industrial growth, vehicular emissions and crop residue burning.\n\nShe also pointed to a lack of political will, poor governance and lack of infrastructure to tackle air pollution.\n\n“We are asking for a plan for the government to step forward and build their own capacity first.’’\n\nButt called for legally binding climate treaties and setting of targets to reduce and control emissions.\n\n5:15pm — Aban Marker Kabraji, senior regional adviser for climate and environment to the regional director of UNEP Asia-Pacific\n\nUN official Aban Marker Kabraji said the messaging that Dawn had brought forth in technical understanding of the issue, along with the convening power and influencing, was “remarkable’’ along with consistency and commitment to tackle the issue of air pollution again and again.\n\nShe said 99 per cent of the population breathes polluted air and air pollution caused over 100,000 premature deaths annually with Lahore, Faisalabad, Peshawar and Karachi among the top 10 most polluted cities in the world.\n\nKabraji said the Indus-Ganges Plain was one of the most polluted parts of the world in air quality with Pakistan, India and Bangladesh, all 3 countries, impacted.\n\nShe proposed UN facilitation promoting regional air quality dialogue on shared airshed management, joint residue management and farmers incentives in Punjab and Haryan and lastly, data sharing and harmonisation.\n\nKabraji said the way forward lay in scaling up low-cost air quality monitoring, integrating air quality targets in NDC revision (2025), mobilising climate and private finance, regional cooperation for emission alerts and citizen engagement through youth-led air monitoring apps.\n\n5:05pm — Sri Lanka MP Harshana Rajakaruna suggests regional strategy to tackle pollution\n\nSri Lanka MP Harshana Rajakaruna thanked the conference organisers for holding the event to address a problem that “crosses borders as easily as the wind”.\n\nHe said Sri Lankans also had concerns about pollution. He added the country had witnessed spikes in poor air quality linked to poor local sources and longrange transport from neighbouring regions.\n\nRajakaruna mentioned the problems that his own country faced in encountering and tackling pollution.\n\n‘‘The human consequences of inaction are grave. Poor air quality shortens life expectancy, increases hospital admissions for respiratory and cardiovascular disease, undermines children’s lung development and school attendance and reduces worker productivity.’’\n\nHe said the above issues were not confined to environmental briefs but emergencies related to public health, economics and social justice.\n\nThe lawmaker outlined a three-pronged approach for the region to tackle the issue: create a regional monitoring and data sharing network with transparent real-time data accessible to governments, scientists and the public; coordinated policy and enforceemnt across borders and thirdly, mobilising finance, technology and capacity through international partnerships.\n\nHe also underlined two matters of political importance. ’’Diplomacy matters. Environmental diplomacy is not a secondary concern, it is central to regional stability and shared prosperity,“ he said, adding that regional associations and global forums should be used to build an architecture of cooperation on air and marine quality.\n\n‘‘Justice matters. Small islands and coastal communities should not be the unwilling recipients of other states’ pollution. Where possible, we should negotiate responsibility sharing mechanisms, including technical support, funding for mitigation and remediation assistance.’’\n\nHe commended Pakistan for taking decisive steps to place clear air on the national agenda and convening forums such as Breathe Pakistan to foster regional dialogue.\n\n‘‘The leadership shown here in policy, public engagement and industrial innovation set an example and opens space for cooperation and action across South Asia. Sri Lanka extends its solidarity with Pakistan’s effort and stands ready to work in partnership.’’\n\nHe also proposed the formation of a regional task force with scientists, officials and civil society representatives to short a draft memorandum of understanding that outlines shared monitoring protocols, emergency notification procedures and a plan for joint capacity building.\n\n’’Pollution that begins across borders can end lives here at home. The air we breathe and the seas that sustain our livelihoods are common goods. Protecting them demands compassion, solidarity and practical cooperation.\n\n‘‘Let us seize this moment not for rhetoric but real measurable action for the health of our children, for the resillience of our economies and for dignity of our coastal communities. Sri Lanka stands with Pakistan and with all other nations of the Indian Ocean and South Asia in this work. Let us go forward.’’\n\n4:49pm — Dr Jian Gao\n\nProfessor Dr Jian Gao, deputy director of the Institute of Atmospheric Research at the Chinese Research Academy of Environmental Sciences, said China had focused on pollution control for half a century.\n\nHe walked through various measures that China took to control air pollution.\n\n4:41pm — Session 6 begins on tackling trans-boundary air pollution\n\nUN’s resident and humanitarian coordinator for Pakistan, Mohamed Yahya, began the session with saying that air pollution and climate change did not respect borders and there were no customs or immigration checks when pollutants were crossing from one border to the next.\n\n‘‘If there is anything that really encourages cooperation and specifically international cooperation, it is the issue of climate change … and air pollution.’’\n\nRecalling the smog last year in Lahore, he said the issue affected New Delhi as well. ‘‘The genius of Breathe Pakistan initiative was to realise early on … that Pakistan cannot deal with this issue alone and if there is anything that can encourage cooperation and coming together, it is the issue of air pollution and climate change.’’\n\n3:48pm — Lunch break\n\n3:46pm — Justice Hassan stresses need for climate finance\n\nLHC’s Justice Hassan recalled Pakistan becoming a member of the Loss and Damage Fund in COP28 in November 2023, saying the country got “lucky”.\n\nHe underscored the need to work on climate financing. “We can’t depend on loans from the GFF (Global Financing Facility) and other countries,” he said.\n\n“We need funding, and we need climate finance. We have a framework now; the finance minister is working on it. We will have a meeting very soon on it.”\n\n3:42 — Justice Shah says judges also need to understand environmental science better\n\nJustice Syed Mansoor Ali Shah said that judges needed to understand climate and environmental science better. He also noted that climate courts needed to be introduced in the future.\n\n“So there are a number of things we need to be doing in the judiciary as far is building capacity to deal with environmental issues once we get done with some of our constitutional issues,” he said.\n\n“More judges ought to get involved and mainstreamed into the process of dealing with the environment,” he said. However, he stated that the judiciary was not the problem in this case.\n\n“The disconnect is the implementation part, where the executive does not follow what we say,” he said.\n\nHe also said that climate issues could not be addressed without financing, adding: “One of the major issues the government faces is finance. They don’t have the finances allocated for this purpose.”\n\nThe judge also expressed disappointment at the missing presence of the prime minister and chief minister at the event.\n\n3:38pm — Justice Mansoor Ali Shah criticises a ‘dead’ civil society\n\nJustice Syed Mansoor Ali Shah also took aim at a “dead civil society”.\n\n“Where are the public interest litigation? You want to sit at home and crib about air pollution? When have you come out to file petitions? When have you gone out protesting?\n\n“Civil societies that are dead, this happens to them. So live with the air pollution you have because you haven’t done much. You should be more active … fight for your right! If you don’t want to fight for your right, nobody is gonna bother.”\n\n3:27pm — Justice Ayesha calls on youth to focus on playing their role\n\nJustice Ayesha called on the youth to focus on what their role in combatting air pollution is and if they wanted their rights, “whether it be writing, speaking out, protesting or bringing litigation to courts”.\n\nShe said, “We lack in the expertise as well. We don’t see the academic churning out information, reports and articles on it. We also dont see the youth paying attention to this.”\n\nShe also noted that the issue required a “lot of investment”. “It requires will and commitment.”\n\n3:22pm — We fail to recognise that air pollution is actually a public health emergency: Justice Ayesha\n\nJustice Ayesha Malik observed, “Today, we fail to recognise the fact that air pollution is actually a public health emergency.”\n\nShe underscored, “The impact it is having for the generations to come, we won’t be able to resolve the issue, we won’t be able to save the generations.”\n\nSpeaking on governance, the judge noted that government policies and laws existed, but “where is the monitoring under that policy, where is the reporting, where is the data on the basis of which the decisions were made?”\n\nJustice Ayesha emphasised the need for reporting and monitoring: “You need the science. Without the science, you cannot solve the issue.”\n\n3:13pm — Air pollution can be tackled through cooperative federalism rather than devolution to provinces: Justice Shah\n\nJustice Syed Mansoor Ali Shah said that the first problem in addressing air pollution was the devolution of the issue to the provinces.\n\n“The subject of pollution has now been devolved to the provinces. There is no national domain to oversee the whole problem at the national level. So I think there is a huge disconnect at a federal and provincial level.”\n\nJustice Shah said that in his opinion, this could be resolved through cooperative federalism. “The federal government will have to play a role in laying down policy or standards … devolution of pollution is a problematic area which needs to be addressed,” he said.\n\nThe judge further went on to say, “I don’t think the government is interested in changing the life of an ordinary person. It is all elitist to satisfy or protect an industry or a pressure group, but an ordinary person is not in the picture.”\n\nJustice Shah said he was not terming development “bad”, but there had to be intelligent ways of doing it. He said that Pakistan’s Environment Protection Agency (EPA) was a department that was subservient to the government. “How could it oppose the government’s will and wishes?”\n\n3:09pm — ‘My duty to give you’ the right under Article 9A: LHC’s Justice Hassan\n\nJustice Jawad Hassan of the Lahore High Court said that under Article 9A of the Constitution, every citizen had the right to a clean and healthy environment.\n\n“It is my duty to give you that right,” he said.\n\n3:03pm — ‘Many gaps’ in the regulatory set-up: Justice Ayesha\n\nSC’s Justice Ayesha Malik noted that the right to clean air had been recognised as a basic right decades ago, adding that there were “many gaps” in the regulatory set-up.\n\nRecalling her time at the LHC, she said there were a lot of cases related to brick kilns and poultry farms. Justice Ayesha detailed that a lot of emissions and odours come from the waste at poultry farms.\n\nShe also highlighted that the owners of these places also approached the courts, saying that the regulator was being unfair to them.\n\n“When we were looking at cases in the Supreme Court — whether it’s related to floods, surface mining, deforestation — the issues are the same. It’s about the way the regulator is handling the matter. […] You don’t feel that urgency, that level of commitment where they realise that the air people are breathing is toxic.”\n\n3:00pm — ‘Governance missing’: Justice Shah notes huge gap between jurispudence, reality\n\nJustice Syed Mansoor Ali Shah observed that the judiciary had been “very active” when it came to climate cases and that “governance” was missing.\n\n“The courts have been very robustly directing and pushing the government to address the issue of air pollution and climate change because to the courts, people matter.”\n\nHe went on to say that the judiciary had worked in order to protect people and their fundamental rights. “That’s the toolkit for us, that’s the prime consideration the judge has — to protect the fundamental rights of a person.”\n\nHowever, he regretted that there was a huge gap between the jurisprudence and the reality on the ground.\n\n“What’s going on? What’s missing? It’s governance, governance, governance.”\n\n2:56pm — Spotlight on climate cases withers away once they’re decided: Justice Shah\n\nJustice Mansoor Ali Shah said that a case from 1997 was decided nine years later, which led to several interesting moves, including getting rid of the two-stroke rickshaws and moving on to CNG buses.\n\n“For the first time, vehicular air pollution was considered and recognised as a source of air pollution,” he said.\n\n“The point I am trying to make is that once the case is going on, the spotlight is on the government and they respond … but it withers away once the case is decided,” the judge added.\n\n2:50pm — Justice Shah details Pakistan’s judicial history in climate cases\n\nSC Senior Puisne Judge Justice Syed Mansoor Ali Shah highlighted that SC’s “iconic judge”, Justice Saleem Akhtar, took up a case about vehicular pollution in Karachi in 1993 and “got it all started”.\n\nDirectives were given about car inspections and maintenance. While “nothing much came about” in that, a major landmark decision of 1994 “set the tone for environmental pollution in Pakistan”, which was in the Shehla Zia case about a grid station being set up in Islamabad.\n\n“That judgment for the first time says that right to life would mean the right to a healthier, better life,” Justice Shah pointed out.\n\nThe judge further recalled that in 1997, he was part of a group that went to the Lahore High Court with a plea seeking to address vehicular air pollution. “At that time, the judiciary didn’t understand. They thought it was a fancy litigation. We weren’t given that respect … the petition was kept pending for nine years.”\n\n2:42pm — Panel on ‘Judicial Activism and Litigation for Clean Air in Pakistan’ begins\n\nThe session on judicial activism for clean air has begun, where Supreme Court’s Senior Puisne Judge Justice Syed Mansoor Ali Shah and Justice Ayesha Malik will give their insights.\n\nLahore High Court’s Jawad Hassan will also shed light on the judicial aspect of tackling climate change.\n\nModerating the session, Senior advocate Faisal Siddiqi said the three judges had “all the [four] Cs that every great judge must have — competence, creativity, courage and conscience”.\n\n2:30pm — Farmers definitely not villains in this: Pakistan Agriculture Coalition CEO\n\nAsked about a viable solution to the burning of crop residuals, Pakistan Agriculture Coalition CEO Kazim M. Saeed said: “Farmers are definitely not the villains in this, maybe they’re the anti-hero of the story”.\n\nHe stressed the need for the interests of individuals and the public interest to be aligned. Saeed noted that stubble burning only occurred during winters and pointed out that the problem did not exist 40-45 years ago, when only wheat was harvested on a large scale and rice crops were cut by hand.\n\n2:19pm — We have to make electric vehicles more friendly for consumers: automaker general manager\n\nAli Zaidi, the general manager of Marketing and Brands at Nexgen Autos’ Omoda & Jaecoo, has stressed the need to make electric vehicles more “friendly” for consumers.\n\nHe pointed out that 33pc is the share of emissions from vehicles in Karachi and 35pc in Lahore. “This is a huge chunk so the question is not whether we will be able to make EVs viable in the next five years, it is more of a statement that we have to.”\n\nHe stressed the need for the step to be sustainable: “If it is not sustainable, it can not run on itself, so it has to make business sense.”\n\nWonder what your carbon footprint is? Calculate here.\n\n2:15pm — PM’s aide Romina Khurshid Alam speaks\n\nRomina Khurshid Alam, coordinator to the Prime Minister on Climate Change, is now speaking at the session.\n\n“I strongly believe smog is no longer just a seasonal inconvenience. We hear that it comes and goes but it is a national emergency, which is unfolding before our eyes.\n\n“It chokes our city and disrupts our economy and silently steals our people’s health. This crisis demands that we move beyond temporary fixes.”\n\n2:08pm — ‘PSO looking at how to reduce transport bills’\n\nAsif Baigmohamed noted that the PSO had signed up with top international technology providers for lithium-ion batteries, solid-state batteries and super capacitors.\n\nHe further said the company was looking at how to reduce the transport bill for consumers by 40pc in the next 10 years, which will also lead to a “40pc reduction” in our oil imports.\n\n2:02pm — PSO board chairman sheds light on his company’s steps\n\nPakistan State Oil (PSO) Board of Management Chairman Asif Baigmohamed is now presenting a keynote address.\n\n“We’re waiting for somebody else to do something. My humble submission is let’s try to see what we can do,” he said. He contended that if Beijing was able to combat air pollution, Pakistan could do so too.\n\nHe highlighted that PSO has been reviewing how it can make things more sustainable and profitable, giving the example of reducing 760 processes of the company to 430 and digitising them.\n\n“That’s the keyword. It has to be profitable.”\n\n1:55pm — EBM CEO proposes national clear air forum\n\nZeelaf Munir said that the next step would be to embed collaboration into Pakistan’s environmental framework to move from isolated efforts to a shared strategy.\n\n“That is why what I am proposing is the creation of a national clean air forum. A permanent platform where government, industries, academia and NGOs collaborate, share data and co-design practical solutions. A space where research meets regulation.”\n\n1:50pm — EBM CEO says clean air an economic necessity\n\nEnglish Biscuit Manufacturers Managing Director & CEO Zeelaf Munir addressed the day’s fourth session, ‘The Smog Equation’. In her keynote speech, she said: “Each year the grey sky returns, it reminds us that leadership today must be measured not only by growth or profit but by the quality of air people breathe.”\n\nShe said that clean air “was a responsibility we all shared”. She noted that air pollution costs Pakistan’s nearly 6pc of its GDP every year, more than what is spent on health and education combined.\n\n“It weakens our workforce, drives us healthcare costs and deters investment. Clean air is not just a social cause, it is an economic necessity.”\n\n1:37pm: BoP chairman stresses federal, provincial integration\n\nThe Bank of Punjab chairman said that integration at a federal and provincial level was something that was the need of the hour.\n\n“The projects rests in the provinces while the entire effort of fundraising is being done at a federal level. And that lack of disconnect is causing a lack of delivery as far as a project’s financing is concerned.”\n\n1:34pm: BoP chairman highlights challenges to Pakistan’s climate financing\n\nThe Bank of Punjab chairman said that Pakistan’s climate financing gap was around $348 billion between now and 2030. He said that the impact of flooding in the country could be another $100bn between now and 2030.\n\n“The dilemma is that we have enough capital available internationally. The challenge is that we do not have enough projects to tap into that funding,” he said.\n\n“The world is not short of capital. The world is short in the confidence they have in Pakistan’s readiness.”\n\n1:29pm: BoP chairman says 6pc of Pakistan’s GDP affected every year by climate crisis\n\nZafar Masud, the Bank of Punjab chairman, gave his closing remarks for the session, calling it a “transformational agenda”. He said that around six per cent of Pakistan’s gross domestic product (GDP) was being affected due to the climate crisis every year.\n\nHe said that “dirty air” meant “lower repayments, weaker exports and high non-performing loans”.\n\nNoting the recent floods in the country, he said that that was in addition to what he had said before. “So altogether it’s a substantial impact.”\n\nHe said that the conference was not just about awareness but also about making concrete the ideas of structured finance and the way forward.\n\n1:24pm — Rafay Alam details how air pollution revolution began in European cities\n\nAsked about other countries around the world facing climate change issues, Climate expert Rafay Alam acknowledged they were “rich, white countries” but stressed how they started on addressing those problems.\n\nAlam noted that Stockholm had immense automobile-related pollution, the United Kingdom had major pollution after World War 2, and as well as in California in the 1970s.\n\n“There have been laws made in each of these countries to address air pollution,” he said, stressing that even those laws were a result of some action.\n\n1:20pm — Onus on consumers to create ‘demand’ for financing green projects: BoP official\n\nBank of Punjab’s (BoP) Arslan Muhammad Iqbal said it was on the consumer that a “demand” was created to finance green projects.\n\nHe asserted that the “funding is there”, mentioning the Green Sukuk bonds.\n\nHe noted that BoP was the only Pakistani bank to get a 50m euro lending facility from a France-based multilateral, which can be used to fund green energy.\n\n01:05pm: Climate expert Rafay Alam says improvements in environment not overnight solutions\n\nRafay Alam, an environmental lawyer, said that while people liked to have a clean environment, they had cosmetic superficial ambitions in this regard.\n\n“Look at it this way: you have to use the black and white of printed policy paper to manifest the change in the quality of the air outside. That requires an immense and very accurate amount of data. You can’t do it without that.”\n\nHe went on to say that most improvements in the environment were not overnight solutions and took time.\n\n12:50pm — Session on ‘Financing Clean Air for Pakistan’ begins\n\nWorld Bank Senior Environment Specialist Shafick Hoossein started off the session by giving a presentation as part of the session ‘Financing Clean Air for Pakistan’.\n\nHoossein stated that 99pc of the world’s population breathes air that does not meet the WHO standards. Out of international development funds, only 1pc is provided to address the issue of air quality, he added.\n\nFatima Attarwala, editor at Dawn’s Business & Finance weekly, is moderating the session. In her remarks, she said that the conversation would focus on how to make air pollution work for Pakistan.\n\n12:49pm — Ahsan Iqbal asks developed world to do more\n\nThe planning minister further said that everyone had heard the “grand announcements at COP after COP”.\n\n“We have seen the press releases and the photo ops. But where is the action? This inaction is feulling the storms that drown our children. Your emissions are the poison in our lungs … Now, we ask the developed world to do more.”\n\nHe went on to say: “The time for blame is over. The time for action is now. Let’s rollup our sleeves, let’s clear the air and let’s get to work.”\n\n12:47pm — This year’s floods ‘not a natural disaster, but a man-made climate catastrophe’\n\nAhsan Iqbal said the poisoned air was not just one symptom of a deeper sickness but a “climate crisis that is pounding our nation with terrifying fury”.\n\nHe also mentioned this year’s monstrous monsoon floods, stating that they were not a natural disaster, but a “man-made climate catastrophe”.\n\n“Over 1,200 lives lost, 4 million countrymen displaced and economic haemorrhage in billions of dollars. I have walked through those flood camps, and I have seen because my own district (Narowal) was one of the worst affected.\n\n“This is the human face of climate injustice.”\n\n12:46pm — Pakistan bears a burden it did not create: Ahsan Iqbal\n\nThe planning minister also highlighted that Pakistan was bearing a burden it did not contribute as much to.\n\n“Every action is a bullet in this fight for clean air. And I say to our international partners and the global community, that Pakistan bears a burden it did not create. We are on the frontlines of a war we did not start. We are doing our part with limited resources,” Iqbal said.\n\n“We call for the urgent delivery and scaling up of climate finance. The promises made in Glasgow and Sharm el-Sheikh but become a reality on the ground in Pakistan.\n\n“We need access to cutting-edge green technology on preferential terms,” he said, calling for the “major emitters of the world” to increase their net-zero timelimes.\n\n“Our survival should not be negotiable in their boardrooms.”\n\n12:33pm — Polluted air ‘holding our nation back’: planning minister\n\nCalling the issue a “battle for survival”, Ahsan Iqbal stressed the need to “confront a brutal, inescapable truth — the air we breathe is making us sick and it is holding our nation back”.\n\n“As of yesterday, our air was not just poor, it was a toxic cocktail, a public health emergency. Lahore’s AQI at 400 is a red alert for our nation,” the planning minister pointed out.\n\n“Let’s be clear; this is not just Lahore’s problem. Karachi, Faisalabad, Peshawar, almost all our urban engines are drowning in pollution.\n\n“To put that in human terms, breathing this air is equivalent to smoking two packs of cigarettes a day.”\n\nHe cited a study as stating that pollution levels witness a spike during winters, but also underscored that the levels have a “very steady line through summers also”.\n\n12:28pm — The very air we breathe has become our enemy, says Ahsan Iqbal\n\nPlanning Minister Ahsan Iqbal termed the ‘Breathe Pakistan’ initiative “very timely”. “This conference is not only about pollution; it is about leadership, partnership, and collaboration.”\n\n“When we look out the window, the beautiful bustling city of Lahore, we find it suffocating. Its vibrant heart is struggling and its lungs are choked.\n\n“The very air we breathe has become our enemy.”\n\n11:52am — Short break\n\n11:45am — ‘EPA to be expanded to entire Punjab next year’\n\nSilwat Saeed also highlighted the various measures being taken by the Punjab government, including an environment protection force, which she said is being experimented with for the first time in the province.\n\n“This is actually providing miraculous results,” the Punjab environment department official said, noting that the teams had specialised equipment with them.\n\nSaeed said the force, currently in Lahore, will also be expanded to the rest of Punjab, with 10 industrial hotspots to be prioritised initially and the entire province next year.\n\n11:42am — ‘Air quality monitors in Punjab increased from 2 to 41 in past year’\n\nSilwat Saeed detailed Punjab’s three-pronged approach to tackle air pollution, which comprises first monitoring the quality of the air we breathe, then mitigating it, and then finally engaging with the citizenry to inform and empower them.\n\n“Without localised data, there is nothing that can work. […] In earlier decades, we were sitting in the dark, we didn’t know what was wrong. Now that has changed.”\n\nThe Punjab official stated that the number of air quality monitors has increased from two to 41 in the past year. “Within the next 6-7 months, the number would be 100 for the entire Punjab.”\n\nShe further noted that a detailed study was currently being undertaken by the Punjab government to see why the air in the province had pollutants that “are affecting our health”.\n\n11:38am — ‘First time that Punjab’s development programme has been climate-tagged’\n\nThe Punjab environment department official asserted that it was for the first time that the province’s development programme had been “climate-tagged”.\n\n“You would be seeing that the transport sector has been given around Rs269bn that has been tagged for climate change mitigation and adaptation programmes,” she said, referring to the largest allocation.\n\nOthers were Rs95bn for raising awareness, Rs65bn for capacity building, Rs62bn for water resources, Rs47bn for forestry, and Rs16bn for agriculture and livestock.\n\nSaeed noted that it was a cross-sectoral issue and the “real villain is not a single entity which you can point out and fix”.\n\n11:30am — Pakistan located in a ‘geographical trap’, adding to its pollution woes: Silwat Saeed\n\nSilwat Saeed noted that urbanisation has also resulted in the “huge menace of smog”, but it was also a manifestation of deteriorating air quality, which becomes palpable because of temperature inversions.\n\nThe Punjab official further highlighted that Pakistan was located in a “geographical trap” that added to its pollution woes.\n\n“The northern area of this entire region is actually the foothill of the Himalayas, and the foothills would act as a lid when all the pollutants from the region get trapped and then they whirl around within the cities in the region, not only in Pakistan but also in India, Bangladesh and Nepal.”\n\n11:24am — Session 2 on a ‘greener Punjab’ begins\n\nSilwat Saeed, Punjab’s Environment Protection and Climate Change Department secretary, kicked off the day’s second session, ‘A Greener Punjab To Combat Air Pollution’.\n\nShe appreciated DawnMedia for “uniting” her department to speak about how environmental governance was being transformed at a sub-national level.\n\n“This problem is not some distant abstract thing. It is right in front of us.”\n\nShe noted that it was not the first time the world was seeing the issue of air pollution, mentioning the advancement in industrialisation in Europe during the last century.\n\n11:20am — ‘About 5pc of entire global GDP lost because of pollution’\n\nMohamed Yahya said that “about $6 trillion annually, about 5pc of the entire global GDP, is lost because of pollution”.\n\n“There’s no better and more heartbreaking place to discuss this issue. I want to congratulate the Dawn group [for organising the conference].”\n\nRecalling last year’s smog, the UN official said the stain was so profound here in Lahore that it was visible from space. “A glaring testament of what needs to be done.”\n\n“The smog is our creation.”\n\n11:18am — ‘Silent pandemic’ of air pollution a global emergency: UN resident coordinator\n\n“The science is clear,” UN’s Yahya said, adding that the numbers should shake everyone. Citing WHO estimates, he pointed out that “99pc of us in this room and 99pc of humanity breathes air that is unsafe”.\n\n“Let that number be something that galvanises us. This is not a distant threat. It’s a global siege. About seven million people lose their lives every year because of the air they breathe.\n\n“It’s the single greatest environmental risk of our lives and a silent pandemic.”\n\n11:13am — What happens when the air we breathe turns against us?: UN’s Yahya\n\nUN’s resident and humanitarian coordinator for Pakistan, Mohamed Yahya, termed the air we breathe as “our most intimate and non-negotiable relationship with our world”.\n\n“It’s not an abstract concept but a fabric of life itself, the substance that fuels our cells, our lungs, our dreams. But what happens when that very substance turns against us? When the air we breathe becomes a slow-acting poison?” he asked.\n\n**11:10am — Musadik Malik notes China leading solar revolution after smog problems 10-15 years ago\n\nThe climate change minister noted that the South Asian cities of Lahore and New Delhi were not mentioned when the issue of the most polluted cities was highlighted 10-15 years ago.\n\n“The names mentioned were Beijing and Shanghai, and now they are providing 60-75pc of the world’s solar technology. Not only did they fix their cities, but they also led the solar revolution throughout the world to counter the problem they were facing”.\n\n11:04am — Policy in works to update old oil refineries: minister Malik\n\nHailing the “amazing initiatives” being carried out under CM Maryam Nawaz, the climate minister said 8,000 to 10,000 bikes have been distributed, 600 or 500 e-buses are on the roads or will be launched, and anti-smog guns have been installed.\n\n“We will keep bringing higher standards for fuel. We’ve made a policy to update our old refineries … can be brought up to the best standards in the world,” the federal minister said, adding that incentives were to be given as well and some companies were working on the policy.\n\n10:55am — Climate minister Musadik Malik calls air pollution a man-made phenomenon\n\nClimate Change Minister Musadik Malik called air pollution a man-made phenomenon, adding that it was up to us to fix it. He noted that climate change and environmental issues were not major objectives in the past and hard work was being carried out to fix this.\n\nHe refrained from citing different laws and policies, but said that the federal government and Punjab were doing very good work with regard to climate change.\n\nThe minister said around 40pc of children’s lung functioning were affected due to polluted air.\n\nHe added: “This is not just smog. Also look at it through the lens of death. And it is not just death. Also look at it through the lens of love, and when you see the faces hidden behind the haze, maybe then we will solve the issues more quickly.”\n\n10:45am — Musadik Malik mentions link between life expectancy and air pollution\n\nClimate Change Minister Musadik Malik is addressing the event via a video link, apologising that he could not reach Lahore due to “some special circumstances, as you know”.\n\n“Pollution and all these environmental hazards … they stand in the way of our success,” the minister said.\n\nHe recalled that his father had been in a coma during his last days and prayed for “just one more day” for his life. Stressing the importance of life, Malik said five to eight years of the lives of all Lahore residents, including elders, were wasted due to smog.\n\n“We probably do not associate this with the grief and mortality that comes ahead of us because of smog or air pollution,” he said, adding that according to some estimates, 128,000 premature deaths occur in Pakistan every year, and a person’s five to eight years of life are cut short due to air pollution.\n\n10:37am — Mandatory recycling bins in Punjab schools from Oct 30\n\nThe Punjab minister also reflected on her recent visits to Japan. “The entire waste management in Japan is for segregated waste, so that technology cannot be brought to Pakistan,” she said.\n\n“So now we’re going to China for that technology and waste incinerators. We’ve started this in schools. We thought schools would be the right place to start this and embed it into our curriculum. After Oct 30, the schools have to keep five recycling bins at schools mandatory,” Aurangzeb said.\n\n10:30am — ‘Transboundary arrangement’ may now be taken up with UN, WB after recent events: Punjab minister\n\nMarriyum Aurangzeb also observed the lack of data regarding air pollution and highlighted the phenomenon of transboundary pollution.\n\n“The major seasonal contributor to high AQI levels in Lahore and Multan … that easterly wind corridor from India plays a critical role and is a major contributor to seasonal AQI levels. We had started a transboundary arrangement but because of recent events, we may take this forward with the UN or World Bank.”\n\n“Breathe Pakistan is a great initiative for spreading awareness … the responsibility is shared, and whatever we choose has consequences on the environment and climate change,” Aurangzeb stressed.\n\n10:26 — ‘Climate Change Vision 2025 tells policy and action plan for next 10 years’\n\nAurangzeb pointed out that Punjab’s Climate Change Vision 2025 detailed the policy and action plan for the next 10 years.\n\nShe highlighted that the Punjab government introduced vehicle fitness certificates for the “first time ever”.\n\n“We are using safe city cameras to identify smoke coming from cars. We have a Punjab Clean Air Programme, which also has a buy-back policy of old vehicles, two-wheelers and three-wheelers.\n\n’[…] For the first time ever, we have mobile fuel testing labs. EPA Punjab has started fuel testing to test petrol at petrol stations in Punjab. In the last eight months, 1,100 electric buses have arrived in Punjab.“\n\n10:21 — Aurangzeb lists steps taken by Punjab govt to tackle smog\n\nAurangzeb emphasised that Punjab now had a state-of-the-art environmental force. Listing the steps taken by the provincial government, she said a subsidy programme with 80pc paid by the government was initiated and Lahore Division now had 5,000 superseeders.\n\nStubble burning zones were mapped, investment was done in the mechanisation of agriculture, and drone monitoring for industrial units is carried out. Around 11,000 brick kilns across the Punjab were also mapped and those without zigzag technology were sealed.\n\n10:17 — Punjab minister details CM Maryam’s smog mitigation plan\n\nThe Punjab senior minister recalled the smog mitigation plan launched by Chief Minister Maryam Nawaz.\n\n“When I speak about Punjab interventions, we have completed the entire legal framework. We are now doing AI-predictable modelling for forecasting AQI levels,” Aurangzeb highlighted.\n\n“Localisation of smog mitigation was critical to the intervention, so we took a multi-sectoral lens to smog mitigation,” she said, noting smog guns imported two months ago and deployed in Lahore.\n\n“For predictable forecasting, we have 41 air monitors across Punjab, and will have 100 across Punjab by 2026.”\n\n10:12am — Marriyum Aurangzeb says such initiatives key to tackling climate change issues\n\nBeginning her address, Punjab Senior Minister Marriyum Aurangzeb noted the presence of “lots of experts, media people and policymakers and civil society”, adding that it reflected the shared responsibility toward climate resilience and climate adaptation.\n\nThanking DawnMedia for taking the initiative, the Punjab minister said she was a “bit sceptical” when she participated in the February conference. “I did not think it would be a sustainable initiative. So my heartfelt congrats to Naz, to you and the Dawn group for sustaining this initiative because that is the key to issues like climate change.”\n\n“I want other media groups to be made part of this initiative. I will present a case study from our chief minister. Lahore, a heritage hotspot of Pakistan, [and] the heartbeat of Pakistan, is confronted with seasonal smog. This is a year-long phenomenon. AQI levels of Lahore and other regions of Punjab were not satisfactory, so we started working on smog mitigation objectives,” Aurangzeb highlighted.\n\nShe said her government was “in shock that we are talking about it in March” when she called a meeting, as the air quality issue is a year-long phenomenon. “We started off with a multi-sectoral lens for climate change.”\n\n10:07am — Dawn CEO Nazafreen stresses commitment to cleaner skies\n\nInaugurating the moot, Nazafreen Saigol-Lakhani, the CEO of Dawn, says: “On behalf of DawnMedia, it is an honour and my responsibility to welcome you all to Breathe Pakistan’s The Air We Breathe — a critical gathering focused on one of the most urgent challenges, air pollution.”\n\nRecalling the initiative’s launch, she said: “Our aim was to start a national dialogue on climate change. At the first conference, experts came together to issue a charter for a climate-resilient Pakistan.\n\n“Today, The Air We Breathe builds on that momentum. As we enter another smog season, this conference focuses on practical tangible measures to tackle air pollution,” Saigol-Lakhani added.\n\nShe further said, “We are helping to weave a living network of collaboration to ensure shared commitments … I hope today’s discussions will inspire collective action and send a strong message that the health of people and the future of Pakistan are not policy points but our priorities.\n\n“Let us commit to cleaner skies and a healthier environment for generations to come.”\n\n9:57am — Conference begins\n\nThe conference has begun, with the national anthem being played, followed by the recitation of the Holy Quran.\n\nPunjab Senior Minister Marriyum Aurangzeb and the UN’s Pakistan Resident and Humanitarian Coordinator Mohamed Yahya are seated ready for the first session.\n\n9:45am — Participants speak to each other ahead of session\n\n9:35am — Guests are seated inside the venue\n\nGuests are seated inside the Expo Centre as the conference is about to kick off.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/112141566430652.webp",
  "retrievedAt": "2025-10-16T20:50:37.072Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948090/breathe-pakistan-experts-bring-attention-to-air-pollutions-transnational-threat-urge-greater-regional-cooperation-to-tackle-issue",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T04:11:39.000Z"
}
