{
  "title": "Balochistan PAC flags financial irregularities at varsity - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Public Accounts Committee (PAC) of the Balochistan Assembly has expressed serious reservations over poor accounting practices, delays in financial submissions, and various irregularities while reviewing the financial matters and audit observations of the Bolan University of Medi­cal and Health Sciences (BUMHS) on Thursday.\n\nA meeting of the committee, presided over by PAC Chairman Asghar Ali Tareen, directed the university authorities to properly utilise over Rs1 billion lying unspent in its account and to ensure strict financial discipline.\n\nThis was the second session of the PAC focusing on the financial performance of the university. The committee examined in detail BUMHS’s bud­get, financial statements, audit objections, and fund utilisation.\n\nOfficials informed the committee that during the fiscal year 2021-22, the uni­­versity received Rs253.332 million under the non-dev­elopment head, of which Rs252.693m was spent.\n\nThe audit report raised objections amounting to Rs1,087.354m, citing inefficient fund utilisation, illegal vehicle purchases, and expenditures made without tenders.\n\nThe PAC chairman directed that all financial statements and audit reports be finalised and submitted within 15 days.\n\nThe committee was told vehicles worth Rs60.872m had been purchased, but some had yet to be delivered to the university.\n\nIt was noted expenditures amounting to Rs15.431m had been made in past years without open tenders.\n\nThe committee taking notice of the irregularity instruc­ted that all future procurements be made with full transparency and in accordance with rules.\n\nPublished in Dawn, October 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/11085618f158996.webp",
  "retrievedAt": "2025-10-16T20:50:17.976Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948038/balochistan-pac-flags-financial-irregularities-at-varsity",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T00:10:51.000Z"
}
