{
  "title": "North Korea holds military parade, shows off new intercontinental missile - World - DAWN.COM",
  "author": null,
  "content": "North Korean leader Kim Jong Un oversaw a large military parade displaying its new intercontinental ballistic missile in front of visiting international dignitaries, state media KCNA said on Saturday.\n\nThe parade, which began late on Friday, marked the 80th anniversary of the foundation of its ruling Workers’ Party and followed celebrations on Thursday.\n\nChinese Premier Li Qiang, Russia’s former President Dmitry Medvedev, as well as Vietnam’s Communist Party chief To Lam, were seen at Kim’s side at the parade, while other foreign dignitaries looked on.\n\nIn the military parade, nuclear-armed North Korea displayed its most advanced Hwasong-20 intercontinental ballistic missile, described by KCNA as the country’s “strongest nuclear strategic weapon system.”\n\nThe Hwasong series of ICBMs has given North Korea the capacity to target anywhere on the US mainland, but questions remain over the sophistication of its guidance system to reach a target, and the ability of a warhead it carries to withstand atmospheric re-entry.\n\n“The Hwasong-20 represents, for the moment, the apotheosis of North Korea’s ambitions for long-range nuclear delivery capabilities. We should expect to see the system tested before the end of this year,” said Ankit Panda of the US-based Carnegie Endowment for International Peace.\n\n“The system is likely designed for the delivery of multiple warheads… Multiple warheads will increase stresses on existing US missile defence systems and augment what Kim sees as necessary to achieve meaningful deterrence effects against Washington.”\n\nOther weapons on display included hypersonic ballistic missiles, cruise missiles, a new type of multiple rocket launcher and a launcher for suicide drones, said Hong Min, North Korea analyst at the Korea Institute for National Unification.\n\nAt the military parade, Kim gave a speech in which he expressed “warm encouragement” for North Korean troops in overseas operations, adding its military’s heroism will not only be seen in the defence of North Korea but also in “outposts of socialist construction,” KCNA said.\n\n“Our army should continue to grow into an invincible entity that destroys all threats,” Kim said.\n\nKim held talks earlier on Friday with Medvedev, who said the sacrifice of North Korean soldiers fighting for Russia in its military campaign in Ukraine proved the trust in relations between the two countries.\n\nKim told Medvedev he hopes to continue strengthening cooperation with Russia and to closely engage in diverse exchanges to achieve common goals, KCNA said.\n\nVietnam and North Korea also signed agreements of cooperation in various fields, including between their defence, foreign and health ministries, KCNA said without elaborating.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/11183649cdddd5a.webp",
  "retrievedAt": "2025-10-12T13:17:01.759Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948184/north-korea-holds-military-parade-shows-off-new-intercontinental-missile",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T13:53:12.000Z"
}
