{
  "title": "Kyiv plunges into darkness after Russian attack on power grid - World - DAWN.COM",
  "author": null,
  "content": "KYIV: Large parts of Kyiv were plunged into darkness in the early hours of Friday after Russian drones and missiles struck Ukrainian energy facilities, cutting power and water to homes and halting a key metro link across the Dnipro river.\n\nIn the latest mass attack targeting the energy system as winter approaches, electricity was interrupted in nine regions, and around 854,000 consumers were temporarily without power across the country.\n\nIn southeastern Ukr­aine, a seven-year-old was killed when his home was hit, and at least 20 people were injured.\n\nIn Kyiv, an apartment block in the city centre was damaged by a projectile, while on the left bank of the Dnipro that divides the capital, crowds waited at bus stops with the metro out of action and people filled water bottles at distribution points.\n\n“We didn’t sleep at all,” said Liuba, a pensioner, as she collected water. “From 2:30am there was so much noise. By 3:30 we had no electricity, no gas, no water. Nothing.”\n\nUkraine’s air force said it downed 405 of 465 drones and 15 of 32 missiles in the attack. Moscow said its overnight strikes were a response to Ukr­aine’s attacks on Russian civilian facilities.\n\nThe assault was among the heaviest concentrated strikes on energy infrastructure, Ukranian Prime Minister Yulia Svyrydenko said. Her deputy, Oleksiy Kuleba, said two million customers in Kyiv temporarily faced problems with water supplies.\n\nUkrainian President Vol­­odymyr Zelenskiy said Russia’s main target ahead of the heating season is civilian and energy infrastructure and called for more support from Kyiv’s allies. “What’s needed is not window dressing but decisive action from the US, Europe, and the G7 in delivering air defence systems and enforcing sanctions,” he said on X.\n\nUkraine’s Energy Min­ister Svitlana Hrynchuk met with G7 ambassadors to discuss how allies could help protect the country against further attacks and repair the damage.\n\nUkrainian private ene­r­gy firm DTEK said its thermal power plants suff­ered significant damage. The government said it ex­­pe­cted to restore the water supply to the capital by the end of Friday.\n\nPublished in Dawn, October 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/11081239e2ad07a.webp",
  "retrievedAt": "2025-10-16T20:50:39.042Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948014/kyiv-plunges-into-darkness-after-russian-attack-on-power-grid",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T00:10:44.000Z"
}
