{
  "title": "19 new dengue cases reported in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: As many as 19 more dengue patients were reported in the garrison city’s three government-run hospitals, taking the total number of cases to 908.\n\nThe arrival of new patients has pushed the overall tally recorded in the last three months to 908 in government-run hospitals.\n\nMore than 90 patients are still admitted, while most patients arrived after failing to get treatment at private hospitals.\n\nCurrently, 66 dengue patients are under treatment at Holy Family Hospital (HFH), Satellite Town, while the remaining are being treated at Benazir Bhutto Hospital (BBH), Murree Road and Rawalpindi Teaching Hospital, Raja Bazaar.\n\n“The District Health Authority has failed to train private medical practitioners to treat dengue patients, as most of them reach government hospitals after receiving wrong treatment from private clinics,” said a senior doctor at Holy Family Hospital.\n\nHe stressed the need to raise public awareness, urging people suffering from high fever for more than three days to avoid self-medication and consult a doctor.\n\nHe added that the Punjab government is providing free medical care and dengue tests at government-run hospitals, where doctors are offering better care to patients.\n\nThe District Health Authority has also launched a campaign against private clinics that failed to inform the administration about dengue cases and referred critical patients to government hospitals.\n\nMost of the patients have arrived from Afandi Colony, Khyaban-e-Sir Syed, Pindora, Dhoke Kashmirian, DAV College Road, Kulyal, Baga Sheikhan, Gangal, Dhama Syedan, Dhamyal, Lakhan, Chak Jalaldin, Girja and various areas of Rawalpindi and Chaklala Cantonment Boards.\n\nPublished in Dawn, October 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1109373924fc266.webp",
  "retrievedAt": "2025-10-12T13:17:16.368Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947958/19-new-dengue-cases-reported-in-rawalpindi",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T00:11:38.000Z"
}
