{
  "title": "SNGPL allows private firm to sell gas to its consumers - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: In a fast-changing, high-stakes development, Sui Nor­thern Gas Pipelines Limited (SNGPL) has approved pipeline capacity allocation of 50 million cubic feet per day (mmcfd) and allowed the transfer of some of its high-end consumers to the country’s first private gas marketing company — Universal Gas Distribution Company (UGDC) — for the sale of natural gas.\n\n“We are pleased to inform that UGDC’s request regarding an increase of 35mmcfd in pipeline capacity (i.e. 25mmcfd on a firm basis till 2033 and 10mmcfd on an interruptible basis for a period of six months) has been acceded to,” said a letter issued by the Lahore-based gas utility, which had resisted the move for almost a year. It added that since UGDC’s pipeline capacity has been enhanced from 15mmcfd to 50mmcfd, the security deposit would need to be topped up accordingly.\n\nThe letter further stated that “clearance of outstanding dues owed to SNGPL by all consumers wishing to switch to UGDC from SNGPL has to be ensured before initiation of transportation services”.\n\nUGDC Chief Executive Officer Ghiyas Paracha said his firm would have to provide an advance deposit of Rs800 million to SNGPL, in addition to a monthly payment of about Rs1bn for transportation costs and high unaccounted-for gas (UFG) losses.\n\nHe said UGDC would be purchasing the most expensive gas in the country — even higher than LNG prices — yet supplying it to consumers at a lower rate due to a thin profit margin. Informed sources said UGDC would be paying a 20pc premium over the official gas rate set under the Petroleum Policy 2012.\n\nThe transaction has seen several twists and turns. On Sept 11, SNGPL deferred the pipeline capacity allocation to UGDC for natural gas transportation, only weeks after approving it. Its board of directors had on Sept 11 “discussed its earlier decision taken at the 639th meeting held on Aug 15 regarding allocation of 35mmcfd pipeline capacity to UGDC. After due deliberation, the BoD with majority resolved that the implementation of the said decision… be and is hereby deferred,” said a memorandum from the utility.\n\nEarlier, SNGPL had conveyed that on the recommendation of management and the advice of the Ministry of Energy, the BoD had approved “allocation of an additional 35mmcfd (25mmcfd on firm basis till 2033 in line with the terms of the existing access agreement and 10mmcfd on interruptible basis for six months) pipeline capacity to UGDC and execution of a second addendum to the access agreement to account for the additional capacity”.\n\nSeparately, the Petroleum Division is processing a case for imposing a captive gas levy on private-sector gas distribution — effectively targeting UGDC — to ensure a level playing field for public and private suppliers, since no other third party is currently in the business.\n\nPublished in Dawn, October 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/11073048194083b.webp",
  "retrievedAt": "2025-10-12T13:17:28.231Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948007/sngpl-allows-private-firm-to-sell-gas-to-its-consumers",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T00:10:58.000Z"
}
