{
  "title": "Ton-up Jaiswal steers dominant India to 318-2 in West Indies Test - Sport - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: Prolific opener Yashasvi Jaiswal smacked 173 not out as India moved ominously towards a massive first-innings total in the second Test against the West Indies on Friday.\n\nThe hosts ended day one on 318-2 after they elected to bat at Delhi’s Arun Jaitley Stadium in a bid to sweep the two-match series.\n\nThe left-handed Jaiswal made the day his own as he put on a marathon 193-run second-wicket stand with Sai Sudharsan, who scored 87.\n\nJaiswal, who registered his fifth 150-plus score in Tests, and skipper Shubman Gill, on 20, were batting at close of play after Sudharsan’s dismissal was the only wicket to fall in the final session.\n\nJaiswal, who got out for 36 in the first Test, mixed the right dose of caution and aggression, hitting 22 fours in his 253-ball knock.\n\n“The determination he showed was important,” India’s batting coach Sitanshu Kotak said. “Last match he felt he missed out on a good innings and the way he approached (the game today) and selection of shots was brilliant.”\n\nThe 23-year-old Jaiswal reached his seventh Test ton in his 26th match since he began his five-day career in the West Indies in 2023 with a 171 on debut.\n\nHe raised his bat, made a heart gesture with his hands and blew kisses as a lively crowd applauded. Jaiswal looked fluent as he hit pace bowler Jayden Seales for three fours in the first over after lunch to raise his fifty and kept up the attack with regular boundaries.\n\nSudharsan reac­hed his fifty with a boundary off Khary Pierre then survived a dropped catch on 58 by Jomel Warrican at short mid-wicket off Justin Greaves.\n\nThe top-order batsman has been fighting for the number-three spot in India’s competitive line-up and looked primed for his first Test ton, but Warrican trapped him lbw.\n\n‘TOUGH DAY’\n\nJaiswal stood firm along with Gill as the pair put toge­t­her 67 runs to tire out the demoralised opposition attack.\n\n“Today was a tough day in the office for everyone,” West Indies assistant coach Floyd Reifer told reporters. “I thought Jaiswal batted really well. (It is) opportunity for our boys to come to India and really bowl line and length for long periods of time.”\n\nIndia started strongly with KL Rahul and Jaiswal putting on 58 runs for the first wicket. Rahul made a rapid 38 before being stumped by wicketkeeper Tevin Imlach off Warrican.\n\nRahul had attacked Seales for successive fours, including a rasping cover drive followed by a whip towards the mid-on fence in the first hour of play.\n\nJaiswal’s straight drive off pace bowler Anderson Phillip after the first drinks break also delighted the home fans, who are expecting another big win.\n\nSpin was introduced in the 15th over, with Pierre bowling his left-arm orthodox on a tidy line and length. Rahul took on Pierre in the next over and came down the track to hit the first six of the match over long-on, but another ambitious attempt in the next over had him walking back.\n\nStrong favourites India came in unchanged from their innings victory in the opener.\n\nThe visitors, led by Roston Chase, are looking to avoid a second successive Test whitewash after losing 3-0 to Australia at home.\n\nScoreboard\n\nINDIA (1st Innings):\n\nY. Jaiswal not out 173\n\nK.L. Rahul st Imlach b Warrican 38\n\nS. Sudharsan lbw Warrican 87\n\nS. Gill not out 20\n\nTOTAL (for two wkts, 90 overs) 318\n\nFALL OF WICKETS : 1-58 (Rahul), 2-251 (Sudharsan)\n\nSTILL TO BAT: D. Jurel, R. Jadeja, W. Sundar, N.K. Reddy, M. Siraj, J. Bumrah, J. Yadav\n\nBOWLING: Seales 16-1-59-0, Phillip 13-2-44-0, Greaves 8-1-26-0, Pierre 20-1-74-0, Warrican 20-3-60-2, Chase 13-0-55-0\n\nWEST INDIES: T. Chanderpaul, J. Campbell, A. Athanaze, S. Hope, R. Chase, T. Imlach, J. Greaves, K. Pierre, J. Warrican, A. Phillip, J. Seales\n\nPublished in Dawn, October 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/11085000e0db208.webp",
  "retrievedAt": "2025-10-16T20:50:00.303Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948002/ton-up-jaiswal-steers-dominant-india-to-318-2-in-west-indies-test",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T00:11:08.000Z"
}
