{
  "title": "Kundi, Fazl discuss political climate in KP after CM’s exit - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: While most of the federal capital was sealed off due to threats of a protest march by the Tehreek-i-Labbaik Pakistan, Khyber Pakhtunkhwa Governor Faisal Karim Kundi visited the residence of his political rival Jamiat Ulema-i-Islam-Fazl (JUI-F) chief Maulana Fazlur Rehman.\n\nAccording to a statement issued by the JUI-F, Governor Kundi held an important meeting with Maulana Fazl at his residence during which they held detailed consultations on various key issues, including the province’s current political climate and law and order situation. The talks covered ongoing operations in different areas of KP, challenges related to maintaining law and order, and the political dynamics following the resignation of the chief minister.\n\nHowever, sources said, Maulana Fazl also sought a place for his son, Maulana Asad Mehmood, in the upcoming by-elections. The two leaders reviewed the upcoming by-elections for the provincial assembly, the Senate, and the vacant National Assembly seats of Chitral and Haripur. They also explored the possibility of a political alliance and its implications during and after the elections.\n\nThe Election Commission of Pakistan has already announced the by-election schedule for NA-1 (Chitral Upper and Lower) and NA-18 (Haripur), both set to take place on Nov 23. In the 2018 general elections, these seats were won by candidates supported by the PTI, but both were later disqualified by the courts.\n\nAbdul Latif Chitrali secured NA-1 as an independent candidate in 2018, while NA-18 was won by Omer Ayub Khan with a significant margin over Babar Nawaz of PML-N.\n\nSources close to both parties disclosed that Maulana Fazl is keen for his son, Maulana Asad Mehmood, to contest the NA-1 Chitral seat. Maulana Asad narrowly lost the 2024 elections from NA-43 Tank to PTI-backed candidate Dawar Khan Kundi by just 555 votes —64,575 votes to 64,020. The by-election in NA-1 Chitral presents an opportunity for the JUI-F to reclaim the seat. In 2018, it was held by JUI-F-backed Maulana Abdul Akbar Chitrali, but in 2024, independent candidate Abdul Latif (aligned with PTI) comfortably won with 61,944 votes, while JUI-F’s Talha Mehmood finished second with 43,127 votes.\n\nSources within both JUI-F and PPP consider NA-1 a favourable seat for Maulana Fazl son to re-enter the National Assembly. Governor Kundi, a PPP member, is expected to discuss the situation with party leadership, with the possibility of an electoral alliance between PPP and JUI-F in NA-1. In the 2024 elections, the PPP candidate received 23,723 votes and the PML-N candidate secured 20,100 votes in NA-1. Conversely, NA-18 Haripur remains dominated by PTI and PML-N.\n\nSources close to Mr Kundi also revealed that security agencies have sought the support of clerics to counter the ideology of banned extremist terror groups. Governor Kundi requested Maulana Fazl to use his influence in combating terrorism and to support ongoing operations against anti-state elements in KP.\n\nPublished in Dawn, October 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68e988514afa6.jpg",
  "retrievedAt": "2025-10-16T20:50:19.941Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948042/kundi-fazl-discuss-political-climate-in-kp-after-cms-exit",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T00:10:37.000Z"
}
