{
  "title": "Tale of Alipur destruction - Newspaper - DAWN.COM",
  "author": null,
  "content": "ALIPUR tehsil of district Muzaffargarh, 80 per cent of whose population has been marooned for weeks, is situated between two mighty rivers and is close to Panjnad where five rivers merge. Because of its proximity to rivers, it is a fertile region but prone to disastrous flooding. This is not just because of the rivers but also due to the mismanagement of the embankments and headworks. Besides its delicious mangoes, dates and pomegranates, the district has also produced dozens of (in)famous and powerful politicians for decades now. We can mention a few of the ruling clans here — the Dastis, Gourmanis, Qureshis, Khars, Jatois, and Sials.\n\nThe scions of these clans have, each in line with their influence, contributed to the district’s underdevelopment. A large majority of the district’s people remain destitute, marginalised and vulnerable to periodic disasters. They are at the mercy of both large landlords and callous bureaucrats. Both official and independent sources identify Muzaffargarh as one of Punjab’s poorest districts, which is deprived in terms of land ownership, consumption, education, sanitation and housing rights. For instance, its literacy rate is estimated as being 30pc lower than that of central Punjab. Its population density too is far less than that of central Punjab. These two indicators suffice to highlight the difference in human development in the two regions. The tale of Muzaffargarh is the tale of the Seraiki belt too.\n\nNow consider the scale of the recent flood losses. The Rapid Need Assessment Report of UN-OCHA published on Sept 23 and covering 18 flood-affected districts in Punjab states that 4.2 million people were impacted. Shockingly, more than 3m were in just five districts of the region, which account for nearly 64pc of the total 28 flood-affected districts. Muzaffargarh appears to be the most devastated district in Punjab as far as its share in the overall affected and displaced populations is concerned. Out of a total of 2.8m displaced people, 33.6pc or 0.92m belonged to the district, followed by Jhang 14pc, Bahawalpur 13pc, Khanewal 11.5pc and Multan 10pc. The report concludes that “The top four most vulnerable hotspots are Muzaffargarh, Jhang, Bahawalnagar and Khanewal”. On food insecurity, too, the report finds that, of those interviewed, between 61pc and 81pc of respondents expressed fear of food shortages in the coming weeks in the southern districts.\n\nThe differences between Punjab’s northern and southern districts are the outcome of deliberate negligence spread over decades.\n\nThough the National Disaster Management Authority’s website showed only four fully and 234 partially damaged houses in the whole of Punjab until Sept 25, the OCHA report shows as many as 46,000 fully and 115,700 partially damaged homes in the province. South Punjab remains at the top. However, interestingly, the UN-OCHA report shows very few damaged schools in south Punjab in comparison to the rest of the province. This is intriguing. Lower literacy levels in the Seraiki belt is a result of the skewed children-school ratio. The literacy rate is likely to drop in future should the government fail to repair the damaged schools quickly.\n\nThese differences between the northern and southern districts are not a result of any organic development. This is the outcome of deliberate and sustained negligence spread over decades. As each flood disaster washed away schools, illiteracy continued to rise or literacy levels remained stagnant. Since the 1992 super floods, Muzaffargarh district has suffered from three colossal flood disasters and four not-too-large calamities.\n\nAs in 2025, in 2010 too Muzaffargarh’s share in Punjab’s total losses was the highest. As in the case of previous flood disasters, the 2025 floods once again uncovered the regional, class, power and gender inequalities. A wise man once said that in contradictions lie hope. Either we heal the root causes of these contradictions and remove their drivers or continue to survive with the contradictions that we have been living with for centuries now.\n\nBut perhaps the status quo will not be sustained (think Nepal) for long — unless, in the words of Senator Mushahid Hussain, “a healing touch” is witnessed. If that did not happen in the last millennium, it may not take place in the future either. But the recent statement of a federal minister provided some clue. He said that the ‘entrenched elite’ was not only responsible for violating the law of the land but also for causing flood destruction and meting out miseries to the poor. I have no reason to disagree with his blunt outburst. Rather, we must be thankful for his straight talk, though unfortunately, he appears to be serving the interests of the same elite. So, let us move ahead. If the elite constitute one end of the stick, the people make up the other. But the kind of democracy we have legitimises the same elite that the people resent.\n\nSo, in Lenin’s words, what is to be done? If most of the people’s vulnerabilities are likely to emanate from the policies of the elite, then so are their miseries and losses. This can’t be reversed unless people reform the situation through peaceful and sustained pressure.\n\nThe elite mismanage dams, embankments, barrages and headworks. They fail to implement laws, rules and policies in letter and spirit. Our Constitution, in particular Articles 37, 38 and 140A, our public policies on disaster management and our commitments under various UN conventions provide sufficient grounds for pressuring the elite. Moreover, the concept of ‘build-back-better’ is a vital pillar of the disaster-reduction framework. The concept is not, as some tend to believe, limited to physical structures; it also means ending socioeconomic vulnerabilities and building the capacities of ordinary people — so that today’s vulnerable segments can be enabled to cope with disasters on their own, and, hence, lessen the burden on the exchequer.\n\nThe writer is associated with Pattan-Coalition38.\nbari.sarwra@gmail.com\nX: @BariSarwra\n\nPublished in Dawn, October 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:50:17.666Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948059",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T00:11:51.000Z"
}
