{
  "title": "Landi Kotal tribe rejects demarcation of Torkham customs’ terminal - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: The Khugakhel tribe from Landi Kotal on Friday rejected the demarcation of the newly-constructed Torkham customs terminal by the National Logistic Corporation (NLC).\n\nAddressing a news conference at the district press club inLandi Kotal, Khugakhel elders Mufti Mohammad Ejaz, Mirajuddin, Haji Khiyal Mohammad and Saadullah Khan said unless the NLC shared the actually agreed master plan of the terminal, they won’t agree to any demarcation.\n\nThey said the Khugakhel tribe, being the collective owner of the land provided to the Federal Board of Revenue a few years ago, was entitled to be part of any change in the customs terminal’s master plan and a renewed demarcation of the entire land sold to FBR.\n\nThe elders said that the completion of the terminal would be considered incomplete if they’re not taken into confidence about the actual master plan.\n\nAsks NLC to share ‘actual’ master plan\n\nThey alleged that certain elements among government departments were deliberately using some self-proclaimed elders against the majority of Khugakhel tribe to further their interests and deprive the tribe of the promised benefits of the customs terminal after its completion.\n\nThe elders also expressed displeasure over notices issued by the local administration to some of its supporters while inviting them to be present at Torkham at the time of demarcation by the NLC.\n\nThey warn the administration against trying to divide their tribe and claiming its prized land at a throwaway price.\n\nThe elders said the price of the additional land would be different from the one agreed in the previous deal as the additional land, which the NLC wanted to grab, was commercial in nature and was a source of earning for the Khugakhel tribe.\n\nThey announced they would conduct their own demarcation with qualified engineers on Oct 14 (Tuesday). The elders invited all members of the tribe to ensure presence at the site of the new customs terminal.\n\nMeanwhile, shopkeepers in the Landi Kotal Bazaar rejected the conservancy fee imposed on them by the tehsil municipal administration (TMA).\n\nThey held a protest demonstration at the Bacha Khan Chowk and demanded the tax’s immediate withdrawal. They complained that the TMA had miserably failed to fulfil its responsibilities of removing encroachments from the local market and keeping it clean.\n\nThe protesters alleged that while the TMA charged them a conservancy fee for allowing fruit and vegetable vendors to occupy any space in the market, the district administration would conduct an anti-encroachment drive against them.\n\nThey also accused the traffic police of fleecing shopkeepers before evicting them from their places in the name of regulating traffic.\n\nWrit petition: Journalists in Landi Kotal announced on Friday to file a writ petition against the assistant commissioner Landi Kotal for allegedly threatening the district press club president of dire consequences.\n\nPresiding his cabinet meeting at district press club Landi Kotal, Aman Ali informed his colleagues that assistant commissioner Afrasiyab Zubair Hundal used derogatory language against journalists during a telephonic conversation after a video of a press club member went viral on social media in which the official concerned refused to answer questions about raids in the local market.\n\nAman Ali told his cabinet that the official also threatened him with dire consequences if the video was not taken off the social media and he said in a sarcastic tone that he knew how to deal with ‘such people’.\n\nHe said that no one would be allowed to infringe upon their constitutional right of freedom of expression, guaranteed under Article 19-A.\n\nThe cabinet decided to file a writ petition against the assistant commissioner while also submitting an application with SHO Landi Kotal police station to immediately provide them adequate security.\n\nMeanwhile, presidents of Jamrud and Bara press clubs announced complete solidarity with their colleagues and demanded of the deputy commissioner to take appropriate action against the official concerned.\n\nPublished in Dawn, October 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/11085854de4864d.webp",
  "retrievedAt": "2025-10-12T13:17:15.625Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947942/landi-kotal-tribe-rejects-demarcation-of-torkham-customs-terminal",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T00:11:45.000Z"
}
