{
  "title": "Taking 20 wickets more important than scoring big runs, says Shan ahead of Pakistan-South Africa Test series - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan captain Shan Masood believes taking 20 wickets, rather than piling up big scores, will be key to winning the upcoming two-match Test series against South Africa, as the hosts prepare spin-friendly conditions for the opener at the Gaddafi Stadium from Sunday.\n\nSpeaking at the pre-series press conference at the venue on Saturday, Shan said Pakistan’s focus was on creating result-oriented pitches that suit their strengths.\n\n“We don’t want flat tracks where matches end in draws,” he remarked.\n\n“Sometimes you sacrifice runs to create situations where 20 wickets are possible.”\n\nThe Pakistan skipper said the approach reflected lessons from the previous World Test Championship (WTC) cycle, where his side struggled to convert opportunities at home. “The idea is to use our home advantage wisely,” he added.\n\nThe Gaddafi Stadium surface, hosting its first Test of the current WTC cycle from Sunday, is expected to offer assistance to spinners. Pakistan are likely to field up to three slow bowlers, with off-spinner Sajid Khan — now recovered from illness — likely to play a key role. Shan also pointed to the option of reverse swing from the pace attack, depending on conditions.\n\nConcerns remain over the recent form of Babar Azam and Salman Ali Agha, but Shan said individual numbers mattered less in low-scoring contests.\n\n“In such conditions, even a fifty can be a match-defining contribution,” he said. Under scrutiny himself after a lean run, Shan noted that he finished among Pakistan’s top scorers in the last WTC cycle.\n\n“Performance should be judged in context — it’s about winning moments, not averages,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/11161059f5c1cae.webp",
  "retrievedAt": "2025-10-12T13:17:01.945Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1948149/taking-20-wickets-more-important-than-scoring-big-runs-says-shan-ahead-of-pakistan-south-africa-test-series",
  "dateList": "2025-10-11",
  "date_published": "2025-10-11T11:12:10.000Z"
}
