{
  "title": "Interior Minister congratulates Saudi Arabia on National day",
  "link": "https://www.app.com.pk/national/interior-minister-congratulates-saudi-arabia-on-national-day/",
  "date_published": "2022-09-21T18:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP):Minister for Interior Rana Sanaullah on Wednesday congratulated Saudi Arabia on its National Day and hoped that ties between the two countries would strengthen in coming days.\nWhile addressing a ceremony arranged by the Saudi embassy to celebrate the kingdom’s 92nd National Day, he thanked Saudi Arabia for hospitality of pilgrims and said that more than two million Pakistanis were working in Saudi Arabia and sending huge amounts of remittances which play a big role in stabilizing our economy.\nThe event took place at the Centaurus Mall in Islamabad and was opened to public.\nA group of Saudi artists performed the traditional sword dance which was applauded by the audience.\nHe said Pak-Saudi relations were characterized by its strength and durability adding that people of Pakistan had extreme love and appreciation for Saudi nation because the Kingdom had a special place in their hearts due to existence of the two Holy Mosques.\nRana Sanaullah said Saudi Crown Prince Mohammed bin Salman would arrive in Pakistan on an official visit in November and the whole nation was eagerly waiting for his visit. “We are waiting with love and affection for the day when Crown Prince Mohammed bin Salman will visit Pakistan,” said the interior minister. “He will come to Pakistan in November this year.”\n“I would like to congratulate the Saudi ambassador to Pakistan, King Salman, Crown Prince Mohammed bin Salman and the kingdom’s people on their National Day from myself, our government, and Pakistani people,” he added.\nSanaullah said Pakistan and Saudi Arabia were like two brothers who had always stood by each other in difficult times.\n“The friendship between Pakistan and Saudi Arabia is an example for the whole world,” he added.\nThe minister praised Saudi Ambassador Nawaf bin Said Al-Malki for his services, calling him a great friend of Pakistan while saying the friendship between the two nations had touched new heights since his appointment in Islamabad.\n“Saudi Arabia is a holy land for the whole Pakistani nation due to the Two Holy Mosques, and we love their leadership and their people as well,” Sanaullah said.\nThe minister said the Saudi envoy had assured him during a recent meeting he would do his best to solve the problems faced by the Pakistani expatriates in the kingdom and further help increase their number in the foreseeable future.\nHe said Al-Malki was also playing an important role in the expansion of the Makkah Route project next year which would further ease Hajj travel for Pakistani pilgrims, he continued.\nRana Sanaullah said interior ministry was working in close coordination with the Saudi embassy to complete all requirements for the expansion of the initiative.\nThe Saudi envoy thanked the minister for extending best wishes on the kingdom’s National Day and prayed for Pakistan’s prosperity and success.",
  "retrievedAt": "2025-08-11T15:36:44.856Z"
}
