{
  "title": "Languages learning vital to benefit from vast reservoirs of knowledge: President",
  "link": "https://www.app.com.pk/national/languages-learning-vital-to-benefit-from-vast-reservoirs-of-knowledge-president/",
  "date_published": "2022-09-21T10:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): President Dr Arif Alvi on Wednesday said that besides learning and promoting the national language, it was also important to learn other languages, especially English, to benefit from the vast reservoir of scientific, technical, and business knowledge available in those languages.\nHe was addressing the inaugural session of the three-day 1st Pak TESOL international conference on emerging trends in English language teaching in Pakistan, at the Allama Iqbal Open University (AIOU), here.\nUS Ambassador to Pakistan Donald Blome, Vice-Chancellor of AIOU, Professor Dr Zia ul Qayum also addressed the conference.\nIn his address, the president said that being heritage and a language of communication at the national level, therefore, we should appropriately focus on the promotion and development of Urdu.\nHe said added that the English language was spoken by a large number of people and was a language of international communication. Therefore, he said it could be beneficial for acquiring modern scientific and technological knowledge as well as for communicating Pakistan’s perspective effectively to the international community.\nThe president said that scientific knowledge and terms were usually available in the language of developed countries, therefore, it was important to learn those languages.\nPresident Alvi said that though modern research and development was taking place in other languages as well, however, a vast amount of research was being done in the English language, which made its learning essential for increasing the pace of the country’s development.\nThe president said that the latest advancements in the field of Information Technology (IT), especially in the form of Artificial Intelligence, were affecting every facet of life. Modern applications and technology could be used to learn languages in an easy and effective manner.\nHe said that modern technology had altered the concept of learning and education and that the memorization of information had gained secondary importance as compared to analytical and logical decision-making.\nThe president highlighted that the Muslim world in the past had displayed reluctance in adopting the latest technology, especially the Gutenberg printing press, which caused Muslim societies to lag behind in science and knowledge.\nHe added that the Muslims of the sub-continent also showed resistance to learning the English language due to its colonial nature, before being urged by Sir Syed Ahmed Khan for its learning to acquire knowledge and advance socially, politically and economically.\nThe president said that earlier a vast resource of knowledge and philosophy was available in Greek which was later translated by the Muslims into Arabic. Later, this vast reservoir of knowledge was translated and transferred to English and other languages, he added.\nHe said that human vocabulary was limited and the failure to understand the context and background of communication may lead to misunderstanding and miscommunication, which may create issues among families as well as nations.\nHe said that the world was faced with the issue of fake news and out-of-context communication, which needed to be addressed so that misgivings and apprehensions among the people and nations may be avoided.\nHe recalled that he had a long association with the process of learning different languages, including Arabic, English and Urdu, during his academic and professional life.\nPresident Alvi appreciated the Allama Iqbal Open University (AIOU) for using hybrid educational methodologies to achieve the dream of “education for all” by imparting education to students, especially in the far-flung areas of the country.He said that he had been making efforts for the promotion of online and hybrid modes of learning in Pakistan as it was the easiest and the most cost-effective solution to impart education.\nUS Ambassador Donald Blome said that the lives and livelihoods of a large number of people had been affected due to the catastrophic floods in Pakistan whereas millions of people had also been left homeless. America stood with Pakistan in this difficult time, he assured.\nThe US ambassador said that the US had been making efforts for many years to enhance the capacity of students and teachers in Pakistan through the Fulbright and other scholarship programs.\nHe added that under the Fulbright program, 800 students and teachers were sent to the US this year. He said that the US embassy had also trained 30 thousand teachers in Pakistan.\nAllama Iqbal Open University’s Vice-Chancellor Professor, Prof Dr Ziaul Qayyum said that the university was taking steps to equip millions of students in remote and backward areas of the country with quality education as well as to increase the capacity of teachers.\nHe also thanked the president for his continuous support and guidance to AIOU in the causing of promoting quality education in Pakistan.",
  "retrievedAt": "2025-08-11T15:36:54.791Z"
}
