{
  "title": "Ahsan Iqbal vows to complete Narowal Sports City",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-vows-to-complete-narowal-sports-city/",
  "date_published": "2022-09-21T12:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Minister for Planning, Development and Special Initiatives Ahsan Iqbal Wednesday vowed to complete the Narowal Sports City that was delayed due to a NAB reference alleging involvement of corruption in the project.\nHe said that the residence of the Narowal would get state of the art sports facility through this project.\nHe said the National Accountability Bureau (NAB) reference had incurred losses of millions of rupees to the project and this loss would be recovered from Imran Khan and other responsible.\nAddressing the media persons here outside the Islamabad High Court (IHC) after dismissal of the NAB reference case against him by an IHC bench, the minister said former Prime Minister Imran Khan and former Chairman National Accountability Bureau (NAB) Justice Javed Iqbal jointly initiated a campaign against the PML-N leadership and this reference was part of that ‘NAB-Niazi alliance’.\nHe said the court kept on questioning the NAB during the one hour hearing to tell it how Ahsan Iqbal was involved in corruption in this reference.\nHe said that NAB could not present any proof of corruption against him and admitted that there was no truth in the allegation of corruption.\nCriticising Imran Khan, the minister said he was a liar who had been lying for many years and opened numerous false cases against the PML-N leadership.\nAfter the IHC verdict today, he said Imran Niazi should see how his cases against his opponents proved wrong and baseless.\n“He (Imran Khan) has lost all his sense and this was the result of his wrong intentions that he was now wandering around on roads”, Ahsan Iqbal added.\nHe said Imran Khan sought peace of mind by making videos of him and other opponents while we were in jail.\nThe minister also termed Imran Khan as the responsible for current situation of the country saying that the country was burning now and that fire was put on by Imran Khan.\nHe also thanked all his friends, his voters and the media who supported him against this case.",
  "retrievedAt": "2025-08-11T15:36:52.299Z"
}
