{
  "title": "IHC acquits Ahsan Iqbal in Narowal Sports City Complex reference",
  "link": "https://www.app.com.pk/national/ihc-acquits-ahsan-iqbal-in-narowal-sports-city-complex-reference/",
  "date_published": "2022-09-21T14:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): An Islamabad High Court (IHC) bench on Wednesday acquitted Federal Minister for Planning, Development and Special Initiatives Ahsan Iqbal in the Narowal Sports City Complex reference filed by the National Accountability Bureau (NAB).\nThe bench comprising Chief Justice Athar Minallah and Justice Saman Raffat Imtiaz announced the verdict after detailed arguments were presented by the two sides.\nAt the outset of hearing, the chief justice observed that the court would not delay the proceedings further and asked the NAB officials to point out corruption in the project. The then NAB chairman had based the reference on the news item of an unknown newspaper.\nThe project was approved by the Central Development Working Party (CDWP) and NAB prepared the reference without taking the CDWP’s approval into account, he added.\nThe court asked the NAB officials how the accused had misused his powers while he was not a minister for inter-provincial coordination in 2009. It was not NAB’s authority to determine the policy for any project. It was also not its job to determine whether Narowal was a big city or small and what kind of projects should be initiated there, he added.\nChief Justice Minallah said NAB officials did not know how a government work. Who was responsible for the loss occurred due to the stoppage of work on a public project, he questioned.\nHe said the CDWP comprised 30 members and whether all of them had committed corruption in the project. NAB had itself admitted that the delay in the project work had caused loss to the national exchequer.\nThe chief justice remarked that the court had repeatedly asked the NAB investigation officer  about corruption in the project, but received no answer. It was how the reputation of people was damaged by the Bureau, he observed.\nHe remarked that a competent officer Ahad Cheema had been kept in jail for three years.\nThe court asked whether NAB had prepared a case against the official who caused loss by stopping the work on the project from 2000 to 2009. The Bureau had also alleged that the project was initiated close to the border area, but did not mention any corruption.\nThe chief justice questioned whether NAB had inquired from the Punjab government that how its project was shifted to the federal government.\nThe NAB investigation officer said that Ahsan Iqbal, a Pakistan Muslim League-Nawaz leader, was arrested in 2019. The additional prosecutor general would give arguments in the case but he could not appear in the court today.\nHe said the Bureau would consider the case under fresh amendments in the NAB law.\nThe prosecutor said under the 18th Constitutional Amendment, the project fell in the provincial jurisdiction, but it was shifted to the Ministry of Inter-provincial Coordination.\nHe said that the Bureau did not stop work on the project.\nThe NAB officials requested the court to grant some time for arguments in the case. The chief justice remarked that the court had already given many dates to the prosecution.\nThe investigation officer claimed that a secretary was pressurized for transferring the project to the federal government.\nThe chief justice expressed his displeasure, observing whether the secretaries were immature to come under the pressure. It showed how NAB prepare cases and then it had nothing to defend, he added.\nThe court observed that the instant case had no connection with the amended NAB law. It was for NAB to prove corruption in a case.",
  "retrievedAt": "2025-08-11T15:36:48.922Z"
}
