{
  "title": "Nepal, Pakistan need to enhance trade, telecom linkages: Khurram Dastgir",
  "link": "https://www.app.com.pk/national/nepal-pakistan-need-to-enhance-trade-telecom-linkages-khurram-dastgir/",
  "date_published": "2022-09-21T11:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Federal Minister for Energy Khurram Dastgir Khan has said that Nepal and Pakistan needed to enhance trade and telecommunication linkages to reduce poverty and bring prosperity to the people of both countries.\nHe made these remarks while addressing a ceremony held here to mark the 8th Constitution Day and National Day of Nepal.\nSouth Asia remained the least interconnected region in the world in terms of trade, transportation, and financial linkages. Therefore, both the countries should further their trade linkages and people-to-people contact in order to promote regional connectivity, the minister added.\nDastgir, on behalf of Prime Minister Shehbaz Sharif, conveyed his sincerest felicitations to the Government and the people of Nepal on their constitution day and national day.\nThe minister also appreciated Nepali Ambassador Tapas Adhikari for extending support to the flood victims and added that the next challenge was to rehabilitate the displaced people.\nThe ambassador said it was a historic day for Nepal, as on this day in 2015, the Constitution Assembly of Nepal promulgated a constitution, embarking a new era of democracy, human rights, peace, progress, development, and prosperity.\nThe Nepali social contract embodied democratic norms and values, including principles of human rights, social justice, inclusiveness and equity, he added.\nThe envoy further said that the Constitution federated the country into seven provinces, and ensured participation and representation of marginalized people through the republic system of governance that strengthened democratic polity, good governance, and the rule of law.\nTalking about Pak-Nepal relations, he said that both the countries enjoyed strong relationship based on mutual trust and cooperation. The two countries were working together at various bilateral, regional, and multilateral forums to promote friendship and cooperation, he mentioned.\n“As founder members of the South Asian Association for Regional Cooperation (SAARC), both the counties have full faith in SAARC Charter and are committed to its objectives.”\nHe added that Nepal and Pakistan were also working together on the agendas of sustainable development, climate change, and environmental protection.\nThe ambassador further said Pakistan had been an attractive destination for Nepali students. Hundreds of Nepali students graduated from Pakistani colleges and universities and were now serving their motherland, particularly in medical and engineering fields.\n“Our business relations are also expanding and increasing over the years. Although there was a little slack during the COVID 19 pandemic, and we need to make up for the lost time. As Ambassador of Nepal to Pakistan, I am fully committed to expanding and deepening our relations.\n“Nepal has always been a hub of mountain and adventure tourism. Our mountains, snow-fed rivers, and topography have always fascinated people worldwide,” the ambassador added.\nThe Ambassador expressed his deepest condolences and sympathies to the Government and the people of Pakistan, who were going through a difficult time due to the Monsoon floods across the country. “The Government and the people of Nepal stand with our Pakistani friends in this time of trouble.”",
  "retrievedAt": "2025-08-11T15:36:52.956Z"
}
