{
  "title": "Curbing human trafficking, migrants smuggling require coordinated response: UNODC",
  "link": "https://www.app.com.pk/national/curbing-human-trafficking-migrants-smuggling-require-coordinated-response-unodc/",
  "date_published": "2022-09-21T14:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Representative of United Nations Office on Drugs and Crime (UNODC), Pakistan Dr. Jeremy Milsom on Wednesday said that curbing human trafficking and migrants smuggling required a coordinated response at all levels.\nRealizing the fact, the government of Pakistan notified provincial and district-level Trafficking in Person (TIP) Coordination Committees earlier this year, he said while speaking at a consultation workshop held here for National and Provincial Anti-Human Trafficking Committees here.\nThe consultative workshop was organized by the UNODC in collaboration with the Federal Investigation Agency (FIA) to provide an opportunity to all the members of national, provincial, and district-level anti-trafficking committees to meet and deliberate on their objectives.\nDr. Milsom said: “We, as UNODC, are very pleased with this action of Pakistan and commend its efforts. We hope that there would be great coordination and synergy amongst all the stakeholders, and that the activities will be conducted in a coordinated manner at federal, provincial, and district levels.\n“The foundation for curbing TIP and smuggling on migrants (SOM) must be the Palermo Convention on Transnational Organized Crime, to which Pakistan is a signatory. Our approach needs to balance progressive and proactive law enforcement with activities that combat the market forces driving human trafficking and migrant smuggling in Pakistan.”\nDirector General FIA Mohsin Hassan Butt said: “We are improving our identification of potential victims and offering greater support to those who are victims of this abhorrent crime. Trafficking is a gross violation of a person’s basic rights and dignity and disproportionately affects the most vulnerable, especially women and children. We are working jointly with UNODC and the European Union (EU) to enhance support to the victims of trafficking and vulnerable smuggled migrants. Our National Action Plan to combat human trafficking and migrant smuggling is victim-centered and addresses the gaps related to it.\n“We are enhancing our ability to act early and to help other relevant stakeholders within Pakistan to deal with the issue. Police are mandated to investigate crimes of internal trafficking and other departments including labour, child protection, women’s protection, and social services are mandated to provide protection and assistance services to the victims”.\nChief of Mission, International Organization of Migrants, Pakistan Mio Sato congratulated the federal government and FIA for adopting comprehensive counter-trafficking measures, that are also in line with the 2030 Agenda for Sustainable Development and Global Compact for Safe, Orderly and Regular Migration (GCM). “It is critical to strengthen partnerships and collaboration amongst local and national stakeholders in order to ensure efforts are sustainable and holistic.”\nMigration Liasion Officer Eric Hann said: “As part of the EU Strategy on Combating Trafficking in Human Beings 2021-2025, we are committed to step up cooperation with countries of origin and transit. This is crucial to ensure a comprehensive approach that includes demand reduction; law enforcement and criminal justice response; and assistance and support to victims, in line with priorities that apply both inside and outside the EU.”\nThe high-level national consultation, organized under the EU-funded Global Action against Trafficking in Persons and the Smuggling of Migrants – Asia and the Middle East (GLO.ACT Asia and the Middle East), brought out well the lack of coordination and understanding of the distinction between trafficking, irregular migration, and smuggling of migrants, and presented a more holistic framework for coordinated approaches.",
  "retrievedAt": "2025-08-11T15:36:51.103Z"
}
