{
  "title": "Pakistan embassy, Tehran observes ‘Kashmir Black Day’",
  "link": "https://www.app.com.pk/national/pakistan-embassy-tehran-observes-kashmir-black-day/",
  "date_published": "2021-10-25T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP):The Embassy of Pakistan in Tehran has observed Kashmir Black Day, to express support of Pakistani government and the nation for the Kashmiri people in their struggle against the continued Indian illegal occupation of Jammu and Kashmir.\nA number of Iranian scholars, academicians, media persons, member of Pakistani community and Pakistani and Iranian students participated in the event, said a message received here.\nIn his remarks, Ambassador Rahim Hayat Qureshi emphasized that Kashmiris had been subjected to the use of brute force from the Indian occupation forces since October 27, 1947.\nBeginning from that day, the Indian security forces have had systematically maimed, executed, murdered, blinded and raped thousands of innocent Kashmiris through state-sponsored terrorism.\nExpressing his gratitude to the Iranian leadership, the ambassador highlighted that it had always given a great regard to the struggle for self-determination in IIOJK.He also thanked the Iranian print and electronic media for projecting the Kashmir cause and in highlighting the systematic human rights violations committed by the Indian occupation forces.\nThe Ambassador reiterated Pakistan’s call to the world leaders, international community including the United Nations, and all human rights organizations to urge India to halt the brute use of force against the innocent Kashmiri people and resolve the Kashmir Dispute as per the charter of the United Nations and various UNSC Resolutions.\nHujjat-ul-Islam Dr. Salman Naqvi and students from Tehran University, in their speeches, condemned the continuing atrocities and gross human rights violations being committed by the Indian occupation forces in IIOJK. At the end, a special prayer was held for the alleviation of sufferings of innocent Kashmiris and for their freedom from barbaric and illegal Indian rule.",
  "retrievedAt": "2025-08-11T21:31:05.435Z"
}
