{
  "title": "President orders State Life to pay insurance claims to policyholders’ widows",
  "link": "https://www.app.com.pk/national/president-orders-state-life-to-pay-insurance-claims-to-policyholders-widows/",
  "date_published": "2021-10-25T14:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP): President Dr Arif Alvi Monday ordered the State Life Insurance Corporation of Pakistan (SLICP) to pay insurance claims to the widows of two different insurance policy holders.\nThe president upheld the orders of the Wafaqi Mohtasib to pay the insurance claims to the widows of policyholders in two separate cases and rejected the representations of the SLICP in this regard.\nAccording to the details, Nagina Fatima’s late husband had purchased non-medical life insurance policy for Rs 1 million and paid annual premium amounting to Rs 54,890 on 31.12.2018.\nAfter his death in February 2019, the widow, being the nominee of the deceased policyholder, approached the SLICP for the payment of the insurance claim.\nThe SLICP repudiated her insurance claim without issuing her any notice. Thereafter, the widow approached the office of the Wafaqi Mohtasib for the redressal of her grievance.\nSimilarly, the husband of Rehana Kosar had purchased a policy for Rs 410,000 and after paying annual premium in July 2019 he died. Kosar’s claim was also rejected without issuing any notice to her after which she approached the Wafaqi Mohtasib to seek justice.\nSubsequently, Wafaqi Mohtasib, in both the cases, passed the orders directing the SLICP to redress the grievances of the complainants by paying them insurance claims, taking disciplinary actions against the delinquent officials under the relevant laws. The Mohtasib also sought compliance report or the reasons for not doing so within 30 days in terms of the Article 11(2) of P.O. 1 of 1983.\nThe SLICP, thereafter, filed appeals to the President assailing the orders of the Wafaqi Mohtasib.\nWhile rejecting the representation of SLICP, the president noted that under the Article 32 of the Establishment of the Office of Wafaqi Mohtasib Order 1983 read with Section 14 of the Federal Ombudsmen Institutional Reforms Act 2013, any person aggrieved by the order of the Mohtasib may file a representation within 30 days before the president.\nHe stated that in both cases, the orders of the Mohtasib were forwarded to the agency on 26.05.2021 whereas both the instant representations of SLICP were field on 07.07.2021.\nThe president observed that the extant law didn’t empower the condonation of delay to entertain a representation which was time barred, adding that it was liable to be rejected out rightly as incompetent and time barred.\nHe remarked that the agency did not challenge the declarations made by the deceased policyholders about their good state of health and treated the insurance policies as “good risk” and a valid contract since the date of issuance of policies till their deaths for all intents and purposes.\nPresident Alvi ordered to estop the agency to assail the policy after the death of policyholders as the agency repudiated the claim without issuing any notices and without providing the complainants the opportunity of being heard.\nThe president in his decision wrote that the agency did not fulfil the requirements of natural justice which was one of the most sacred principles and its violation is always considered enough to vitiate even the most solemn proceeding.\n“Therefore, the representation is rejected at it is time barred and the Agency must consider the matter further, redress the grievance of the complainants by paying them death insurance claims, take disciplinary actions against delinquent officers under relevant laws and report compliance within 30 days”, he ordered.",
  "retrievedAt": "2025-08-11T21:31:06.849Z"
}
