{
  "title": "Covid-19: Pakistan records lowest deaths since disease spike",
  "link": "https://www.app.com.pk/national/covid-19-pakistan-records-lowest-deaths-since-disease-spike/",
  "date_published": "2021-10-25T10:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 25 (APP):The national tally of Covid-19 active cases on Monday was recorded 23,940 with 698 more people tested positive for the deadly virus and 666 people recovered from the disease during the last 24 hours.\nNine corona patients have died during the last 24 hours, where the deceased were under treatment in different hospitals, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Khyber Pakhtunkhwa (KP) followed by Sindh. Out of the total nine deaths occurred, four of them died were under treatment on ventilators.\nThere were 1,524 Covid-19 infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country. The National Covid positivity ratio during past 24 hours was recorded 1.65 percent.\nThe maximum ventilators were occupied in four major cities including Gujranwala 18 percent, Peshawar 25 percent, Lahore 21 percent and Multan 38 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of Covid patient) was also occupied in four major cities of Swabi 31 percent, Bannu 25 percent, Sargodha 20 percent and Multan 36 percent.\nAround 218 ventilators were occupied elsewhere in the country while no Covid affected person was on ventilator in Azad Jammu and Kashmir (AJK), Balochistan and Gilgit Baltistan (GB).\nSome 42,095 tests were conducted across the country on Sunday, including 17,710 in Sindh, 12,188 in Punjab, 8,305 in Khyber Pakhtunkhwa (KP), 2,944 in Islamabad Capital Territory (ICT), 374 in Balochistan, 302 Gilgit Baltistan (GB) and 272 in AJK.\nAround 1,216,908 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,269,234 cases were detected that also included the perished, recovered and under treatment Covid-19 patients so far, including AJK 34,441, Balochistan 33,196, GB 10,383, ICT 106,710, KP 177,519, Punjab 439,171 and Sindh 467,814.\nAbout 28,386 deaths were recorded in country since the eruption of the contagion. Around 7,551 people perished in Sindh, three of them died in the hospitals on Sunday. 12,896 people died in Punjab with one deceased died in the hospital on Sunday.\nAs many as 5,720 people expired in KP, five of them died in hospitals on Sunday, 938 individuals died in ICT, 355 people died in Balochistan, 186 infected people perished in GB, and 740 people died in AJK.\nA total of 20,530,153 corona tests have been conducted so far, while 640 hospitals are equipped with Covid facilities across the country. Some 1,591 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:31:09.198Z"
}
