{
  "title": "Indians turn nasty against Muslims after losing cricket match",
  "link": "https://www.app.com.pk/national/389603/",
  "date_published": "2021-10-25T16:07:00.000Z",
  "source": "APP",
  "content": "New Delhi, India – Just before the start of the India-Pakistan T20 World Cup cricket match in Dubai on Sunday, the Indian team took a knee in solidarity with the Black Lives Matter (BLM) movement.\nIndia lost the match, handing Pakistan its first win against the arch-rival at any World Cup.\nAccording to Al Jazeera News,  as soon as the match at the Dubai International Stadium ended, some Kashmiri students celebrating Pakistan’s victory were attacked in India.\nEven Mohammed Shami, a Muslim member of India’s playing-XI, was abused on social media following the loss, despite captain Virat Kohli acknowledging his side had been “outplayed” by Pakistan.\nCricket matches often worsen the tensions between the nuclear-armed neighbours, who have fought three wars since their independence from the British in 1947.\nMuzamil, a Kashmiri studying in a college in Mohali district in western India’s Punjab state, told Al Jazeera that minutes after the cricket match ended, “a group of nearly 20 goons gathered outside our hostel”.\n“We had never seen those faces and had no idea who they were. They had sticks and they beat up three of my friends. I was afraid and didn’t leave the room,” said the 22-year-old who did not want to disclose his full name for fear of reprisals.\nAfter the assault, Muzamil said his friends were forced to move into the house of another friend, as they feared for their safety.\n“This was a game and supporting any team is an individual’s choice. What happened to us is really, really wrong,” he told Al Jazeera.\n“It happens with us in [New] Delhi and everywhere else. As a Kashmiri student, I feel unsafe in India.”\n“But it was suicidal to do so in Punjab,” said Nasir Khuehami, the national spokesperson of Jammu and Kashmir Students’ Association, referring to Kashmiris celebrating Pakistan’s win.\n“They are a minority in mainland India and the celebrations were stupid. Knowing that your life is in danger, it wasn’t a wise step.”\nKashmir is claimed by India and Pakistan, which rule over parts of it. The Indian side of the Himalayan territory has been witnessing an armed rebellion for decades, with many residents supporting a merger of the region with Muslim-majority Pakistan.\nKhuehami said at least 14 Kashmiri students were attacked across India following the match, with seven of them sustaining serious injuries.\nHe said he spent the rest of Sunday night responding to calls of distress from Kashmiri students, despite the police saying they had not heard of any such attacks on Kashmiris.\nAfter India’s loss, Indian cricketer Shami’s Instagram got hundreds of abusive messages, some of which labelled the fast bowler a “traitor” and a “sell-out”. Some posters even called him a “Pakistani”, suggesting he should be thrown out of the Indian team.\nShami had his ODI and T20 debut against Pakistan in 2013 and 2014 respectively when India was victorious in both matches.\nCritics also highlighted why the Indian cricket team had not spoken up about Shami being singled out.\n“[The] silence is not willful ignorance, it is worse than that. Who were they taking a knee for? The American players have risked their careers to take that position,” Kavita Krishnan, rights activist and member of the Communist Party of India (Marxist–Leninist), told Al Jazeera.\n“Why can’t you tell your own government that Muslim lives matter and Kashmiri lives matter?”\nOmar Abdullah, former chief minister of Indian-administered Kashmir, said Shami was “one of 11 players who lost last night, he wasn’t the only player on the field”.\n“Team India, your BLM knee-taking counts for nothing if you can’t stand up for your teammate who is being horribly abused and trolled on social media,” he posted on Twitter.\nKrishnan said the BLM movement was against the police brutality against the Blacks. “Then why can’t Indian players speak on the police brutality against Muslims?” she asked.\n“Posturing for others may be a fashionable thing to do, but it is moral bankruptcy.”",
  "retrievedAt": "2025-08-11T21:31:05.309Z"
}
