{
  "title": "Strategy to be chalked out for revival of economic stability: Gillani",
  "link": "https://www.app.com.pk/national/strategy-to-be-chalked-out-for-revival-of-economic-stability-gillani/",
  "date_published": "2023-04-18T12:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):Pakistan Peoples Party’s (PPP) senior leader and former Prime Minister (PM) Syed Yousuf Raza Gillani on Tuesday expressed the hope that the political leaders in the coalition government would soon announce a strategy that would bring economic and political stability to the country.\nTalking to media persons here after meeting Mutthidda Quami Movement (MQM) along with Minister for Commerce Syed Naveed Qamar, Adviser to Prime Minister Qamar Zaman Kaira said, “Politicians should play their role as a bridge not as a wall.”\n“PPP wants to make a conducive environment for dialogue among the political parties as we believe all problems being faced by the county can only be addressed through the dialogue,” he added.\nYousaf Raza Gillani said the eyes of over 220 million masses were looking to the political parties in the current political and economic instability in the country.\n“Political stability is directly linked with economic stability and the masses could get relief from the government after this achievement,” he added.\nHe said that PPP had signed the Charter of Democracy (CoD), under which constitutional amendments were made and then President Asif Ali Zardari under that legislation delegated all his powers to the Parliament\nYousuf Raza Gillani said that all political forces direly needed join hands for the supremacy of the Parliament and to ensure that all institutions work in their domain.\nResponding to a query, he said that PPP would also approach Jamiat-e-Ulema Islam (F) and finalized its dialogue process with allies of the government.\nMQM leader Muhammad Abubakar appreciated the efforts of the PPP for engaging all political forces for strengthening democratic institutions and the supremacy of Parliament in the country.\nHe said, “Keeping in view the prevailing political situation and making joint efforts for the economic and political stability of the country, the dialogue among political parties is the need of the hour.”\nHe said, “The message of the delegation will be passed on to the MQM leadership and expressed the hope that these efforts of PPP will be helpful in starting a political discussion in the country.”\nHe said, “Elections will be held at the due time.”\nHe assured that the MQM would support any such move of allies with the objective to strengthen the democratic system of the country.",
  "retrievedAt": "2025-08-11T08:19:53.184Z"
}
