{
  "title": "PM stresses ‘no politics’ on health, education projects",
  "link": "https://www.app.com.pk/national/pm-stresses-no-politics-on-health-education-projects/",
  "date_published": "2023-04-18T08:03:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Apr 18 (APP): Prime Minister Shehbaz Sharif on Tuesday stressed that the development projects, particularly those relating to health and education, must not be politicized and be implemented in the best interest of the general public.\nDuring his visit to the Rawalpindi Institute of Urology and Transplantation (RIUT), he said no one should be allowed to politicize the projects of any government.\nShehbaz Sharif said it was time to get united for the proper implementation of the Constitution of the country.\nHe expressed satisfaction with the successful completion of the first phase of the hospital where patients were being provided best medical treatment in areas of dialysis, kidney ailments, and surgeries.\nHe lauded the Punjab administration of health for effectively carrying out the operationalization of the hospital and appreciated doctors and nurses for their dedication.\nHe mentioned that Rs 5 billion were spent on RIUT so far and recalled that he laid the foundation stone of the hospital in 2012. He regretted that the previous government delayed the project, which otherwise could have been made operational much earlier.\nPM Sharif said earlier, an allegation put against him by a former chief justice of the Supreme Court halted the work on a kidney and liver transplant hospital in Lahore.\nHe said such discouragement of development and social work badly impacted the provision of civic facilities for the general public.\nHe said serving the masses was a noble cause that needed a synchronized effort by all stakeholders.\nThe prime minister took a round of various sections of the RIUT and inquired about the health of patients. He also instructed the administration to leave no stone unturned in providing best medical facilities to the patients.\nFederal Minister for Information and Broadcasting Marriyum Aurangzeb, Pakistan Muslim League (Nawaz) leaders Hanif Abbasi, Tahira Aurangzeb, and others were present.",
  "retrievedAt": "2025-08-11T08:19:57.258Z"
}
