{
  "title": "Imran Khan’s bailable arrest warrants issued in judge threatening case",
  "link": "https://www.app.com.pk/national/imran-khans-bailable-arrest-warrants-issued-in-judge-threatening-case/",
  "date_published": "2023-04-18T13:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):A judicial magistrate court on Tuesday issued bailable arrest warrants of former prime minister Imran Khan in the female judge threatening case.\nDuring the course of hearing, Special Prosecutor Rizwan Abbasi informed Judicial Magistrate Malik Amaan that the court had summoned the PTI chairman in personal capacity as his request of a one-day exemption from attendance was not approved on the last date of last hearing.\nHe prayed to the court to issue Imran Khan’s non-bailable arrest warrants for his persistent non-appearance. The PTI chief had always filed appeals against his warrants whenever the same were issued against him, but he never appeared in person.\nThe police officer who visited Imran Khan’s house for execution of the warrants in the Toshakhana case, was tortured by the PTI activists, he added.\nImran Khan’s lawyer Faisal Chaudhry said the matter of Imran Khan’s bails in other cases was pending with the Islamabad High Court (IHC). Ali Bokhari Advocate said the district administration had issued a notification regarding the shifting of court to the Judicial Complex for hearing of the Toshakhana case.\nThe judge remarked that the court had already dismissed Imran Khan’s two applications for exemption from attendance.\nFaisal Chaudhry said today they would file a new request for exemption from his appearance, adding the court had also sought a report from the Interior Ministry regarding withdrawal of Imran Khan’s security.\nDuring the hearing, the prosecution also submitted a report regarding the execution of arrest warrants of Imran Khan. Imran Khan’s lawyer said the warrants were sent to Banigala where his client did not live any more.\nAfter hearing the arguments, the court instructed the legal team of Imran Khan to submit surety bonds of Rs 20,000 and issued bailable arrest warrants against him.\nThe case was subsequently adjourned till May 25.",
  "retrievedAt": "2025-08-11T08:19:53.888Z"
}
