{
  "title": "President directs reimbursement of 57,172 AUD health insurance claim to a citizen",
  "link": "https://www.app.com.pk/national/president-directs-reimbursement-of-57172-aud-health-insurance-claim-to-a-citizen/",
  "date_published": "2023-04-18T08:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP): President Dr Arif Alvi has upheld the decision of the Federal Insurance Ombudsman (FIO) directing an insurance company to reimburse the full health insurance amount of 57,172 Australian Dollars (AUD) to a citizen, who had been denied the insured amount on flimsy grounds, within 30 days.\nThe complainant (Fahad Mahmood) had obtained a Worldwide Travel Insurance Policy from a company (United Insurance Company of Pakistan Ltd) for his father to travel to Australia with a sum assured of USD 50,000 for medical expenses and hospitalization abroad, President Secretariat Press Wing said in a press release on Tuesday.\nDuring his stay in Australia, his father was admitted to hospitals twice and was treated for a few days. He filed the health insurance claim but the company only honoured the claim for his father’s first admission to the hospital in Australia.\nThe second admission claim was denied on the ground that his father was admitted for the second time due to pre-existing ailments (chronic kidney disease, chronic heart failure, diabetes, benign prostate hypertrophy and hypertension) which he did not disclose at the time of obtaining the policy from the company.\nFeeling aggrieved, the complainant approached the FIO for relief, which passed the order in his favour. Subsequently, the company filed a representation with the President against FIO’s order, which was rejected.\nThe president in his decision said that the onus to prove the pre-existing ailment rested upon the petitioner company and the repudiation of the insurance claim required unimpeachable evidence regarding the existence of the alleged pre-existing ailment and its knowledge by the policyholder.\n“No clinical investigation or diagnostic assessment has been produced by the petitioner company to prove the factum of pre-existing ailment”, he added.\nThe president further held that FIO had rightly observed that “the business of insurance obliges the company to ensure the protection of the interests of insurance policyholders. Due diligence is required to be carried out by the respondent company before the issuance of policy as it relates to the policy applicants’ health, belongings and life. Without going through due process, the issuance of policy creates such situations. After getting his policy issued, a policyholder considers himself covered against various eventualities. A policyholder travelling abroad can come across health issues in a foreign land requiring urgent medical cover, which is exactly the purpose of the travel insurance policy”.\nThe president said that the company was a well-established organization and it had all means at its disposal to ascertain pre-existing ailments before issuing the policy.\nHe observed that the company had accepted the first admission claim without any objection but it took the plea of a pre-existing ailment while repudiating the second admission claim unjustifiably without producing cogent material to corroborate its stance.\nHe further observed that the repudiation of the second admission claim on flimsy ground, while honouring the first admission claim, constituted maladministration on the part of the company, which was unjust, unreasonable and based on irrelevant grounds.",
  "retrievedAt": "2025-08-11T08:19:56.350Z"
}
