{
  "title": "Hindu leaders’ blasphemous words against Harmain AL-Sharifain, Baitullah not acceptable: Ashrafi",
  "link": "https://www.app.com.pk/national/hindu-leaders-blasphemous-words-against-harmain-al-sharifain-baitullah-not-acceptable-ashrafi/",
  "date_published": "2023-04-18T17:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP): Prime Minister’s Special Representative on Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Tuesday said the blasphemous words by Indian Hindu leaders against Harmain Al-Sharifain and Baitullah were not acceptable to the Muslims.\nTalking to the media, Ashrafi who is also the Secretary General of International Tazeem-e-Harmain Al-Sharifain Council, said the Muslim Ummah was quite disturbed over the blasphemous words of Hindutva leaders as India was currently under the rule of an extremist and terrorist group that had made the so-called secular country a hell for the minorities.\nIt should be known to the Hindutva preachers that the Muslims would not hesitate in sacrificing their lives for the honor of Harmain Al-Sharifain and Baitullah, he added.\nAshrafi said as the successful mediation of China had culminated in a rapprochement between Iran and Saudi Arabia, then its role for the settlement of the Israel-Palestine issue would be fully supported.\nHowever, the solution acceptable to the people of Palestine would be only be acceptable to the Ummah, he added.\nAshrafi said the restoration of relations between Iran and Saudi Arabia was great news for the Muslim Ummah, and the leadership of Saudi Arabia, especially Prince Muhammad bin Salman’s leading role was becoming the centre of the Ummah’s unity and stability.\nFollowing the restoration of relations between Qatar and Bahrain, the closeness of the United Arab Emirates and Qatar would also help in resolving the issues in the region, he added.\nResponding to a question, he said Saudi Arabia’s positive role on the issue of Syria would help stop the bloodshed of Muslims, restore Yemeni government’s relations with the Houthis and the visit of the Saudi foreign minister to Syria would further cement cordial relations between the two countries.\nHe expressed the hope that peace situation in Iraq, Syria and Yemen would get better due to these developments at the diplomatic fronts.",
  "retrievedAt": "2025-08-11T08:19:46.209Z"
}
