{
  "title": "New religious affairs minister, Saudi envoy discuss Hajj arrangements",
  "link": "https://www.app.com.pk/national/new-religious-affairs-minister-saudi-envoy-discuss-hajj-arrangements/",
  "date_published": "2023-04-18T14:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):The newly-appointed Minister for Religious Affairs and Interfaith Harmony, Senator Talha Mehmood, wasted no time in getting down to work, as he met with the Saudi Ambassador to Pakistan, Nawaf bin Said Al-Malki, soon after assuming office on Tuesday.\nDuring the meeting, the two officials discussed a range of issues related to the upcoming Hajj pilgrimage, including the Road to Makkah project and other matters.\nMinister Mehmood praised the Saudi envoy, describing him as a valuable friend of Pakistan who had played a significant role in bringing the people of both countries closer.\nThe two officials discussed the expansion of the Road to Makkah project to other cities in order to facilitate the maximum Hajj pilgrims, with Ambassador Al-Malki announcing that the designated airport terminal would be handed over to Saudi officials for the project on April 25.\nAmbassador Al-Malki congratulated Senator Mehmood on his appointment and expressed his best wishes, describing him as a long-time and reliable friend of Saudi Arabia.\nHe assured the minister of all possible cooperation from the Saudi government in facilitating the Hajj pilgrimage for Pakistani pilgrims.\nMinister Mehmood, for his part, emphasized that under the mission of his predecessor, Mufti Abdul Shakoor, it was his first priority to provide the best facilities to Pakistanis.\nThis commitment to ensuring a smooth and hassle-free Hajj experience for Pakistani pilgrims is a testament to the government’s vision for promoting religious harmony and facilitating religious practices in the country.\nThe meeting between the minister and the Saudi envoy highlights the strong and enduring ties between the two countries and their shared commitment to serving the Islamic community.",
  "retrievedAt": "2025-08-11T08:19:46.301Z"
}
