{
  "title": "Speakers demand women-led solutions for climate justice",
  "link": "https://www.app.com.pk/national/speakers-demand-women-led-solutions-for-climate-justice/",
  "date_published": "2023-04-18T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):Minister for Climate Change Senator Sherry Rehman, said Pakistan was at the frontlines of climate change and a climate emergency should be declared in Pakistan.\nSpeaking at a seminar organized at a local hotel by Aurat Foundation under the JAZBA program, she said Pakistan was at the frontlines of climate change and there should be a climate emergency declared in Pakistan.\nSenator Sherry Rehman said women were better consumers of nature, they have very little to work with and have very low disposable incomes and it is the women who make the wheels of our agriculture and economy turn.\nShe added that women were responsible for running a household but yet these numbers do not show up in the official data.The seminar included representation from all the major political parties as well as participation from the disabled and transgender community. It also included civil society organizations, women political workers, academia and media.\nThe welcome remarks at the opening of the seminar were given by Naeem Mirza, Executive Director Aurat Foundation. He welcomed all the participants to the seminar and said that climate change was actually global warming.He said that we should aim to focus our energies on combating climate change. He said that major contributors towards carbon gas emissions come from two countries, 29% from China and 31% from the USA.\nDr. Aliya Hashmi Khan, a retired professor of Economics and former Dean Faculty of Social Sciences, Quaid-i-Azam University and who also serves as a member of the general body of AF, spoke next. She said that over the years Aurat Foundation’s work has expanded in a number of different directions but Climate change is not being taken seriously in the context of gender.\nShe cited the labour force statistics and said that if the total employed women in Pakistan then 68% work in the agriculture sector. Agriculture was not a homogenous sector but it also includes livestock as well.Women were not recognized as agriculture workers in the labour force statistics and they do not receive their due social protection due to this. She said that it was even more important for Pakistan to recognize the women who work in the agriculture sector.\nThe most important message coming out from today’s deliberation was collecting periodic and updated information and data, especially on women working in agriculture and related activities. Labour force classifies women as an employee but there was no chamber for agricultural self-employed people and there is no women representation to speak about this fact.\nAt the end of her brief talk, she said we cannot solve the issues of injustice without looking at a holistic picture and this report is very important in this regard since it talks about inter-government partnerships, partnerships with the donor community and also of the movements women are engaged in.\nSimi Kamal, researcher and environmentalist presented the key findings of the research report. Her presentation was titled ‘Women at the Forefront of Climate Action’. She said that this report was more of a think piece and aims to highlight major factors\nShe said the booklet was divided into five sections and starts from the basic concept of climate change, current global institutional architecture for climate change, the impact of climate change in Pakistan and policy response, and the final section talks about developing the platforms for climate action led by women.\nShe said the time has come for women to take over the task of rebuilding the earth and its resources for a safer climate, equitable living conditions and environmental justice. She further added that global economies are failing to produce economic, environmental and social justice for people and planet Earth and said that the current mantra of ‘build back better’ will never deliver until we challenge the current capitalist and development paradigms of perpetual growth in a finite world.\nKamal said that moving to a global economy based on zero growth and eventual de-growth seems essential to severely curtail and then end fossil fuel emissions. She said that almost 30 million people have been affected by the recent floods in Pakistan.\nShe said that the way forward includes long-term, medium-term and short-term measures and actions. She said that demonstration of political will by federal & provincial governments should be a priority. In the medium term, we need to make the water ministry and the flood commission more effective, changing the narrative around women and climate change as well as developing an extensive training program on ecosystem-based adaptation.\nIn the very short term, we need to be able to know globally but act locally. One way to mitigate climate change is by putting women on key committees as well as developing programs for selected climate-vulnerable areas in different geographical zones.\nAmbassador Shafqat Kakakhel, Chairperson Board of Governors SDPI, praised the researcher for producing a very useful booklet on climate change and how to deal with it.\nHe said that the short, medium and long-term measures given in the report are all achievable and he hopes that Pakistan can summon the political will and mobilize the resources in order to achieve this task.\nKim Campbell, former Prime Minister of Canada, said we need to create strong partnerships among national and international actors focused on climate change. She said that it is a part of her organization, Club de Madrid’s main aims and objectives.\nLuke Myers, Counsellor, Development and Head of Cooperation, Canadian High Commission, Islamabad said that today’s event is important to highlight the challenges Pakistan’s women face in their fight against climate change. He said that it is not a competition that which country is among the worst hit with regards to climate change since we are all facing extreme weather events.\nDr. Shahida Rehmani, MNA and Secretary Women’s Parliamentary Caucus Pakistan, said that this is a very important subject and applauded the efforts of Aurat Foundation in organizing this seminar. She praised the qualities of the minister of climate change and said that Pakistani women are not behind anyone.\nIrfan Mufti, Team Lead SAP-PK, said that the visuals and optics of this issue are daunting and that we have reached an incredible level. He said that we need to fight for our right’s share within the international arena and continue our battle against climate change.",
  "retrievedAt": "2025-08-11T08:19:45.517Z"
}
