{
  "title": "Minorities for making Population Census process all-inclusive",
  "link": "https://www.app.com.pk/national/minorities-for-making-population-census-process-all-inclusive/",
  "date_published": "2022-10-16T13:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): The representatives of different religious minorities have urged the Pakistan Bureau of Statistics (PBS) to ensure proper representation of their youth in data collection for an all-inclusive population census.\nChairman One-man Commission on Minority Rights (OMC) Dr Shoaib Suddle presided over a meeting with the PBS officials and the representatives of minorities to ascertain the latest status and plan of the ensuing population census, an official of the OMC told APP while sharing the recent update on the meeting.\nThe OMC chairman briefed the participants about the purpose of the meeting which mainly related to sharing of concerns of minority communities in relation to their lack of participation in, and certain reservations about the 2017 Census data.\nAfter listening to the participants’ suggestions, the Director General (Admin) of PBS agreed to get the following points considered:\nInclusion of different marginalized groups in the enumeration teams, trainers and entire process of data collection and data processing; sensitizing the enumerators on cultural, caste and religious factors, so that they fill the census form correctly; train and instruct the relevant staff so that the entire population with its religious, ethnic, caste, gender or racial identity etc., was reflected in the results.\nMoreover, the minorities’ representatives demanded real-time transferring of data from the field to the main system without any data losses; effective awareness campaigns be launched through electronic and print media regarding the registration process; online registration facility be provided so that people having access to internet may avail this facility; and places of worship should be used for awareness purposes.\nThe DG (Admin) also agreed to address the concerns of minorities at district-level and below to educate people on the importance of census; and issue cards to civil society groups to facilitate the enumeration process, while mobilizing local civil society organizations and volunteers to assist enumerators particularly in the areas with minority settlements.\nMoreover, the PBS officials concurred said that the non-governmental organisations and community based organisations should be encouraged to launch awareness campaign on the significance of the population census.\nThe minorities also highlighted to ensure two separate categories of ‘Hindu Jati’ and ‘Schedule Caste Hindu’ be included in the new census, as the absence of those had led to data distortion in the previous censuses. The results of the census be shared at all levels (Union Council, Tehsil and District) in order to build confidence among all sections of the populace, they added.\nIt was also agreed that the PBS would engage enumerators other than the government servants from within the educated youth, both male and female.\nThe post-activity report on pilot census which was held in 32 districts of Pakistan in August 2022 would be shared with the OMC and other stakeholders, and the schedule of the next Council of Common Interests (CCI) meeting would also be shared with the Commission, the PBS officials agreed.\n“At least 5% enumerators and other work-charge employees may be engaged in line with the minority quota policy of the government and the decision of the Supreme Court. Accuracy of number of family members at each household may be ensured,” the representatives proposed.\nThey also suggested for census data be collected separately for each minoritycommunity and should not be lumped in “Others” category, whereas the nomenclature of each minority community should be used in the census questionnaire and other documents as those communities liked to be identified.\nFor instance, the ‘Isaie’ (Christian) be called ‘Masihi’. It was also highlighted that PBS should improve interaction with civil society, media, and minority groups on regular basis.\nDuring the meeting, it was revealed that the PBS planned to start the Census by December 2022 or January 2023. “The schedule of activities when finalized may be given wide publicity and also shared with the OMC,” the meeting participants demanded.\nThe OMC chairman appreciated the participants for their candid input and hoped that the PBS would taking necessary steps.\nThe meeting was participated by Judge, Shariah Appellate Bench, Supreme CourtDr Khalid Masood, and renowned social and human rights activists.",
  "retrievedAt": "2025-08-11T15:44:05.691Z"
}
