{
  "title": "President directs Silk Bank to refund Rs 200,000 with profit to bank fraud victim",
  "link": "https://www.app.com.pk/national/president-directs-silk-bank-to-refund-rs-200000-with-profit-to-bank-fraud-victim/",
  "date_published": "2022-10-16T09:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): President Dr. Arif Alvi has upheld a decision of the Banking Mohtasib (BM) and directed the Silk Bank Ltd (SBL) to refund the bank account of a fraud victim with Rs 200,000 along with the remaining profit till the date the amount is credited to his bank account.\nThe President said Silk Bank had committed maladministration by failing to appoint honest officials at its bank branch and unjustly withholding the profit amount.\nThe President gave these directions while rejecting a representation of Silk Bank against a decision of BM in a case where a citizen of Multan, Muhammad Shafiq, the complainant, had invested Rs 200,000 in Term Deposit Receipt (TDR) with the bank, however, he was only paid profit for six months and when he went to withdraw the remaining profit from his account, he was informed that his TDR was fake and he had been hoodwinked by the ex-Branch Operations Manager.\nThe President in his decision held that since the complainant had produced the original TDR which bore the bank’s logo, duly stamped and signed by the ex-branch operations manager, the bank was responsible for any document signed by its employee on purportedly bank’s stationery and stamp of the bank.\nHe added that there was no litmus test for the general public to differentiate between the original and fake stationery of the bank.\nThe President held that the bank’s contention, that profit amounts of six months were credited in the complainant’s account through fund transfers from multiple accounts of the customers and not from the bank’s payable account as normally done, carried no weight as a customer was usually satisfied when monthly profit was credited in his account.\nHe said that it was not the duty of the customer to scrutinize the records and internal processes of a bank and to ascertain whether profit was credited in his account by the bank by routing through the bank’s books and proper vouchers were passed.\nThe President said that the bank was shifting responsibility to the complainant in order to cover its own internal lapses and controls.\nHe observed that the bank had admitted that the ex-branch manager had signed the said TDR and had committed fraud and had been terminated from the bank’s service in a fraud case.\nHe added that it was a well-settled principle of “vicarious liability” that an employee was liable for the loss caused to a customer through the wrongful act of his employee in the course of the employer’s business.\nThe President concluded that the appointment of vigilant bank officials/officers and honest and professional staff was the responsibility of the bank and not of the complainant, who had posed his trust in the bank.\nHe added that the bank was the custodian and trustee of the hard-earned money of the account holder. “The bank official was there in the bank duly posted by the management, and there was unimpeachable evidence of the commission of fraud by the bank official in the bank branch,” he stated.\nThe President, therefore, rejected the bank’s representation as the bank could not escape liability in a case of this kind when the commission of fraud was established and admitted. “It is a case of wrongdoing and maladministration by the bank officials. The bank is, therefore, responsible to make good the loss of the complainant without further delay,” the President added.",
  "retrievedAt": "2025-08-11T15:44:09.520Z"
}
