{
  "title": "Verdict reserved on fertiliser firms’ pleas - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) has reserved its verdict in a case concerning fertiliser prices, following the conclusion of arguments.\n\nJustice Saman Rifat Imtiaz presided over the hearing of a petition, filed by several fertiliser companies, challenging the authority of the Competition Commission of Pakistan (CCP).\n\nLegal representatives from both the fertiliser firms and the CCP appeared before the court.\n\nAt the outset of the proceedings, counsel for the fertiliser companies contended that the costing information requested by the CCP is confidential in nature and, therefore, cannot be disclosed. They argued that sharing such proprietary data would compromise the companies’ competitive positions.\n\nIn response, the CCP representative stated that under the regulatory framework established by the Securities and Exchange Commission of Pakistan, all companies are obligated to submit cost audit reports.\n\nHe highlighted that fertiliser companies already provide this data to the SECP, questioning how the same information could be withheld from another regulatory authority.\n\nThe case stems from an ongoing investigation by the CCP into a significant surge in fertiliser prices. As part of its probe, the Commission requested detailed cost information from fertiliser companies. Rather than complying, the companies approached the IHC and obtained a stay order.\n\nThe CCP, in its defence, cited the Supreme Court ruling in a previous case involving Dalda Foods, where the apex court affirmed the Commission’s jurisdiction to monitor markets, demand information, and conduct investigations.\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/191057534327548.png",
  "retrievedAt": "2025-08-25T14:26:19.536Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905183/verdict-reserved-on-fertiliser-firms-pleas",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:41:33.000Z"
}
