{
  "title": "Unbeaten Pakistan wrap up Women’s World Cup qualifiers with 7-wicket win over Bangladesh - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan finished the ICC Women’s World Cup 2025 Qualifiers at the top of the table with a domineering win over Bangladesh by seven wickets in Lahore on Saturday to remain unbeaten in the tournament.\n\nPakistan had already booked their spot for the World Cup to be held later this year in India on Thursday, courtesy of their bowlers, who had once again stepped up to defend a below-par score of 205 against Thailand.\n\nPlaying in their final One-Day International (ODI) encounter of the tournament, the Green Team restricted Bangladesh to a paltry 178-9 in the first innings at the Lahore City Cricket Association ground.\n\nIn the second innings, the hosts reached the target with ease, getting over the line with more than 10 overs to spare, with player of the match Muneeba Ali scoring 69 to set up the chase.\n\nPakistan’s bowlers put in yet another memorable performance as Bangladesh could only manage 178-9 on a track that wasn’t as difficult to bat on.\n\nBangladesh got off to a rocky start when they lost their openers for low scores courtesy of Pakistan captain Fatima Sana and spinner Sadia Iqbal, both continuing with their terrific form with the ball throughout the tournament.\n\nFargana Hoque fell for a seven-ball duck as Fatima got her with a ball that came in after pitching.\n\nBangladesh were 21-3 at one stage after they lost captain Nigar Sultana to another inducker by Fatima.\n\nBangladesh veteran bats Ritu Moni and Fahima Khatun were the mainstays for their side, both scoring 40+ scores to rescue their team from a precarious situation at one stage in the innings.\n\nSadia Iqbal was the pick of the bowlers for the hosts, getting three wickets for 28 off her 10 overs with her wily left-arm spin.\n\nAfter Pakistan lost opener Shawaal Zulfiqar on just the second ball of the innings, Muneeba starred with the bat again for Pakistan, with an innings of 69 runs.\n\nThe southpaw opener hit eight sublime boundaries during her stay at the crease and ensured Bangladesh never made inroads into the middle order.\n\nThe veteran Sidra Amin chipped in with another substantial innings of 37, following up on her 80 in the last match.\n\nPlayer of the match in the encounter against Scotland, the big-hitting Aliya Riaz was the batter who took the Green Team home.\n\nShe remained unbeaten on 52, hitting the winning runs for the hosts as they ended the tournament with a perfect scoreline of five wins and zero losses.\n\nThis was despite the Green Team not having the best of days in the field as they dropped multiple catches, allowing Bangladesh to get to a fighting total after they won the toss and elected to bat.\n\nSkipper Fatima had led the way for Pakistan women as they beat Thailand by 87 runs in their fourth encounter of the qualifiers on Thursday.\n\nShe was the player of the match after playing a captain’s knock of 62 not out, supported by veteran bat Sidra Amin from the other end. She then picked up three wickets as well in the second innings to help bowl out Thailand for 118 runs.\n\nThe Pakistan skipper, speaking after the match had said, “Our main aim was that we want to play the World Cup — and the way our players were supporting each other, with our self-belief getting stronger after the camp, that really helped us achieve this win.”\n\nThe six-team ICC event — which includes Bangladesh, Ireland, Scotland, Thailand and West Indies alongside hosts Pakistan — featured a single-league round-robin format with the matches taking placeat the Gaddafi Stadium and LCCA ground in Lahore.\n\nThe tournament decided the two qualifiers for the 2025 Women’s World Cup to be held later this year in India.\n\nPakistan, however, will be playing their matches at a neutral venue after a “fusion” model was decided upon following India’s refusal to play their matches in Pakistan for the ICC Champions Trophy earlier this year.\n\nSquads\n\nPakistan: Shawaal Zulfiqar, Muneeba Ali, Sidra Amin, Aliya Riaz, Natalia Pervaiz, Sidra Nawaz (wicket-keeper), Fatima Sana (captain), Rameen Shamim, Diana Baig, Sadia Iqbal and Nashra Sandhu.\n\nBangladesh: Fargana Hoque, Dilara Akter (wicket-keeper), Sharmin Akhter, Nigar Sultana (captain), Ritu Moni, Nahida Akter, Fahima Khatun, Shorna Akter, Jannatul Ferdus, Rabeya Khan and Marufa Akter.\n\nSeparately, Pakistan Cricket Board (PCB) Chairman Mohsin Naqvi said the women’s side would not travel to the World Cup in India “as per the agreement”, and the hosts would decide the venue for Pakistan’s matches.\n\n“It will happen as per the agreement […] But wherever it is, our team is ready to play,” Naqvi said while talking to reporters in Lahore.\n\n“It is an agreement and it would work accordingly,” the PCB chairman said.\n\nTalking about the improvement from the women’s side, Naqvi said, “Nothing bears results in a day. Small changes kept happening, and after that, they got on the right track.”\n\n“If the team has gelled together and plays together as a team, then this is the result that comes,” he said.\n\nResponding to a question about his promise of rewarding the players, the PCB chief said, “They will definitely be given their reward. That is their right.”\n\nAnswering a question regarding a preparatory series for the women’s side for the World Cup, the PCB chief said that they were planning on it.\n\nHe said similar changes would also take place across all teams, adding that they would get the right results after making such small changes.\n\nHe said that Pakistan coach Aqib Javed was appointed as the board needed a coach on an immediate basis.\n\n“It was a temporary arrangement, we will act on it in the coming days,” he said.\n\nAdditional reporting by Abdul Ghaffar.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/19172643c7113e2.jpg",
  "retrievedAt": "2025-08-25T14:25:54.948Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905249/unbeaten-pakistan-wrap-up-womens-world-cup-qualifiers-with-7-wicket-win-over-bangladesh",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T08:09:31.000Z"
}
