{
  "title": "Sindh CM says controversial canals project to die down before budget - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sindh Chief Minister Murad Ali Shah on Saturday said that the controversial canal project would die down before the 2025-26 federal budget.\n\nOn February 15, Punjab Chief Minister Maryam Nawaz and Chief of the Army Staff Gen Asim Munir inaugurated the ambitious Cholistan project to irrigate south Punjab’s lands amid public uproar and strong reservations in Sindh. The Sindh Assembly also passed a unanimous resolution against the project in March.\n\nThe past few months have seen nationwide protests from political parties and civilians against the proposed canal project. The canals controversy has deepened with Murad strongly criticising the Punjab government for increasing water being diverted to the TP Link Canal. The Indus River System Authority (Irsa) claimed to have taken all decisions as per the law.\n\nThe CM was responding to questions from journalists in Sindh’s Saeedabad area when he claimed that the project would be shelved or halted before the federal budget.\n\n“Sindh’s people know that only PPP can stop this project,” he said, adding that approval of this canal was given by Irsa during the tenure of the caretaker government.\n\n“President Asif Zardari made it clear in his address to the joint session of parliament that he could not support canals; thus, all conspiracies failed,” Murad added. “The April 18 public meeting in Hyderabad division was larger than the previous rally staged by the party at the same ground.”\n\nMurad announced that a public gathering would be held in Sukkur on April 25, followed by gatherings in other divisional headquarters.\n\n“The party will hold public rallies against the canals in Shaheed Benazirabad, Mirpurkhas and Karachi,” the CM was quoted as saying.\n\nCalling the canal project a conspiracy against the PPP, Murad echoed party chairman Bilawal Bhutto-Zardari and threatened that if the decision to build the canals is not reversed, then “we will withdraw support from the government”.\n\nAccording to the statement, the CM further inferred that some people visited the canal site and falsely claimed that work was underway.\n\n“I sent people to the site [in Cholistan] quite some time back and had a complete survey conducted,” he said. “I have sent some more people [to the canal area]. A model of 400 to 500 feet was prepared, but even this model was incomplete, as they (the government) were trying to show they were working on the canal.\n\n“This work has been paused since the July-August period. Showing a completed stretch of 100 or 200 metres out of 300 kilometres to claim that the project is underway is an attempt to mislead people.”\n\nHe added that as long as PPP was present there, the canals would not be built without approval.\n\n“Such approval will never be given,” the CM maintained. “Asif Zardari and Bilawal Bhutto Zardari will not let this anti-Sindh project materialise.”\n\nAnswering a question, Murad said that had the PPP stood with the government on the canal issue last June, “then why would the CM have approached the Council of Common Interests (CCI)? Why did Sindh oppose the project in the Central Development Working Party meeting?”\n\nSpeaking on Geo News programme ‘Naya Pakistan’, PML-N leader Rana Sanaullah said that the PPP’s opposition to the canals was just propaganda and that its reason for pursuing the issue was for political gain.\n\n“There will be no work on government projects without consensus,” Sanaullah said. “The PPP is taking a nationalist approach by saying ‘they’re taking Sindh’s water, it’s an attack on the PPP’.\n\n“The party needs to take a hard stance since they have never gotten the mandate from their own people,” he said. “But the canal itself is not their reason for protesting, their reason is the People’s Party.”\n\nHe added that the PPP has no issue with five of the six canals.\n\n“They have no issue with five of the canals, their only problem lies with the Cholistan canal,” he explained. “Their opposition to the project is just propaganda. Will the canals irrigating Thar come from Punjab?”\n\nThe adviser emphasised that the canals would irrigate millions of acres of land lying barren in Thar.\n\n“The Green Pakistan initiative is our future,” he said. “Hundreds of thousands of acres will be irrigated, and misery will be alleviated.”\n\n“If you want to see Pakistan prosper and become better, then we need to counter the blackmailers who are using propaganda to further their political aims,” he added.\n\nWhen asked why he was discouraging people from taking his coalition ally’s statements at face value, Sanaullah replied that the project would be consensus-driven.\n\n“Whenever the project starts, we will sit down and try to find a consensus,” he said. Asked about why the government doesn’t want to hold a CCI meeting for the project, Sanaullah said there needs to be consensus beforehand and expressed concern that the plans would be “bulldozed”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/19190859b66d962.jpg",
  "retrievedAt": "2025-08-25T14:25:51.585Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905276/sindh-cm-says-controversial-canals-project-to-die-down-before-budget",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T18:21:26.000Z"
}
