{
  "title": "Ireland women edge Scotland in thriller at World Cup Qualifiers - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Laura Delany’s unbea­ten 57-run innings under pressure guided Ireland to a heart-stopping one-wicket victory agai­nst Scotland in their final ICC Wom­en’s World Cup Qualifier league match here at the Gaddafi Stadium on Friday.\n\nIreland were already out of contention to qualify for the main round but their victory also diminished little hopes Scotland might have had of progression.\n\nChasing 269, Ireland’s chase flickered between hope and chaos. Openers Gaby Lewis (61 off 72 balls, nine fours) and Sarah Forbes (55 off 66, six fours) launched a fiery 109-run stand in 19.5 overs. But after their departures, the middle order crumbled to 180-4 by the 35th over.\n\nDelany entered at this critical juncture, steadying the innings even as wickets tumbled. With Ireland reeling at 209-7 in the 43rd over, she partnered with Jane Maguire (28) in a 53-run eighth-wicket stand, inching closer to the target.\n\nIn a late twist, Maguire fell on the last ball of the 49th over and drama peaked in the final over. Needing just seven runs, the responsibility to take Ireland over the line fell on the shoulders of tail-ender Ava Canning, who had to face pacer Katherine Bryce.\n\nCanning, 21, showed nerves of steel, hitting Bryce for a boundary on the very first ball but the 27-year old undau­nting pacer dismissed the batter on the next ball to keep Scotland’s hopes alive.\n\nLast batter Cara Murray came out to face the final delivery with two runs remaining. However, Bryce could not hold her nerves as she bowled two leg-byes, sealing Ireland’s nail-biting win.\n\nDelany’s 63-ball 57, including four boundaries, anchored the chase.\n\nEarlier, Scotland’s Bryce starred with an unbeaten 131 off 137 balls, an innings that was studded with 14 boundaries and two maximums, rescuing her side from 19-3 after a rain-delayed start.\n\nShe forged key partnerships, 62 with Ailsa Lister (27), 65 with Katherine Fraser (33) and 51 with Rachel Slater (13 not out) to post 268 for the loss of seven wickets.\n\nRight arm pacer Canning took three wickets while 24-yearold leg spinner Murray removed two Scottish batters. Bryce was equally impressive with the ball, claiming three wickets while giving away 49 runs, but her heroics fell short.\n\nOn Saturday, Pakistan, who have already qualified for the World Cup, will take on Bangladesh while West Indies face winless Thailand.\n\nIn the tournament standings, Pakistan, unbeaten, are on top with eight points, while Bangladesh (six points) and West Indies (four points) vie for the last available spot.\n\nIreland and Scotland end their campaigns with four points each. Thailand are at the bottom.\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/191141066afe6ad.jpg",
  "retrievedAt": "2025-10-12T02:37:11.217Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905168/ireland-women-edge-scotland-in-thriller-at-world-cup-qualifiers",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:41:40.000Z"
}
