{
  "title": "India plans to ease nuclear liability laws to attract foreign firms - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: India is planning to ease its nuclear liability laws to cap accident-related penalties on equipment suppliers, three government sources said, in a move mainly to attract US firms that have been holding back due to the risk of unlimited exposure.\n\nThe proposal by Prime Minister Narendra Modi’s government is the latest step to expand nuclear power production capacity by 12 times to 100 gigawatts by 2047 as well as provide a fillip to India in trade and tariff negotiations with the US.\n\nA draft law prepared by the department of atomic energy removes a key clause in the Civil Nuclear Liability Damage Act of 2010 that exposes suppliers to unlimited liability for accidents, the three sources said.\n\nIndia’s atomic energy department, the prime minister’s office and the finance ministry did not respond to requests seeking comment. “India needs nuclear power, which is clean and essential,” said Debasish Mishra, chief growth officer at Deloitte South Asia.\n\n“A liability cap will allay the major concern of the suppliers of nuclear reactors.” The amendments are in line with international norms that put the onus on the operator to maintain safety instead of the supplier of nuclear reactors.\n\nNew Delhi is hoping the changes will ease concerns of mainly US firms like General Electric Co and Westinghouse Electric Co that have been sitting on the sidelines for years due to unlimited risks in case of accidents.\n\nAnalysts say passage of the amended law is crucial to negotiations between India and the US for a trade deal this year that aims to raise bilateral trade to $500 billion by 2030 from $191 billion last year.\n\nModi’s administration is confident of getting approval for the amendments in the monsoon session of parliament, set to begin in July, according to the sources. Under the proposed amendments, the right of the operator to compensation from the supplier in case of an accident will be capped at the value of the contract. It will also be subject to a period to be specified in the contract.\n\nCurrently, the law does not define a limit to the amount of compensation an operator can seek from suppliers and the period for which the vendor can be held accountable.\n\nLaw grew out of Bhopal disaster\n\nIndia’s 2010 nuclear liability law grew out of the 1984 Bhopal gas disaster, the world’s deadliest industrial accident, at a factory owned by US multinational Union Carbide Corp in which more than 5,000 people were killed.\n\nUnion Carbide agreed to pay an out-of-court settlement of $470 million in damages in 1989. The current liability law effectively shut out Western companies from a huge market, and also strained US-Indian relations since they reached a deal on nuclear cooperation in 2008.\n\nIt also left US firms at a disadvantage to Russian and French companies whose accident liability is underwritten by their governments. The draft law also proposes a lower liability cap on small reactor operators at $58 million, but is unlikely to alter the cap for large reactor operators from the current level of $175 million, the three sources said.\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:36:31.865Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905206/india-plans-to-ease-nuclear-liability-laws-to-attract-foreign-firms",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:41:47.000Z"
}
