{
  "title": "Privatisation Commission board okays transaction structure for Roosevelt Hotel - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Privatisation Commission’s board on Friday finalised recommendations for the transaction structure of New York’s Roosevelt Hotel, for presentation to the Cabinet Committee on Privatisation (CCoP).\n\nThe government intends to develop the historic site in the heart of the Big Apple as an iconic structure with modern features.\n\nThe board meeting, chaired by Adviser to the Prime Minister on Privatisation, Muhammad Ali, discussed various transaction structure options developed by the financial adviser, a consortium led by Jones Lang La Salle Americas Inc (JLL) for the privatisation of the PIA-owned property.\n\nJLL was engaged by the Privatisation Commission in February 2024 for the development of joint ventures of the Roosevelt Hotel.\n\nThe privatisation commission has the mandate to appoint financial adviser to undertake the envisaged leasing of Roosevelt site for setting up a joint venture project for prospective mixed-use development, through the best-suited mode as delineated in the Privatisation Commission Ordinance, 2000.\n\nThe privatisation board also decided to cancel the bidding process of Zarai Taraqiati Bank Limited (ZTBL) due to bids being on the higher side and sought fresh advertisement for hiring the services of a financial adviser.\n\nThe board also gave approval of a transaction committee for the private sector participation in three power distribution companies: Faisalabad Electric Power Supply Company (Fesco), Gujranwala Electric Power Supply Company (Gepco) and Islamabad Electric Power Supply Company (Iesco).\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:37:08.979Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905182/privatisation-commission-board-okays-transaction-structure-for-roosevelt-hotel",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:41:33.000Z"
}
