{
  "title": "Russia’s Putin declares unilateral Easter ceasefire in Ukraine - World - DAWN.COM",
  "author": null,
  "content": "Russian President Vladimir Putin declared a unilateral 30-hour Easter ceasefire in Ukraine on Saturday, after Washington said it could abandon peace talks within days unless Moscow and Kyiv show they are ready to stop the war.\n\nPutin ordered fighting to stop as of 6pm Moscow time (1500 GMT) on Saturday until midnight on Sunday night.\n\n“Based on humanitarian considerations … the Russian side announces an Easter truce. I order a stop to all military activities for this period,” Putin told Valery Gerasimov, Chief of Russia’s General Staff, at a meeting televised on Saturday.\n\n“We assume that Ukraine will follow our example. At the same time, our troops should be prepared to repel possible violations of the truce and provocations by the enemy, any aggressive actions,” Putin added.\n\nBut shortly after the announcement, around an hour before it was due to take effect, air raid sirens rang out in Kyiv.\n\nUkraine’s President Volodymyr Zelensky dismissed the proposal as “yet another attempt by Putin to play with human lives”. As of 45 minutes before the truce was meant to start, Ukrainian planes were repelling Russian air strikes, Zelensky said in a post on X.\n\n“Shahed drones in our skies reveal Putin’s true attitude toward Easter and toward human life,” he said, referring to Iranian-made attack drones used widely by Russia in the war to attack Ukrainian cities far from the front.\n\nThe Russian Defence Ministry said its troops had been instructed about the ceasefire and would adhere to it, provided it was “mutually respected” by Ukraine.\n\nMeanwhile, in a statement by the foreign ministry, Britain urged Russia to commit to a full ceasefire in Ukraine, “not just a one-day pause”.\n\n“Ukraine has committed to a full ceasefire. We urge Russia to do the same,” a British foreign ministry spokesperson said, adding that a pause would enable negotiations for a just and enduring peace.\n\n“Now is the moment for Putin to show he is serious about peace by ending his horrible invasion,” the UK Foreign, Commonwealth and Development Office said in its statement.\n\nUS President Donald Trump and Secretary of State Marco Rubio had said on Friday that the United States would walk away from efforts to broker a Russia-Ukraine peace deal unless there were clear signs of progress soon.\n\nKirill Dmitriev, an envoy for Putin who travelled to Washington this month, posted news of the ceasefire on X, adding: “One step closer to peace” and an emoji of a dove.\n\nTrump has vowed to bring a swift end to the war, while shifting US policy from firmly supporting Kyiv towards accepting Moscow’s account of the conflict.\n\nLast month, Ukraine accepted a proposal from Trump for a 30-day truce, which Moscow rejected; the sides agreed only to limited pauses of attacks on energy targets and at sea, which both accuse the other of breaking.\n\nPutin’s announcement comes a week after a Russian missile attack killed 35 people and wounded nearly 120 in the Ukrainian city of Sumy, including Christians heading to celebrate Palm Sunday.\n\nThat attack, the deadliest against civilians of the year so far, spurred Kyiv and its European allies to press Washington to take a tougher line towards Moscow.\n\nPutin has proclaimed unilateral pauses in fighting in the past with little impact on the battlefield, including a 36-hour proposed truce for Orthodox Christmas in January 2023, which Kyiv rejected.\n\nKremlin spokesman Dmitry Peskov said this week that some progress on a peace settlement had already been made but that contacts with Washington were difficult.\n\nRussia’s invasion of Ukraine in February 2022 has killed and injured hundreds of thousands of soldiers on both sides, displaced millions of Ukrainian civilians and reduced frontline Ukrainian cities to rubble.\n\nPutin has said repeatedly that he wants an end to the war, but has not retreated from his initial demands that Kyiv cede all territory he claims to have annexed and be permanently barred from joining a defence alliance with the West.\n\nKyiv says those terms would be tantamount to surrender and leave it undefended from future Russian attacks.\n\nPutin told Gerasimov on Saturday that Russia welcomed efforts from the US, China and Brics countries to find a peaceful settlement to the conflict.\n\nSeparately, Russia and Ukraine both confirmed a swap of prisoners of war on Saturday, mediated by the UAE. Each released 246 prisoners, while a further 31 wounded Ukrainians were transferred in exchange for 15 injured Russian soldiers, the Russian defence ministry said.\n\nThe European Union reacted cautiously to Putin’s declaration of a unilateral 30-hour Easter ceasefire, saying Moscow could stop the war immediately if it wanted to.\n\n“Russia has a track record as an aggressor, so first we need to see any actual halt of the aggression and clear deeds for a lasting ceasefire,” said Anitta Hipper, the European Commission’s lead spokesperson for foreign affairs and security.\n\nHipper added that it had been more than a month since Ukraine agreed to an unconditional ceasefire.\n\n“Russia could stop this war at any moment if it really wanted to… We continue to support Ukraine for a long, just and comprehensive peace.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/192200126fa442d.jpg",
  "retrievedAt": "2025-08-25T14:25:51.586Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905294/russias-putin-declares-unilateral-easter-ceasefire-in-ukraine",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T17:09:58.000Z"
}
