{
  "title": "Karachi’s JPMC doctors boycott OPDs after colleague beaten by patient’s relatives - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Young doctors at the Jinnah Postgraduate Medical Centre (JPMC) on Friday boycotted the outpatient department (OPD) services in protest over an attack on their colleague by relatives of a patient on Thursday night.\n\nA teenage patient, Nisar Ahmed, was brought to the JPMC by his relatives on April 16. He was admitted to ward-17 but a day later, his condition deteriorated after which the doctors recommended shifting him to the medical ICU. However, no ICU beds were reportedly available due to which a dispute broke out between the doctors and the relatives, during which Dr Shewaram was physically assaulted.\n\nIn the meantime, the patient died, which prompted the relatives to hold a demonstration. They carried the coffin of the deceased and protested outside Saddar police station.\n\nDIG-South Syed Asad Raza told Dawn that the relatives of the patient were workers of the Peoples Students Federation. He said JPMC’s security in-charge, Col (retd) Khalid, had engaged the protesters for negotiations.\n\nThe police had registered an FIR against doctors over “negligence” while another FIR was lodged against the protesters on complaint of JPMC deputy director Dr Mohammed Yaseen.\n\nHospital administration, family of teenager who died lodge FIRs against each other\n\nJPMC spokesperson Jahangir Aijaz Durrani told Dawn that the patient had been admitted at ward-17 for the last two days. His health deteriorated and a request was made by doctors to all ICUs for referring him there for further treatment. In the meantime, the relatives took the patient to a medical ICU where no bed was available. Mr Durrani said there was one reserved bed but another patient was being treated on that.\n\nThe Young Doctors Association (YDA) condemned the “brutal attack” on Dr Shewaram and boycotted the OPD on Friday.\n\nIt also blamed the JPMC administration and the security department for failing to ensure safety of doctors and unavailability of ICU beds.\n\nIn a statement, the YDA said the doctor was attacked by a group of 10-15 people, alleging that the health workers’ personal belongings like cell phones, cash and gold rings, etc were also stolen by the attackers.\n\n“The YDA JPMC holds the administration of JPMC, particularly the security department, responsible for this incident due to negligence in ensuring a safe working environment and the unavailability of ICU beds,” said Dr Mehboob Ali Noonari of the YDA.\n\nThere are only 9 beds in the medical ICU of the JPMC and despite having a 30-bed surgical ICU, only 7-8 beds are functional, leading to such unfortunate incidents, added the statement.\n\nFurthermore, the YDA strongly condemned the lodging of an FIR against the doctors, saying that the actual “culprits” should be held accountable.\n\nThe YDA demanded lodging of an FIR and arrest of the suspects involved in the incident, suspension of Saddar SHO and suspension of FIR against doctors, enhanced security for doctors and provision of additional beds in ICUs to manage critical patients effectively.\n\nThe YDA warned that if their demands were not met, they would continue the boycott and plan further actions accordingly.\n\nFIRs\n\nJPMC’s deputy director Dr Yaseen lodged an FIR against 12 persons, stating that Dr Shewaram was beaten inside Ward-23 of the medical ICU. When he reached the spot, he called the police.\n\nThe FIR said the relatives carried the coffin of the patient and in order to “hide” their mistake, they resorted to beating the doctors. Therefore, the JPMC wanted a legal action against them. The police had invoked sections 337-A(i) (causing minor head injury), 147 (rioting), 148 (rioting, armed with a deadly weapon), 186 (obstructing a public servant in discharge of public functions), 427 (mischief causing damage), 34 (common intention) of the Pakistan Penal Code.\n\nAnother FIR registered on the complaint of Mir Murtaza said that his nephew, the patient Nisar Ahmed, was brought to the JPMC emergency on April 16 from Jamshoro from where he was shifted to ward-28 where he suffered breathing problems and doctors advised shifting the patient to Ward-7.\n\nWhen they shifted the patient to ICU while carrying the letter of the doctor concerned, around five doctors present there, including Dr Shewaram, continued talking with each other. The doctors asked him [the complainant] to go outside. However, when the patient’s health deteriorated, he came inside the ward where Dr Shewaram engaged in a heated argument with him. In the meantime, other doctors and the JPMC administration officials also arrived and ordered him to go outside.\n\nThe complainant alleged that Dr Shewaram did not admit his nephew despite having a bed and called the police who detain him [the complainant] at Saddar police station for two hours where he was later informed that the patient had expired. The complainant said he wanted an FIR against Dr Shewaram and others over charges of negligence. The police had invoked sections 319 (unintentional murder) and 304-A (causing death by negligence) of Pakistan Penal Code against the said doctor and others.\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:36:51.342Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905164/karachis-jpmc-doctors-boycott-opds-after-colleague-beaten-by-patients-relatives",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:45:05.000Z"
}
