{
  "title": "The freedom to fly solo - Newspaper - DAWN.COM",
  "author": null,
  "content": "“FEMINISM convinced women they could have it all. Now they’re 40, independent and crying in a very nice empty apartment.” So wrote Nandi on X.\n\nThe response was swift as the ‘feminists’ that Nandi was taking issue with responded. “See sis,” wrote one “I’d rather cry in an apartment which I own than in one which I can be kicked out because the man bought it.” Another wrote: “…if you have a very nice apartment of your own when you’re 40 in this economy, that’s a well-played game of life and the privilege to cry in that apartment, wow.”\n\nOne of the best responses (among a huge number of them) simply stated: “Funny how people blame feminism for women ‘crying’ in nice apartments, but never blame patriarchy for women crying in marriages, bedrooms and kitchens, they were told would complete them.”\n\nIt is true that the very word ‘feminism’ raises the hackles of many — including women — when it is used. Weighed down by the accrued moral and historical baggage of being associated with Westernisation, colonial dominance and white supremacy, it is easy to hold up a word as the progenitor of all that is wrong with gender relations in modern society.\n\nThis is particularly so in the South Asian context where the entrenchment of patriarchy is such that women are even more eager to shut down other women who are fighting for basic equality and respect at the hands of social, cultural and political institutions. Nothing, it appears, endears women to chauvinistic men more than the former’s amenability to criticising their own. Hating women together is the glue of many a relationship.\n\nThis X kerfuffle over the feminist contribution to female loneliness took place within a context where women are increasingly financially independent and living alone. Pakistan is far behind in this regard; its flailing economy is often subject to the vagaries of whatever political order is having its moment in the sun, and simply does not provide the volume of opportunities that would ensure a strong middle class.\n\nHowever, while one cannot see a mass upsurge in the numbers of financially independent women who can support themselves, their numbers are increasing even in Pakistan. The increase in urbanisation in recent years, along with educational opportunities for women, means that the financially independent and voluntarily single professional woman is no longer the oddity she once was.\n\nWomen in Pakistan grow up surrounded by the critical and toxic perspectives of everyone around them.\n\nSome of these women have taken to social media to chronicle what it is like to live alone as a woman in cities such as Karachi and Lahore. One of them, whom I watch regularly, begins every reel she posts on Instagram with a reminder that living by herself was always her dream. While she has not provided much of an explanation of why living by herself was her dream, it is not difficult to guess the reason.\n\nWomen in Pakistan grow up surrounded by the critical and toxic perspectives of everyone around them. As one of the respondents on X put it, the image of crying women is etched in our minds because women, by and large, still live a subservient and miserable existence pressed into the service of others. When one considers the drudgery of repetitive housework, the scolding of husbands and other relatives and the thanklessness of it all, it doesn’t take much to realise that living in an apartment alone is like a tropical beach vacation in comparison.\n\nA glimpse into the lives of women living alone in Pakistan also dispels the myth that being alone automatically means being lonely. Social media content about their lives reveals that they eat, sleep, cook and clean according to their own schedules and convenience. There is time to enjoy a cup of tea and one’s inner contentment and peace are not being constantly disturbed by the vagaries of other people’s moods, needs, and demands. Most women in Pakistan spend all their lives entrapped by these forces; naturally the few who can escape are grateful for the reprieve.\n\nThis is not to say that the world, like our friend Nandi on X, is not up in arms to criticise the increasing numbers of women living alone. The solitary woman of their imagination is financially comfortable but emotionally bereft, essentially crying alone. These sorts of statements are part of the sociocultural backlash against women having this kind of autonomy. Society does not look kindly on women who choose paths that are not the usual that have been prescribed for them, ie, marriage and kids and family maintenance. This interpretation of the solitary woman as a ‘bechari’ is popularised as an added burden to the other obstacles already put in their way.\n\nInterviews with women living alone in Pakistan reveal the problems they have renting apartments, getting cars fixed, and dealing with nosy neighbours and relatives. A woman living alone, after all, is a testament to the fact that women do not need men in order to live. And in a male-dominated society, where women are second-class citizens, such a testament is unacceptable in all circumstances.\n\nThe waves of change have a way of upending the status quo. The beginnings of change and the fact that there are Pakistani women out there who are living alone and are even willing to share how normal and enjoyable their experiences show that the old ways are slowly disintegrating.\n\nThis does not mean that all women should aspire to live alone for their entire lives. Instead, it shows that when the opportunity to live alone and independently presents itself, it can be looked at as an enjoyable and peaceful time of contentment and freedom.\n\nThe writer is an attorney teaching constitutional law and political philosophy.\n\nrafia.zakaria@gmail.com\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6802f02585214.jpg",
  "retrievedAt": "2025-10-12T02:37:28.239Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905223",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:37:43.000Z"
}
