{
  "title": "PSX ends the week with 414-point gain - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pak­istan Stock Exchange’s benchmark KSE-100 index largely traded in the positive zone throughout the trading session on Friday, buoyed by encouraging ma­­c­­r­o­economic indicators and strong corporate earnings.\n\nThe stock market ended the final trading session of the week on a positive trajectory, as the benchmark index closed with a gain of 414.45 points, or 0.35 per cent.\n\nThe session began with some negativity, as the index dipped to an intra-day low of 116,759.07 during early trading hours. However, investor interest returned later in the day, lifting the index to an intraday high of 117,888.13.\n\nDespite some late-session profit-taking, the KSE-100 index finally managed to close at 117,315.58.\n\nAccording to Topline Securities, the upward momentum was primarily driven by the highest-ever monthly current account surplus and a favourable movement in the Real Effective Exchange Rate.\n\nAccording to data released by the State Bank of Pakistan, the country posted a current account surplus of $1.195 billion in March compared to a $363 million surplus a year ago.\n\nThe KSE-100 index saw a significant boost from heavyweight stocks, with the top positive contributions coming from United Bank Limited, Lucky Cement Limited, Sazgar Engineering Works Lim­ited, Meezan Bank Limited and Systems Limited. Collectively, these five stocks added 913 points to the index.\n\nIn terms of traded value, Sazgar led the board with transactions worth Rs2.41bn, followed by Pak­istan State Oil at Rs2.26bn, Mari Petroleum Company Limited at Rs1.77bn, United Bank Limited at Rs1.74bn, and Lucky Cement Limited at Rs1.72bn.\n\nUBL continued to garner investor interest as it gained to close 9.57pc higher. This interest can be attributed to its recent announcement of results for January-March, in which the banking company posted its highest ever diluted earnings per share of Rs28.9 (up 126pc year-on-year).\n\nTotal traded volume for the day reached 422m sha­res, while the total traded value stood at Rs34.4bn.\n\nOn a weekly basis, the PSX posted a positive performance after having a massive negative last week due to the initiation of the tariff war, according to Insight Securities.\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6802e6a74b472.gif",
  "retrievedAt": "2025-08-25T14:26:21.138Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905185/psx-ends-the-week-with-414-point-gain",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:41:33.000Z"
}
