{
  "title": "NDMA warns tourists as severe weather expected today in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Rs550m allocated for protection against floods, river erosion and dam strengthening\n• Four filtration plants to address Cholistan water shortage\n\nISLAMABAD/LAHORE: As the National Di­­saster Management Authority (NDMA) issued another warning about severe weather conditions that are expected in parts of Punjab and Islamabad today, the Punjab cabinet committee on disaster management approved several schemes aimed at making Cholistan more climate-resilient.\n\nThe fresh weather advisory, issued by the National Emergencies Operation Centre (NEOC) of the NDMA, says that a westerly disturbance is likely to cause unstable weather across several regions, bringing heavy rainfall, thunderstorms, windstorms, and isolated hailstorms.\n\nThe NEOC has warned that heavy rain and strong winds may lead to the falling of weak trees and could cause temporary power outages. Windstorms and hail may damage poorly constructed buildings, rooftops, vehicles, and power infrastructure. Additionally, hailstorms could pose serious risks to standing crops.\n\nNDMA has advised everyone, including tourists, to monitor weather and road conditions, avoid unnecessary movement during heavy rain, and follow local safety instructions, especially in landslide-prone areas.\n\nThe authority continues to monitor the situation in real-time, and is coordinating with provi­ncial and district disaster management autho­ri­­ties to ensure prompt response and public safety.\n\nCholistan projects\n\nSeparately, the Punjab cabinet committee on disaster management has approved several schemes to combat climate impacts, as well as okaying the installation of water filtration plants in Cholistan.\n\nProvincial Health Minister Khwaja Salman Rafique chaired the meeting, held at the PDMA head office, which was also attended by Addi­tional Chief Secretary Ahmed Raza Sarwar and Punjab Relief Commissioner Nabeel Javed.\n\nPDMA Director General (DG) Irfan Ali Kathia presented a four-point agenda in the meeting.\n\nThe first agenda included a briefing on six flood protection and river erosion schemes and the second included the installation of four Reverse Osmosis (RO) water filtration plants in Cholistan.\n\nThe meeting also approved an agreement with the Urban Unit for conducting a survey and the mapping of populations in riverine areas. It was briefed that a detailed survey will be conducted in phase 1 along the river Indus and hill torrents.\n\nThe meeting also approved four schemes worth Rs550 million to prevent river erosion and strengthen the Walewala Dam on the river Sutlej in Kasur district.\n\nApproval was also given for the construction and strengthening of a protective dam to prevent river erosion in Layyah. A scheme was also approved to prevent erosion of the river Chenab from Bela Sarban to Head Trimo in Jhang district.\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:36:49.298Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905197/ndma-warns-tourists-as-severe-weather-expected-today-in-punjab",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:39:47.000Z"
}
