{
  "title": "Businesses seek PM’s intervention as logistics crisis deepens - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Claim ports are paralysed, thousands of containers stuck, perishables rotting away\n• Transporters seek grace period to implement new Sindh govt regulations\n\nKARACHI: The country’s logistics and transport system has ground to a halt as a nationwide strike by goods transporters entered its fourth day on Friday, disrupting trade operations, paralysing supply chains and dealing a fresh blow to the country’s fragile economy.\n\nMeanwhile, a spokesperson of the Karachi Port Trust (KPT) said that the port operation has so far remained normal, but it may see some impact from Monday onwards in case the strike is prolonged.\n\nThe strike, triggered by the Sindh government’s enforcement of new vehicle fitness regulations, has reportedly left thousands of containers stranded at ports and warehouses, causing widespread concern among exporters and importers.\n\nThe provincial government introduced stricter vehicle fitness regulations in response to a surge in road accidents across Karachi. The city has witnessed an alarming rise in fatal collisions, particularly involving dumpers and water tankers.\n\nKarachi Chamber of Commerce and Industry (KCCI) President Muhammad Jawed Bilwani has made an urgent appeal to Prime Minister Shehbaz Sharif, calling for immediate and decisive intervention to resolve the nationwide transporters’ strike.\n\nIn a letter sent to the prime minister on Friday, he expressed serious concern over the paralysis of cargo movement across the country.\n\n“Export consignments remain stuck at factories and warehouses, while import containers are stranded at port terminals under the custody of terminal operators and foreign shipping lines,” he said. “This disruption is inflicting heavy financial losses on the business community and creating a cascading effect on industrial productivity and national economic stability.”\n\n“On the import side, the inability to move containers is choking supply chains, delaying production and pushing industries into operational chaos,” he claimed.\n\nMr Bilwani also highlighted the burden of rising demurrage and detention charges being imposed by port authorities and foreign lines.\n\nAddressing the impact on perishable exports, he warned of a looming catastrophe. Due to the current disruption, fresh produce is rotting, consignments are being rejected abroad, and exporters are incurring devastating losses. “This crisis is not just threatening the agricultural economy but damaging our long-term reputation in international markets,” he warned.\n\nMr Bilwani called upon the PM to immediately bring all stakeholders to the negotiating table. “Many exporters are now being forced to shift to air freight, which is significantly more expensive,” he said.\n\n‘20,000 containers stuck’\n\nMuhammad Younus Soomro, a former vice president of the KCCI, said the situation at the ports had become alarming.\n\nAll terminal operators typically clear an average of 5,000 containers daily, both import- and export-bound. “Due to the ongoing transporters’ strike, more than 20,000 containers are now stuck,” he said.\n\nHe said transporters are protesting against newly enforced regulations that they consider excessively strict. The government has begun cancelling the registration of trucks that were originally registered as far back as 1975.\n\nGoods transporters also held a demonstration outside the Customs House. Sindh Minister for Local Bodies Saeed Ghani held talks with the protestors and asked them to call off the strike, but the transporters clearly said that they would continue their protest till their demands are met.\n\nIn a letter to Sindh CM Murad Ali Shah, President Transporters of Goods Association (TGA) Tariq Guj­jar said that meeting the new requirements on such short notice was unfeasible and urged the government to grant a six-month grace period.\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:36:31.151Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905141/businesses-seek-pms-intervention-as-logistics-crisis-deepens",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:39:40.000Z"
}
