{
  "title": "Work on construction of new canals on Indus halted, govt lawyer tells SHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Bench orders appointment of Irsa federal member from Sindh by 29th\n• Judges call for amendment to Irsa Act to ‘permanently settle’ issue between federal and provincial govts\n• Stay order on canals project extended\n\nKARACHI: A federal law officer on Friday informed the Sindh High Court that work on the canals project had been stopped in compliance with its earlier restraining order.\n\nThe information was provided by Additional Attorney General Mohsin Qadir Shahwani to a division bench during the hearing of a petition against the planned construction of new canals on the Indus River and against the appointment of Asjad Imtiaz Ali, the federal member from Sindh in the Indus River System Authority (Irsa).\n\nWhen the bench comprising Justice Muhammad Faisal Kamal Alam and Justice Jawad Akbar Sarwana inquired from the law officer whether the work on canals project stopped in compliance with its earlier directives, he replied in the affirmative.\n\n“It is stated that no further action has been taken in compliance of the restraining order, which we appreciate,” the bench stated in its order.\n\nIrsa Secretary Muhammad Khalid Idrees Rana was also in attendance.\n\nAbout appointment of the federal member of Irsa from Sindh, the federal law officer submitted that the bench had not issued any such instructions.\n\nHowever, the bench noted that an earlier order of the SHC on the subject issue was still in filed as the apex court had also turned an appeal filed against it.\n\nThe additional attorney general insisted that the Supreme Court had dismissed the appeal over non-prosecution and pleaded for more time to file reply.\n\nThe Irsa secretary submitted that they would abide by any appointment order issued by the federal ministry of water in compliance with the court order.\n\nThe bench in it order said, “It is expected that before the next date of hearing, federal member from the Province of Sindh will be appointed, as already decided by the division bench of this Court by its Judgment dated 12.05.2017, handed down in constitution petition No. D-5206 of 2013, which has attained finality.\n\n“We may observe that a legislative amendment in the Indus River System Authority Act, 1992 can be made so that this issue is permanently settled. Both the governments, that is, federal and provincial, should take concrete steps so that no harm is caused to national unity, which should be preserved, promoted and preferred at all cost,” the bench ruled.\n\nThe judges adjourned the hearing till April 29 and ordered that the interim restraining order passed at the last hearing would continue till the next date.\n\nA grower of Sindh, Qurban Maitlo, moved the SHC last month against the appointment of Asjad Imtiaz Ali as Irsa member and submitted that his appointment was made in clear violation of a policy decision as well as an earlier judgement of the SHC on the subject matter.\n\nOn April 9, the bench had restrained the respondents from taking any further action and measures on the canals project in pursuance of the impugned water availability certificate, issued by Irsa on Jan 25.\n\nCiting the secretaries of establishment and water resources divisions, Irsa chairman, secretary of the Sindh irrigation department and federal member of Irsa as respondents, a grower of Sindh had challenged the appointment of federal member of Irsa Asjad Imtiaz Ali.\n\nRepresenting the petitioner, Barrister Zamir Ghumro had argued that Mr Ali was holding his position without a lawful authority as the SHC had already ruled that federal member of Irsa must be from Sindh.\n\nThe petitioner had also impugned the water availability certificate issued by Irsa for construction of new canals and asked the court to suspend the same.\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:36:51.023Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905165/work-on-construction-of-new-canals-on-indus-halted-govt-lawyer-tells-shc",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:45:05.000Z"
}
