{
  "title": "13 suspects detained in raids as police file FIR over Ahmadi man’s lynching in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "The police detained 13 suspects during raids on Saturday as a first information report (FIR) was filed for yesterday’s lynching of an Ahmadi man in Karachi’s Saddar area.\n\nLaeeq Ahmad Cheema, a 46-year-old businessman, was beaten to death when hundreds of Tehreek-i-Labbaik Pakistan (TLP) supporters stormed a hall belonging to the Ahmadiyya community to prevent them from observing religious rituals.\n\nTLP workers allegedly thrashed Cheema, who was supposedly recording a video of the mob, near the auto parts market at some distance from the worship place. He was later taken to the Civil Hospital, where he succumbed to his injuries.\n\nSouth Deputy Inspector General of Police (DIG) Syed Asad Raza told Dawn.com that the police registered a case against 15 nominated suspects over murder and terror charges for the lynching.\n\nThe FIR was filed by the victim’s relative at the Preedy Police Station under Sections 147 (rioting), 148 (rioting, armed with deadly weapon), 149 (every member of unlawful assembly guilty of offence committed in prosecution of common object) and 302 (premeditated murder) of the Pakistan Penal Code read with Section 7 (punishment for acts of terrorism) of the Anti-Terrorism Act.\n\nThe complainant said he had arrived to meet the deceased at the latter’s home when he received a call at 1:30pm that Cheema was badly injured by a large number of people near Hashu Centre and taken to Civil Hospital Karachi.\n\nThe complainant said he and other relatives immediately reached the hospital where doctors informed them that Cheema had died from his injuries. He said he later visited Ahmadiyya Hall where he was informed that at 1:15pm, a mob had beaten up his cousin during which the suspects also made a video of him being thrashed.\n\n“My cousin was crying for help,” the complainant said, adding that Cheema fell down on the road and was profusely bleeding from his head and face after the beating. The complainant said after getting some information and through social media, he came to know that 15 named suspects had “brutally” murdered his cousin.\n\nThe complainant said his deceased cousin was a witness of a case (FIR 608/2023) which is pending before a court. As per the FIR, the deceased had appeared before the court during hearing of that case on Friday (April 17, 2025) where the suspects had threatened him of dire consequences.\n\nDIG Raza told Dawn.com that in a crowd of around 15-20 persons, six culprits who beat Cheema to death and were seen in CCTV footage of the crime, were identified.\n\nDIG Raza said one of them was the sole elected Union Council chairman of Kharadar. He added that the suspect had contested and won on a TLP ticket. He said the three other suspects were nominated in a previous vandalism case against TLP in 2023 pertaining to the same site, with Cheema being the only eyewitness to the incident.\n\nHe said that of the 15 suspects nominated in the FIR, eight were actually seen on site and seven were not visible hence their involvement was being verified. Raza added that earlier today, the South Police conducted several raids on the hideouts of the nominated individuals, with technical and human intelligence, however, most of them had gone into hiding and switched off their phones.\n\nNevertheless, he said police arrested 13 suspects who he said were TLP members and closely related to the nominated suspects, adding that their interrogation was still under way.\n\nDIG Raza said seven of the nominated people in the FIR charged with less serious offences had managed to obtain interim pre-arrest bail from an anti-terrorism court in the evening.\n\nEarlier, Preedy Police Station House Officer (SHO) Shabbir Husain had visited the residence of the deceased and met with his family members to convince them to file the FIR.\n\nAccording to SHO Husain, around 45-50 Ahmadis were inside their place of worship when the mob besieged them, adding that a prison van was called to shift them to a safe place.\n\nPolice surgeon Dr Summaiya Syed said the deceased received multiple injuries all over his body, with death occurring due “to hard and blunt impacts on the head, leading to fractures and bleeding”.\n\nThe Human Rights Com­­mission of Pakistan (HRCP) said it was “appalled” by the incident, which it denounced as a “failure of law and order” that was a “stark reminder of the continued complicity of the state in the systematic persecution of a beleaguered community”.\n\nIt said the perpetrators of the attack in Saddar must be swiftly traced, arrested and prosecuted “without caving in to pressure from the far right to release those responsible”.\n\nIn a report last month, the HRCP said it had observed a growing trend of mob-led attacks on homes of families belonging to religious minorities, as well as their places of worship.\n\nThe report, titled ‘Under Siege: Freedom of Religion or Belief in 2023-24’, said over 750 persons were in prison on charges of blasphemy, as of October last year. It documented at least four faith-based killings, three of which targeted the Ahmadi community.\n\nThe HRCP observed an “increasing weaponisation of blasphe­­my laws against Ahmadis”, with cases often initiated by law enforcement officials themselves. It also spoke of Ahmadis’ “arbitrary detention”, “desecration of their graves” and the “vulnerability of Hindu and Christian women” to forced conversion.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/19160941122e367.jpg",
  "retrievedAt": "2025-08-25T14:25:51.544Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905268/13-suspects-detained-in-raids-as-police-file-fir-over-ahmadi-mans-lynching-in-karachi",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T11:58:08.000Z"
}
