{
  "title": "Deadlocked - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN’S sputtering democracy finally seems to have stalled. It had been evident for the past few years that the nation would soon arrive at a crippling deadlock unless one of the many protagonists in the ongoing political saga decided to take a step back.\n\nIn the absence of any serious effort towards a drawdown, the political system has now completely lost steam. The question of what comes next should cause a fair bit of unease. Divided and conquered, the political leaders who have long steered the country find themselves at a loss.\n\nThose in power cannot face the public, and those out of power cannot make anything of the public’s support. They have mutually surrendered the state to unelected, unaccountable quarters. As a result, the judiciary has fallen, the executive has been compromised, and the legislature rendered almost redundant. Shut out, the ordinary citizens of Pakistan have no one to turn to for their problems.\n\n‘A government of the few, by the few, for the few.’\n\nThere is no escaping that label. The Pakistani political system has been soulless for so long that even the staunchest democrats have been complacent about the country’s descent into totalitarianism. Politicians’ refusal to talk to each other and resolve issues with negotiation has created space for a different type of rulership to take over.\n\nEven now, with KP Chief Minister Ali Amin Gandapur recently stating that PTI chief Imran Khan is ready for talks, ‘not for his sake, but for the sake of the country’, it is known that that proposition is a non-starter. Mr Khan obviously does not want those talks with his fellow politicians, and his fellow politicians therefore see no option but to assert themselves more forcefully so they may keep holding onto their power. Pakistan may need democracy, but no one really seems to want it.\n\nThe Machiavellian approach taken by the coalition government has seen it cross many lines that should never have been crossed. There is much strength in the criticism that it seems to exist solely to serve vested interests, and one day it must be held to account for the extensive damage it has caused.\n\nAt the same time, the PTI, the main party in opposition, also has a lot to answer for. The party has never felt any responsibility for leading the country down the path of bitter divisiveness and polarisation, and it has often wielded its influence with a dangerous recklessness, frequently crossing the bounds of reason. It is its constant belligerence that turned politics into a zero-sum game where opponents deserve no respect or consideration.\n\nIt is important that both sides acknowledge their faults and make amends. This country has seen more than its fair share of misery. It deserves better.\n\nPublished in Dawn, April 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:25:55.775Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905226",
  "dateList": "2025-04-19",
  "date_published": "2025-04-19T00:39:25.000Z"
}
