{
  "title": "Non-Muslim students to be taught their religious values in new curriculum: Shafqat",
  "link": "https://www.app.com.pk/national/non-muslim-students-to-be-taught-their-religious-values-in-new-curriculum-shafqat/",
  "date_published": "2021-03-02T13:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 02 (APP):Minister for Federal Education and Professional Training Shafqat Mehmood on Tuesday said Non-Muslim students would be taught their religious values rather than Islamic studies in the New National Single Curriculum.\nDuring a meeting held here at his office with the British High Commissioner Dr Christian Turner, the education minister said students of Christian, Hindu, Sikh, Bhai Matt and Kelash community would be taught separate subjects that had been prepared in consultation and cooperation of their scholars.\nExpressing his views over new uniform educational curriculum, Federal Minister said till grade five, the subjects including English, Mathematics and Science would be taught in English, while the students would read Urdu and Islamic studies in Urdu.\nSocial Studies and General Knowledge would also be taught in Urdu while English terms would also be included in these subjects. However, English objects would also be included phase-wise from class six to eight. After class eight, the students could select national or international qualification according to their own choice, he added.\nFederal Minister further said private book publishers had been given permission for books publishing, adding, the provinces and private educational institutions could teach any book.\nHowever, the federal education ministry had ensured that the publisher’s books in that regard, should meet the criteria of single national curriculum and should not have any kind of hate material.\nHe is it was right of all citizens to give their suggestions on the new national single curriculum, therefore it had been uploaded on the official website of education ministry.\nHe said several experts had criticised the single national curriculum without reading and knowing its benefits.\nWhile talking about the single national curriculum till middle class, the minister said\nthe provinces and private educational institutions had been given permission to teach additional material.\nThe elite private schools were free in holding music and dance classes. Similarly, the Madaris could also teach additional material of their Dars-e-Nizami, he added.\nDuring the meeting, both sides also discussed the procedure of Madaris registration.\nShafqat said that the registration process of Madaris was continued across the country and under the Directorate General of Religious Education, an attached department of federal education ministry, a total of sixteen offices had been established for this purpose.\nSo far, 2000 Madaris had been registered,while on the demand of few Madaris, five new educational boards had also been established, he informed.\nHe said that before the education ministry, Madaris were working under interior ministry.\n“We had brought Madaris under the Ministry of Federal Education and Professional Training where the doors of the best carrier opportunities will be opened for students due to implementation of single national curriculum”, he remarked.",
  "retrievedAt": "2025-08-11T20:26:04.321Z"
}
