{
  "title": "“Kashmir is not about roads but far Bigger Issue – required to be settled without further delay”: Mehbooba Mufti.",
  "link": "https://www.app.com.pk/national/kashmir-is-not-about-roads-but-far-bigger-issue-required-to-be-settled-without-further-delay-mehbooba-mufti/",
  "date_published": "2021-03-02T15:54:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: , Mar 02 (APP):Former “Chief Minister” of the Indian Illegally Occupied Jammu and Kashmir State, Mehbooba Mufti, on Tuesday said that Kashmir issue was not about roads and development but a far bigger issue – that should be resolved without further loss of time in line with the aspirations of the people of the state.\n“In peace times, roads and lane are laid automatically,” she said while addressing to her party workers in Anantnag, says a report reaching here from across the line of control [LoC].\n“People of the erstwhile Jammu and Kashmir State have been in difficult times for last 70 years. Thousands of people have been sacrificed in different ways and means,” Mehbooba said .\nShe underlined “the presence of 10 lakh Indian soldiers in IIOJK reflects Kashmir is an issue which needs resolution”, the report said.\nShe also emphatically demanded “whatever India has taken away (through sinister August 05, 2019 action) should be returned back with interest.”\n“Why are you getting angry ? We are asking for return from the Indian Parliament which snatched our respect and pride. Snatched our identity. People of Jammu and Kashmir have been fighting since last 70 years irrespective of methodology adopted”, the furious Mufti said, according to the report.\nThe former “Chief Minister” of IIOJK Mehbooba Mufti urged the IIOJK people to advise their children not to take up arms. “Please ask my children not to wield gun because violence is not solution to any problem.”, she maintained, the report said.\nCiting the country-wide farmers protest in India, Mufti said “Today world is advocating their cause. Why they do not advocate our cause? It is because we have been bracketed as terrorists so as to delegitimize our aspirations and our struggle.\nWhat does gun brought here? Our minors get killed. Athar Mushtaq of Below Rajpora Pulwama had just passed 10th class and had just joined 11th standard, and he died at (Lawaypora).",
  "retrievedAt": "2025-08-11T20:25:57.547Z"
}
