{
  "title": "Three provincial assemblies and National Assembly to elect 37 senators",
  "link": "https://www.app.com.pk/national/three-provincial-assemblies-and-national-assembly-to-elect-37-senators/",
  "date_published": "2021-03-02T09:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 02 (APP): Three provincial assemblies and the National Assembly would elect 37 senators on Wednesday (March 3, 2021) as the Punjab Assembly has already elected 11 senators unopposed.\nTwelve candidates each from Balochistan and Khyber Pakhtunkhwa (KP) while 11 from Sindh and two from federal capital would be elected senators.\nEleven candidates from Punjab have already been elected unopposed.\nThose elected unopposed in Punjab are Kamil Agha, Saifullah Nyazee, Afnanullah Khan, Aon Abbas, Ejaz Chaudhry, Sajid Mir and Irfanul Haq Siddiqui on general seats; Azam Tarar and Syed Ali Zafar on the technocrat seats and Zarqa Suharwardy and Saadia Abbasi on the women seats.\nIn federal capital, a one-to-one contest between Finance Minister Hafeez Sheikh and former prime minister Yusuf Raza Gilani would be held for a general seat while PTI’s Fauzia Arshad and PML-N’s Farzana Kausar would contest for a woman’s seat.\nIn Balochistan, 32 candidates would vie for 12 seats, including 16 for seven general seats and four for two technocrat seats. In Khyber Pakhtunkhwa, 11 candidates remained in the contest for seven general seats, five candidates for two technocrats’ seats, five for the women’s seats and four for a non-Muslim seat.\nIn Sindh, a total of 17 candidates remain in the contest – 10 for seven general seats, four for two technocrats seats and three for the two women’s seats.\nA total of 37 senators — 12 each from Khyber-Pakhtunkhwa and Balochistan, 11 from Sindh and two from Islamabad – will be elected on March 3. Eleven senators from Punjab have been already elected unopposed. Two senators from Islamabad would be elected by the National Assembly and the remaining to be elected by their respective assemblies.\nOut of total membership of 104 in Upper House at present, three seats are lying vacant in Senate due to death of PML-N Parliamentary leader Senator Mushahid Ullah Khan, resignation of ANP Senator Sitara Ayaz and non-assumption of the office by Ishaq Dar after being elected as Senator.\nThe Senate of Pakistan at present consists of 104 members and elections to fill seats in the Senate allocated to each province are held in accordance with the system of proportional representation by means of the single transferable vote.\nThe Senate is not subject to dissolution, but the term of its members is six years. Half of the Senate members retire after every three years and new ones are elected to replace them.\nHowever, the Constitution (Twenty-fifth Amendment) has abolished eights FATA seats, reducing the total number of seats in Senate from 104 to 96. However, the senators elected in 2015 and in 2018 – prior to the enactment of 25th amendment – were to continue their respective terms till 2021 and 2024. Former FATA senators used to be elected by the 12 FATA members of the National Assembly. However, there will not be an election on the FATA seats in 2021. Four FATA senators are retiring after completing their terms on March 11, 2021. There will not be an election for these four seats and they will cease to exist, bringing the total number of Senate members to 100 after March 2021 elections.\nAmong the 52 Senators retiring on March 11, 2021, 14 Senators belong to PML-N including Agha Shahzaib Durrani, Ayesha Raza Farooq, Chaudhary Tanvir Khan, Ghous Muhammad Khan Niazi, Lt. General (R) Salahuddin Tirmizi, Lt. General Abdul Qayyum HI (M) Retd, Muhammad Javed Abbasi, Najma Hameed, Pervaiz Rasheed, Prof. Sajid Mir, Rahila Magsi Raja Muhammad Zafar-ul-Haq, Saleem Zia and Sardar Muhammad Yaqoob Khan Nasar. One seat (15th seat) had fallen vacant due to death of PML-N Senator Mushahid Ullah Khan.\nSeven PPPP senators completing their term in 2021 include Abdul Rehman Malik, Farooq Hamid Naek, Gianchand, Islamuddin Shaikh, Saleem Mandviwalla (Deputy Chairman Senate), Sassui Palijo and Sherry Rehman.\nLikewise, seven PTI senators would including Brig. (R) John Kenneth Williams, Liaqat Khan Tarakai, Mohsin Aziz, Nauman Wazir Khattak, Samina Saeed, Syed Shibli Faraz, and Zeeshan Khanzada would complete their term on March 11, 2021.\nSix independent senators retiring in 2021 are Aurangzeb Khan, Dr Asad Ashraf, Haji Momin Khan Afridi, Mir Muhammad Yousaf Badini, Sajjad Hussain Turi and Taj Muhammad Afridi.\nFour MQM senators including Khushbakht Shujat, Mian Muhammad Ateeq Shaikh, Muhammad Ali Khan Saif and Nighat Mirza would also complete their term on March 11, 2021. Four senators from BAP getting retired are Manzoor Ahmed, Muhammad Khalid Bizenjo, Sarfaraz Ahmed Bugti and Nusrat Shaheen.\nTwo NP senators including Dr Ashok Kumar and Mir Kabeer Ahmed Muhammad Shahi, two PkMAP senators including Gul Bashra, Muhammad Usman Khan Kakar and two JUI-F Senators including Molana Atta Ur Rehman, Maulana Abdul Ghafoor Haideri would complete their term.\nSimilarly, JI Senator Siraj ul Haq, BNP-M Senator Dr Jehanzeb Jamaldini would also complete their term. An ANP Senator Sitara Ayaz from Khyber Pakhtunkhwa has already resigned from the Senate membership during last month and would contest the Senate election now on general seat from Balochistan.",
  "retrievedAt": "2025-08-11T20:26:10.022Z"
}
