{
  "title": "Pak-China collaboration around poverty alleviation on the anvil",
  "link": "https://www.app.com.pk/national/pak-china-collaboration-around-poverty-alleviation-on-the-anvil/",
  "date_published": "2021-03-02T12:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 02 (APP):Pakistan and China will collaborate on poverty alleviation through a Memorandum of Understanding (MoU) to be signed soon.\nThis was stated by the Chinese Ambassador to Pakistan Nong Rong in a meeting with the Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar on Wednesday.\nSecretary Poverty Alleviation and Social Safety Division (PASSD), Muhammad Ali Shahzada was also present on the occasion.\nSharing her views, Dr. Sania said, “We congratulate Chinese government and leadership for momentous achievement of eradicating extreme poverty from China. It is unprecedented in human history that 770 million people have been taken out of extreme poverty in a span of over 40 years.”\nDuring the meeting, Chinese Ambassador and Dr. Sania discussed the draft of Memorandum of Understanding (MoU) which was being framed between the Ministry of Commerce of the People’s Republic of China and Poverty Alleviation and Social Safety Division of Pakistan aimed at establishing a platform for collaboration around poverty eradication.\nSpeaking to the press after the meeting, Dr. Sania said, “We are working on the final details of the MoU. The Framework will provide both countries an opportunity to capitalize on sharing of experiences in poverty eradication”.\n“The collaboration established as a result, therefore, will enable Pakistan to benefit from evidence and lessons in poverty eradication from the China’s experience on the one hand. On the other hand, it will enable Pakistan to disseminate lessons from Ehsaas, which is a unique multi-sectoral approach to tackling poverty”, she said.\nDr. Sania also congratulated Nong Rong on his appointment as China’s Ambassador to Pakistan.\nDr. Sania reiterated the importance of China-Pakistan Economic Corridor (CPEC) for poverty eradication. “Not only is CPEC a remarkable demonstration of our time-tested friendship, it is also an ideal milieu for socio-economic development which will contribute to uplifting people and graduating them out of poverty”, she said.\nFurther, Dr. Sania congratulated and reiterated the close iron brother ties between China and Pakistan.\nShe termed the upcoming collaboration as a good initiative.\nWhile commenting on the importance of CPEC, she said that CPEC was a paradigm of development and that socio-economic development under CPEC would contribute to poverty alleviation in Pakistan.",
  "retrievedAt": "2025-08-11T20:26:06.538Z"
}
