{
  "title": "AJK President emphasis for conservation of wildlife habitat",
  "link": "https://www.app.com.pk/national/ajk-president-emphasis-for-conservation-of-wildlife-habitat/",
  "date_published": "2021-03-02T14:36:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK], Mar 02 (APP):Azad Jammu and Kashmir (AJK) President Sardar Masood Khan on Tuesday urged the department concerned to take necessary measures for conservation of the natural environment and protection of wildlife.\n“The AJK region is known for its beautiful forests, majestic mountains and lush green valleys that are home to hundreds of animals, plants and bird species. The wildlife, plants and birds have to co-exist side-by-side human beings to keep an ecological balance,” he asserted.\nSpeaking after a briefing given to him by Secretary Wildlife, fishers and Auqaf, Sardar Javed Ayub at Aiwan-e-Sadr, the AJK President said steps were being taken by the wildlife department in collaboration with the forests and other departments to preserve wildlife and to conserve habitat were appreciable, AJK President office said.\nHe asserted that they need to take more steps to protect migratory birds coming from Siberia and Russia and also to protect ibex, musk dear and other wildlife in Neelum Valley and other adjoining areas by conserving their natural habitat.\nHe said protection and conservation of the natural environment, wildlife habitat and the wildlife were the collective responsibility of all, and everyone should fulfil this responsibility by considering it as our national obligation.\nEarlier, Secretary Sardar Javed Ayub told the AJK President that at present, eight national parks spread over 260,000 acres of land have been developed in different parts of Azad Jammu and Kashmir.\nThese included Ghamot National Park and Musk Dear Park in Neelum Valley, Machiara National park in Muzaffarabad, Toli Pir park in Rawalakot, Pir Lasura park in Kotli, Deva Vatala Park in Bhimber, Maha Sher Park in Poonch river, and Azad Pattan Park in Kotli and Sadhnoti areas.\nGiving details about cold water fish hatcheries, the Secretary Wildlife said Trout Experimental Unit at Patehka in Muzaffarabad, trout fish hatcher in Salkhala, trout fish hatcheries at Dawarian and Taobutt, warm water fish hatchery at Chakar in Jhelum Valley, Mangla fish hatchery in Mirpur and Maha Sher fish hatchery in Kotli are functioning.\nCommenting on the briefing given regarding Tajweed-ul-Quran Trust, President Sardar Masood Khan said demand of increasing honorarium of teachers for seminaries being run by Tajveedul Quran Trust was justified.\nIn this regard, the department should take immediate steps so that the teachers imparting Quranic teachings in these seminaries could perform their duties without any financial difficulty.\nHe said the discrepancy in the number of seminaries operating in different districts under Tajweed-ul-Quran Trust should also be removed.\nBesides Director Wildlife Naeem Iftikhar, Dar and Raja Mohammad Siddique, the briefing was attended by senior officials of the departments of religious affairs, Auqaf and wildlife.",
  "retrievedAt": "2025-08-11T20:25:59.719Z"
}
