{
  "title": "US embassy launches academy for women entrepreneurs 2022",
  "link": "https://www.app.com.pk/national/us-embassy-launches-academy-for-women-entrepreneurs-2022/",
  "date_published": "2022-06-11T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): US Embassy Islamabad’s Counselor for Commercial Affairs John Coronado on Saturday congratulated more than 115 Pakistani women entrepreneurs on their selection to the Academy for Women Entrepreneurs (AWE) 2022 in a virtual launch event on June 11. &nbsp;\nThis U.S. training program supports women worldwide in building their own businesses.\nIts launch in Pakistan is part of the 75th anniversary celebrations of U.S.-Pakistan bilateral relations and an ongoing effort to empower Pakistani women to realize their economic potential and increase prosperity for all Pakistanis.\nDuring his remarks, Coronado spoke about the need to support women entrepreneurs:\n“When women are economically empowered, they reinvest in their families and communities, strengthening the social fabric and improving education and skill levels of the workforce.? This multiplier effect spurs economic growth and enhances stability.”\nWith mentoring and guidance from established Pakistani entrepreneurs, the AWE participants will undertake a three month, rigorous online training program developed by Arizona State University’s Thunderbird School of Global Management and American natural resource company Freeport McMoran.\nThrough AWE, participants learn core business skills and will meet weekly to discuss the material with experienced local mentors and U.S. experts.  AWE is designed to cultivate entrepreneurial know-how, help women entrepreneurs connect with funding opportunities, enhance opportunities for business expansion, and increase the likelihood of entrepreneurial success.\nFour of the U.S. Mission to Pakistan’s Lincoln Corners in Multan, Muzaffarabad, Khairpur, and Peshawar will lead AWE Pakistan 2022, with support from the Pakistan American Cultural Center and the DOVE Foundation.  Lincoln Corners in Peshawar, Lahore, Rawalpindi, and Larkana took part in AWE Pakistan 2021.\nToward the end of their AWE journey, participants will have the opportunity to compete for seed funding from the U.S. Mission to Pakistan to further grow or establish their enterprises.\nUpon completion, the participants will join the global AWE network, which offers further growth opportunities, as well as the community of U.S. exchange program alumni.",
  "retrievedAt": "2025-08-11T15:04:13.432Z"
}
