{
  "title": "Pakistan expresses solidarity with Kashmiri Women on International Day for Elimination of Sexual Violence in Conflict",
  "link": "https://www.app.com.pk/national/pakistan-expresses-solidarity-with-kashmiri-women-on-international-day-for-elimination-of-sexual-violence-in-conflict/",
  "date_published": "2020-06-19T02:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP):Pakistan on Friday drew the world’s attention to the plight of Kashmiri women in Indian Occupied Jammu & Kashmir (IOJ&K), who had been frequent targets of sexual violence by Indian occupation forces.\n“In the past three decades, more than 11,000 women have been victims of rape or gang-rape at the hands of Indian occupation forces in occupied Jammu & Kashmir. We reaffirm our complete solidarity with these Kashmiri women and their families,” the Foreign Office in a statement on the occasion of the International Day for the Elimination of Sexual Violence in Conflict said.\nWomen in IOJ&K have frequently been targets of violence and aggression as a means to punishing their families and communities for standing up against illegal and forcible Indian occupation, the statement said and added abduction and molestation of young women during so-called “cordon-and-search operations” has been used as a punitive tool by Indian occupation forces to punish entire communities.\nIt said these repugnant acts of violence against women were enabled through a pervasive culture of impunity, reinforced by draconian laws such as Armed Forces Special Powers Act (AFSPA) that shield the Indian security forces from prosecution from their crimes of sexual violence.\nIndia’s resort to sexual violence in the conflict situation of IOJ&K has been documented by the two reports of the UN Office of the High Commissioner for Human Rights (OHCHR) as well as global media and civil society organizations, the Foreign Office said and added that the horrific mass rape of Kashmiri women in Kunan Poshpura villages of IOJ&K on 23 February 1991 is one of many evidences of systematic use of rape by Indian occupation forces to terrorize the entire population.\nIt said that lack of accountability of perpetrators and absence of justice for victims of rape of this and other incidents in the occupied region continue to define India’s deliberate disregard of rule of law and human rights.\nPakistan condemns India’s use of rape as an instrument of state policy to subjugate the Kashmiri people in the occupied territory, the FO statement said and added that the world must wake up to these war tactics in IOJ&K, in violation of International Humanitarian and Human Rights Law as well as applicable UN Security Council Resolutions.\nThe UN Security Council, OHCHR, the UN human rights mechanisms, the UN Secretary General’s Special Representative on Sexual Violence in Conflict must take cognizance of these crimes and hold Indian state actors to account who abet and partake in acts of sexual violence against women in IOJ&K, the Foreign Office statement said.",
  "retrievedAt": "2025-08-11T19:21:48.684Z"
}
