{
  "title": "Pakistan signs $1500 mln financing agreements with WB, ADB, AIIB for anti-COVID response",
  "link": "https://www.app.com.pk/national/pakistan-signs-1500-mln-financing-agreements-with-wb-adb-aiib-for-anti-covid-response/",
  "date_published": "2020-06-19T06:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP):Pakistan on Friday signed three financing agreements worth US$1500 million with the World Bank, Asian Development Bank and the Asian Infrastructure Development Bank for anti-COVID response besides strengthening health and education systems.\nPrime Minister Imran Khan also witnessed the signing ceremony held here, said a PM Office press release.\nUnder the agreement for COVID-19 Active Response and Expenditure Support Program (CARES), the ADB would extend financial support of US$500 million with the objective to support Government of Pakistan’s efforts to strengthen the health system and mitigate socioeconomic impacts of the COVID-19 pandemic.\nThe AIIB would extend co-financing of US$500 million for the Covid-19 Active Response and Expenditure Support Program (CARES) to augment the Government’s efforts to mitigate the direct and indirect impacts of COVID-19 pandemic.\nThe third agreement titled “Securing Human Investments to Foster Transformation (SHIFT) worth US$500 million aims at strengthening the civil registration and vital statistics, health and education systems essential for Human Capital (HC) accumulation. It will also help recognize and support the contribution of women to economic productivity and improve efficiency of the national safety nets.\nSecretary, Ministry of Economic Affairs Noor Ahmed signed the three loan agreements on behalf of Government of Pakistan while Country Director World Bank Patchamuthu Illangovan, Country Director ADB Ms. Xiaohong Yang signed agreements on behalf of the WB, ADB, and AIIB.\nThe disbursement of US$1,500 million will be made to Pakistan in next few days.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:21:45.382Z"
}
