{
  "title": "Consecutive 5th day decline in positive cases; additional ventilators added: NCOC",
  "link": "https://www.app.com.pk/national/consecutive-5th-day-decline-positive-cases-additional-ventilators-added-ncoc/",
  "date_published": "2020-06-19T02:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP):The National Command and Operation Centre (NCOC) on Friday said there was a consecutive 5th day decline in positive cases ratio after witnessing rise in number of positive cases for three weeks.\nAccording to NCOC, around 103 more ventilators were added to national count, which makes total number of ventilators1503 in the country.\nIn order to meet additional requirements of hospitals, procurement of additional ventilators on fast track basis was in progress and would be completed between mid to end of July, adding that more than 1500 ventilators to the existing number.\nOperationalisation of 2150 additional oxygenated beds across Pakistan was pursued on war footing to ease extra pull on major hospitals in mega cities across the country.\nThe details of area wise expansion of oxygenated beds included as 60 beds would be added in Azad Jammu and Kashmir (AJK), 200 in Balochistan, 40 in Gilgit Baltistan (GB), 450 in the Islamabad Capital Territory (ICT), 400 in Khyber Pakhtunkhwa (KP), 500 in Punjab and 500 in Sindh.\nTesting capacity has increased by 65 times and being further increased to more than 100,000 tests per day by mid July.\nHowever, the NCOC also issued the mortality analysis till June 18 (n-3,093) where CFR: 1.93 against 5.37 percent globally where further gender bifurcation showed 73 percent males where age range was1– 102 years (Median 60 years) whereas 74 percent over the age of 50 years. However, 73 percent deceased had chronic comorbidities meaning already affected with other disease before contracting coronavirus.\nIt also added that 91 percent of deceased remained hospitalized (Average stay: 5 days, range: 1-35 days). As many as 28,824 tests were conducted during last 24 hours and 61,383 people recovered so far across Pakistan.\n“There is no patient on vent in AJK, Balochistan and GB,” it added. Around 546 ventilators were occupied across Pakistan where as total Active COVID-19 cases in Pakistan were 100,450 (4944 on June 18).\nA total of 165,062 cases were detected so far (AJK 769, Balochistan 8998, GB 1225, ICT 9941, KP 20182, Punjab 61678 Sindh 62269). So far, 3229 deaths (136 on June 18) occurred due to COVID-19 whereas in Sindh 964, Punjab 1265, KP 773, ICT 95, Balochistan 99, GB 18 and AJK 15.\nA total of 1,011,106 tests were conducted 809 hospitals with COVID-19 facilities with 7,496 patients admitted across the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:21:50.373Z"
}
