{
  "title": "Treasury benches appreciate financial team for business-friendly, tax-free budget",
  "link": "https://www.app.com.pk/national/treasury-benches-appreciate-financial-team-for-business-friendly-tax-free-budget/",
  "date_published": "2020-06-19T04:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 19 (APP):The treasury benches in Senate on Friday lauded the financial teams of the government for giving balanced, business- friendly and tax free budget in wake of COVID-19 while the opposition termed it anti-people.\nResuming debate on the budget in the Senate, Mohsin Aziz of PTI appreciated the Advisor to the Prime Minister on Finance Dr Hafeez Shaikh for giving business-friendly and pro-poor budget in wake of COVID-19 and at such critical time. He said the International Monetary Fund (IMF) predicted that the world economy would shrink 3 per cent and the government gave a tax free budget without imposing any new tax.\nHe said steps were also proposed to control smuggling and a force was being erected in this regard. Many incentives were announced for industries in the budget, he said. Mohsin Aziz said customs duties on 20,000 items were reduced on basic raw materials which would help revive basic industry in the country. It would not only stimulate the country’s economy but to help in creating job opportunities.\nHe said the Prime Minister Imran Khan also wanted to increase salaries and pensions of employees but there was no fiscal space. Efforts were being made to reduce our expenditures and enhance revenue collection, he added. He said the current account deficit has been reduced to $ 3 billion from $ 20 billion and not a single penny loan was obtained from State Bank of Pakistan. Similarly, he said the foreign direct investment witnessed 137 per cent growth. He said the total country debt was Rs 6000 billion till 2008 which stood at Rs 16,000 billion by 2013 and Rs 30,000 billion by 2018. The past PPP and PML-N governments secured excessive loans during their 10 years tenures, he added. He said structural changes had been made by the PTI led government to put the country on right track.\nSenator Faisal Javed said that each step of the PM Imran Khan is for the welfare of people of Pakistan. He said that tax payer amount is being spent for poor and there is no camp office for the Prime Minister. Imran Khan, he said, is living at his own residence and the entire expense is being paid by him. The national exchequer would be spent only for the welfare of people by Imran Khan who saved Rs. 180 million in year through austerity campaign at Prime Minister’s Office.\nPPPP Senator Keshoo Bai criticized the government for not giving any major relief to the masses in the budget. She said no raise was made in salaries and pensions of the employees for the first time. She also alleged that Sindh share has been slashed in NFC which would affect all development projects in the province. Mushahid Hussain Syed said the country’s national security was strong and now there was dire need to strengthen human security. He also stressed the need to join hands to cope with regional challenges. He said no one could face Coronavirus individually and we had to counterit jointly. He said that opposition was always ready to help government in collective challenges being confronted by the country.\nSenator Waleed Iqbal of PTI said overall Rs 64 billion was allocated for higher education in the budget and a sum of Rs 28 billion was specified for development projects of Higher Education Commission (HEC). However, he suggested that the HEC budget should be enhanced to Rs 70 billion. Regarding PSDP, he said 73 per cent was allocated for ongoing and 27 per cent for new projects.\nSimilarly, he said an amount of Rs 77 billion was earmarked for social sector development which was 38 per cent more as compared to last year. The budget of Ehsah programme has also been enhanced from Rs 187 billion to Rs 208 billion, he added. Waleed Iqbal said hefty allocation were made for COVID-19, Rs 50 billion for farmers, Rs 10 billion for locusts control and Rs 10 billion special grant for Balochistan. Similarly, he said Rs 70 billion was allocated for three hydel projects including Mohmand, Diamer Basha dams and Dasu hydropower projects ANP Senator Sitara Ayaz said that each government terms his budget as the best one but the need is to step ahead after shunning all political differences. However, she said that inflation rate is very much high and the Opposition also seems reluctant to cooperate with government in this regard. She said that petrol prices have been reduced but there is shortage of petrol and the government is unable to manage and shift its benefit to the masses.\nSitara Ayaz said that hospitals lack facilities in Khyber Pakhtukhwa to tackle the situation after COVID-19 and demanded more allocation for health sector. She demanded more allocation in NFC award for small provinces especially Khyber Pakhtunkhwa after merger of tribal districts in the province. She focused to adopt austerity measures and take more steps to reduce the burden on the poor.\nSenator Shehzad Waseem said that tiger force is volunteer force which would work with the support of the society and the government. He said that relief package was announced for the poor and the disbursement was made with transparency. Senator Abida Azeem said that 45 districts were affected due the attack of locusts and demanded more allocation for agriculture sector and relief to the farmers. She criticized the budget 2020-21 and termed it as of IMF budget.\nSenator Naseebullah Bazai said that economic activities have declined in the country during the last five months and the budget 2020-21 has been worked out to boost economic activities and combat COVID-19. He termed it as a positive budget and hoped that it would bring relief in the lives of people. He said that present government is facing cartels and mafias but it is determined to get rid of them through effective action against them.\nMQM Senator Muhammad Ali Khan Saif said that rational approach is vital in democracy and urged the political parties to introduce democratic norms within their parties. He said that such steps would help to highlight the public problems and get them resolved in an effective way.\nSenator Ghous Muhammad Khan Niazi also criticized the budget and economic policies of the government and said no commitment made by PTI before coming into power had been fulfilled now. He said that ban on import of vehicles should be lifted and tax on auto-industry should be reduced for bringing down the prices of vehicles.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:21:48.536Z"
}
