{
  "title": "KP Govt allocates Rs. 2915.373 for Sports, Tourism, Youth Affairs, Culture & Archaeology",
  "link": "https://www.app.com.pk/national/kp-govt-allocates-rs-2915-373-for-sports-tourism-youth-affairs-culture-archaeology/",
  "date_published": "2020-06-19T06:54:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jun 19 (APP):The Khyber Pakhtunkhwa government has allocated Rs 2915.373 million for Sports, Tourism, Culture, Archaeology and Youth Affairs in the Annual Budget for the year 2020-21 and out of the total Rs. 2.9 billion sports would get Rs. 1.58 billion.\nThis was stated by Khyber Pakhtunkhwa Finance Minister Taimur Saleem Khan Jhagra in a budgetary speech at the Khyber Pakhtunkhwa Assembly on Friday. He said KP govt allocated Rs. 2915.373 million for 85 projects of these departments in which 68 ongoing schemes and 17 new schemes including Rs. 184.083 million for 16 projects of Archaeology, Rs. 15.000 million for two projects of Culture, Rs. 1581.779 million for 27 ongoing projects of sports, Rs. 788.501 million for 21 ongoing projects of Tourism and Rs. 788.501 million for Youth Affairs.\nFor the completion of the work on the Arbab Niaz Cricket Stadium Peshawar, the government has allocated Rs. 44 million, Rs. 33 million earmarked for the ongoing 1000 ground facility, Rs. 1.9 billion has been allocated for the establishment of new grounds in different districts and Rs, 33 million for the infrastructure development, promotion of tourism sites and developing of roads and other accessibility for the promotion tourism while Rs. 1.1 billion would be spending on under KITE program, the projects including exploring tourism potential and the World Bank has also extending financial support to the government of Khyber Pakhtunkhwa.\nFor developing New A-class Category Sports Stadia’s (ground with international standard facilities) at Tank, Kalam, Lakki Marwat, Chitral and Tahkal Peshawar and up gradation of all facilities including cricket ground in Hayatabad Sports Complex the govt has allocated Rs. 500 million.\nAnother silent feature of the sports budget for the year-2020-21 Rs. 830 million allocated for the up gradation of all existing facilities across Khyber Pakhtunkhwa that would benefit and help the Directorate Sports KP for overall promotion of sports in the province.\nThe KP Finance Minister said that Rs. 345 million has also been allocated for the ongoing 1000 grounds facilities in KP including merged tribal areas. He informed the house that work on the laying of artificial hockey turf in historical Islamia College and laying of Tartan Track (Artificial Athletic Tracks) in Bannu Sports Complex have already kicked off.\nHe said the govt has allocated Rs 40,000 million for the two ongoing projects of the Youth Affairs while Rs 1.001 million has been allocated for two new culture schemes, Rs 0.009 million for 9 new sports projects and Rs 305,000 million for six new tourism projects. Rs. 200.00 million for Sports Complex in Lakki Marwat, Rs. 500.00 Million for up gradation of Hayatabad Sports Complex Peshawar, Rs. 150,000 for establishment of Sports Stadium in Tehkal Peshawar, Rs. 250.00 for Renovation of Grassy Ground Swat and Rs. 0.250.00 for developing multi-purse ground in Kalam, Rs. 250.00 Million for construction of Sports Complex in District Chitral, Rs. 200,000 million for construction of Sports Complex in District Tank, Rs. 100,000 million for KP for Sports Talent Hunt Program, Rs. 500,000 million for repair and rehabilitation of sports equipment, improvement of Mahu Dhan Lake Swat Rs. 100,000 million for wide tourist destination in Alai, Rs. 100,000 million for improvement and rehabilitation of tourist destinations in KP, Rs. 200,000 million for improvement and rehabilitation of KPCTA and regional offices, Rs. 700,000 million in Tourism and Culture sectors. He said besides all hardship the government has allocated Rs 300,000 million for holding various events of tourism and culture, Rs 300,000 million for development of Camping Pods sites and Rest Houses, Rs 200,000 million has been allocated for construction of KP Cultural Complex and Rs 200,000 million for Human Treasures.\nWhile highlighting annual development program 2020-21, the Finance Minister said RESCU 112 services were being extended to six new districts including Tank, Upper Chitral, Upper Kohistan, Kolai Palas, Batagram and Torghar with allocation of Rs290 million in budget 2020-21.\nHe said the RESCU 1122 services has been extended to Lakki Marwat, Malakanad, Lower Kohistan and Shangla districts costing Rs210.5 million, adding the project would create 1000 jobs for youth.\nTo restore economy and generate employment opportunities, he said, loan scheme for 10,000 SMEs would benefit over one million people, adding Interest free loans to 30,000 to business enterprenures would benefit 0.5mln people.\nHe said 25,000 additional recruitment would be made to plant 190.5 million sapling under Billions Trees project and resources would be provided for establishment of marble city in Buner district besides digital jobs in KP with allocation of Rs290 million project would be implemented.\nFor health sector, he said, sehat insaf card under health insurance scheme would be provided to all families of the province at a cost of Rs10 billion, 30,000 additional health staff would be recruited and Rs2.4 billion would be spent on integration of health services delivery program.\nRs.1.1 billion would be utilized on uplifting on non teaching DHQs, new blocks would be constructed at Peshawar Institute of Cardiology and Khyber Teaching Hospital with allocation of Rs4 billion and Rs900 million would be spent on treatment of poor cancer patients.\nHe said Rs300 million were being spent on improvement of 200 BHUs and Rs200 million allocated for establishment of a medical college Timergara Lower Dir.\nThe Finance Minister said KP Govt would improve conditions of 26,000 schools, 21 new teachers were being recruited, additional 3000 AS DEOs and 3000 schools leaders would be recruited for effective schools management besides financial resources would be provided for purchase of tablets for training of teachers for education of students in wake of COVID-19.\nLikewise, 1210 schools would be uplifted and that upgradation of 534 schools was underway, the Minister said, adding 300 new schools would be constructed in the province.\nThe Finance Minister said Rs1 billion were allocated for public sector universities and Rs500 million for establishment of Pak-Austria Fachashule Institute at Haripur, Rs110.6 million for UET Swat and Rs1.3 billion for construction of 74 Govt colleges.\nHe said Rs800 million allocated for 88MW Gabral Kalam hydropower project, Rs600 million for completion of 157MA Maidan hydropower project, Rs5.7 billion for rehabilitation of provincial roads, Rs4.2billion for dualization of Mardan-Swabi Road, Rs3.5 billion for rehabilitation and construction of roads in all divisions.\nFor clean drinking water, the Minister said Rs830 million were set aside and mega gravity flow water supply scheme at Mansera would be launched.\nRs200 million allocated for solorization of 400 water supply schemes, gravity and overhead schemes and Atla dam at Gadoon would be constructed for provision of clean water to Swabi district.\nFor uplift of urban and rural areas, he said Rs5 billion were allocated in the budget 2020-21, adding Rs3.9 billion would be spent on infrastructure and municipal services in specified districts with collaboration of EU, Rs1.8 billion for Warsak-Nasirbagh road, Rs55 billion for Peshawar Development Program.\nFor sports and tourism uplift, the Minister said Rs1.1 billion were earmarked under KITE program with financial assistance of World Bank, Rs440 million for rehabilitation of Arbab Niaz stadium, Rs330 million for construction of 1000 sports facilities and Rs1.9 billion for construction of new grounds in the provinces besides Rs370 million for construction of roads in Malakand and Hazara Division to promote tourism.",
  "retrievedAt": "2025-08-11T19:21:46.960Z"
}
