{
  "title": "Privatization of 3 DISCOs likely to be completed by next year: Awais",
  "link": "https://www.app.com.pk/national/privatization-of-3-discos-likely-to-be-completed-by-next-year-awais/",
  "date_published": "2024-12-28T12:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 28 (APP):Minister for Power Division Sardar Awais Ahmed Khan Leghari on Saturday expressed the hope that privatization of three power distribution companies (DISCOs) would be completed by end of next year.\nSharing the last 9 months performance of power sector under the dynamic leadership of Prime Minister Shehbaz Sharif at press conference here, the minister said the government was moving towards privatization and concession models and already appointed members of Board of Directors (BoDs) of DISCOs purely on merit. Circular debt costs were also being shifted from electricity bills to the national debt to reduce burden on the consumers, he added.\nHe said the average price of electricity has decreased to Rs 44.04 per unit from Rs 48.70 per unit owing the reforms initiated in power sector by the incumbent government. Similarly, average power tariff for industrial consumers has also decreased to Rs 47.17 per unit from Rs 59.50 per unit, he added.\nBoth the domestic and industrial consumers have witnessed Rs 4.66 per unit and Rs 11.33 per unit decreases respectively in the tariff since June 2024.\nHe went on to say that  the government has eliminated Rs 150 billion in cross-subsidies from the industrial sector, a step that has boosted industrial growth and job creation in Pakistan. The government was also diligently working on upgrading the transmission sector, including the division of National Transmission and Despatch Company (NTDC) into three entities, he added.\nHe said NTDC would be divided into three entities including the National Grid Company of Pakistan for efficient and reliable transmission, the Energy Infrastructure Development and Management Company for project management, and the Independent System and Market Operator for a competitive and transparent electricity market.\nRegarding Independent Power Producers (IPPs), he said agreements with five IPPs had been terminated in the first phase which would help savings of Rs 411 billion. In the second phase, agreements with eight bagasse-based IPPs have also been settled which resulted annual savings of Rs 8.826 billion and overall saving of Rs 238.224 billion, he added.\nHe said talks with 16 more IPPs were going on and it would help saving additional Rs 481 billion to the national exchequer.\nRegarding switching agricultural tube-wells on solar in Balochistan, the minister said that 27,000 tube-wells were being solarized. The project would cost Rs 55 billion for which 70 per cent share was being provided by the federal while remaining 30 per cent by the provincial government, he added\nHe said this initiative would promote green energy and revolutionize the agriculture sector in Balochistan.\nSardar Awais said the incumbent government continued its people-welfare development agenda despite a continuous drive by Imran Khan led political party Pakistan Tehreek-e-Insaf to create instability in the country.\nComing hard on PTI, he said the previous government did nothing in power sector during its around four-year rule while the government led by PML-N did remarkable achievement in just 9 months.\nHe said the government has also announced to set up an Independent Market Operator in power sector adding that the government would not involve in sale and purchase of electricity. The companies would do sale and purchase business in the power sector, he added.\nAbout electricity winter package, the minister said the package introduced a special tariff Rs 26 per unit for domestic, commercial and industrial consumers for three months. “This initiative underscores our commitment to reducing electricity costs and supporting economic growth,” he added.\nHe said it was also necessary to enhance demand of electricity consumption for lowering power tariff.\nAwais said that the government has planned to introduce special tariffs for electric vehicles (EVs) under a forthcoming EV policy. The policy would reduce dependency on imported fuels, lower greenhouse gas emissions, and improve air quality, he added.\nHe said it would also foster economic growth through job creation in local manufacturing and the development of charging infrastructure. “This new policy will revolutionize the transport sector of Pakistan,” he added.\nHe said the PM has also approved the power distribution system and in next two years Rahim Yar Khan to Matairi Transmission Line project would be completed.\nHe said efforts were also being made to manage circular debt burden, with a focus on reducing consumer electricity costs. Power Sector’s debt was being restructured with the Finance Ministry, he added.\nHe said that the government was committed to delivering affordable, sustainable, and reliable electricity to the people. The reforms and achievements reflect our dedication to addressing long-standing challenges in the power sector while building a resilient and prosperous future, he added.\nReplying to a question, he stressed the need to bring reforms in power regulator.\nTo another query, the minister said that losses of DISCOs companies except in Sindh and Balochistan witnessed significantly decrease during the last 9 months.\nTo a question, he said over billing of Rs 50 billion was detected in Lahore Electric Supply Company but now no one would be allowed to carry out over-billing.\nThe system of complaint system in DISCOs was also being digitized.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:07:22.253Z"
}
