{
  "title": "Security Forces successfully foil multiple infiltration attempts by Khawarij, Afghan Taliban at Pak-Afghan border",
  "link": "https://www.app.com.pk/national/security-forces-successfully-foil-multiple-infiltration-attempts-by-khawarij-afghan-taliban-at-pak-afghan-border/",
  "date_published": "2024-12-28T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 28 (APP):Security Forces successfully foiled multiple infiltration attempts by Khawarij terrorists and Afghan Taliban at Pakistan-Afghanistan border.\n“On the night of December 27 and 28, a group of 20 to 25 Fitna-al-Khawarij  terrorists attempted to cross into Pakistan from two locations in Kurram and North Waziristan by using Afghan Taliban border posts. However, Pakistani security forces acted promptly and foiled their infiltration attempt sources said.\nThe terrorists again attempted to enter into Pakistan in wee hour of Saturday by using the Afghan Taliban border posts and upon their failure resorted to unprovoked firing with heavy weapons on Pakistani border posts, they said.\nIn retaliation, Pakistan’s security forces swiftly responded back with full force. The sources conformed heavy losses on the Afghan side, with casualties of over 15 terrorists and Afghan Taliban fighters and several others injured.\nDue to the effective prompt action and shelling, Afghan Taliban forces fled while abandoning their six posts, the sources ssid.\nNo fatalities were reported among Pakistani security personnel, while three soldiers sustained injuries during the exchange of fire.\nThe sources said that Pakistan has repeatedly urged the interim Afghan government to prevent terrorists from using Afghan soil for anti-Pakistan activities. However, the Afghan Taliban have allegedly continued to support these elements instead of suppressing them. The terrorists operate freely within Afghanistan, carrying out terrorist activities against Pakistan, the sources said.\nPakistani security forces are fully capable of giving a decisive response to any act of aggression.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:07:22.253Z"
}
