{
  "title": "Senator Afnan pledges to support ‘Digital Rights Bill’, boosting Pakistan’s digital transformation",
  "link": "https://www.app.com.pk/national/senator-afnan-pledges-to-support-digital-rights-bill-boosting-pakistans-digital-transformation/",
  "date_published": "2024-12-28T05:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 28 (APP): Pakistan Muslim League-Nawaz (PML-N) Senator and member Senate Standing Committee on IT Afnan Ullah Saturday pledged to support PPP Chairman Bilawal Bhutto-Zardari’ s digital rights bill, acknowledging the significant role of PPP in backing PML-N’s interests.\nIn an exclusive interview with a private news channel, Senator Afnan Ullah Khan stated that the PML-N would support the PPP’s digital rights bill, underscoring the significance of their coalition partnership and commitment to advancing Nawaz Sharif’s ‘Digital Pakistan’ initiative.\nSenator Afnan Ullah Khan highlighted PML-N’s past achievements in IT development and expressed commitment to continuing these efforts in line with Nawaz Sharif’s vision of transforming Pakistan into a digital hub.\n“I am pleased to announce that internet users in Pakistan will soon experience faster internet speeds, he said, adding, the PTA chairman and IT minister are collectively addressing this issue and we have introduced multiple bills that will yield fruitful results in the coming months.”\nSenator Afnan emphasized that Pakistan was actively working towards transforming into a digitalized nation, with a focus on providing high-speed internet facilities to its citizens. This initiative is part of the government’s efforts to enhance connectivity, improve digital infrastructure and increase investment in digital skills, he added.\nOur goal is to create a knowledge-based economy, driven by innovation and entrepreneurship, which will ultimately spur economic growth, he said, adding, to achieve this, the Ministry of IT and Telecom has been launching programs to build a network of National Incubation Centers and inducting over promising start-ups. With the support of initiatives like the Digital Pakistan program, Pakistan is poised to become a leading player in the global digital landscape, he added.\nResponding to a query, Senator Afnan Ullah Khan also acknowledged that Pakistan was facing challenges in its digital transformation journey, however, he assured that these challenges were being addressed and would be resolved soon.",
  "retrievedAt": "2025-08-10T14:07:01.323Z"
}
