{
  "title": "President Zardari vows to uphold Bhutto family’s legacy of serving humanity, poor",
  "link": "https://www.app.com.pk/national/president-zardari-vows-to-uphold-bhutto-familys-legacy-of-serving-humanity-poor/",
  "date_published": "2024-12-28T15:02:00.000Z",
  "source": "APP",
  "content": "SUKKUR, Dec 28 (APP): President Asif Ali Zardari on Saturday vowed to keep up the Bhutto family’s legacy of public service, dedicated to improving the socio-economic well-being of the nation. He hailed the establishment of Dr Ziauddin Hospital Sukkur Campus, adding that it will provide quality healthcare services to the people of Sukkur.\nThe President expressed these views while addressing the inauguration of Ziauddin Hospital in Sukkur. Chief Minister Sindh Syed Murad Ali Shah, Chief Minister Balochistan Mir Sarfaraz Ahmed Bugti, Dr Asim Hussain, Sindh provincial ministers, MNAs, MPAs, hospital establishment, and people from different walks of life attended the event.\nSpeaking at the event, President Asif Ali Zardari hailed the inauguration of the state-of-the-art hospital as a transformative moment for Sukkur and its surrounding areas. He praised Dr Asim Hussain and the Ziauddin Hospital management for their efforts in establishing a facility equipped with cutting-edge technology and a team of highly skilled professionals.\nThe President reflected on his personal involvement in encouraging Ziauddin Hospital to invest in Sukkur, highlighting the need for such initiatives to uplift healthcare standards in underserved areas. He said that the Government of Sindh would also bear the expenses for the establishment of a university at the Ziauddin Hospital Sukkur Campus. He stated that he had also donated his personal land for establishing Dr Ziauddin Hospital’s campus in Hyderabad.\nThe President also highlighted that Rohri canal was being lined from its beginning and Rs 15 billion would be spent annually in this regard. He said that the funds generated from the trading of carbon credits in the international market were being used for the lining of the Rohri Canal project.\nThe President said that the hospital exemplified Dr Asim Hussain and his family’s unwavering commitment to providing quality healthcare services to the people. He highlighted that Dr Ziauddin was a member of the Central Legislative Assembly before Pakistan’s independence and an associate of Quaid-i-Azam Muhammad Ali Jinnah, and now his family was carrying forward his legacy.\nPresident Asif Ali Zardari highlighted the significance of the university campus, where medical students can pursue higher education. He emphasized that providing top-notch healthcare facilities to the public was a top priority and reiterated his commitment to ensuring that the people of Pakistan have access to quality medical care.\nSindh Chief Minister Syed Murad Ali Shah welcomed the establishment of Dr. Ziauddin Hospital in Sukkur, terming it a significant milestone in the province’s healthcare landscape. He praised the Dr. Ziauddin Network for setting up hospitals and educational institutions in Sindh, and expressed his desire to see the network expand to Hyderabad.\nHe congratulated the people of Sukkur on having access to a world-class hospital, which will not only benefit the local population but also provide quality medical care to surrounding areas. He assured that the Sindh government is committed to providing full support for the establishment of another hospital in Hyderabad.\nThe chief minister also announced that a separate road is being constructed to connect the Dr. Ziauddin Hospital to the Sukkur Airport, which will be completed soon. He noted that the hospital’s establishment will further enhance the healthcare facilities available to the people of Sukkur, which already has several major hospitals.\nMurad also appreciated Dr. Asim Hussain’s announcement to establish world-class schools in Sindh, calling it a welcome move. He assured that the Sindh government will provide full cooperation in this endeavor.",
  "retrievedAt": "2025-08-10T14:06:36.866Z"
}
