{
  "title": "Pakistan honoured by WHO for eliminating Trachoma",
  "author": null,
  "content": "ISLAMABAD, May 19 (APP): In a landmark achievement for Pakistan’s healthcare system, the World Health Organization (WHO) has officially recognized the country for eliminating trachoma as a public health problem.\nThe announcement was made during the 78th World Health Assembly held in Geneva.\nFederal Minister for Health, Syed Mustafa Kamal, received the prestigious honorary certificate from WHO Director-General Dr. Tedros Adhanom Ghebreyesus in a special ceremony on the sidelines of the assembly.\nThe recognition highlights Pakistan’s sustained efforts and success in combating one of the world’s leading infectious causes of blindness.\n“This is a proud moment and a major achievement for Pakistan’s public health system,” said Minister Kamal. “It reflects our government’s commitment to safeguarding the vision and wellbeing of every Pakistani citizen.”\nTrachoma is a bacterial eye infection that can cause irreversible blindness if left untreated.\nIts elimination marks a major public health victory and serves as a model for other countries working to combat neglected tropical diseases.\nThe achievement is the result of years of coordinated policy implementation, extensive community-based health programs, and robust support from global health partners.\nMinister Kamal praised the tireless efforts of health workers, national and provincial health departments, and development agencies whose contributions made the elimination possible.\n“This success would not have been possible without the dedication of our frontline workers and the strong collaboration between federal, provincial, and international partners,” he added.\nThe Health Minister also reaffirmed Pakistan’s determination to eradicate polio, stating, “Just as we have eliminated trachoma, we are determined to make polio a thing of the past.”\nThe WHO recognition underscores Pakistan’s progress in tackling preventable diseases and reinforces its commitment to advancing public health for all citizens.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:38:07.980Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-honoured-by-who-for-eliminating-trachoma/",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T14:28:00.000Z"
}
