{
  "title": "PM laptop scheme deadline extended: students get a second chance",
  "author": null,
  "content": "ISLAMABAD, May 19 (APP):The Prime Minister’s Youth Laptop Scheme has announced an extension of its registration deadline from May 20 to June 1, 2025.\nThe deadline extension opened up a new window of opportunity for students to leverage the scheme’s resources and enhance their digital literacy.\nAccording to an official,the scheme, part of the Prime Minister’s Youth Programme, has been well-received by students across the country.\nWith the new deadline, students who may have missed the initial opportunity can now apply and benefit from the program.               As part of the government’s efforts to promote smart education and digital empowerment among youth, the scheme aims to empower 100,000 talented students with laptops to enhance their academic and research capabilities.\nThe scheme’s website has seen a significant spike in traffic, with thousands of students successfully submitting their applications.\nAs part of the government’s efforts to promote education and innovation,PMLS Phase-IV is now officially open for applications.\nThe government has announced the eligibility guidelines for the laptop distribution scheme, ensuring a fair and merit-based selection process.\nAccording to the guidelines, students pursuing higher education in recognized public sector institutions are eligible to apply.\nTo qualify, students must be currently enrolled in PhD, MS/MPhil, Bachelor’s, or Master’s programs and meet specific academic requirements.\nA minimum CGPA of 2.80 or 60% marks is mandatory, while first-year students need to submit their HSSC marks.                                  MS/PhD students in their first semester are required to submit the results of their previous degree.\nThe distribution of laptops will also follow a quota system, with 18% reserved for students in Balochistan’s higher education institutions and 5% for distance learning students.       Within the distance learning quota, 2.5% will be allocated to Virtual University and 2.5% to Allama Iqbal Open University.\nImportantly, only currently enrolled students are eligible, and those who have already graduated are not entitled to benefit from the scheme, even if they applied during their enrollment.\nLaptops will be awarded based on inter-se merit within departments and degree programs, following a transparent selection process.\nStudents can  register through Prime Minister’s Digital Youth Hub (DYH) App or Visit Prime Minister’s Youth Programme (PMYP) official website: www.pmyp.gov.pk, which is now live and operational.\nAll applicants are encouraged to apply early.\nA 15-day window will be provided to raise any objections or grievances once the provisional merit list is published.                                       After addressing all concerns, the final merit list will be released.\nThe Prime Minister’s Laptop Scheme Phase-IV is more than just a government program but it’s a symbol of hope and investment in the future of our students. It recognizes that in today’s world, digital access is as vital as a textbook or a classroom.\nThe scheme, a flagship program of the Prime Minister’s office, has already started showing promising results, with thousands of students benefiting from the initiative.\nBy providing laptops to talented and deserving students, the government aims to bridge the digital divide, foster innovation, and equip the next generation with the skills required to compete in the global economy.\nThe scheme’s implementation is being closely monitored, with a focus on transparency, efficiency, and merit-based selection.\nThe Prime Minister’s Youth Laptop Scheme 2025 is a testament to the government’s commitment to investing in the country’s future – its youth.\nAs the scheme continues to gain momentum, it is expected to have a lasting impact on Pakistan’s education landscape, empowering students to achieve their full potential and contribute to the nation’s progress.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:39:17.142Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-laptop-scheme-deadline-extended-students-get-a-second-chance/",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T09:50:00.000Z"
}
