{
  "title": "Zaheer Ahmed Baber Sidhu visits residence of Squadron Leader Usman Yousaf Shaheed",
  "author": null,
  "content": "Rawalpindi, May 19 (APP): Air Chief Marshal Zaheer Ahmed Baber Sidhu, Chief of the Air Staff, Pakistan Air Force, on Monday visited the residence of Squadron Leader Usman Yousaf Shaheed in Rawalpindi to offer Fateha and convey his condolences to the bereaved family.\nThe Air Chief paid rich tribute to Squadron Leader Usman Yousaf Shaheed, who gave the supreme sacrifice and embraced martyrdom in the line of duty during the recent enemy attack on an operational Air Base of Pakistan Air Force, said an ISPR news release.\nChief of the Air Staff assured the family of the Shaheed officer that the services and sacrifices of our martyrs will forever be etched in the nation’s memory and honored with unwavering reverence.\nHe also offered Fateha for the elevation of the martyr’s ranks in heaven and prayed that Allah Almighty grant patience to the bereaved family.\nLater, Air Chief Marshal Zaheer Ahmed Baber Sidhu visited Combined Military Hospital Rawalpindi, where he met with injured personnel from Pakistan Air Force, Pakistan Army, as well as civilians who sustained injuries during the conflict.\nHe also received a comprehensive medical briefing on their condition and interacted with the wounded personnel, lauding their resilience and unwavering courage in the face of adversity. He directed the hospital staff to provide the best possible medical care and administrative support to the injured personnel.\nSpeaking on the occasion, Chief of the Air Staff reiterated Pakistan Air Force’s steadfast resolve to defend the aerial frontiers of Pakistan at every cost and to uphold the legacy of valour & commitment demonstrated by its personnel in the line of duty.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:39:20.101Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/zaheer-ahmed-baber-sidhu-visits-residence-of-squadron-leader-usman-yousaf-shaheed/",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T06:52:00.000Z"
}
