{
  "title": "Kamal meets Cuban Health Minister in Geneva",
  "author": null,
  "content": "ISLAMABAD, May 19 (APP): Federal Minister for Health, Syed Mustafa Kamal on Monday met with the Minister of Health of Cuba on the sidelines of the 78th World Health Assembly in Geneva, marking a significant step toward enhanced health cooperation between Pakistan and Cuba.\nAccording to a spokesperson of Pakistan’s Ministry of Health, the meeting was held in a constructive and cordial atmosphere, with both sides exchanging views on areas of mutual interest in the health sector.\nMinister Kamal expressed heartfelt gratitude to the Cuban government for its humanitarian assistance following the devastating 2005 earthquake in Pakistan, particularly for dispatching a 2,000-member medical mission that provided critical support during a time of national crisis.\nThe two ministers emphasized the need to strengthen primary and secondary healthcare systems, with Minister Kamal commending Cuba’s well-integrated healthcare model. “Cuba has established an exemplary system from which Pakistan can learn significantly—particularly in delivering care efficiently at the primary and secondary levels,” he remarked.\nThe Cuban Health Minister explained that 70–80% of patients in Cuba receive treatment at the primary care level, reducing pressure on hospitals and enhancing overall system efficiency.\nHe offered insights into how such a model could be adapted to benefit Pakistan.\nDiscussions also included potential collaboration in pharmaceutical production, vaccine development, and capacity building.\nMinister Kamal highlighted the importance of fostering long-term ties for knowledge sharing and innovation in healthcare.\nWith Pakistan’s population reaching 240 million and seven million newborns annually, Minister Kamal underscored the urgent need for local vaccine manufacturing.\nHe sought Cuba’s support in transferring vaccine production technology and strengthening Pakistan’s immunization efforts.\nThe meeting also explored opportunities for training Pakistani healthcare professionals in Cuba.\nMinister Kamal praised Cuba’s achievements in vaccine development, including its success in producing three COVID-19 vaccines and ongoing work on several more.\nIn a gesture of goodwill, the Cuban Health Minister invited Minister Kamal to visit Cuba to observe its healthcare infrastructure firsthand. Minister Kamal accepted the invitation and expressed interest in arranging the visit soon.\nThe two leaders agreed to deepen cooperation in vaccine and pharmaceutical production, promote academic and scientific exchanges, and maintain regular high-level engagements.\nThe meeting concluded with both ministers reaffirming their commitment to a sustained and strategic health partnership.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:37:40.033Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kamal-meets-cuban-health-minister-in-geneva/",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T14:30:00.000Z"
}
