{
  "title": "Govt committed to rebuilding 12 Flood-Damaged bridges on Kalam road: NA told",
  "author": null,
  "content": "ISLAMABAD, May 19 (APP): Parliamentary Secretary for Communications, Gul Asghar Khan, informed the National Assembly on Monday that the government is taking all necessary steps to reconstruct 12 bridges on Kalam Road (N-95), which were severely damaged during the catastrophic floods of 2022.\nResponding to a calling attention notice regarding delays in the rehabilitation of the bridges and a 6-kilometre stretch of road—originally part of an Asian Development Bank (ADB)-funded project launched in 2010—he said the infrastructure was spread over several kilometre corridor in Swat.\nKhan explained that the initial construction contract, awarded in 2013, was terminated in November 2020 due to the contractor’s poor performance. A new contract was awarded in 2021, but the unprecedented floods of 2022 again halted progress, destroying records and drastically altering the region’s hydrology with water levels rising up to three meters.\nTo address these changes, the government enlisted Australian consultants to reassess the hydrological landscape and redesign flood protection structures. However, as the ADB loan approached its closure deadline, funding constraints delayed further work.\nHe assured the House that the Ministry of Communications is now working to financially close the project and resume full-scale reconstruction activities.\nIn the interim, temporary connectivity solutions, such as speed coaches, have been deployed to facilitate transportation.\nRegarding the 6-kilometre road segment washed away by the floods, Khan said 95% of the stretch was affected. Although the Prime Minister had announced a rehabilitation package, implementation was delayed due to funding issues. The project has now been revised to a cost of Rs. 7 billion, and reconstruction work has resumed.\nHe also informed the House that the previous contractor has been blacklisted and penalized for non-performance. A new contract worth Rs. 276 million for six bridges has been uploaded on the Pakistan Road Asset Management System (RAMS) and is currently under execution.\nReaffirming the government’s commitment, he said that restoring infrastructure damaged by natural disasters—particularly in strategically significant areas like Swat—remains a top priority.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:36:58.909Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-committed-to-rebuilding-12-flood-damaged-bridges-on-kalam-road-na-told/",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T17:24:00.000Z"
}
