{
  "title": "Gilani meets, Archbishop Edgar Peña Parra, reaffirms commitment to peaceful cooperation",
  "author": null,
  "content": "ISLAMABAD, May 19 (APP): Chairman Senate Syed Yousuf Raza Gilani met with Archbishop Edgar Peña Parra, Deputy Secretary of State of the Holy See, in Rome and reiterated Pakistan’s commitment to fostering close ties and promoting global peace through dialogue and cooperation.\nThe meeting took place during Chairman Gilani’s visit to Rome, where he is leading a four-member delegation on behalf of Prime Minister Muhammad Shehbaz Sharif to represent Pakistan at the inauguration ceremony of His Holiness, the Pope, said a press release issued here on Monday.\nGilani fondly recalled his interaction with His Holiness during the ceremony and conveyed his best wishes for the Pope’s mission ahead.\nHe also expressed Pakistan’s appreciation for the Pope’s constructive remarks and call for peaceful resolution amid recent tensions between India and Pakistan.\n“The Pope’s advocacy for peace and prosperity in South Asia through dialogue reflects our own aspirations for regional harmony,” Gilani said.\nArchbishop Edgar Peña Parra, who previously served as the Vatican’s Representative in Islamabad from 2011 to 2015, reaffirmed the Holy See’s commitment to strengthening bilateral cooperation and fostering deeper engagement with Pakistan.\nHighlighting Pakistan’s sacrifices in the fight against terrorism, Gilani said that the country had suffered immensely due to decades-long terrorism and continued to host over 3.5 million Afghan refugees since 1988.\n“A peaceful neighborhood is in Pakistan’s foremost national interest. This is why we actively promote dialogue as the only viable path to regional peace and development,” the Chairman emphasized.\nThe two sides agreed to continue working closely on matters of mutual interest, particularly those concerning interfaith harmony, regional stability, and global peace.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:37:59.515Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gilani-meets-archbishop-edgar-pena-parra-reaffirms-commitment-to-peaceful-cooperation/",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T14:09:00.000Z"
}
