{
  "title": "PM lauds Pak Navy’s ‘deterrent response’ in Operation Bunyanum Marsoos",
  "author": null,
  "content": "KARACHI, May 19 (APP): Prime Minister Shehbaz Sharif on Monday lauded the role of Pakistan Navy during Operation Bunyanum Marsoos for its “resolute posture, operational dexterity, and effective deterrent response” in countering adversarial maritime threats.\nAddressing a gathering of Pakistan Navy’s officers and sailors at the Pakistan Navy Dockyard, he paid tribute to them in safeguarding sea lines of communication and ensuring the uninterrupted flow of maritime trade, while maintaining absolute maritime sovereignty through a layered and assured seaward defence.\nPM Sharif said in the recent tense situation, the entire nation acted as an iron wall and stood by its brave armed forces.\nHe mentioned that the readiness of the Pakistan Navy was exemplary and it was vigilant to make history like 1965 had India committed any naval aggression.\nPaying tribute to naval forces, the Prime Minister said due to operational preparedness, the Indian Navy’s Ship Vikrant never dared to enter into the 400 nautical miles into the sea.\nHe recalled Pak Navy’s proud legacy of decisive operations, adding that the marine force remained fully capable of executing high-intensity operations akin to the historic Operation Dwarka, whenever and wherever required.\n“Strong coordination among the armed forces is a golden chapter in the country’s history,” he said and added that the ground forced targeted the enemy’s positions with precision using Fatah missiles and other weapons.\nAlso, the Pakistan Air Force taught the enemy a lesson with modern technology which it would remember for long.\nThe Prime Minister paid tribute to the Chief of the Army Staff General Syed Asim Munir, Chief of the Air Staff Air Chief Marshal Zaheer Ahmed Babar and the Chief the Naval Staff Admiral Naveed Ashraf for their unforgettable role in defending their motherland.\nHe also saluted all services chiefs and specially Lt. Yasir Shaheed of PNS Mehran for his great sacrifice.\nPrime Minister said during tense situation, Karachi Port, Qasim Port and the mega city remained completely functional and all commercial ships continued to enter and exit without interruption, while commercial activities on the western coast of India remained suspended.\nHe said the enemy also acknowledged the fact that Pakistan’s Navy had changed the power equilibrium in the Arabian sea, adding that it was the victory of whole nation as well as of the Naval Force.\nThe Prime Minister expressed gratitude to the leaders including Turkish President Recep Tayyip Erdogan, Saudi Crown Prince Mohammed bin Salman, UAE President Sheikh Mohammed bin Zayed, Qatari Emir Sheikh Tamim, Chinese President Xi Jinping and US President Trump, for their support.\nShehbaz Sharif termed US President Donald Trump as man of peace for his intervention to deescalate war between two nuclear countries and playing pivotal role for ensuring ceasefire.\nUpon arrival, the Prime Minister was received by Chief of the Naval Staff Admiral Naveed Ashraf. Chief of the Army Staff General Syed Asim Munir and Chief of the Air Staff Air Chief Marshal Zaheer Ahmad Baber Sidhu were also present.\nDuring the visit, the Prime Minister boarded the Type-054 A Class Destroyer PNS TAIMUR, where he was briefed by Commander Pakistan Fleet on the Pakistan Navy’s strategic orientation, operational undertakings, and noteworthy contributions during the ongoing operation.\nPM Sharif interacted with officers and sailors of the Pakistan Navy, lauding their exemplary professionalism, combat readiness, and steadfast commitment to national defence. He conveyed the nation’s deep appreciation and reaffirmed unwavering confidence in the capabilities of Pakistan’s armed forces.\nMinister for Defence Khawaja Muhammad Asif, Minister for Planning, Development and Special Initiatives Ahsan Iqbal Chaudhary, Minister for Information and Broadcasting Attaullah Tarar, and Federal Minister for Education and Professional Training Dr Khalid Maqbool Siddiquie attended the event.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:36:37.078Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-lauds-pak-navys-deterrent-response-in-operation-bunyanum-marsoos/",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T18:54:00.000Z"
}
