{
  "title": "Nine Bills pass through Senate",
  "author": null,
  "content": "ISLAMABAD, May 19 (APP):The Senate of Pakistan passed nine significant bills on Monday, following extensive debates and discussions.\nThese bills, which had already been approved in the lower house of Parliament, cover a broad range of issues, from child marriage prevention to amendments in national laws concerning trade organizations and motor vehicle safety.\nOne of the most contentious pieces of legislation, The Islamabad Capital Territory Child Marriage Restraint Bill, 2025, was presented by Senator Sherry Rehman.\nWhile the bill garnered significant support, it also faced strong objections from some members of the Senate. Senators Kamran Murtaza and Attaur Rehman raised concerns over the bill and suggested referring it to the Council of Islamic Ideology for further review. Despite these objections, the bill was passed after a heated debate.\nIn addition to the child marriage bill, several other key legislative changes were approved, including:\nThe Trade Organizations (Second Amendment) Bill, 2025, presented by Shahadat Awan.\nThe Anti-Rape (Investigation and Trial) (Amendment) Bill, 2023, introduced by Samina Mumtaz Zehri, which aims to strengthen the legal framework for the investigation and prosecution of rape cases.\nThe University of Innovation and Technology Bill, 2023, presented by Umer Farooq, which seeks to establish a new institution focused on fostering innovation in higher education.\nThe Provincial Motor Vehicles (Amendment) Bill, 2024, and The National Highways Safety (Amendment) Bill, 2024, both introduced by Senator Mohsin Aziz, aim to improve road safety and regulation of motor vehicles in the country.\nThe China Pakistan Economic Corridor Authority (Amendment) Bill, 2022, put forward by Senator Muhammad Abdul Qadir, which seeks to streamline the operations of the CPEC Authority. The Provincial Motor Vehicles (Amendment) Bill, 2023, presented by Shahadat Awan.\nAdditionally, The Pakistan Names and Emblems (Prevention of Unauthorized Use) (Amendment) Bill, 2023, presented by Shahadat Awan, was passed, tightening regulations surrounding the unauthorized use of Pakistan’s national symbols.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:37:06.032Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nine-bills-pass-through-senate-2/",
  "dateList": "2025-05-19",
  "date_published": "2025-05-19T16:55:00.000Z"
}
