{
  "title": "AIOU marks Black Day to show solidarity with Kashmiri people",
  "link": "https://www.app.com.pk/national/aiou-marks-black-day-to-show-solidarity-with-kashmiri-people/",
  "date_published": "2023-10-27T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP):Allama Iqbal Open University (AIOU) observed Black Day against the humanitarian atrocities and human rights abuses in Indian Illegally occupied Jammu and Kashmir (IIOJK) by arranging a seminar with the presence of faculty members, officers, employees and students.\nDirector General Regional Services, Dr Malik Tauqir Ahmed Khan presided over the seminar, while the Chairperson of the Department of History, Dr. Kishwar Sultana hosted the event.\nDr. Malik Tauqir stated that Pakistan has always stood by the Kashmiri people and will continue to support them, as Muhammad Ali Jinnah said, “Kashmir is the aorta of Pakistan”, It is our duty to protect Kashmir.\nDr. Ashraf Wani, as a guest speaker, conveyed the voice of the Kashmiris and stated that seminars, conferences, and observance of Black Day boost the morale of Kashmiris. They want the Muslim Ummah to practically stand with them and Palestine during these difficult times just as the whole West stands with Israel against Palestine.\nDr. Abdul Basit Mujahid, Dr. Kausar Parveen, Dr. Muhammad Sajid Khan and Dr. Malik Hamad Ahmed also spoke at the event.\nThe speakers condemned the Indian occupation and emphasized the need for human rights organizations and the international community to play a role.\nThey said that Indian atrocities against the people of IIOJK are regrettable and condemnable and the Pakistani nation is saddened by human rights violations in Kashmir.\nA solidarity walk was also held to express solidarity with Kashmir, in which faculty members, officers, employees and students participated.\nThe participants, holding banners and posters, chanted different slogans in solidarity with Kashmir.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:16:38.936Z"
}
