{
  "title": "Home Minister Sarfraz Bugti’s message on the occasion of “Black Kashmir Day”.",
  "link": "https://www.app.com.pk/national/home-minister-sarfraz-bugtis-message-on-the-occasion-of-black-kashmir-day/",
  "date_published": "2023-10-27T09:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Caretaker Federal Minister for Interior Sarfraz Bugti in his message on Black Kashmir Day on Friday, said that October 27 was the darkest day in the history of the state of Jammu and Kashmir.\nHe said, on October 27, 1947, Indian army usurped the freedom of people of Jammu and Kashmir and seized the whole area illegally and turned a large part of Occupied Jammu and Kashmir into a military cantonment. Today, 76 years have passed, India continues to forcefully occupy this area even after 76 years, said the minister and added that UN and international organizations could not stop India from atrocities.\nThe minister said that Narendra Modi had flouted UN resolutions and overturned the political system in Occupied Valley on August 5, 2019.\nNew laws were imposed to suppress the voice of Kashmiri people, said the minister adding that the true representatives of the Kashmiri people have been suffering the hardships of imprisonment for years.\nHe said restrictions are being imposed on the media to hide Indian atrocities from the eyes of the world whereas thousands of innocent Kashmiris have sacrificed their lives in this war of freedom movement.\nThe minister further said that even such a large army of India is unable to suppress the struggle of Kashmiris for the right to self-determination.\nThe latest situation in Gaza has proved that long unresolved conflicts are still a threat to world peace, said the minister adding that the right of Kashmiris to self-determination was a universally recognized right.\nHe said that Kashmiri people were still adamant about their just struggle and the people of Pakistan stood with Kashmiris and were standing and would continue to stand with them.\nIndia cannot suppress the freedom spirit of Kashmiris with the use of force and Pakistan will continue its full moral, diplomatic and political support to the Kashmiris, he expressed.",
  "retrievedAt": "2025-08-11T10:15:44.132Z"
}
