{
  "title": "Pakistan observes 76th anniversary of India’s occupation of Jammu and Kashmir as ‘Black Day’",
  "link": "https://www.app.com.pk/national/pakistan-observes-76th-anniversary-of-indias-occupation-of-jammu-and-kashmir-as-black-day-2/",
  "date_published": "2023-10-27T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP):The government and the people of Pakistan and Kashmiri people on Friday observed the 76th anniversary of the Indian troops’ landing in Jammu and Kashmir as a ‘Black Day’.\nThe president, the prime minister and the foreign minister, in their special messages on the occasion, reiterated Pakistan’s unflinching moral, diplomatic and political support to the Kashmir Cause.\nThey also underscored the need to reverse India’s illegal and unilateral actions of 5th August 2019, which have triggered a process aimed at changing the demographic structure and political landscape of the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe foreign minister addressed letters to the President UN General Assembly, the President UN Security Council, the UN Secretary General, the UN High Commissioner for Human Rights and the OIC Secretary General to apprise them of the latest situation in IIOJK.\nIn the letters, the foreign minister called for the implementation of the relevant UN Security Council resolutions to enable the people of Jammu and Kashmir to determine their own future. He requested the international community to urge India to immediately release the political prisoners and dissenters, including Yasin Malik, for whom the Indian authorities had  sought a death penalty.\nThe foreign secretary briefed the Islamabad-based diplomatic missions on the situation in IIOJK. He also highlighted the legal, security and human rights dimensions of the Jammu and Kashmir dispute.\nA ‘Protest Walk’ was also held from Foreign Office to ‘D-Chowk’ on the Constitution Avenue in Islamabad . It was led by Federal Minister for Information and Broadcasting Murtaza Solangi, and participated by the officers and staff members of the Ministry of Foreign Affairs.\nA range of activities, including public rallies, seminars, webinars, panel discussions and photo exhibitions, were being organized throughout the country to mark the ‘Black Day’.\nWith the active participation of Pakistani and Kashmiri diaspora, Pakistan’s diplomatic missions around the world also arranged special events to raise global awareness about India’s decades-long occupation of Jammu and Kashmir.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:16:42.967Z"
}
