{
  "title": "Japanese government honors former Pakistani diplomat",
  "link": "https://www.app.com.pk/national/japanese-government-honors-former-pakistani-diplomat/",
  "date_published": "2023-10-27T14:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): The Government of Japan has conferred the 2023 Spring Imperial Decorations, “The Order of the Rising Sun, Gold and Silver Star” on Imtiaz Ahmad, former Ambassador of Pakistan to Japan.\nThis distinguished honor was bestowed upon him in recognition of his significant contribution towards strengthening friendship, cultural and economic relations and mutual understanding between Japan and Pakistan said a news release of the embassy.\nThe Order of the Rising Sun is awarded by the Emperor of Japan to Japanese and foreign individuals in recognition of their long-time contributions.\nOn behalf of the Government of Japan, WADA Mitsuhiro, the Ambassador of Japan to Pakistan conferred the decoration on Imtiaz Ahmad at a ceremony held at the Ambassador’s residence on Friday.\nThe ceremony was attended by the family, relatives, friends, and colleagues of Imtiaz Ahmad Asad Majeed Khan, former Foreign Secretary, and former Ambassador of Pakistan to Japan.\nIn addition to his regular diplomatic activities, he has made great contributions to the Japanese people. During his tenure as Deputy Chief of Mission at the Embassy of Pakistan in Tokyo, the Great East Japan Earthquake occurred on March 11, 2011.\nAfter the earthquake, he reached out to the Pakistani community in Tokyo and visited the affected areas with them every weekend to serve Pakistani food and distribute relief supplies.\nMany Japanese people were moved by his and the Pakistani people’s dedication, and his presence with the disaster victims was highly praised by the Pakistani and Japanese media.\nIn July 2019, Imtiaz Ahmed came back to Japan, as the Ambassador of Pakistan. That year has marked the beginning of a new era, Reiwa, for Japan. Ambassador Imtiaz has always played a significant role in strengthening our ties.\nLast year, when Japan and Pakistan celebrated the 70th anniversary of diplomatic relations, Imtiaz Ahmad played an important role in making this celebration a special one even amidst the difficult times of Covid 19 pandemic.\nIn his congratulatory remarks, Ambassador WADA greatly appreciated the efforts of Ambassador Imtiaz and said this prestigious imperial decoration is the acknowledgement of his efforts and dedication towards the further strengthening of friendly relations between Japan and Pakistan.\nFluent in the Japanese language and well versed with Japanese culture, Ambassador Imtiaz truly played the role of a bridge between Japan and Pakistan and deserves our sincere applause and commendation, said Ambassador WADA.\nOn receiving the award Imtiaz Ahmad expressed his gratitude to the Government of Japan and the Embassy of Japan in Islamabad for honoring his dedications by holding the special conferral ceremony in the Ambassador’s residence.",
  "retrievedAt": "2025-08-11T10:16:17.801Z"
}
