{
  "title": "Pakistan High Commissioner to UK urges int’l action to end human rights abuses in IIOJK",
  "link": "https://www.app.com.pk/national/pakistan-high-commissioner-to-uk-urges-intl-action-to-end-human-rights-abuses-in-iiojk/",
  "date_published": "2023-10-27T14:28:00.000Z",
  "source": "APP",
  "content": "LONDON, Oct 27 (APP): Pakistan High Commission observed Jammu and Kashmir Black Day here on Friday to commemorate a somber milestone in the history of the region.\nOn this day in 1947, India forcibly occupied Jammu & Kashmir by landing its army in Srinagar against the will and wishes of the Kashmiri people.\nThe event featured both virtual and in-person participation by cross-party British Parliamentarians, Kashmiri leaders, members of academia and representatives of human rights organizations.\nThe messages of the President, the Prime Minister and Foreign Minister of Pakistan were read out on this occasion.\nIn his remarks, Pakistan High Commissioner to UK Dr. Mohammad Faisal underscored the significance of Jammu and Kashmir Black Day, marking the day when India, 76 years ago, violated international law and morality by deploying its troops in Srinagar, based on a fraudulent instrument of accession.\nHe brought attention to the ongoing oppression of innocent Kashmiri people by the Indian occupation forces, a press release issued by Pakistan High Commission said.\nThe High Commissioner emphasized the urgent need for international action to end draconian laws and human rights abuses in the Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nBritish Parliamentarians and speakers expressed solidarity with the Kashmiris, highlighting concerns about the humanitarian crisis in IIOJK.\nThey called on the UK Government to protect Kashmiris’ rights, vowed to continue addressing human rights violations in the UK’s Parliament and urged India to grant access to human rights organizations.\nEmphasizing it as a matter of human rights and self-determination, they called for international intervention based on UN Security Council Resolutions.\nEarlier, a Photo Exhibition at the High Commission displayed evidence of ongoing atrocities committed by Indian occupation forces in IIOJK, serving as a stark reminder of the need to address the human rights situation and work towards a peaceful resolution of the Jammu & Kashmir dispute in accordance with the wishes of the Kashmiri people.\nThe worldwide commemoration of Jammu and Kashmir Black Day serves as a powerful reminder of the urgent need to address the humanitarian crisis in IIOJK, protect the human rights of the Kashmiris, and achieve an early resolution of the Jammu & Kashmir dispute.",
  "retrievedAt": "2025-08-11T10:16:19.384Z"
}
