{
  "title": "Kashmiris observe Black Day against continual 76-year-long Indian forced, unlawful Occupation of disputed Kashmir",
  "link": "https://www.app.com.pk/national/kashmiris-observe-black-day-against-continual-76-year-long-indian-forced-unlawful-occupation-of-disputed-kashmir/",
  "date_published": "2023-10-27T11:02:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK): Oct 27 (APP) :: Protest rallies warn world of the unending global war if Kashmir issue was not peacefully settled immediately on the eve of the Black Day observed at both sides of the LoC in internationally acknowledged disputed Jammu and Kashmir State on on Friday.\nJammu and Kashmir people inhibiting both sides of the line of control AJK and IIOJK, besides rest of the world observed Black Day on Friday, October 27 to mark strong protest and indignation against the continual forced and unlawful occupation of Jammu & Kashmir state for the last 76 years since this bleak day of 1947.\nThe People of Jammu and Kashmir living on either side of the LoC treat the day of October 27 as the Black Day in the history of the disputed State when India had forcibly landed its armed troops against the aspirations and the wishes of the people of the State.\nThe day is observed as the Black Day by Jammu and Kashmir people every year to mark extreme resentment and indignation over the continued unlawful and forcible occupation of bulk of Jammu Kashmir state by the Indian tyrannical forces. India had landed her armed military troops in Srinagar this day 76 years ago on October 27, 1947 contrary to the aspirations of the people of the State.\nIt was on this day in 1947 when Indian armed troops invaded Jammu and Kashmir and occupied it absolutely against the wishes of the Jammu and Kashmir people and in the sheer violations of the partition plan of the sub-continent denying all international norms and commitments.\nThis year too, the Black Day against continual forced Indian occupation is being observed at the time when the Kashmir freedom has reached at its climax following the massive continued anti-India protests by the people of the bleeding Indian occupied state of Jammu and Kashmir for last over four years against the complete communication and information blocked by the Indian occupational forces, since furious Kashmiris continuing protest against August 5, 2019 Indian sinister action of scrapping special status of the disputed Jammu Kashmir State abrogating Article 370 and 35-A of her constitution.\nThe call for observance of Black Day was given by the top elderly Kashmiri leadership of the Kashmir resistance movement and All Parties Hurriyat Conference and the government of Azad Jammu and Kashmir.\nIn Mirpur, the Black Day rally was started from district court premises under the auspices of Mirpur district administration with coordination of all representative organizations of the civil society led by their representatives including Deputy Commissioner Yasir Riaz Chaudhry, Extra Assistant Commissioner Tanveer ul Islam, Tehsildar Imran Yousaf Chaudhry, local President DBA Kamran Tariq Chaudhry Advocate Secretary General District Bar Association, Fàzal e Raziq Advocate, President his own faction of Markazi Annjuman-e-Tajran, President District Non Gazetted technical employees organization Qaiser Shiraaz Kazmi, senior journalists, lawyers and members of the business fraternity.\nAs previous the observance of the black day was aimed at to apprise the world of the Kashmiris ever-lasting severe hatred against India besides against the forced Indian occupation of their motherland for the last 76 years – besides to remind the international community and the global forums especially the United Nations to perform their due global role for the early peaceful settlement of Kashmir issue in line with international norms and commitments including the UN resolutions which clearly spoke of the grant of right to self determination through free and fair referendum in entire Jammu and Kashmir state.\nProtest rallies and processions, besides public congregations in all small and major towns including district and tehsil headquarters were the hallmark of the Black Day in all small and major towns at either side of the Line of Control in Jammu and Kashmir state i-e Azad Jammu Kashmir and Indian occupied Jammu and Kashmir to reiterate complete dissociation from India besides to apprise the world of the continued Indian brutalities unleashed against the innocent Jammu Kashmir fighting against the forcible Indian rule and to get the motherland freed from the Indian clutches.\nIn Indian illegally occupied Jammu and Kashmir, the Day was marked by protests, strikes and anti-India demonstrations in various parts of the occupied state despite restrictions in response to the call given by the caged Kashmiri leaders besides other leadership of the All Parties Hurriyat Conference comprising the freedom-loving Kashmiri political and other public representative parties. The nation-wide Black Day call given by the Pakistan government was also given by AJK government at both sides of the LoC to observe the day in the liberated territory besides across Pakistan and remaining parts of the world where Pakistanis and Kashmiris were residing in.\nAHR.",
  "retrievedAt": "2025-08-11T10:16:46.048Z"
}
