{
  "title": "Decision to deport 1.3 million illegal immigrants to be implemented: Jan Achakzai",
  "link": "https://www.app.com.pk/national/decision-to-deport-1-3-million-illegal-immigrants-to-be-implemented-jan-achakzai/",
  "date_published": "2023-10-27T13:57:00.000Z",
  "source": "APP",
  "content": "QUETTA, Oct 27 (APP): Balochistan Minister for Information Jan Achakzai on Friday said that the state would implement its decision to deport 1.3 million illegal immigrants with full force and no one would be allowed to enter Pakistan without valid visa.\nAddressing a press conference, he said that action would be taken against those who had rented out their properties and provided shelter to illegal immigrants.\nJan Achackzai ruled out the news to review the decision taken for the repatriation of undocumented immigrants and said that after the deadline, all relevant institutions will work to deport the unregistered immigrants.\nHe said that a control center would be established, in which officials of institutions concerns would be present.\nThe government will set up detention centers in Haji Camp Quetta, Chaman and Pishin to accommodate foreign nationals residing in the country without identity documents before deportation to their respective countries, he said and added that the illegal immigrants would be kept at these centres with respect and provided with meals and medical facilities.\nHe said a part from Chaman, crossing points are being opened in Killa Saifullah and Chagai to report illegal immigrants to Afghanistan.\nHe warned the local people to vacate their properties from illegal foreigners and action will be taken against the owner of the house in which illegal occupants were found.\nJan Achakzai said that the Balochistan government would ensure security to the convoys of illegal foreigners coming from Sindh, Punjab to deport via Chaman border.\nThe minister said Saturday is fixed for illegal foreigners coming from Punjab while Monday, Wednesday, Friday has been fixed for those coming from Sindh.\nHe said some political elements are unsuccessfully trying to make the repatriation of illegal immigrants an issue for their political gains.\nHe added that every state had the right to take action against illegal immigrants.",
  "retrievedAt": "2025-08-11T10:16:19.712Z"
}
