{
  "title": "Well-equipped law university to be established in Islamabad: Minister",
  "link": "https://www.app.com.pk/national/well-equipped-law-university-to-be-established-in-islamabad-minister/",
  "date_published": "2020-02-27T00:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP):Federal Minister for Law and Justice Barrister Dr Farogh Naseem Thursday said the government was planning to establish a well-equipped law university in the federal capital.\nHe was addressing the participants of a ceremony, held here at Islamabad Bar Council (IBC) as a chief guest for distribution of certificates among the advocates recently promoted to advocates high court.\nSpeaking on the occasion, he said such university campuses would be established in all the provincial headquarters whereas art of the facilities online library of international standards would also be operational in such varsity.\nHe said the government was planning to attach such varsity with IBC for better practical education and research.\nHe said the government believed in welfare of lawyers as the whole judicial set up was based on lawyers community adding hefty efforts were needed in this regard.\nThe minister said he was averse to the use of ‘Wukala Gardi’ with the lawyers’ profession and he had always opposed use of such terms.\nHe said Pakistan was also came into being due to the efforts of Quaid-e-Azam Muhammad Ali Jinnah who was professionally a lawyer.\nHe stressed the young lawyers to avoid short term plannings for success.\nThe minister hoped that Islamabad High Court (IHC) would be shifted to its new building at constitution avenue which would help reduce the problems of judiciary as well as lawyers being faced at F-8 Katchery.\nHe said due to over load of cases and less number of judges causing delay in speedy justice and added number of IHC judges would be increased to fifteen after consultation with lawyers and making amendments.\nHe said recruitment of judges should be on merit instead of quota system. About amendments in the code of civil procedures, he said over hundred years old laws framed by British were being practiced in the country and needed amendments.\nHe invited the legal fraternity in this regard to play their role.\nLater, the certificates were distributed among the newly promoted lawyers.",
  "retrievedAt": "2025-08-11T18:52:11.972Z"
}
