{
  "title": "DRAP directed to ensure availability of PPE, safety masks in markets",
  "link": "https://www.app.com.pk/national/drap-directed-to-ensure-availability-of-ppe-safety-masks-in-markets/",
  "date_published": "2020-02-26T21:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP):The ministry of National Health Services, Regulations and Coordination on Thursday directed the Drug Regulatory Authority of Pakistan (DRAP) to ensure availability of personal protection equipment (PPE) especially masks in local markets.\nAccording to an official of the ministry, keeping in view the emergent situation arising due to coronavirus, the ministry also directed the DRAP to constitute teams comprising federal inspector of drugs who should coordinate with provincial health authorities to ensure availability of PPE at reasonable prices in local markets of the country.\nAs per direction of special assistant to the prime minister on health, federal inspector of drugs teams would ensure availability of tyvek suits, disposable gowns, face shields, surgical mask, biohazard bags, goggles, shoe cover and hand sanitizer in the country.\nThe team would ensure free availability of these items besides identifying the stockist who were involved in black marketing and take actions against such culprits in collaboration with local administration and law enforcement agency.\nMeanwhile, District Magistrate Islamabad Capital Territory (ICT) Hamza Shafqaat had prohibited all kinds of hoarding and profiteering of safety masks in the federal capital under section 144 Cr PC 1898.\nThe order would be applicable with immediate effect and remain in force for a period of two months.\nAll shopkeepers and vendors of federal capital had been advised against all kinds of hoarding and profiteering of safety masks and make their availability possible, keeping in view the report of two cases of coronavirus in Pakistan.\nIn violation of the order, strict action would be taken including penalty or punishment, investigation, inquiry or proceedings under the code of criminal procedure, 1898.\nIt is pertinent to mention here that a popular chain of medical stores has started sharing free of charge safety masks to the citizens of federal capital for their protection against coronavirus.",
  "retrievedAt": "2025-08-11T18:52:14.794Z"
}
