{
  "title": "Pakistan, Qatar agree to further enhance economic cooperation",
  "link": "https://www.app.com.pk/national/pakistan-qatar-agree-to-further-enhance-economic-cooperation/",
  "date_published": "2020-02-27T12:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP):The leadership of Pakistan and Qatar on Thursday agreed to further enhance economic cooperation especially in the energy sector.\nDuring a day-long visit of Prime Minister Imran Khan to Doha, along with a high-level delegation, the two countries also agreed to immediately activate the bilateral Joint Working Group on Commerce and Investment and the MoU on Cooperation in the fields of Tourism and Business Events.\nAccording to a press release issued by the PM Office, delegation-level talks were followed by tete-a-tete between Prime Minister Imran Khan and Emir of the State of Qatar Sheikh Tamim bin Hamad Al Thani.\nThe two leaders exchanged views on the existing excellent bilateral relations as well as regional and international issues of mutual concern.\nThey reaffirmed their commitment to further strengthen the robust political and economic partnership existing between the two brotherly countries.\nThe prime minister appreciated Qatar’s valuable role leading to the U.S.-Taliban peace agreement due to be signed on 29th February 2020.\nPrime Minister Imran Khan reiterated Pakistan’s continued support for an Afghan-owned and Afghan-led peace process.\nThe two leaders expressed the hope that all Afghan stakeholders would seize this historic opportunity to reach an inclusive political settlement for the establishment of durable peace and stability in Afghanistan.\nThe prime minister also briefed the Emir of Qatar on the continuing grave human rights violations in Indian Occupied Jammu & Kashmir under the RSS-inspired BJP government.\nHe expressed deep concern over the ongoing anti-Muslim riots in India which have been precipitated by the Hindutva inspired ideology of the current Indian government.\nThe prime minister was accompanied by Foreign Minister Shah Mahmood Qureshi, Special Assistant to the Prime Minister on Overseas Pakistanis and Human Resource Development Syed Zulfikar Abbas Bukhari, Special Assistant to the Prime Minister on Petroleum Nadeem Babar and senior officials.\nThis is the second visit of Prime Minister Imran Khan to Qatar after taking office. The Qatari Emir had visited Pakistan in June 2019, which resulted in strengthening bilateral collaboration in diverse areas.",
  "retrievedAt": "2025-08-11T18:52:07.456Z"
}
