{
  "title": "Advent of pre-monsoon: Rain-wind thundershower lashes different parts of country",
  "link": "https://www.app.com.pk/national/advent-of-pre-monsoon-rain-wind-thundershower-lashes-different-parts-of-country/",
  "date_published": "2022-06-18T17:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP): Rain-wind thundershower lashed different parts of the country including the federal capital on Saturday morning and night, marking the advent of Pre-Monsoon rains.\nThe rain-wind/thunder shower of moderate to heavy intensity started in Islamabad early morning of Saturday and continued for a while turning the weather pleasant and decreasing the day temperature.\nThe rain of moderate to heavy intensity again started at night around 10 pm and continued for around half an hour.\nThe rain provided much needed relief to the heat stricken people by decreasing the hot weather conditions.\nFor the next 24 hours, the Pakistan Meteorological Department (PMD) has forecasted partly cloudy weather with rain-wind/thundershower for Khyber Pakhtunkhwa, Punjab, Islamabad, Gilgit Baltistan, Kashmir and northeast Balochistan.\nHeavy fall and hailstorm may also occur at a few places during the period.\nHowever, hot and dry weather is likely to prevail in other parts of the country.\nAs per the synoptic situation, moist currents from the Arabian sea were penetrating central and upper parts of the country.\nA westerly wave was also affecting upper parts of the country.\nDuring the last 24 hours, widespread rain-wind/thunderstorm with isolated heavy fall occurred in Punjab, Kashmir, Khyber Pakhtunkhwa, Gilgit-Baltistan, northeast Balochistan and Islamabad.\nThe rainfall recorded during the last 24 hours was Kashmir: Garhi Dupatta 66 mm, Rawalakot 37, Kotli 20, Muzaffarabad (Airport 05), Punjab: Rawalpindi (Chaklala 56, Shamsabad 22), Faisalabad 40, Toba Tek Singh 37, Sialkot (City 33, Airport 28), Jhang, Okara 28, Multan (Airport 25, City 14), Islamabad (Bokra 22, Golra 13, Airport 05, Zero Point 04, Saidpur 03), Bahawalpur (Airport 20, City 15), Bahawalnagar 18, Bhakkar 14, Sahiwal 12 , Lahore (Iqbal Town 10, Airport 05, Nishtar Town, Johar Town 04, Chowk Nakhuda 03, City, Gulshan Ravi, Lakshmi Chowk, Shahi Qila, Gulberg, Tajpura, Mughalpura 02, Upper Mall, Farrukhabad, Samanabad 01), Narowal 11, Gujrat 10, Gujranwala 09, Murree 08, Layyah 07, Rahim Yar Khan, Kot Addu 06, Khanewal, Mangla 05, Khanpur 03, Kasur 02, Khyber Pakhtunkhwa: Malam Jabba 32, Kakul 02, Saidu Sharif 01, Balochistan: Barkhan 20 , Zhob 05, Sibbi 03, Gilgit Baltistan: Babusar 10, Astore 09, Bagrote 04, Hunza and 03mm in Gilgit.\nThe highest maximum temperatures recorded during the period were Turbat 44 C, Dadu, Shaheed Benazirabad 43, Dalbandin and Khairpur 42C.",
  "retrievedAt": "2025-08-11T15:06:32.367Z"
}
