{
  "title": "Polling for Senate’s 48 vacant seats on April 2",
  "link": "https://www.app.com.pk/national/polling-for-senates-48-vacant-seats-on-april-2/",
  "date_published": "2024-03-11T16:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP): The Elections Commission of Pakistan (ECP) has announced that polling for the 48 vacant seats in the upper house of parliament will take place across the four provinces on April 2.\nCandidates interested in contesting the elections must obtain nomination papers from the Election Commission headquarters and provincial election commissioners of Punjab, Sindh, Balochistan, and Khyber Pakhtunkhwa starting Monday.\nNomination papers can be deposited with the relevant returning officers on March 15 and 16. The ECP will issue the schedule on March 14.\nAccording to ECP, the six-year term of the 52 senators elected in 2018 set to end on March 12, 2024. Additionally, with the merger of erstwhile FATA into Khyber Pakhtunkhwa under the 25th Constitutional Amendment, the seats for four senators ceased to exist. As a result, the total number of senators to be elected has been reduced to 48 after the elimination of the four FATA seats.\nThe ECP announced that elections will be held for seven general seats, two seats reserved for women, two for scholars/technocrats, and one non-Muslim seat in Punjab.\nIn Sindh, there will also be elections for seven general seats, two seats reserved for women, two for scholars/technocrats, and one non-Muslim seat.\nIn addition to this, lawmakers from Khyber Pakhtunkhwa (KP) assembly would elect members against seven general seats, two women and two seats for technocrats, including Ulema.\nThe lawmakers from Balochistan assembly would elect members against seven general seats, two women and two seats for technocrats, including Ulema.\nBesides, any additional information regarding the Senate elections can be obtained at 051-9219335.\nMembers of the National Assembly will elect one general seat and one seat for technocrats, including Ulema from the federal capital, it added.\nEarlier, the ECP designated Returning Officers (ROs) in Islamabad and the four provinces to oversee the Senate election process.\nAccording to an ECP notification, Saeed Gul, the Director General Training at ECP, will serve as the Returning Officer (RO) in the federal capital. Meanwhile, Aijaz Anwar Chohan, Sharifullah, Shamshad Khan, and Muhammad Farid Afridi, who are provincial election commissioners, will act as returning officers in Punjab, Sindh, Khyber Pakhtunkhwa, and Balochistan, respectively.",
  "retrievedAt": "2025-08-11T01:14:08.193Z"
}
