{
  "title": "52 Senators including chairman complete tenure On Monday",
  "link": "https://www.app.com.pk/national/52-senators-including-chairman-complete-tenure-on-monday/",
  "date_published": "2024-03-11T18:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP): The tenure of 52 Senate members, including Chairman Muhammad Sadiq Sanjrani , Deputy Chairman Mirza Afridi, Leader of the House Ishaq Dar, Leader of the Opposition Dr. Shahzad Waseem and Senator Raza Rabbani, ended on Monday (March 11).\nAfter its merger into Khyber Pakhtunkhwa, the four FATA seats in the Upper House will no longer exist, reducing the total membership of the new Senate from 100 to 96.\nThe terms of 11 senators supported by Pakistan Muslim League-N (PML-N), 13 by Pakistan People’s Party (PPP), seven by Pakistan Tehreek-e-Insaf (PTI), and two each from Jamiat Ulema-e-Islam F (JUI-F), Pashtunkhwa Milli Awami Party (PkMAP), and National Party have ended as of Monday.\nAwami Party (BAP), along with one senator from Jamaat-e-Islami (JI), Muttahida Qaumi Movement – Pakistan (MQM-P), and Pakistan Muslim League-F, (PML-F) have retired on Monday.\nIn the house, there will be 17 senators from PTI, 9 from Pakistan People’s Party, 5 from Pakistan Muslim League-N, 7 from Balochistan Awami Party (BAP), 3 from Jamiat Ulema-e-Islam Fazl (JUI-F), 2 each from Muttahida Qaumi Movement (MQM) and Awami National Party (ANP), one from Pakistan Muslim League-Q (PML-Q), and 2 independent members.\nMuhammad Asad Ali Khan Junejo  and Mushahid Hussain Sayed representing Islamabad, have also retired from Senate.\nTwelve Senators from Sindh have retired, including Raza Rabbani, Imamuddin Shouqeen, Moula Bux Chandio, Syed Muhammad Ali Shah Jamot,Dr Muhammad Farogh Naseem, Syed Muzafar Hussain Shah, Syed Waqar Mehdi,  Khalida Sikandar Mandhro, Engr. Rukhsana Zuberi, Keshoo Bai, Quratulain Marri, and Anwar Lal Dean\nAmong the 12 retired senators from Punjab are Leader of the House Muhammad Ishaq Dar and Leader of the Opposition Dr Shahzad Waseem, along with Dr. Asif Kirmani, Rana Mahmood ul Hassan , Dr Musadik Masood Malik, Shaheen Khalid Butt, Walid Iqbal, Hafiz Abdul Karim, Nuzhat Sadiq, Seemee Ezdi and Kamran Michael. Additionally, Rana Maqbool’s seat became vacant following his passing.\nAmong the 11 retired Senators from Khyber Pakhtunkhwa are Bahramand Khan Tangi, Faisal Javed, Fida Muhammad, Pir Syed Muhammad Sabir Shah, Muhammad Talha Mahmood, Mushtaq Ahmed, Dilawar Khan, Muhammad Azam Khan Swati Prof. Dr. Mehr Taj Roghani, and Rubina Khalid. Additionally, Shaukat Tareen’s seat has already become vacant following his resignation.\nThe list of retired senators from Balochistan includes Chairman Muhammad Sadiq Sanjrani , Ahmed Khan, Molvi Faiz Muhammad, Kauda Babar,  Muhammad Akram , Sardar Muhammad Shafiq Tareen, Muhammad Tahir Bizinjo, Naseebullah Bazai, Abida Muhammad Azeem,and Sana Jamali.\nFour erstwhile FATA senators, including Hidayat Ullah , Hilal-ur-Rehman, Shammim Afridi, and Deputy Chairman Mirza Muhammad Afridi, have also retired.\nAfter the general elections, six Senate seats have become vacant as a result of the winners in those elections. By-elections to fill these vacant seats will take place on March 14.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:14:28.289Z"
}
