{
  "article_id": "2025-09-02_16eab1872baca3207189edf0317c0682",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fab-briefs-senate-body-on-spectrum-auction-efforts/",
    "retrieved_at": "2025-09-06T10:48:52.946Z"
  },
  "metadata": {
    "title": "FAB briefs Senate body on spectrum auction efforts",
    "author": null,
    "date_published": "2025-09-02T12:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 426,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 02 (APP):The Senate Standing Committee on Information Technology and Telecommunication on Tuesday received a detailed briefing from the Frequency Allocation Board (FAB) on ongoing efforts for spectrum auctions and associated challenges. Chaired by Senator Palwasha Mohammad Zai Khan, the Committee was informed that since 2021, necessary bands had been made available in line with global 5G requirements, including the vacation of 30 MHz and identification of millimetre-wave bands in the 3 GHz and 24 GHz ranges. However, litigation and stay orders on certain bands were delaying auctions, causing significant economic losses by slowing digital progress. The Special Secretary, Ministry of IT, assured the Committee that, in line with the Prime Minister's directions, the spectrum auction would be completed soon with input from an engaged consultant. The Attorney General, along with representatives from PEMRA and PTA, briefed members on the status of LDI/FLL stay orders, noting that cases initially heard by the Sindh High Court had been transferred to civil courts, with the next hearing scheduled for September 17. The Committee also received briefings from the Pakistan Software Export Board (PSEB), PTA and the National Cyber Crime Investigation Agency (NCCIA) on registered call centers, software houses, revenue streams, and measures to curb cyber fraud. Officials highlighted that cybercrime posed a major threat to digital trust and financial inclusion, with scams amounting to billions of rupees. It was reported that 63 illegal call centers had been dismantled and Rs 40 million recovered. Members voiced concern over loan scams, gambling apps, fake news, and misinformation campaigns on social media. They were informed that coordination with banks had been strengthened to detect skimming devices, and digital monitoring was intensified during sensitive national events. The Committee underscored the need for stronger inter-agency collaboration, the use of artificial intelligence for early detection, and stricter liability for social media intermediaries. The Chairperson directed NCCIA to present a comprehensive report on cyber-linked crimes at the next meeting. PTA informed the committee that litigation over 6.6 MHz in the 1800 MHz band remained unresolved. Despite a Supreme Court ruling in PTA's favour, the matter was shifted to lower courts, causing delays. Members criticized such tactics, warning they resulted in financial losses and undermined national interests. The Committee decided to summon Law Division officials to the next meeting to explain tribunal delays and recommend solutions. The meeting was attended by Senators Anusha Rehman, Ahmad Khan, Pervaiz Rashid, Dr Mohammad Humayun Mohmand, Dr Afnan Ullah Khan, Saifullah Sarwar Khan Nyazee, Nadeem Ahmed Bhutto, the Special Secretary for IT and senior officials of the concerned departments.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}