{
  "article_id": "2025-09-02_086157b5fd2a6b036dabdc45629d0324",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/neoc-predicts-further-strain-on-punjabs-flood-affected-areas/",
    "retrieved_at": "2025-09-06T10:48:27.006Z"
  },
  "metadata": {
    "title": "NEOC predicts further strain on Punjab’s flood-affected areas",
    "author": null,
    "date_published": "2025-09-02T13:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 183,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 02 (APP):National Emergencies Operation Centre (NEOC) on Tuesday warned of further strain on already flood-affected areas and urban flooding as heavy rainfall is forecast to hit Islamabad and multiple districts of Punjab within the next 12 to 24 hours. According to the National Disaster Management Authority's (NDMA) NEOC, the anticipated rains could add pressure to flood-affected areas of Punjab. The advisory urges residents and local administrations to remain vigilant, as heavy rainfall is likely to lash several districts including Sialkot, Narowal, Lahore, Sheikhupura, Gujrat, Gujranwala, Hafizabad, Chiniot, Faisalabad, Sargodha, and surrounding areas. Intermittent showers are also expected in Islamabad, Rawalpindi, Jhelum, Chakwal, Attock, Multan, Khanewal, Bahawalnagar, Bahawalpur, Rahim Yar Khan, Dera Ghazi Khan, Rajanpur, and nearby regions. Authorities have strongly advised citizens to avoid rivers, streams, and nullahs, and to refrain from unnecessary travel during the forecast period. People are also urged to follow official instructions, maintain a safe distance from electricity wires, and steer clear of waterlogged zones to minimize risk. Emergency services remain on alert, and local administrations have been directed to ensure readiness for any potential flooding incidents.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}