{
  "article_id": "2025-09-02_39d44780280ea246e3c71d115e00006b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/app-union-election-nirc-chairman-questions-exclusion-of-voters/",
    "retrieved_at": "2025-09-06T10:50:29.495Z"
  },
  "metadata": {
    "title": "APP Union Election: NIRC Chairman questions exclusion of voters",
    "author": null,
    "date_published": "2025-09-02T07:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 206,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 02 (APP):Chairman of the National Industrial Relations Commission (NIRC), Justice (retd) Shaukat Aziz Siddiqui, questioned the exclusion of voters from the APP Employees Union election list during a hearing on Tuesday in Islamabad. A three-member bench headed by Justice (retd) Shaukat Aziz Siddiqui, with members Siraj-ul-Salam Khan and Munawar Hussain Turi, heard the case of Khizar Zaman Malik versus APP Employees Union. Chaudhry Sagheer appeared for the petitioner, while Hussnain Haider Thaheem represented APP. APP's lawyer argued that the names of voters were removed from the final list after the election schedule was issued, despite the list being verified by the Human Resource Department. Justice (retd) Siddiqui called the authorized NIRC officer, Madad Ali Shah, and asked whether he had the authority to exclude names after the election schedule was issued. The officer admitted that the voters concerned were not given a chance to be heard. The NIRC Chairman noted that the act deprived eligible voters of their right to vote. The officer's response was termed unsatisfactory, and he was directed to submit a detailed written report on the exclusion and the entire election process by Wednesday. The bench postponed the hearing until Wednesday and issued notices to all parties, including the excluded voters.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}