{
  "article_id": "2025-09-02_022fbe385dabbf1ecd2f589d42fb0414",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/uzbek-envoy-declares-pakistan-a-significant-strategic-partner-on-uzbekistans-34th-independence-day/",
    "retrieved_at": "2025-09-06T10:50:07.819Z"
  },
  "metadata": {
    "title": "Uzbek envoy declares Pakistan a significant strategic partner on Uzbekistan’s 34th Independence Day",
    "author": null,
    "date_published": "2025-09-02T08:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 961,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 2 (APP):Ambassador of Uzbekistan to Pakistan is Alisher Tukhtaev, has declared Pakistan a significant strategic partner of Uzbekistan on the occasion of the \"34th Anniversary of the Independence Day of the Republic of Uzbekistan\" in Uzbek cultural vibes. \"I welcome you all to this reception dedicated to the 34th Anniversary of the Independence of the Republic of Uzbekistan. For every Uzbek, this day is not just a holiday. It is the heartbeat of our nation. It is the day when the dream of millions of families - to live under their own flag, in a free country - became a reality,\" the Ambassador said. The Uzbek envoy said that under the leadership of President of Uzbekistan Shavkat Mirziyoyev, the country has entered a new era - the era of the New Uzbekistan. \"We proudly say that we are reviving the traditions of the First and Second Renaissances, and we are confidently moving toward the Third Renaissance - a bridge between our famous past and a bright future of revival and progress. Let me share with you what Independence means in real terms. Ambassador of Uzbekistan to Pakistan is Alisher Tukhtaev, said this while addressing the \"34th Anniversary of the Independence Day of the Republic of Uzbekistan.\" The Ambassador said that Independence is not an abstract word, but it is the smile of a child walking to school with bright eyes and his first book in hand. Meanwhile, highlighting the economic performance of Uzbekistan in last decades, he said that despite global challenges, Uzbekistan's economy is growing by more than 6 percent every year and in just eight years, our GDP has doubled, reaching 115 billion US dollars last year, and is expected to exceed 130 billion this year, he said. Alisher said that exports have grown to $26 billion , while our gold and foreign exchange reserves have, for the first time, surpassed $48 billion and over the past years, Uzbekistan has attracted about $ 130 billion in foreign investment. This year alone, $ 35 billion of investments are creating almost 9,000 new enterprises and service complexes and on the eve of Independence Day, 79 major projects worth $4 billion were launched - a true gift to our people for the holiday, he said. The Uzbek envoy said the number of small and medium-sized businesses has doubled, and today they employ more than 10 million people At the beginning of this year, we set the ambitious goal of creating 5.5 million new jobs. He said that in just eight months, 5 million people have already been employed and most touching of all, 700,000 of our compatriots who had been working abroad returned home, believing in the future of their country. Uzbekistan is opening wider to the world and last year, more than 10 million tourists visited our country, bringing more than $3 billion in revenue and by 2030, \"we aim to attract an additional $35 billion of investment and increase the share of renewable \"green\" energy to 54 percent, he said. Today, Uzbekistan is no longer just an exporter of raw materials but our industrial output has grown from $29 billion in 2017 to $70 billion today. Modern technologies and new knowledge are transforming every sector, creating hundreds of thousands of jobs and building a strong workforce for the future, he said. \"Our pride is not only in the economy, and for the first time in history, the national football team of Uzbekistan has qualified for the World Cup! This historic success united millions of hearts, showing that the spirit of Uzbekistan can reach the highest peaks - in sports, in science, in culture, and in every area of life.\" The Ambassador said that Uzbekistan and Pakistan are connected not only by economic interests but \"We are bound by centuries of shared history, culture, and spirituality.\" Today, these ties are gaining new strength, turning into a true strategic partnership built on trust, respect, and brotherhood. In February this year, the official visit of Prime Minister Shehbaz Sharif to Uzbekistan was a milestone and \"Our leaders signed the Joint Declaration and the Protocol on establishing the High Council of Strategic Partnership as well as this historic step laid the foundation for long-term and multi-dimensional cooperation.\" The ambassador said that \"We are working together on projects of historic importance - above all, the Trans-Afghan Railway, which will connect not only Uzbekistan, Afghanistan, and Pakistan, but CIS countries with South Asia, opening huge opportunities for regional trade and integration.\" He said that both sides of trade are also growing rapidly, and in 2024, turnover exceeded 404.5 million US dollars. In just the first seven months of this year, it reached $320 million - an increase of 126 percent compared to last year. Uzbekistan has become Pakistan's largest trading partner in Central Asia, and our leaders have set a goal to bring this figure to $2 billion. and steps such as exhibitions, trade houses, new air routes, and cultural exchanges are already bringing us closer to this target. Talking on people to people, he said Uzbekistan has simplified the visa regime for Pakistani brothers, sisters and opened direct flights between Tashkent and Lahore, as well as Tashkent and Islamabad and business forums, roadshows and cultural events held this year in Islamabad, Lahore, Karachi, and many other cities of Pakistan attracted great interest and strengthened people-to-people connections. As \"we celebrate the Independence Day of Uzbekistan today, let me express my deep gratitude to the Government and people of Pakistan, to the diplomatic corps, the business community, academics, cultural figures, the media, and all friends of Uzbekistan for being here with us\", he said. On behalf of the people and leadership of Uzbekistan, \"I wish the brotherly people of Pakistan peace, prosperity, and continued success.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}