{
  "title": "Accountability court orders transfer of reference against Sibtain Khan to anti-corruption court",
  "link": "https://www.app.com.pk/national/accountability-court-orders-transfer-of-reference-against-sibtain-khan-to-anti-corruption-court/",
  "date_published": "2024-10-09T16:44:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 09 (APP): An accountability court on Wednesday ordered transfer of the Chiniot mines and minerals reference, filed by the National Accountability Bureau (NAB) against former Punjab Assembly Speaker Sibtain Khan and others, to the anti-corruption court.\nThe court held that it no longer had jurisdiction to hear the reference after the Supreme Court’s recent verdict and directed Sibtain Khan and the other accused to appear before the anti-corruption court for further proceedings. It added that the anti-corruption court was the appropriate forum for this reference.\nAccountability Court Judge Zubair Shehzad conducted the proceedings, during which Sibtain Khan and other accused appeared and marked their attendance. During the hearing, NAB Prosecutor Haris Shafiq Qureshi submitted a report and supported the transfer of the reference.\nBesides Sibtain Khan, Salman Ghani, Muhammad Aslam, Abdul Sattar Mian, Imtiaz Ahmad Cheema, and others were named as the accused in the reference. The bureau alleged that Sibtain Khan exceeded his powers and awarded a multi-billion rupees contract to a firm of his choice in 2007 when he was the Minister for Mines and Minerals in the PML-Q government. The bureau stated that the company given the contract had a paid-up capital of only Rs2.5 million and lacked the experience required for the project.\nEarlier, on October 6, 2022, an accountability court had returned the Chiniot mines and minerals reference to NAB, observing that it lacked jurisdiction to proceed further in the case after the amendments introduced in NAB law.\nThe reference was reopened at NAB’s request after the amendments in the law were set aside by a three-member Supreme Court bench in 2023.\nHowever, on September 6, 2024, a five-member Supreme Court bench restored the changes to the NAB law, accepting the federal government’s appeal against the previous verdict, which had struck down those amendments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:57:45.882Z"
}
