{
  "title": "ITP outlines traffic plan for upcoming SCO Summit",
  "link": "https://www.app.com.pk/national/itp-outlines-traffic-plan-for-upcoming-sco-summit/",
  "date_published": "2024-10-09T15:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 09 (APP):Islamabad Traffic Police (ITP) has issued a special traffic plan for the upcoming Shanghai Cooperation Organization (SCO) summit in Islamabad on Wednesday.\nAccording to the plan, over 585 officers from the ITP will be deployed to ensure smooth traffic flow and guide citizens to alternative routes, a public relations officer told APP.\nMillat Road to Kashmir Chowk and Dhokri Serena Hotel, during the summit, traffic on this route will be closed.\nRawal Dam Chowk to Kashmir Chowk and Serena Malpur, traffic on this road will also be closed for the duration of the summit.\nAabpara and Srinagar Highway to Serena, traffic on these routes will be blocked, with alternative routes suggested.\nAlternative Route for Citizens from Murree and Bhara Kahu to Rawalpindi, citizens can use Korang Road, turning left at Bani Gala, and proceed via Park Road to reach Rawal Dam Chowk and Faizabad.\nAlternative Route for Those Traveling from Faizabad to Bhara Kahu and Murree, use Park Road, Bani Gala, and Korang Road as an alternative.\nSrinagar Highway to Murree and Bhara Kahu, citizens should use Chand Tara Chowk, Pak China Centre, Sports Complex, and continue via Murree Road, Park Road, Bani Gala, and Korang Road.\nHeavy Traffic from Peshawar to Lahore, heavy traffic must use the Taxila motorway and Tarnol Railway crossing to reach the Fateh Jang motorway.\nHeavy Traffic from Lahore via GT Road to Islamabad and Rawalpindi, this traffic will be diverted to Chak Beli Road to reach Chakri motorway.\nTraffic from Sectors F-5, G-5, G-6, and Margalla Road Heading Towards Rawalpindi, traffic will be diverted via 9th Avenue.\nTraffic from Faisal Avenue Heading Towards Zero Point, this traffic will also be redirected to 9th Avenue.\nCitizens Traveling from Bhara Kahu to Rawalpindi, use Korang Road, Bani Gala, and Lehtrar Road.\nTraffic from Rawalpindi to Islamabad, citizens will use 9th Avenue via Saddar and Murree Road.\nTraffic Between Zero Point, Faisal Avenue, and Koral Chowk (Using the Expressway), this route will be closed, and the service road will be used as an alternative.\nColonel Sher Khan Road to Faizabad, citizens should use 9th Avenue from the Stadium Road signal.\nFrom October 14 to 16, 2024, all types of heavy traffic will be restricted from entering Islamabad. Chief Traffic Officer Islamabad, Muhammad Sarfraz Virk, said that wherever roads are closed, traffic police officials will be present to guide citizens and provide alternative routes.\nSarfaraz Virk urged citizens to cooperate with the traffic police and use alternative routes during the summit.\nFurthermore, FM Radio 92.4 and other social media channels will keep citizens informed of traffic updates throughout the event, Virk added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:56:17.085Z"
}
