{
  "title": "World Space Week to conclude on Thursday",
  "link": "https://www.app.com.pk/national/world-space-week-to-conclude-on-thursday/",
  "date_published": "2024-10-09T11:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 9 (APP):The World Space Week 2024 celebrations will conclude on Thursday after commemorating the occasion through a number of space related activities organized by various departments, highlighting this year’s theme “Space and Climate Change”.\nThe World Space Week activities were mainly arranged by Space and Upper Atmosphere Research Commission (SUPARCO), Institute of Space Technology and various educational institutions and organizations from October 04-10.\nThe inauguration ceremony of World Space Week 2024 was held on October 04 at the National Centre for Remote Sensing and Geo-Informatics (NCRG), SUPARCO Complex, Karachi with Vice Chancellor of Fatimiyah International University, Dr. Jamil Kazmi as a chief guest.\nAs the national coordinator of World Space Week since 2005, SUPARCO took lead in organizing a series of activities and contests to raise awareness and promote interest in space science across Pakistan.\nSUPARCO’s Space Education and Awareness Drive (SEAD) engaged schools, colleges, universities, astronomy and science societies, and the general public through various contests and activities including the ‘Best Space School Contest’, ‘Space Ambassador Contest’, ‘University Contest’, and ‘Contests for the Public’.\nA series of webinars were conducted, focusing on the role of space technology in monitoring climate change, managing resource sustainability, and developing climate adaptation strategies.\nSpace Vans visited schools in Islamabad, Karachi, and Lahore to deliver lectures and academic visits will also be arranged. Additionally, live astronomical observations were broadcasted on SEAD’s Facebook page.\nThe Spacecademy Society also arranged an exciting series of interactive space science activities for students from different schools.\nSpaceacademy Society arranged various activities under the theme “Explore the Universe – A Journey to the Cosmos” in coordination with the Space Education and Awareness Drive of SUPARCO.\nMaintaining its past trend of celebrating World Space Week, IST has also marked this important occasion through a number of activities continuing from October 08-10.\nDesigned for students from Grades 6 to 12, the event has featured 10 categories and 70 educational modules, offering a range of activities including space recitations, trivia, creative writing, technology demonstrations, models and collectibles, art and design, performing arts, life and sustainability, and space for climate change.\nIST and NCGSA continue to empower the next generation of scientists, innovators, and climate leaders by providing an exciting platform for students to explore the intersection of space technology and climate action.\nFor the past 19 years, the Institute of Space Technology (IST) has proudly led the celebration of World Space Week (WSW) , a global event endorsed by the United Nations to honor the remarkable achievements in space science and technology and their profound contributions to humanity.\nSince 2005, IST has served as a dynamic platform for students to engage in immersive STEM and STEAM-based activities, competitions, and hands-on projects, igniting curiosity and passion for space exploration.\nThis enduring tradition has not only inspired young minds but also fostered a deep appreciation for the critical role that space technology plays in advancing scientific progress and addressing global challenges.\nThrough World Space Week, IST has championed space education on a national scale, empowering students to innovate, think creatively, and pursue careers in space science in alignment with the global vision set by the United Nations.\nIn order to educate young students and the general masses about the bounties of space technology and its applications, United Nations General Assembly has declared 4th-10th October as World Space Week.\nUN General Assembly selected 4th to commemorate the launch of the first human-made Earth satellite, Sputnik 1, on 4th October 1957, and the signing of the Treaty on Principles Governing the Activities of States in the Exploration and Peaceful Uses of Outer Space, on 10th October 1967.\nWorld Space Week Association (www.worldspaceweek.org), a non-government, non-profit international organization, coordinates this celebratory week worldwide through National Coordinators appointed in each country.\nIn Pakistan, the event is coordinated by the country’s National Coordinator, the Secretary of National Space Agency of Pakistan, SUPARCO, through Space Education and Awareness Drive (SEAD).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:56:58.353Z"
}
