{
  "title": "SC adjourns dam funds case till Friday",
  "link": "https://www.app.com.pk/national/sc-adjourns-dam-funds-case-till-friday/",
  "date_published": "2024-10-09T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 09 (APP):The Supreme Court of Pakistan on Wednesday adjourned hearing of Dam Fund case till October 11 and directed WAPDA counsel, representatives of the Auditor General and the Attorney General to suggest a workable solution to the problem.\nA three-member bench headed by Chief Justice of Pakistan Qazi Faez Isa heard the case.\nDuring the proceedings, the chief justice questioned that whether the amount of dam funds could be kept in private bank for mark up? He said that the court wouldn’t go toward the top court’s judgment regarding the construction of dams.\nAdditional Auditor General informed the court that the SC couldn’t keep this amount with itself. He said that the dam fund account was opened in line with the order of the top court and registrar office had been looking after it.\nHe said that there were no irregularities found in dams’ fund and its mark up, adding that mark up couldn’t be received if the money was kept in public account.\nFormer attorney general Khalid Javed Khan said that there was no objection on changing of account name. He said that this amount should be used only for construction of dams.\nThe chief justice remarked that no review petition was filed when the judgment was issued.\nThe legal advisor to the statement said that there was more than Rs23 billion in dam funds. A total of Rs11 billion were collected while Rs12 billion is mark up against it, he said.\nTo a query, the additional attorney general said that it was government who used to pay the mark up. It is paid against the amount which is used by the government, he said.\nThe CJP said that by putting the burden of markup on the government, be happy that 11 billion rupees have increased to 23 billion.\nAdditional Auditor General said that the amount of dams fund should be transferred to WAPDA through the public account of the government.\nThe CJP asked that under what jurisdiction the Supreme Court had been seeking progress report of the construction of dams and whether there was provision of implementation bench in the constitution.\nWAPDA’s lawyer Saad Rasool said that the purpose of the court was only to ensure the implementation of the order for the construction of dams, adding that there was no mention of implementation bench in law.\nThe chief justice remarked that in Pakistan, many things are done without constitution and law. I took the oath of supremacy and implementation of the Constitution, not judicial decisions, he said. He questioned that can the dams fund money be given to the government.\nKhalid Javed said that the Supreme Court had sought progress reports under the jurisdiction of 184/3. He opposed the option of giving the dams fund money to the government.\nThe chief justice directed WAPDA counsel, representatives of the Auditor General and the Attorney General to suggest a workable solution to the problem.\nThe court adjourned the hearing till Friday.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T19:56:34.177Z"
}
