{
  "title": "PIA relief and chartered flights carry back hundreds of Pakistanis from different parts of the world",
  "link": "https://www.app.com.pk/national/pia-relief-and-chartered-flights-carry-back-hundreds-of-pakistanis-from-different-parts-of-the-world/",
  "date_published": "2020-04-15T01:17:00.000Z",
  "source": "APP",
  "content": "KARACHI, Apr 15 (APP):Pakistan International Airlines (PIA) since April three has successfully managed to bring back home over 1800 countrymen and women stuck in different parts of the world due to COVID-19 induced global lockdown, said a spokesman of the national flag carrier here on Wednesday.\nMentioning that 11 different relief flights were flown to Central Asia, Far East, Middle East and Canada, he said these also included destinations where PIA does not have a regular flight operation and that special flight permission had to be sought in minimum possible time, for the convenience of Pakistani passengers.\nUnder this operation relief as well as chartered flights was said being operated to and from Pakistan with some additional flights also scheduled from April 15 to April 19.\nSharing details of the next phase of the relief operation, he said a flight from Islamabad to Toronto is planned for Wednesday followed by two more from Islamabad to Manchester on April 17 and 18 consecutively, with PK 8894 and PK 8852 leaving for Seoul (South Korea) from Islamabad on April 17 with two more flights planned from Karachi to Jakarta (Indonesia) on April 18 and Karachi to Toronto (Canada) April 19.\nAccording to the PIA spokesman passengers already flown back to home include those from Canada, Tajikistan, Uzbekistan, Azerbaijan, Iraq, Japan, Thailand Malaysia and Turkey.\nHe said Pakistanis currently stuck abroad due to unusual circumstances, consequent to COVID-19 pandemic and trying to reach back home can approach Pakistan embassies in the countries they are stranded and that can also contact PIA call centre, PIA booking office or its website to purchase tickets.\nThe spokesman particularly emphasized that the national flag carrier has ensured fool proof preventive arrangement against the coronavirus to protect air crew as well as passengers being flown, under the relief operation,\nIt is not only that the aircraft are thoroughly and regularly disinfected but the cabin, cockpit and ground staff were also being provided with protective gear while passengers reaching home are immediately moved to designated units for quarantine and essentially required testing cum screening r.\nPassengers were said to be repeatedly expressing their gratitude to Prime Minister Imran Khan for taking notice of the plight of the stranded Pakistanis and issuing directives for their safe and convenient return.\nPIA Chief, Air Marshal Arshad Malik, who is personally supervising the relief operation was said to had thanked Federal Minister for Aviation, Ghulam Sarwar Khan for being instrumental in making the exercise smooth adding that PIA family itself needed to be felicitated for being part of the extraordinary initiatives in keeping up the operations under difficult time.",
  "retrievedAt": "2025-08-11T19:06:24.018Z"
}
