{
  "title": "10BTT employs 63,644 daily waged impoverished women, jobless youth: Amin Aslam",
  "link": "https://www.app.com.pk/national/10btt-employs-63644-daily-waged-impoverished-women-jobless-youth-amin-aslam/",
  "date_published": "2020-04-15T01:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP):Adviser to the Prime Minister on Climate Change Malik Amin Aslam Wednesday said the 10 Billion Tree Tsunami (10BTT) project was providing livelihood to around 63,644 daily wage earning impoverished women and jobless youth across the country.\nTalking to APP, he said most of the staff working under the 10BTT afforestation project was working on developing plant nurseries, plantation, guarding of enclosures and community awareness on planting trees in far flung areas.\nHe mentioned that earlier in the Billion Tree Afforestation Project (BTAP), 20 percent saplings planted in the project were produced by the women in their homemade nurseries. “A woman under that nursery has managed to get Rs100,000 to Rs 650,000 which is a substantial amount for poor households. Most of the women working under the BTAP and now under 10BTT are widows, orphan girls and also jobless male youth,” he added.\nAmin Aslam informed that the prime minister was especially requested to revive 10BTT and Clean Green Pakistan as the plantation season was falling and it would have resulted into the failure of achieving the set target of 20 million plants for this year’s plantation across the country.\nHe added that all the provinces and states were written letters to enhance the existing labour working under the 10BTT so that maximum plantation targets could be achieved on war footings.\n“These jobs are called ‘green jobs’ globally as they help reduce the pressure on environment and help sustain the damaging ecology along with strengthening the communities. It will also have a very positive impact on our regional climate as trees have their own micro-climate that helps reduce the increasing hot temperature of the area,” Amin said.\nAt present, he said in Gilgit Baltistan around 3,000 green jobs were created under the project, in Khyber Pakhtunkhwa 19,353, Azad Jammu and Kashmir (AJK) 8,500, Punjab 17,391, Balochistan 3,500, Sindh 11,900 jobs.\n“Most of these jobs are based in the rural areas that helped in reaching out most of the marginalized communities and households. Interestingly, women in AJK have also initiated plantation in the mountainous terrain of the valley which is propitious and the other regions are follow suiting it,” he mentioned",
  "retrievedAt": "2025-08-11T19:06:23.142Z"
}
