{
  "title": "AJK refutes Indian baseless propaganda for sending COVID19 positive patients to AJK",
  "link": "https://www.app.com.pk/national/ajk-refutes-indian-baseless-propaganda-for-sending-covid19-positive-patients-to-ajk/",
  "date_published": "2020-04-15T05:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP):Azad Jammu and Kashmir (AJK) Prime Minister Raja Farooq Haider Khan on Wednesday refuted the Indian baseless propaganda in which it alleged Pakistan for forcibly sending COVID19 positive patients to AJK and said that it was an attempt to divert the attention from the deteriorating situation in the Indian Occupied Jammu Kashmir.\nIn a statement issued here, he strongly condemned the Indian baseless accusations and said that lowest number of coronavirus positive patients, were recorded in AJK as compare to any other part of Pakistan.\nThe Prime Minister expressed his profound gratitude to the government of Pakistan for extending all out support and cooperation to the state government to effectively deal with the pandemic.\nHe said Armed forces are for the protection of the masses in the state while people from both sides of bloody Line of Control (LoC) love Pak Army.\nRaja Farooq Haider Khan said during a of national coordination committee, he suggested Prime Minister Pakistan Imran Khan to inform P-5 and other friendly countries about the Indian conspiracies, wicked plan and its atrocities on the people of Occupied Jammu and Kashmir.\nMeanwhile, presiding over a meeting of the Ulema, the Prime Minister Farooq Haider told that his government has removed the ban on the presence of more than five worshipers in the mosques in AJK and appealed ulema to decide it by them considering the number of worshipers in the mosques.\nHe said AJK government would not impose any ban on five time prayers, Friday or taravih prayers. “Precautionary measures must be taken with disinfecting the mosques through sprays”, he added.\nThe Prime Minister said that all possible measures would be taken to be benefitted from the divine blessings of the holy month of Ramazan.\nHe announced to close all cases registered against the ulema during the lockdown in the state.\nRaja Farooq Haider appealed ulema to educate masses about the precautionary measures against the pandemic.\nHe appreciated the unity demonstrated by ulema in the wake of the coronavirus outbreak and requested them to continue extending their much needed cooperation in that regard.\nSpeaking on the occasion, ulema assured the prime minister of their full cooperation in the prevailing situation and said that they would ensure the government’s directives were implemented.\nSahibzada Saleem Chishti, Moulana Mehmood ul Hassan Masoodi, Allama Syed Shabbir Hussain Bukhari, Muhammad Zaman Saifi, Moulana Qari Abdul Malik, Moulana Syed Nazir Gillani, Moulana Abdul Rauf Nizami, Qazi Muhammad Ibrahim Chishti, Moulana Imran Shairazi, Moulana Syed Riaz Kazmi, Moulana Tahir Hameed Barkati, Moulana Mehmood ul Hassan Ashraf, Moulana Syed Adnan, Moulana Ateeq Danish, Danyal Shahab, Moulana Ishtiaq Ziyai, Allama Fareed Abbas, Allama Hussain Kazmi, Moulana Hafiz Nazir Ahmed Qadri, Qazi Manzoor ul Hassan, Moulana Muhammad Perviaz Qureshi and others attended the meeting.",
  "retrievedAt": "2025-08-11T19:06:11.171Z"
}
