{
  "title": "Sanjrani calls for national response to overcome COVID-19 pandemic",
  "link": "https://www.app.com.pk/national/sanjrani-calls-for-national-response-to-overcome-covid-19-pandemic/",
  "date_published": "2020-04-15T06:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP):Senate Chairman Muhammad Sadiq Sanjrani Wednesday said the Parliament has to play a more robust role in the current crisis as there was need for a national response to overcome the COVID-19 the pandemic.\nThe chairman expressed these views while presided over the Senate House Business Advisory Committee via video conferencing. This was the first session of the committee which was held through video link. The initiative was proposed by the Senate Chairman a couple of days ago. The committee deliberated on the emerging scenario aimed COVID-19 and discussed in detail the hardships being faced in transecting the legislative business.\nThe chairman observed that important legislation was pending. However, he said that decision to convene the Senate session requires detail examination of the existing rules and procedures.\nHe referred the matter to Senate Committee on Rules of Procedure and Privileges for a report and said that any decision to convene senate session would be taken in accordance with the recommendations of the committee.\nHe said economic fallout of the crisis cannot be ignored and Parliament has to take a lead in this regard with special reference to the upcoming budget.\nAdvisor to the Prime Minister on Parliamentary Affairs Dr. Babar Awan, during the meeting, apprised that federal and provincial governments have taken a unanimous decision to extend the lockdown until April 30.\nHe stressed the need to consider overall situation with regard to lockdown, precautionary protocols and the risk factors involved before taking any decision. Parliamentary leaders, participating in the discussion also floated various proposals for convening senate sessions and committee meetings.\nLeader of the House in Senate Syed Shibli Faraz, Mushahidullah Khan, Sitara Ayaz, Barrister Muhammad Ali Saif, Sajjad Hussain Turi, Anwar ul Haq Kakar, Aurangzeb Khan Aurakzai, Advisor to Prime Minister Babar Awan, Federal Minister for Narcotic Control Muhammad Azam Swati and Secretary Senate Dr. Akhtar Nazir were present in the committee room during the meeting whereas Deputy Chairman Senate Saleem Mandviwalla, Leader of the oppostion in the Senate Raja Muhammad Zafar ul Haq, Senator Sherry Rehman , Moulana Abdul Ghafoor Haideri and Usman Khan Kakar, Dr. Jahanzeb Jamaldini, Siraj ul Haq, participated through Video Link and gave recommendations.",
  "retrievedAt": "2025-08-11T19:06:12.771Z"
}
