{
  "title": "Sindh CM responsible to save vulnerable segments from unemployment, starvation: Dr Firdous",
  "link": "https://www.app.com.pk/national/sindh-cm-responsible-to-save-vulnerable-segments-from-unemployment-starvation-dr-firdous/",
  "date_published": "2020-04-15T08:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Wednesday said Sindh Chief Minister Murad Ali Shah was fully empowered under the Constitution to take decisions about easing or extending the lockdown in the province, but as the chief executive of the province he was also responsible to save the vulnerable segments from unemployment, hunger and starvation.\nAddressing a joint press conference along with Pakistan Tehreek-e-Insaf (PTI)’s Central Vice President and Parliamentary leader of the Party in Sindh Assembly Haleem Adil Sheikh here, she said on Tuesday, during the National Coordination Committee (NCC) meeting chaired by Prime Minister Imran Khan, decisions were made in consensus and for the sake of national unity, the prime minister authorized the provinces to take their own decisions regarding lockdown and opening of low-risk industries to provide employment to daily wage workers.\nThe special assistant said Prime Minister Imran Khan was fully cognizant of his responsibilities and taking along all the federating units to successfully surmount the challenge.\nShe said the federal and provincial governments would have to work together to cope with the coronavirus challenge.\nShe said all other provinces accepted the decisions made in the NCC meeting but unfortunately Sindh government spokesman, also a provincial minister made a controversial tweet which was an effort to divide the nation at this critical juncture.\nShe said time and again the Sindh government was informed during the meetings of NCC that the provinces were free to take decisions in the larger interest of the people of their respective provinces keeping in view ground situation.\nShe said the rulers should give hope to the people but the in today’s press conference of Syed Murad Ali Shah appeared pessimistic which might create fear and panic among the people of Sindh.\nShe reminded the Sindh chief minister that he had the powers to impose curfew in the province under the Constitution but at the same time he had responsibilities to protect the rights of the people of the province.\nShe said if the Sindh government failed to provide ration to the poor segments of the society, it would mean that the lockdown was imposed to protect the rights of the upper class and to promote his image of ‘good boy’ in the media.\nShe assured that the federal government was ready to cooperate with the provincial government in the process of providing relief to the poor segments o f the society and Ehsaas Emergency Cash Programme was its manifestation as disbursements were being made in all provinces including Azad Kashmir and Gilgit Baltistan.\nShe said the federal government announced Rs1200 billion relief package after the spread of coronavirus, whereas the Sindh government had not announced any relief package for vulnerable segments of the society.\nShe asked Murad Ali Shah that instead of focusing to build his media image, he should look at the poverty and hunger at the ground and take measures.\nShe said the picture of Qauid-e-Azam Muhmmad Ali Jinnah had been published on the boxes of relief packages given by the federal government as this was not the time of political point-scoring, but serving the masses.\nShe said the Prime Minister Imran Khan wanted to take all provinces with him in fight against the coronavirus as the government had been fighting on two fronts, one of controlling coronavirus and the other to protect the people from hunger and starvation.\nHaleem Adil Sheikh said PTI was in the opposition in Sindh, but it wanted to cooperate with the government of the province at this critical time.\nHe asked Sindh chief Minister that instead of holding lengthy press conferences, he should perform practically on the ground.\nHe said the Sindh government should disclose where it had distributed relief goods worth billions of rupees.\nHe said Bilawal Bhutto Zardari should know that health sector was a provincial department and the PPP was ruling the province for past 12 years but health infrastructure was in very bad shape.\nHaleem Adil Sheikh said thousands of youth had joined Tiger Force in Sindh and working actively to provide relief to the deserving people.",
  "retrievedAt": "2025-08-11T19:06:08.063Z"
}
