{
  "title": "Minister calls students to use productively online learning opportunity during lockdown in country",
  "link": "https://www.app.com.pk/national/minister-calls-students-to-use-productively-online-learning-opportunity-during-lockdown-in-country/",
  "date_published": "2020-04-15T01:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP):Federal Minister for Federal Education and Professional Training/ National History and Literary Heritage Division Shafqat Mehmood Wednesday stressed upon teachers and students to use online learning opportunity productively during the lockdown situation prevailing in the country.\nIt is necessary to work out new methods of imparting education to students by connecting them with teachers under this extraordinary situation,” Minister said while speaking to a private news channel.\nWith the help of this platform, the students can revise their lessons, practice academic exercises, find additional materials on difficult topics as well as get immediate feedback from their teachers, he said.\nNow teachers with reliable internet connectivity have been asked to offer their services to help pupils catch up during the lockdown period, he mentioned.\nMinister for Education said amid Coronavirus crises, the government with collaboration of Pakistan television initiated a learning program for students who are forced to stay at home due to Coronavirus outbreak.\nTeleschooling is a great initiative of running a literacy program on television to educate the students at home, he added.\nHigher Education Commission (HEC) also advised universities to arrange online classes but this plan could not succeeded due to technical issues and unavailability of the internet in some parts of the country, minister said.\nPTV has great outreach and we can be connected with maximum number of students all over the country, he said, adding, we are also working to improve the connectivity issues.\nHe also emphasized that the students must remain indoors as part of precautionary steps against COVID-19 and learn from home classes.",
  "retrievedAt": "2025-08-11T19:06:19.065Z"
}
