{
  "title": "COVID-19: Govt. extends expired MRPs, CNICs’ validity till June 30",
  "link": "https://www.app.com.pk/national/covid-19-govt-extends-expired-mrps-cnics-validity-till-june-30/",
  "date_published": "2020-04-15T05:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP):The government on Wednesday announced to extend validity of expired Machine Readable Passports (MRPs) and Computerized National Identity Cards (CNICs) till June 30 in the wake of coronavirus (COVID-19).\nAll the passport issuing authorities at home and abroad have been advised to entertain expired CNICs up to April 30 and until further orders as NADRA had discontinued renewal of CNICs, said a notification issued by the Ministry of Interior.\nExpired MRPs could be extended manually as per the given “manual observation” for a further period of one year on realization of proportionate fee equivalent to Rs 1,000, by submitting application on plain paper along with copies of passport and CNICs.\nManual endorsement regarding newborn babies may be made in the MRP of either parents, subject to realization of prescribed endorsement fee equivalent to Rs 800 and after completion of all other formalities, the notification said.\nThe foreign missions abroad had been advised that the passport applications could be processed through online service, and in case a passport was not received by the applicant through online service due to suspension of operation of international flights, a manual extension might be granted on their existing passports.\nThe ministry of foreign affairs had been asked to convey these instructions to missions in Islamabad and abroad.\nMeanwhile in another notification, the ministry said, Pakistani prisoners, detained in different countries, would be allowed to come back after the verification of nationality and passport.\nIn case of the prisoners having valid CNICs but not valid passports, the prisoners will be deported after due verification of nationality, CNIC and passports and issuing of Emergency Travel Document (ETD).\nIn the case of not valid CNICs and passports, the application of individual will be dispatched to ministry of interior for verification through email. “\n“Only verified Pakistani are allowed deportation to Pakistan” the notification said",
  "retrievedAt": "2025-08-11T19:06:11.819Z"
}
