{
  "title": "Sania Nishtar visits Payment Center at G-10/4 to review arrangements",
  "link": "https://www.app.com.pk/national/sania-nishtar-visits-payment-center-at-g-10-4-to-review-arrangements/",
  "date_published": "2020-04-15T01:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP):Special Assistant to Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar Wednesday visited Payment Center for disbursement of assistance under Ehsaas Emergency Cash Program at G-10/4 Islamabad to check the arrangements and facilities.\nThe special assistant expressed satisfaction over the cash disbursement arrangements after interacting with the women in queues and staff.\nAll the sufficient preventive measures for the safety of women beneficiaries were taken by the officials through ensuring hand sanitization, maintaining distance, disinfection of centers etc.\nThe payment process under Ehsaas Emergency Cash programme was started from Thursday and continuing smoothly till the seventh day (Wednesday).\nDuring the last six days (till Tuesday) an amount of Rs. 32.87 billion has been disbursed among more than 2.73 million people under the Ehsaas Emergency Cash programme.\nOut of 17,000 payment centers for cash disbursement under this program, 9,419 centers have been establishment so far.\nThe staff at the payment centers has been trained to deal with the persons with disabilities also.\nThe registration process to receive the emergency cash of Rs. 12,000 per family distributed under this scheme is SMS driven, and this has been ongoing for the last two weeks.\nTo-date, 78.44 million SMS requests have been received. “It is possible that several people from one family apply, hence the number of families applying may be less than this number”, said Dr. Sania.\nEhsaas has announced that the SMS campaign will be opened till 19th of this month. Ehsaas has also released an instructional video to explain to people what they should expect.\nThe Cabinet has approved waiver of advance withholding tax on commission collected under section 233 of the Income Tax Ordinance, 2001 from branchless banking agents, to incentivize branchless banking operations from operating in the current difficult environment.",
  "retrievedAt": "2025-08-11T19:06:18.544Z"
}
