{
  "title": "No political affiliation in Ehsaas Cash Emergency Programme: PM",
  "link": "https://www.app.com.pk/national/no-political-affiliation-in-ehsaas-cash-emergency-programme-pm/",
  "date_published": "2020-04-15T05:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP):Prime Minister Imran Khan on Wednesday said Ehsaas Cash Emergency Programme was being carried out regardless of any political affiliation besides ensuring utmost transparency and merit.\nIn a meeting with Central Vice President of Pakistan Tehreek-e-Insaf Haleem Adil Sheikh, the Prime Minister said the federal government was taking every possible step to provide relief to general public during the tough times of coronavirus situation.\nImran Khan said the government was cognizant of the problems faced by people and termed poverty another big challenge along with COVID-19.\nHe said the government was formulating the strategy to address the situation keeping in view the economic problems of people.\nHe lauded the spirit of youth of the country in joining Corona Relief Tiger Force and stressed contribution of philanthropists to help the government mitigate the situation amid epidemic.\nHe urged the political figures to motivate the affluent to help the needy and deserving during particular situation.\nHaleem Adil Sheikh apprised the prime minister on overall situation of coronavirus in Sindh and the problems faced by the people.\nHe said the people of Sindh were grateful for the financial assistance given by Prime Minister Imran Khan through Ehsaas Cash Emergency Programme.\nHe said the people of provinces acknowledged the federal government’s steps including allocation of billions of rupees for needy despite financial constraints and taking timely decisions for construction and export industries.\nHaleem Sheikh said the youth of Sindh would be ever-ready to join the Tiger Force and become a strength of Prime Minister Imran Khan.\nHe assured the prime minister that PTI Sindh chapter would not leave alone the people of province in current difficult time.",
  "retrievedAt": "2025-08-11T19:06:11.996Z"
}
