{
  "title": "Joint efforts needed to contain coronavirus pandemic: Shafqat",
  "link": "https://www.app.com.pk/national/joint-efforts-needed-to-contain-coronavirus-pandemic-shafqat/",
  "date_published": "2020-04-15T04:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP):Minister for Federal Education and Professional Training and National Heritage and Culture Shafqat Mahmood Wednesday said international online Mushaira was a breath of fresh air for the people who were confining themselves at homes during the lockdown in the wake of coronavirus pandemic.\nHe was speaking at the Online Mushaira organized by Pakistan Academy of Letters here.\nShafqat Mahmood said without the joint efforts of the government agencies, social organizations and individuals, it is not possible to overcome the pandemic and its adverse effects.\nHe said the government was aware of its responsibility to protect the people. In a global perspective, our region was facing many problems, despite the scarce resources, the government was working hard to ensure that the poor people face least problems during the coronavirus.\nHe said things would improve and switch back to the normal days. Pakistan Academy of Letters would play its role in developing mutual relations between the writers and people by utilizing modern resources in a better way, he added.\nHe said that launching of the online “Umeed-e-Zeest Award” by PAL is well-appreciated in the context of the coronavirus pandemic.\nPakistan Academy of Letters, Chairman Dr Yousuf Khushk said under the patronage and guidance of Federal Minister, Shafqat Mahmood, PAL would work on modern lines for the promotion of literature and welfare of the writers.\nHe said the writers’ community who was limited to houses would stay in touch with one another through this activity to minimize the prevailing environment of isolation. This Mushaira would be broadcast on the Pakistan Academy of Letters Facebook page, which would be viewed by millions of people, he said.\nHe said the PALs would continue to host such online events and also organize an online seminar ‘a Naatya programme’ on the death anniversary of Allama Iqbal in Ramazan.\nDr Khushk said the history of literature was a witness to the fact that writers had written excellent and masterpiece writings in difficult situations. The writers had highlighted difficult situations of coronavirus through their writings and had kept the consciousness.\nIftikhar Arif said the PAL’s Mushaira in this situation was like spring, in which poets from Pakistan and around the world were participating.\nThe Mushaira was presided over by Iftikhar Arif.",
  "retrievedAt": "2025-08-11T19:06:16.449Z"
}
