{
  "title": "Huawei launches mandatory ICT courses for students across Islamabad under PM’s digital education initiative",
  "author": null,
  "content": "ISLAMABAD, May 27 (APP):In a significant step toward digital education reform, Huawei Pakistan, in collaboration with the Ministry of Federal Education & Professional Training (MoFE&PT), has rolled out a wide-ranging ICT training program for students from Grade 6 to 10 across Islamabad Model Schools and Colleges. The initiative is part of the Prime Minister’s nationwide digital transformation campaign.\nThe program, overseen by the Federal Directorate of Education (FDE), aims to train over 300,000 students, with special focus on regions including Islamabad, Gilgit-Baltistan, and Azad Jammu and Kashmir. Alongside student training, the project includes a “Train the Trainer” component and the formulation of a comprehensive digital roadmap for educational institutions.\nAccording to an official notification issued by the FDE, all heads of institutions have been directed to ensure 100% registration of students from Grades 6 to 10 by May 27. Students are required to register through the Huawei Talent platform and must possess unique email IDs and phone numbers to complete the process.\nThe foundational course titled “AI Basics” — a one-hour module — has been made mandatory for all students before the commencement of the summer vacations. Subsequent courses will cover a wide array of emerging technologies such as 5G, IoT, cloud computing, data analysis, and network security, scheduled across various months for different grade levels.\nThe FDE emphasized the significance of this initiative in preparing students for a rapidly digitalizing world and enhancing Pakistan’s IT education infrastructure.\nStudents who complete the modules will receive official course completion certificates, boosting their credentials in the digital tech arena.\nFor registration and further information, students can access the course portal at Huawei Talent Platform https://talent.shixizhi.huawei.com/center/private Center.htm?schoolld=136518942739522 3554&type=studyCenter LearningTask&sxzlang=en US&mapDetail=3&mapDetailld=l 856513213288005633.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:56:45.614Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/huawei-launches-mandatory-ict-courses-for-students-across-islamabad-under-pms-digital-education-initiative/",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T08:17:00.000Z"
}
