{
  "title": "Foundation University, Romanian embassy host ‘Foundation Film Festival 2025’",
  "author": null,
  "content": "ISLAMABAD, May 27 (APP): The Foundation University Islamabad’s Department of Arts and Media, in collaboration with the Embassy of Romania, hosted the Foundation Film Festival 2025.\nThe event featured the Romanian documentary “The King’s War,” which explores King MichaelI’s pivotal role in World War II.The festival kicked off with the arrival of Romanian Ambassador Dr. Dan Stoenescu, who was welcomed by Professor Dr. Qaiser Ali Malik and Dr. Hina Shahid, Head of the Department of Arts and Media. Renowned artist Jamal Shah and Zaildar Ahsan Shah, President of the Romania-Pakistan Friendship Association, also attended.Dr. Hina Shahid emphasized the importance of arts and media in promoting peace narratives during conflicts, highlighting the department’s academic achievements and cultural outreach. The festival received 92 film submissions across various categories.\nAmbassador Stoenescu reflected on Romania’s complex geopolitical position during World War II and the importance of film, art, and theater in preserving national history.\nHe also inaugurated a Romanian cultural exhibition showcasing the country’s artistic legacy.\nThe ambassador praised Pakistani artistic expression and acknowledged its role in strengthening cultural bridges between Romania and Pakistan after visiting the Indigenous Art Gallery.\nThe event concluded with an award ceremony recognizing contributors to the festival.\nThis cultural exchange marks a significant step in strengthening ties between Romania and Pakistan, following the opening of Romania’s Honorary Consulate in Peshawar and discussions on parliamentary friendship groups.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:55:33.155Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/foundation-university-romanian-embassy-host-foundation-film-festival-2025/",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T11:23:00.000Z"
}
