{
  "title": "RISJA elected new body for 2025-26 term",
  "author": null,
  "content": "ISLAMABAD, May 27 (APP):Rawalpindi Islamabad Sports Journalists Association (RISJA), on Tuesday elected new office bearers for the next term (2025-26).\nThe election process was held at the National Press Club (NPC),Islamabad under the supervision of a three-member election committee including Shehryar Khan as Chairman, Asim Jilani and Rana Farhan Aslam as members of the election committee.\nAccording to the election results, 59 members unanimously recommended the single panel to form the new governing body with Abu Bakr secured the position of the President, while other office bearers included Syed Arsalan Sherazi as General Secretary, Nasir Abbas Naqvi as Finance Secretary. Zulfiqar Baig was elected as Senior Vice President, Aqeel Anjum and Asghar Ali Mubarak as Vice Presidents, and Hafiz Obaidur Rehman along with Asim Riaz as Joint Secretaries, said a press release.\nThe elected executive body members of RISJA included Faheem Anwar Khan, Afzal Javed, Zahid Farooq Malik, Nasir Aslam Raja, Zeeshan Qayyum, Sohail Raja, Arfa Feroz, Kiran Khan, Owais Abbasi and Farhan Jafri.\nAbdul Muhi Shah and Malik Shakeel Awan will serve as the patron and chairman of RISJA respectively.\nOn this occasion, the newly elected President, and Secretary, expressed their gratitude to the members and reaffirmed that newly elected body would serve deliberately and effectively for the welfare of the members of the association.\nOn the other hand, NPC President Azhar Jatoi, Rawalpindi Islamabad Union of Journalist’s (RIUJ) President, Tariq Ali Virk and others congratulated the newly elected office bearers and expressed hope that the new body would render exemplary services to the journalist community\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:57:37.248Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/risja-elected-new-body-for-2025-26-term/",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T15:58:00.000Z"
}
