{
  "title": "Technical Institutes of China, Pakistan sign MoU to enhance Vocational Training Cooperation",
  "link": "https://www.app.com.pk/national/technical-institutes-of-china-pakistan-sign-mou-to-enhance-vocational-training-cooperation/",
  "date_published": "2022-03-30T10:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP): Beijing Industrial Technician College and the Punjab University of Technology Rasul Wednesday signed an MoU to enhance sister college relations for long-term collaboration to increase international education exchange and strengthen vocational education and training cooperation.\nTo further promote mutual understanding and friendship, both institutions under this MoU (Memorandum of Understanding) will develop cooperation in vocational education and training, focusing on teacher training and study tours, says a press release issued here.\nThis MoU’s potential outcome will be and not be limited to exchange and visits, study tours for students, customized professional development programs for trainers, teachers facilitated by BITC, and course and latest curriculum development.\nWhile speaking on occasion, Prof. Dr. Rauf-i-Azam, Vice-Chancellor, Punjab University of Technology, said that the Punjab University of Technology Rasul (PUT Rasul) was established through an Act of the Provincial Assembly of Punjab in 2018.  Despite being launched recently, PUT Rasul has a rich history and enviable legacy of producing engineering professionals for more than a century.\nPunjab University of Technology Rasul (PUT Rasul) offers various BS programs related to Civil Engineering Technology, Electrical Engineering Technology,&nbsp; Mechanical Engineering Technology, Software Engineering Technology,&nbsp; Technology Management.\nHe said this MoU would bring forward the two institutions and help foster Pakistan-China relations. While speaking on occasion, Cai Xizhong, President of Beijing Industrial Technician College, said that Beijing Industrial Technician College is subordinate to the Department of Human Resources and Social Security, with more than 3500 students.\nThere are four major professional groups and 25 majors, including Intelligent manufacturing, Environmental testing, Automobile maintenance services, and Cultural and creative industries. He said that the college is China’s training base for four projects of World Skills International: CNC lathe, CNC milling, Water treatment technology, and Mechatronics.\nBITC has received experts and players from many countries for exchange visits. BITC has also won five gold medals, two silver medals, one bronze medal, and one winning prize in the world skills international; the gold medal rate is 50%, and the medal rate is 80%. BITC has carried out 32 foreign trainings for food inspectors and other technicians of countries along the “Belt and Road,” with 888 trainees, covering more than 40 countries such as Cambodia and Burma.\nProf. Dr. Rauf-i-Azam, Vice-Chancellor, Punjab University of Technology, and President Cai Xizhong, Beijing Industrial Technician College, signed the document.  Both sides have appreciated the Institute of Peace and Diplomatic Studies’ efforts to facilitate the cooperation between the institution.  They pointed out that IPDS has made landmark and remarkable efforts in building China-Pakistan cooperation.",
  "retrievedAt": "2025-08-11T14:37:48.536Z"
}
