{
  "title": "Ehsaas programme: Neglected Street Hawkers reap the benefits",
  "link": "https://www.app.com.pk/national/ehsaas-programme-neglected-street-hawkers-reap-the-benefits/",
  "date_published": "2022-03-30T06:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP): Street vendors are the most visible part of the urban informal economies around the world and contributing immensely to provide easy access to a wider range of goods and services in public spaces.\nRoaming around all the day in bazaars and streets, this segment of society remained neglected over the decades and in absence of any specific incentive for them, they have to often come across hard times.\nRespective governments of the past have been benefitting big industrialists, rich businessmen and feudal lords in dispensation of loans, incentives and subsidies but it was the Pakistan Tehreek-e-Insaaf government that for the first time came out to mitigate their suffering.\nThe first-ever Ehsaas Street Hawkers initiative was launched in Islamabad to safeguard the rights of street vendors, address their concerns and improve their financial conditions.\nThe initiative is being executed through collaboration among the Capital Development Authority (CDA), Islamabad Capital Territory Administration (ICTA), Metropolitan Corporation Islamabad (MCI), and Pakistan Institute of Development Economics (PIDE) under Mazdoor Ka Ehsaas.\nAccording to the conservative estimates, there are around 20,000 street vendors operating in Islamabad, who are generating annual net income up to Rupees 9.6 billion.\nEhsaas’ support for street vendors is in line with the Prime Minister Imran Khan’s vision of the welfare state based on Riyasat-e-Madina model. Under this initiative, around 200 vendors in Islamabad have been provided vending licenses issued by municipality and new eco-friendly carts.\nSyed Tahir Sardar, a street vendor at G-11 who is beneficiary of the Ehsaas Rehribaan initiative said, “This is for the first time in the history that any government paid heed to the concerns of the street vendors and took steps to ensure their respectable earning through providing them a proper legal space, license certificate and new eco-friendly carts.”\nTahir Sardar who is providing watch repairing services said, this scheme has facilitated me and other vendors. “Earlier we have been facing issues due to sitting illegally in the main markets and bearing loss whenever Capital Development Authority (CDA) launched encroachment operation.”\nHe said, the owners of the shops in front of which we were sitting used to exploit us through extracting more and more money and pressurize us to raise the rent. “This program has saved us from all the pressures and helped expand our businesses.”\nAnother beneficiary of the program, Zahid Javed who is a garments vendor in the same sector, said the Rehribaan initiative has reduced our difficulties to a greater extent. “Earlier we were facing difficulty in displaying more and more stuff on the cart but this cart is more convenient to use.”\nHe said since this cart is covered and can be locked so we are now safe from heat and rain as well as thieves. “We can leave the stall there and freely move to do other tasks. We are thankful to the present government and urge to include us in other initiatives of the Ehsaas program.”\nAccording to the Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar, the government has embarked upon this initiative for street vendors for the first time in Pakistan.\n“The marginalized segment of street vendors is an integral part of the local economy, which cannot be wished away in a low-income country like Pakistan,” she said.\nStreet Vendors, have remained an integral part of the urban economy around the world. They provide a range of goods and services to middle- and low-income groups of society.\nPakistan is also not an exception as hundreds of thousands poor salesmen earn their living through vending business. They reach out to every nook and corner especially in low cost settlement to provide items of daily use at their door step.\nBut, they remained to be a neglected segment. No matter a policy was formulated in 1986 for Islamabad Capital Territory constituting a special committee that met in 2015 and 2017 to prepare a comprehensive framework for street vendors. But, no significant progress could be made.\nThe existing street vending framework talks about responsibilities and penalties applicable due to violations but a comprehensive framework that includes rights, privileges and entitlements of street vendors has not been set out in line with the much-needed safeguards.\nExecutive Director, Center of Street Economy (CSE), Zia Bandey informed that more than 200 existing vendors have been provided with the carts facility in four sectors of the federal capital including G-10, G-11, F-11 and I-10 after conducting survey. “During upcoming weeks, carts will be provided to the vendors in F-7 sector and gradually this facility would be extended to other sectors as well.”\n“These carts are eco-friendly and being provided initially to the vendors already selling goods outside the shops or in markets for the last many years,” he informed. “The only difference we made is that now they have more convenient cart facility, legal space, license and they don’t have to pay rent or money to any shopkeeper there and face exploitation”.\nThese vendors who have been provided carts and licenses are now able to focus on their businesses more diligently without facing any threat or exploitation.\nAPP/snk/maz",
  "retrievedAt": "2025-08-11T14:37:54.212Z"
}
