{
  "title": "President for use of peaceful space technology, satellite navigation for agriculture, climate change",
  "link": "https://www.app.com.pk/national/president-for-enhanced-use-of-satellite-navigation-in-agriculture-climate-change/",
  "date_published": "2022-03-30T09:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP): President Dr Arif Alvi on Wednesday said Pakistan supported the peaceful use of space technology and stressed that achieving self-reliance in satellite navigation was significant for the country to match the pace of global scientific advancements.\nThe president called for the revision of global space laws in pursuit of activities for peaceful purposes and emphasized a “responsible approach” by the States to discourage the proliferation of space debris in the Earth’s orbit.\nAddressing the concluding ceremony of the International Conference on Space (ICS) 2022 on ‘Role of space technology and applications in socio-economic development’, the president said.\nOrganized by Pakistan Space and Upper Atmosphere Research Commission (SUPARCO), the three-day event brought together space sector scientists, academicians, and researchers to share views on areas of space science, technology, and applications.\nPresident Alvi emphasized that the world needed to understand that science without the approach of compassion and humanity was of little use for mankind. However, he pointed out that the countries with “an edge of power” were ignoring the principles of morality in view of their economic interests.\nHe said India’s irresponsible attitude was a big threat to the region’s security, adding that the open sale of uranium in the country was a point of concern. He also termed as “highly irresponsible” the recent incident where India’s “unguided” missile was launched toward Pakistan’s airspace.\nHe said after Russia, Pakistan was the first country in Asia that sent a satellite to outer space and also achieved nuclear deterrence in short span of seven years after India conducted its “so-called peaceful” atomic explosion” in 1974.\nPresident Alvi called upon the country’s space technology scientists to explore capabilities in satellite navigation and promote relevant applications in areas of socio-economic development.\nHe stressed achieving capabilities to process the high volume of satellite image data in areas particularly agriculture, river water telemetry, climate change and flood monitoring.\nPresident Alvi said the government was focusing on the making of indigenous satellites and added that huge responsibility lay on scientists to target their work and research in identifying future requirements related to satellite navigation in line with latest trends.\nHe mentioned that Pakistan through its satellites was already carrying out studies on global warming to get a better understanding of the effects of trace gases on the depletion of the atmosphere’s Ozone layer.\nThe president said he had tasked SUPARCO to use artificial intelligence and Geographic Information System (GIS) for improved calibration of irrigation system in the country.\nHe said expanding the existing scope of remote sensing through geo-stationary satellites was important for the sustainable management of water resources.\nHe expressed confidence that the International Space Conference 2022 would provide budding scientists of Pakistan an opportunity to converge their energies on research and development in the field of space science, technology, and its applications.\nChairman SUPARCO Amir Nadeem said the technical discussions of the conference focused on the management of remote data and GIS for better management of natural resources.\nHe said the platform provided an opportunity to those having an ambition in the space sector and exploring various dimensions of science.\nSecretary-General Asia Pacific Space Cooperation Organization, Yu Qi in her video message shown on the occasion said Pakistan as a founding member of APSCO always promoted regional cooperation for the promotion of space science.\nICS Secretary Aftab Ahmed Khan highlighted the objective of enhancement of science\napplications and services for socio-economic development.\nLater, President Alvi visited the exhibition of stalls where he was briefed about Pakistan’s aerospace navigation systems and the robots designed to accommodate a variety of rugged terrain for tactical surveillance.\nThe national fleet of satellites including BADR-1, BADR-B, PakSat-1, PakSat-1R, PRSS-1 and PakTes-1A were also put on display.",
  "retrievedAt": "2025-08-11T14:37:48.634Z"
}
