{
  "title": "Online Visa available in 191 countries: Rashid",
  "link": "https://www.app.com.pk/national/online-visa-available-in-191-countries-rasheed/",
  "date_published": "2022-03-30T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP): Minister for Interior Sheikh Rasheed Ahmed on Wednesday said e-passport facility has been introduced on the directives of Prime Minister Imran Khan adding that online visa was available in 191 countries and currently no visa case was pending with the interior ministry.\nSpeaking at launching of E-Passport ceremony here, the minister said corruption has totally been eliminated in visa process as earlier Rs 100,000 to Rs 150,000 per visa bribe was being taken.\nHe said process of acquiring visa has been made easy and online and the people could get online visa in 191 countries. As many as 88 new NADRA offices were opened in various part of the country and every Tehsil headquarters has NADRA office, he said.\nHe said ladies staff was recruited in NADRA offices of erstwhile FATA areas and Balochistan to facilitate the women of far flung areas.\nHe said validity of passport has also been extended from 5 to 10 years to facilitate the overseas Pakistani on same old fee on the directives of PM. NADRA has started issuing succession certificate across the country and its credit also goes to PM, he added.\nThe minister said drone service has also been launched in Islamabad which helped foil several terrorist activities. He said some 300 new parks have been established and renovated in the federal capital under the PM’s green and clean Pakistan Vision. Women Bazaars have been set up in the Capital to empower women folk, he added.\nSheikh Rasheed said popularity of Imran Khan has immensely increased and entire nation was with the PM. Coming hard on Sharif family, he said the Sharif family remained involved in minting money from Saddam Hussain, Col Gaddafi and Osama Bin Laden. Nawaz Sharif personally appeared before the Apex Court in Memo-gate scandal, he added.\nHe said it was Nawaz Sharif who provided Fareed Kot address of Ajmal Kasab to India.\nEarlier, Director General Immigration Islam Zeb briefed the participants about the feature of e-Passport. The e-Passport has 29 latest new security features and electronic Chip has been used in it, he added.\nHe said e-Passport holder would take benefit of e-gate facility at all airports around the world.",
  "retrievedAt": "2025-08-11T14:37:48.495Z"
}
