{
  "title": "Korea to increase EDCF loans for Pakistan up to $1 billion for 5 years: Ambassador",
  "link": "https://www.app.com.pk/national/korea-to-increase-edcf-loans-for-pakistan-up-to-1-billion-for-5-years-ambassador/",
  "date_published": "2022-03-30T07:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP): Ambassador Republic of Korea Suh Sangpyo on Wednesday said the government of Korea will increase the Economic Development Cooperation Fund (EDCF) loans for Pakistan upto US$ One billion for five years (2022-26).\nIn an exclusive chat with APP, the Korean Ambassador said that in 2019, Korea signed the framework agreement with Pakistan to provide $500 million of EDCF loans that give financial space for the construction of infrastructure in Pakistan.\nAmbassador Sangpyo said there are multiple projects underway between Pakistan and Korea as in the business sector, both countries partner in the automobile, transportation, hydropower, smartphones, and confectionaries production sectors.\nWhile further elaborating the cooperation in various areas, he said Administrator of the Rural Development Administration (RDA) of the Republic of Korea (RoK), Taewoong Hur and his delegation visited Pakistan from August 3rd to 5th past year and paid courtesy call to the Prime Minister. Hur inaugurated the KOPIA Pakistan Center and chaired the Joint Symposium for Agricultural Technical Cooperation between the both countries.\nThe technical Cooperation projects include self-sufficiency of virus free potato seed multiplication by Aeroponic Technique, Chilli production and post-harvest management technology development in Pakistan, and establishment of production technology of major fodder crops in Pakistan, he added.\n“New Technical Cooperation Projects Signing Ceremony between Korea Program on International Agriculture (KOPIA) Center, Rural Development Administration (RDA) and Ministry of National Food Security & Research (MNFSR), Pakistan Agricultural Research Council (PARC) was held on May 4, 2021,” the Ambassador said.\nHe also underlined the collaboration in the field of EDCF and IT Park. The ambassador and Minister for Information Technology and Telecommunications, Syed Amin ul Haque inaugurated the Islamabad Technology Park in May, 2021.\n“Around 1,500 Pakistani students are studying in Korea in undergraduate and graduate programs. Global Korea Scholarship (GKS) provides international students with opportunities to conduct advanced studies in undergraduate & graduate programs at higher educational institutions in the Republic of Korea in order to promote international exchanges in education and mutual friendship between countries”, he informed.\nThe Embassy of the Republic of Korea and the University of Peshawar jointly organized a seminar on the Current Situation in Afghanistan and the Regional Plans for Peace-building on the 8th of December at the University of Peshawar Campus.\nMore than 200 Masters and PhD students attended the seminar and held interactive discussions over lunch with the Ambassador of the Republic of Korea Suh Sangpyo and the panelists.\nIn the field of education, he said the University level Cooperation included PMAS-Arid Agriculture University Rawalpindi and the Chungbuk National University memorandum of understanding (MOU).\nThe institutions agreed to cooperate over full spectrum of mutual interest with specific agreements on January 26, 2022 which included academic and technical staff Exchange for joint research, joint publication of research paper etc.\nThe Korean Embassy was also active contributing Climate Change Crisis Cooperation.\nThe Embassy in its commitment to support the Ten Billion Tree Tsunami Initiative of the Prime Minister of Pakistan Imran Khan has donated Ten Thousand Trees under the second phase of the Pak-RoK Friendship Forest, which is aimed at helping Pakistan in its fight against Climate Change.\nThe Ambassador said, “The Friendship Forest was launched in 2019 in Haripur, Khyber Pakhtunkhwa with just 6,000 trees. Now within its Phase-II, the Embassy will be planting 10,000 trees and with the years to come, it aims to continue expanding this Friendship Forest across the country especially in areas which have suffered from deforestation and biodiversity loss”.\nHe added that the Korean Companies have completed multiple Hydropower projects in Pakistan. “The multiple projects are in-process mainly in the Khyber Pakhtunkhwa province in Pakistan. The total amount of projects so far reached US$4 billion”, he added.\nThe list of companies working in the Hydropower sector include K-Water, Daewoo E&C, Korea South East Power Corporation (KOEN), DL E&C, Lotte E&C, Korea Hydro & Nuclear Power Corporation (KHNP), Korea Overseas Infrastructure & Urban Development Corporation (KIND), Lotte, Sambu Construction, Hyundai Eng., Doosan.\nDuring the COVID-19 pandemic, he said Pakistan, Republic of Korea and the UNHCR held a trilateral Letter of Exchange Ceremony in Islamabad on 26th February, 2021 in regards to the Donation of 600,000 Medical Masks from the Government of the Republic of Korea to the Government of Pakistan.\nHe mentioned that the Korean government in its commitment to support Pakistan’s fight against COVID-19 has donated essential medical equipment to the National Disaster Management Authority of Pakistan. “A handing over ceremony to mark the occasion was held at the Prime Minister’s Secretariat on 9th December 2021. The donated equipment included 2,000 Test Kits, 5 Ventilators, and 10 Oxygen Concentrators”.\nThe Ambassador mentioned that the Korea International Cooperation Agency (KOICA) Pakistan Office handed over 10,000 hand sanitizers to the Ministry Of Climate Change (MoCC) to strengthen the hygiene response system of Pakistan.\n“Currently 4 projects are ongoing and KOICA Pakistan office has granted around $8 million to the Government of Pakistan. Among the Korean Government Sponsored Scholarships, the 70 percent of the students major in engineering and 25 percent of students major in Natural Sciences have been assisted by the Korean government”, he added.\nKorean companies are working in the manufacturing and automobile sectors, other industries including manufacturing of smartphones, home-appliances, and confectionaries. “Also Korean Companies are working in the infrastructure areas including building of Hydro-dams”, he informed.\n/395",
  "retrievedAt": "2025-08-11T14:37:51.184Z"
}
