{
  "title": "FM reaffirms Pakistan’s desire to further strengthen bilateral cooperation with Iran",
  "link": "https://www.app.com.pk/global/fm-reaffirms-pakistans-desire-to-further-strengthen-bilateral-cooperation-with-iran/",
  "date_published": "2022-03-30T13:42:00.000Z",
  "source": "APP",
  "content": "HUANGSHAN, (China) March 30 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi on Wednesday while referring to the frequent high-level exchanges between Pakistan and Iran, reaffirmed Pakistan’s desire to strengthen the bilateral cooperation in all areas.\nHe also underscored the importance of earliest completion of border markets in the context of enhanced bilateral economic cooperation.\nOn the sidelines of the Ministerial meeting of the Neighbouring Countries of Afghanistan, Foreign Minister Makhdoom Shah Mahmood Qureshi met with Iranian Foreign Minister Dr. Hossein Amir Abdollahian.\nDuring the meeting, the two foreign ministers had a comprehensive review of bilateral relations and the regional situation.\nThe foreign minister also briefed on the unprovoked violation of Pakistan’s airspace by an Indian supersonic missile, underlining that such actions were fraught with grave implications and represented a serious threat to regional peace and stability.\nOn the situation in Afghanistan, the foreign minister highlighted that as neighbours, Pakistan and Iran had been closely coordinating.\nPakistan would continue to play its role for political and economic stability of Afghanistan, which would ultimately benefit the entire region, he added.\nForeign minister Qureshi expressed the hope that the Joint Economic Commission session would be held at the earliest to boost trade and economic collaboration.\nThe foreign minister expressed satisfaction on the facilitative movement of trucks under TIR, which would further strengthen economic linkages in the region.\nQureshi appreciated Iran’s steadfast support for the Kashmir cause, especially at the Supreme Leader level.\nForeign minister Dr. Abdollahian reaffirmed Iran’s desire to further strengthen fraternal ties in diverse areas of bilateral cooperation. He also extended an invitation to the Foreign Minister to visit Iran to carry forward the process of expansion of bilateral relations.",
  "retrievedAt": "2025-08-11T14:37:59.659Z"
}
