{
  "title": "PR procures 230 new bogies: Senate told",
  "link": "https://www.app.com.pk/national/pr-procures-230-new-bogies-senate-told/",
  "date_published": "2022-01-18T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP): Minister for Railways Muhammad Azam Khan Swati on Tuesday told the Senate that Pakistan Railways has procured 230 new bogies to provide better services to the passengers which would be received in three to four months.\nReplying to various questions during Question Hour, the minister said the capacity of repair workshop was also being enhanced in order to repair 30-40 bogies per month.\nHe said PR has bogies which were 30-50 years old. Railways has locomotives but due to shortage of bogies could not run more trains between Lahore and Rawalpindi, he added.\nHe said PR was ruined in the past due to political appointments and gang men were working in homes of officers. All the state enterprisers like PIA, Pakistan Steel Mills, Pakistan Post and PR, which were once profit earning institutions were ruined through excessive political appointments, he said.\nHe said the government has introduced a computerized system to improve the performance and efficiency of the department.\nHe said contract employees could not be regularized as per the decision of Apex Court. The government always creates job opportunities in the country, he added. He said the department was looking after the families of ‘Shudha’.\nReplying to another question, Azam Swati said several meetings have been held with Chinese authorities for initiation of work on up-gradation of ML-1 from Karachi to Peshawar. As per the requirement, PR has also handed over tendering documents to China, he added.\nHe said Prime Minister Imran Khan was visiting Beijing next month and he has requested him to take up this project with the Chinese president on priority basis.\nHe said the project was a win-win project both for Pakistan and China, which would help avert train accidents and cut losses of Pakistan Railways.\nThe minister said that some facilities like ticketing were also being out-sources.\nTo a question, he said an area of 4451 acre Railway land has been leased out during last three years in various parts of the country. Pakistan Railways has planned to commercially exploit its available lands through Private-Public Partnership (PPP) mode and in this regard expression of interest for hiring of consultant for commercial exploitation of 25 mega sites all over the network was invited in the year 2021.\nIn addition 111 new commercial sites were also identified all over the network to offer the sites for commercial projects under PPP mode in 2nd phase, he said.\nHowever, he said Supreme Court of Pakistan imposed ban on Pakistan Railways to commercially utilize its land by leasing on short or long term basis. Thereafter, lease process has been held up due to above said ban, he said.",
  "retrievedAt": "2025-08-11T14:08:29.493Z"
}
