{
  "title": "Govt intends to regularize cryptocurrency: Shibli Faraz",
  "link": "https://www.app.com.pk/national/govt-intends-to-regularize-cryptocurrency-shibli-faraz/",
  "date_published": "2022-01-18T16:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP): Federal Minister of Science and Technology, Senator Shibli Faraz Tuesday said the government intends to regularize the cryptocurrency for which the State Bank of Pakistan, Securities and Exchange Commission of Pakistan and Finance Division are working.\n“We cannot separate ourselves from the affairs of the region”, he said while addressing the first Pakistan Blockchain Summit 2022 at a local hotel.\nHe said that the people are turning to cryptocurrency without proper planning however government control is essential for prevention from loss and ensuring transparency.\nHe said that his ministry has taken important steps to move towards the use of technology. As a part of such efforts, the ministry developed the Electronic Voting Machine and formulated the Science, Technology and Innovation Policy.\nThe minister said that the blockchain will become a 20 billion market by 2024 and about 200 countries have somehow incorporated blockchain into their systems.\nThe banks can save eight to ten billion annually by using blockchain while the voting process can be more transparent through using this technology.\nThe blockchain technology has also been used in EVMs, he said.He said that the government is working on blockchain technology for transparency and accountability.\nThe Ministry of Science and Technology is launching blockchain technology pilot projects in its universities.\nAll three universities will bring their degrees on blockchain technology, he said adding, degree verification issues will also be resolved with the Higher Education Commission.\nSpeaking on the occasion, Minister of State and Chairman Board of Investment, Muhammad Azfar Ahsan said that the financial institutions are assuming a new shape with the advent of modern technology.\nHe said that Blockchain technology will revolutionize various fields.He said that the Board of Investment is the secretariat of the Special Economic Zones and connects the central and provincial governments.\nHe said that the federal government is working to make business easier for the people.Azhar Ahsan said that the Board of Investment has introduced 103 reforms in 24 sectors.",
  "retrievedAt": "2025-08-11T14:08:34.710Z"
}
