{
  "title": "Businessmen, Afghan envoy agree on removal of hindrances from Pak-Afghan trade",
  "link": "https://www.app.com.pk/national/businessmen-afghan-envoy-agree-on-removal-of-hindrances-from-pak-afghan-trade/",
  "date_published": "2022-01-18T10:35:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 18 (APP): An agreement was reached between businessmen and Newly appointed Acting Consul General of Afghanistan in Peshawar, Hafiz Mohibullah for joint efforts to remove hindrances in mutual trade and Transit Trade.\nThe agreement was reached during a meeting of delegation of businessmen led by Vice President of Pak-Afghan Joint Chamber of Commerce and Industry (PAJCCI), Zia-ul-Haq Sarhadi and Acting Afghan Consul General, says a press release issued here on Tuesday.\nThe businessmen’ delegation comprises of prominent importers and exporters of Pakistan and Afghanistan, transporters, custom clearing agents and people associated with trade between the two neighbouring countries.\nNewly appointed Commercial Attache at Afghan Consulate, Waheedullah Himmat, Deputy Attache, Hameedullah Fazil Khel, outgoing commercial attache, Fawad Arsh and other officials were present on the occasion.\nThe delegation members congratulated newly appointed officials from Taliban government and briefed them about the problems and difficulties being faced by businessmen of both the countries.\nSpeaking on the occasion, Zia-ul-Haq Sarhadi who is also President of Frontier Custom Agents Association said that there are a lot of difficulties in Afghan-Pakistan Transit Trade Agreement (APTTA) as a result of which it is not finalized yet.\nHe said around 90 percent work on APTTA has been completed and only 10 percent is remaining and there is need of involving stakeholders from both the countries.Zia apprised Afghan Consul General that export to Afghanistan from Pakistan has shown a decline of around 35 percent.\nDuring the period from September to December 2021, export to Afghanistan from Pakistan was calculated as 231.4 million dollars. Where the export during the same period in preceding year of 2020 was registered as US dollars 357.2 million, showing a reduction of US dollar 125.8 million dollars.\nZia Sarhadi appreciated the measures taken by Taliban government for facilitation of business community of the region the decision of reducing octroi tarrif helped in increasing business volume.\nTaking part in discussion, Former Senior Vice President of SCCI, Engr Manzoor Elahi and Shahid Hussain said presently there is economic crisis in Afghanistan as a result of which businessmen are unable to obtain Letter of Credit (LC) and other legal documents from banks.\nThey suggested that State Bank of Pakistan (SBP) should continue the facility it provided till December 13, 2021 of issuing Form E to exporters and Form I to importers till the time the economic crisis in Afghanistan is over and the country is recognized by international community.\nBoth sides agreement on taking measure for promotion of trade and commerce between both the countries and in the region in general.",
  "retrievedAt": "2025-08-11T14:08:29.301Z"
}
