{
  "title": "President expresses gratitude to Ulema for supporting govt policies against coronavirus",
  "link": "https://www.app.com.pk/national/president-expresses-gratitude-to-ulema-for-supporting-govt-policies-against-coronavirus/",
  "date_published": "2020-03-26T10:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 26 (APP):President Dr Arif Alvi on Thursday expressed his gratitude to the Ulema for supporting the government’s policies against the coronavrus, and urged them to advise and educate the people to stay indoors and offer prayers at homes, which would help contain the spread of disease.\nThe president held a video conference with the governors and Ulema from various schools of thought, and during the consultative session, he discussed with them the situation arising out of Covid-19 pandemic and sought their cooperation to create awareness among the masses about the disease.\nHe highlighted the preventive measures to be taken by the people for preventing the spread of the disease. The only solution to the present crisis, he emphasized, was to maintain social distancing and act upon the guidelines provided by Islam to cope with such a situation.\nThe president appreciated the unity among Ulema, particularly the unanimous declaration issued by them yesterday in Karachi calling for adoption of preventive measures against Covid-19.\nThe Ulema assured their complete support and said they would comply with the instructions given by the government. They said they had already taken a number of steps like cancellation of religious congregations, postponement of convocations and examinations, besides declaring holidays for over three million Madrassah (seminaries) students.\nThey advised the people to resort to Almighty Allah to rescue them from the crisis.\nThey appreciated the steps initiated by the government against the pandemic. They also commended the relief measures taken by the government for the welfare of the needy. The Ulema paid homage to the doctors and nurses, who were on the front line against this pandemic.\nAzad Jammu and Kashmir President Sardar Masood Khan, Federal Minister for Religious Affairs and Interfaith Harmony Pir Noor ul Haq Qadri, provincial governors, including Gilgit-Baltistan governor, Council of Islamic Ideology Chairman Dr Qibla Ayaz and Ulema from various schools of thought were also present on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:00:11.812Z"
}
