{
  "title": "Coronavirus pandemic: nation gears up with govt, opposition on one page",
  "link": "https://www.app.com.pk/national/coronavirus-pandemic-nation-gears-up-with-govt-opposition-on-one-page/",
  "date_published": "2020-03-26T00:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 26 (APP):People across the country has geared up to show ‘one nation, one goal’ spirit to defeat the pandemic as federal, provincial governments and opposition parties exhibiting a rare harmony and unity in fighting against this deadly coronavirus.\nAccording to official sources, currently the country was facing the coronavirus pandemic and the confirmed cases have crossed the figure of 1100 by this time.\nAmid limited medical facilities and financial challenges, a virtual lockdown has already been enforced across country as the federal government and the provincial governments were racing against time to contain the spread of coronavirus infectious.\nHowever, the challenge has also provided a rare opportunity to the nation to get united and wage a collective war against the fatal disease.\nThe pandemic effecting worldwide and the disease do not respect borders, nor religions or ethnicities. As the window of opportunity to contain the spread of coronavirus was getting narrower with each passing day.\nSindh government was offering most share of medical supplies which it has received from China on Wednesday to other provinces to help them effectively contain the spread of coronavirus.\n“Chief Minister Sindh has decided that out of the 500,000 N95 masks received from China, Sindh will keep 200,000 masks and the remaining will be distributed amongst Punjab, KP, Baluchistan, Azad Jammu and Kashmir and Gilgit Baltistan governments. Yes together we can,” Adviser to Sindh CM on Information Senator Murtaza Wahab posted on his twitter handle, shortly after Murad Ali Shah receiving a huge consignment of medical supplies donated by Jack Ma Foundation and Alibaba Foundation of China, at the Karachi airport.\nThe country’s top civil and military leadership has been pushing for unity and solidarity in the recent days in order to win the war against coronavirus. “Very rarely a calamity has such a worldwide impact as we are witnessing today. Nations have to go through difficult times, but only with unity, they sail through. We Pakistanis also need to stand united to fight this pandemic,” President Dr Arif Alvi said.\n“I am proud to say that the Pakistani nation has the capability to face any ordeal. We need unity and passion to face the catastrophe that has engulfed the whole world,” Prime Minister Imran Khan said.\nIn a rare gesture, Pakistan People’s Party (PPP) Chairman Bilawal Bhutto Zardari has announced a ‘no criticism policy’ against Prime Minister Imran Khan and the federal government over its response to coronavirus pandemic.\n“We should not waste our energies over criticism, the blame game and political point-scoring. It’s not the time to criticise the prime minister and I will not blame him or anyone. Instead, I should hope that he and every single citizen of Pakistan can win this fight through coordination and unity,” he said.\nSoon after the emergence of coronavirus cases in Pakistan, Prime Minister Imran Khan chaired a meeting of National Security Committee, with top provincial as well as military leadership in attendance, and took important decisions regarding the outbreak.\nA joint parliamentary committee comprising lawmakers from treasury and opposition benches was also being set up to fight a collective war the pandemic with unity and coherence.\nA cabinet meeting on Wednesday formally invited the opposition to give productive suggestions to be incorporated in the national roadmap being devised to handle the situation.\nAn environment of cooperation and unity among federal government, provincial governments as well as different political parties – both on treasury and opposition benches – has developed and country’s civil and military leadership were also on the same page vis-à-vis fight against coronavirus.\nIt is hoped that through joint and coordinated efforts, the country would soon be able to win the war against coronavirus.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:00:18.688Z"
}
