{
  "title": "China to provides walk through testing facility machine for corona virus: Gen Afzal",
  "link": "https://www.app.com.pk/national/china-to-provides-walk-through-testing-facility-machine-for-corona-virus-gen-afzal/",
  "date_published": "2020-03-26T03:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 26 (APP):Chairman National Disaster Management Authority (NDMA) Lieutenant. General Muhammad Afzal on Thursday said the Chinese government is sending a walk through testing facility machine to diagnose COVID-19 or Coronavirus.\nAddressing a press conference, he said it would be helpful to diagnose a large number of people for this corona virus ,especially in those area where test facility not available.\nIn a week this machine would be available here, he said it was a plan to install this device in different cities where maximum number of people could be entertained for test of coronavirus.\nHe was accompanied by Minister for Planning, Development and Special Initiatives Asad Umar, Minister for Religious Affairs and Interfaith Harmony Pir Noor ul Haq Qadri, Special Assistant to the Prime Minister on Health (SAPM) Dr Zafar Mirza and SAPM on Information and Broadcasting Dr Firdous Ashiq Awan.\nGeneral Afzal informed that there were only 700 intensive care unit (ICU) beds in the country when the National Security Council started its initiatives to contain COVID-19.\nAt present, he said there were 19,672 ICU beds across the country whereas there were 400-500 quarantine type facilities. In the federal capital and provinces overall 162,000 quarantine beds to facilitate the coronavirus affected population.\nThe Chairman NDMA mentioned that around 1,795 three-four star hotels’ rooms were being booked to set up quarantines across the country. “As many as 42,000 rooms have been acquired to set up one room for one person in case the pandemic surges as the 4th line defense in the fight against coronavirus.”\nHe noted that around 194,000 medical practitioners in the country were working at various healthcare facilities to deal with the coronavirus patients that comprised of 30,000 ICU workers who were directly exposed to an affected patient.\nNDMA, he said had designed a kit containing gown, combination shield, goggles, 2 N95 masks, 30 surgical masks and a handwash enclosed in a box. “Just like a soldier is provided with his kit during a war similarly our medical workers till April 5 next Sunday will get their kits across the country.”\nHe said when the outbreak spread in the country there were mainly 2,200 ventilators available in the country and out of which 400 were out of order. “The number of out-of-order ventilators has reduced to 61 that are in Punjab. The defence forces department has offered its assistance in resolving this issue which will be overcome soon.”\nThe number of ventilators being imported will reach to 1,000 from 10-15 April and hence increasing to 2,000-3,000 till April 25-30. However, after evaluation of the aforementioned we would be able to boost the number of ventilators to 10,000 till the month of May, said Chairman NDMA.\nWhile briefing about the aid received from different countries Lieutenant General Muhammad Afzal said 5 lac masks were received from a private Chinese company which were distributed in Sindh province as per its requirement. “Around 50,000 coronavirus testing kits will come from China tomorrow and will be disbursed as per the need of the provinces.”\nHe added that an IM-76 aircraft would leave to Wuhan province of China to bring 15-tonnes of cargo including 20 ventilators. “The authorities in Urumqi will send a special aircraft with 8-member medical team whereas 15-tonnes relief items are also expected.”\nChairman NDMA said the National Institute of Health would take the special medical team from China to visit the entire country and seek guidance over better mitigation measures for coping with coronavirus.\nHe also mentioned that around 15,000 overall combinations were sent by Singapore through a special aircraft which would reach Pakistan in the next 2-3 days.\nGeneral Afzal said, “Our main focus from the day one is on three things: protection equipment, ventilators and testing kits. Orders have been placed already to get kits for conducting one million tests for coronavirus.”\nHe said, “We have also discussed with Xinjiang government for relief items and assistance for Gilgit Baltistant. A huge amount of medical goods have been sent at the Khunjerab Border which will be brought to Gilgit through MI-17 tomorrow. This will be sufficient to cater the needs of Gilgit Baltistan for the next many weeks.”\nNDMA Chairman said that two more aircraft would go to Chengdu and Beijing to get 20 tonnes and 80 tonnes of medical goods respectively.\nHe informed that disinfectant spray was already carried out by NDMA in public buildings whereas the Authority had also taken the initiative to disinfect the most affected areas of the country as well.\n“100 pickups with each having four to six guns will disinfect the most affected areas due to coronavirus with chemicals along with four big machines imported for this purpose. We will start from Barakahu, Chak Shehzad, Mardan, Dina, Serai Alamgir and other parts of the country most affected due to COVID-19,” he said.\nLater on SAPM, Dr Firdous Ashiq Awan said Prime Minister Imran Khan has termed doctors and paramedics as first line of defence against coronavirus pandemic and issued directives that their safety and security should be ensured at all cost.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:00:14.205Z"
}
