{
  "title": "Govt stands with coronavirus victims in hour of difficulty, to continue effort till last patient cured: Shahryar Afridi",
  "link": "https://www.app.com.pk/national/govt-stands-with-coronavirus-victims-in-hour-of-difficulty-to-continue-effort-till-last-patient-cured-shahryar-afridi/",
  "date_published": "2020-03-31T23:22:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 01 (APP):Federal Minister for SAFRON Shahryar Afridi Wednesday said the Government was standing with the coronavirus victims in this hour of need and would continue efforts till the last patient had been treated in the country.\nAddressing a press conference here, he said Prime Minister Imran Khan had established “Corona Relief Fund and urged philanthropists and well-off people to generously donate in it besides, reaching out to the vulnerable segments of the society in their respective areas for assistance.\nHe said it was our collective responsibility to help the poor in coronavirus crisis.\nHe said people from all walks of life had shown confidence and trust in the decisions and policies of Prime Minister Imran Khan in the wake of coronavirus and were following Government instructions.\nAfridi said the Prime Minister and Chief Minister KP had announced huge relief packages to help poor people, daily wagers, labourers and other vulnerable segments, who lost jobs due to lockdown, imposed to prevent spread of coronavirus which had been declared pandemic worldwide.\nHe said the people of developed and underdeveloped countries all had become its victims.\nThe minister said Prime Minister Imran Khan had directed the ministers, MNAs and MPAs to reach out to their constituencies and monitor the relief efforts and address people problems there.\nHe said Foreign Minister Shah Mahmood Qureshi and his team were keeping eyes on the expatriate Pakistanis and would ensure their repatriation.\nThe minister said relief to poor people should be provided in such a way that their self esteem and dignity could not be hurt.\nAfridi said in normal days wealthy people used to spend thousands of rupees on food in hotels and restaurants and during the lockdown the money which they have saved not going to these places should be\nspent on poor people, it would be indeed a great service to humanity.\nHe said it was not a time of politicking and point scoring instead serve poor people with more dedication and spent generously on them.\nHe appreciated Shahid Afridi Foundation for providing food and ration to around 4000 poor families in Kohat and adjoining areas.\nThe Minister said Pakistani were known worldwide for donations in times of difficulty and expressed the hope that they would demonstrate the same spirit of giving donations as demonstrated by them during 2010 floods and 2005 earthquake.\nHe directed Chief Secretary KP to quickly finalize mechanism for disbursement of Rs 5000 per month to each poor household under CM KP relief package.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:02:04.596Z"
}
