{
  "title": "AJK President urges UN to pay heed to AI-India reports on Kashmiri detainees",
  "link": "https://www.app.com.pk/national/ajk-president-urges-un-to-pay-heed-to-ai-india-reports-on-kashmiri-detainees/",
  "date_published": "2020-03-31T23:00:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Apr 01 (APP):President of Azad Jammu and Kashmir (AJK), Sardar Masood Khan Wednesday appreciated the demand of Amnesty International-India (AI-India) for the immediate release of all Kashmiri prisoners from the Indian jails and restoration of 4G internet services in Indian Occupied Jammu and Kashmir (IOJK) in view of COVID-19 pandemic.\n“United Nations Security Council, UN Secretary General, the United Nations Human Rights Council and the International Committee of the Red Cross (ICRC) must intervene to secure release of all Kashmiri prisoners languishing in the Indian prisons”, the president said in a statement issued by his office.\nDescribing AI-India demand of as timely and urgent, President Khan pointed out that since the outbreak of COVID-19, the families of these prisoners were highly worried about the health of their near and dear due to unhygienic conditions in IOJK and Indian jails.\n“The COVID-19 can speedily spread in the prisons where the Kashmiri inmates have been locked up,” he warned and urged the international community particularly the United Nations to take notice of this situation without any further delay.\nThe AJK president while terming Indian Prime Minister Narendra Modi a stone-hearted ruler said that under the garb of COVID-19, he had imposed further restrictions in IOJK, and had stepped up the ethnic cleansing of the Kashmiri people. He reiterated the demand for restoration of basic civil liberties, freedom of expression and the healthcare facilities in occupied valley.\nThe AJK president expressed grave concern that the spread of COVID-19 pandemic in occupied Kashmir comparatively more than India and Pakistan because of the curbs imposed by the Indian government.\nThese restrictions, he went on to say, had almost blocked the access of the Kashmiri people to the health facilities.\nThe president condemned the Indian government and media for quoting dubious figures about COVID-19, and pointed out that confirmation of these figures through independent sources was not possible because of curbs on media.\nIt may be recalled that AI- India chapter after interviewing 255 people including dozens of prisoners in the jails of India and occupied territory, journalists, lawyers and businessmen, has reported that there had been no coordination of different government departments with the health department in the occupied Kashmir, and blockade of internet and other communication means amidst the outbreak of pandemic added fear to the Kashmiri people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:02:05.246Z"
}
