{
  "title": "PM launches SMS service to provide emergency cash to needy in ongoing Coronavirus situation",
  "link": "https://www.app.com.pk/national/pm-launches-sms-service-to-provide-emergency-cash-to-needy-in-ongoing-coronavirus-situation/",
  "date_published": "2020-04-01T07:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 1 (APP):Prime Minister Imran Khan on Wednesday launched a national level SMS service under the “Ehsaas Emergency Cash Program” to cater to the financial needs of the poor, needy and deserving people in the wake of ongoing Coronavirus situation.\nUnder the emergency cash program, the needy people could get a lump sum of Rs. 12,000 as financial assistance for four months by sending their Computerized National Identity Card (CNIC) number through SMS service on 8171.\nThe people sending their CNIC numbers would get a reply of their eligibility or otherwise for availing the facility after the analysation of their data by the Ehsaas Emergency Cash Program.\nThe prime minister while launching the service sent his CNIC number through SMS service on 8171 and got a reply that being a government servant he was not eligible for the Ehsaas Emergency Cash Program.\nSpecial Assistant to the PM on Social Protection Dr. Sania Nishter briefed the prime minister in detail about the Emergency Cash Program.\nAccording to details, Ehsaas Emergency Cash program has been planned in the context of the economic hardships being experienced by the vulnerable due to the ongoing Coronavirus crisis.\nThe currently stalled economic activity affects daily wage earners and piece-rate workers, the most. In addition, layoffs in the formal economy were also pushing people below the poverty line.\nWithin this context, the Ehsaas Emergency Cash initiative has been designed for simple and easy rollout, using the existing at-scale digital payment capacity of the Government of Pakistan, which has been developed within the Poverty Alleviation Division.\nAn SMS campaign will be the entry point to identify the beneficiaries. Through an aggressive communication campaign, citizens will be informed that they can send an SMS on 8171 to check their eligibility status.\nIn the event of their being eligible, they will receive an SMS message informing them of how to collect money. If they are not identified in the database, they will be directed to contact their respective district administration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:01:52.231Z"
}
