{
  "title": "Malik Amin Aslam lauds Attock Govt arrangements to tackle Coronavirus",
  "link": "https://www.app.com.pk/national/malik-amin-aslam-lauds-attock-govt-arrangements-to-tackle-coronavirus/",
  "date_published": "2020-03-31T22:27:00.000Z",
  "source": "APP",
  "content": "ATTOCK, Apr 01 (APP):Advisor to Prime Minister on Climate Change Malik Amin Aslam lauded the arrangements made by the Attock district government to tackle Corona Virus pandemic.\nWhile chairing a meeting to review the arrangements made to handle Corona Virus emergency,he said despite of having financial constraints district government has done a tremendous job for which DC Attock Ali Anan Qamar and his team deserves appreciation.\nOn the occaasion,PTI leaders Malik Khurram Ali Khan , Akbar Khan Tanoli , Malik Ejaz of Saidan , CEO Health Dr Sohail Ejaz , Dr Asif Niazi , Deputy Director Public Relations Shahzad Niaz Khokhar and other officers were also present. Malik Amin Aslam said that the present government under the leadership of Prime Minister Imran Khan has mobilized maximum resources to help the people specially those living below poverty line.He said the government has allocated Rs 10 billion under Insaf Imdad Program and through this progam 2.5 million families would be benefited while under Insaf Ehsas Program 10.2 million families would be given financial assistance.\nAmin said,It is high time for every one to play his role and specially emphasized that philanthropists to come forward and help the poor segments of this society. He urged upon the people to remain restricted to their houses,maintain social distance and to follow in true letter and spirit the instructions given by the govt to ensure lock down for controlling Corona Virus .\nEarlier Deputy Commissioner Ali Anan Qamar in his briefing apprised the adviser about the arrangements made in context with Corona Virus emergency.\nThe DC said”Edibles are available across the district and groceries and other shops will remain open from 0900 am to 0500 pm while medical stores are exempted from the schedule.”\nHe said “there is complete lock down across the Attock district and mostly people are cooperating.”\nAli Anan Qamar said that total 21 Corona Virus suspect patients were admitted and out of these 20 patients have been declared negative.\nLater,Adviser to Prime Minister on Climate Change Malik Amin Aslam visited different quarantine centers and other medical\nfacilities and expressed his satisfaction.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:02:04.093Z"
}
