{
  "title": "Number of COVID-19 cases jump to 2,039: Dr Mirza",
  "link": "https://www.app.com.pk/national/number-of-covid-19-cases-jump-to-2039-dr-mirza/",
  "date_published": "2020-04-01T11:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 01 (APP):Special Assistant to Prime Minister on National Health Services Dr Zafar Mirza Wednesday said that number of COVID-19 cases jumped to 2,039 with 178 more cases reported over past 24 hours.\nIn a televised daily briefing on COVID-19, he said 654 cases were reported from Sindh, 708 from Punjab, 158 from Balochistan, 54 from Islamabad Capital Territory, 184 in Gilgit Baltistan and six in Azad Jammu and Kashmir.\nHe said 24 more patients had recovered during last 24 hours, bringing total number to 82.\nHe added as many 974 confirmed patients were admitted in various hospitals out of which 10 were in critical condition and on ventilator while remaining were in various stages of recovery.\nHe said that there were total 17,331 suspected patients with addition of 1,436 patients during last 24 hours.\nHe said that 8,893 people were living in different quarantine out of which test of 5,198 people were conducted with ratio of 19% positive cases and 81% negative cases.\nHe said that despite clear directions, some organization had continued the practice of using bi-metric from its employees and asked to stop this practice to control further spread of this virus to others.\nHe said that in adoption of strict prevention measures and social distancing policy, while reviewing world’s guidelines and keeping in view the local aspects, the ministry of National Health Services had decided to issue two guidelines separately for shops and factories.\nHe added the objective behind issuing guidelines was to protect the customers and workers at factories and shops from coronavirus as the government had allowed running of all those shops and factories which were manufacturing or selling necessary items.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:01:52.663Z"
}
