{
  "title": "Govt extends lockdown period for two weeks up to April 14",
  "link": "https://www.app.com.pk/national/govt-extends-lockdown-period-for-two-weeks-up-to-april-14/",
  "date_published": "2020-04-01T03:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 01 (APP):The government decided on Wednesday that the period for restrictions, already imposed to prevent spread of Coronavirus in the country, has been extended for two weeks up to April 14.\n“All units of the country including federal government, and governments of all four provinces, Gigit Baltistan and Azad Kashmir have jointly decided that the current level of lockdown should continue for another two weeks,” Minister for Planning, Development and Special Initiatives Asad Umar said.\nHe was addressing a press briefing along with Special Assistant to Prime Minister on Health Dr Zafar Mirza and Special Assistant to Prime Minister on National Security Division Moeed Yusuf here to inform about the decision of National Coordination Committee (NCC) meeting on Coronavirus held here.\nHowever, he said that in the meantime, the NCC would keep on monitoring the situation closely and the decision could be revised by either reducing restrictions and period or increasing the restrictions that all would depend on the pace of spread of the virus.\nExpressing satisfaction over slow pace of spread of the virus, the minister said that the government’s strategy of imposing restriction had yielded positive results.\n“Therefore, we do not need any further restrictions to be imposed at current stage,” he added.\nAsad Umar informed that the services and industries which need essential items such as eatables, energy, and medicines would have to be kept open to ensure proper production and supply of the essential items.\nHe said except some complaints from some areas of the country, all the provinces were fully implementing the decisions of NCC.\nWith respect to transportation of Pakistanis abroad, the minister said on April 4, the government had decided to run first flight of Pakistan International Airline that would carry Pakistani passengers who wanted to return back to their country.\n“Passengers will be tested and they will be kept in quarantine facility till the results are received,” he said, referring to the government’s aim to resume flight operations.\nIf they test negative, then we will ask them to self-quarantine and take necessary precautionary measures, the minister said.\n“On April 5, we will review this measure of bringing people from abroad, if it is successful then the flights will be started in different airports of the country.\nHowever he informed that the domestic flights would remain suspended until further order.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:01:55.697Z"
}
