{
  "title": "Hafeez Shaikh directs FBR to speed up refund process",
  "link": "https://www.app.com.pk/national/hafeez-shaikh-directs-fbr-to-speed-up-refund-process/",
  "date_published": "2020-04-01T02:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 01 (APP):Adviser to the Prime Minister on Finance and Revenue Dr. Abdul Hafeez Shaikh Wednesday directed the Federal Board of Revenue (FBR) Chairperson to expedite the process of refunds so that the business community was provided with maximum relief.\nChairing a meeting here at the Finance Division through video link with the business community, the adviser assured the business community of his full support during this difficult period.\nAdviser to PM on Commerce was also present during the meeting, according to press statement issued by the Finance Minister.\nHe expressed the hope that the future was more promising for Pakistan’s export sector after the crisis.\nThe advisor also directed that the mechanism for distribution of monetary assistance should ensure transparency and simplicity of procedures so that the poor daily wagers get relief without any complication.\nSpeaking on the occasion, the Chairperson FBR briefed the meeting that she was personally engaged with her team and business representatives to speed up the matters related to refunds.\nThe business representatives requested for the speedier refunds for providing them enough liquidity to manage their activities.\nThe business community shared with the Adviser Finance the current situation of their businesses and the issues they had been facing because of a global slump in business activities.\nThe participants were briefed that the daily wagers and SME sector was the worst hit during the crisis.\nThe participants deliberated upon a feasible plan to distribute the amount earmarked in the Prime Minister’s relief package for the daily wagers and laborers (Rs 200 billion) to support them in the scenario of lesser business activities in the country.\nThe participants from the business community committed to take care of their daily wagers with the help of the government and promised to fulfill their social responsibilities in the hour of need.\nAmong others, the meeting was also participated by Dr. Waqar Massod Khan, Ali Jameel, Mian M. Mansha, Shahid Hussain, Shahzad Saleem, Bashir Ali Muhammad, Ali Habib, Aurangzeb, Tariq Saigol, Almas Hyder, Shahid Soorty, Fawad Anwer, Saqib Sherazi, Tariq Habib and senior officials of Ministries of Finance, Commerce and FBR.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:01:55.682Z"
}
