{
  "title": "All necessary measures being taken to ensure public safety: COAS",
  "link": "https://www.app.com.pk/national/all-necessary-measures-being-taken-to-ensure-public-safety-coas/",
  "date_published": "2020-04-01T03:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 1 (APP):Chief of Army Staff (COAS) General Qamar Javed Bajwa Wednesday said the planned measures to contain the pandemic of Coronavirus or COVID-19, if implemented timely, would contribute to safety and well being of every Pakistani and society at large.\nAddressing the special briefing at National Command and Operation Centre (NCOC) here, the COAS said all necessary measures to ensure public safety were being taken, an Inter Services Public Relations (ISPR) press release said.\nHe said, “We cannot afford to leave any segment of society at the mercy of this pandemic. Troops on ground must reach out to citizens in every nook and corner of Pakistan not only to protect them against this pandemic but also for bringing comfort in this hour of distress.”\nThe COAS mentioned that only through a coherent national effort we could address all vulnerabilities before they turn into threats. “We must Rise – and rise together irrespective of caste, colour, creed and religion fighting as One Nation. The task at hand is daunting, but we have overcome difficult situations before. This time the challenge is entirely different. Armed Forces will stand shoulder to shoulder with nation to guard the border between people and COVID-19.”\nPakistan Army being part of national effort would not leave any stone unturned for security and safety of people of Pakistan, the COAS concluded.\nForeign Minister Shah Mehmood Qureshi, Minister for Planning, Development, Reforms and Special Initiatives and Focal Person for National effort for COVID-19 Asad Umer, Minister for Interior Brig (R) Ijaz Ahmed Shah, Minister for Economic Affairs Muhammad Hammad Azhar, Minister for Communications and Postal Services Murad Saeed, Minister for Aviation Division Ghulam Sarwar Khan, Minister for National Food Security and Research Khusro Bakhtiar, Minister for Maritime Affairs Ali Zaidi, Special Assistant to the Prime Minister (SAPM) on Finance and Revenue Dr Abdul Hafeez Shaikh, SAPM for Information and Broadcasting Dr Firdous Ashiq Awan, SAPM on Health Dr Zafar Mirza, SAPM on National Security Moeed Yousaf and SAPM on Poverty Alleviation and Social Safety Dr Sania Nishtar and senior military officials attended the briefing.\nThe forum was briefed about the latest situation on containment efforts and enforcement measures against COVID-19 and troops deployment across the country assisting the federal and provincial administrations in aid of civil power.\nThe forum expressed complete satisfaction over the measures taken so far and also dilated upon future course of action.\nThe NCOC was serving as a nucleus for one window operation to synergize and articulate national effort against COVID-19, optimise informed decision making and ensure implementation of decisions of National Security Committee (NSC) and National Coordination Committee( NCC).\nMeanwhile, Commander Army Air Defence Command, Lieutenant General Hamood Uz Zaman Khan was designated as chief coordinator NCOC.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:01:55.559Z"
}
