{
  "title": "Iranian parliamentary delegation, interior minister discuss mutual interest matters",
  "link": "https://www.app.com.pk/national/iranian-parliamentary-delegation-interior-minister-discuss-mutual-interest-matters/",
  "date_published": "2021-10-12T16:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP):Iranian parliamentary delegation headed by Dr Ahmad Amirabadi Firhani Tuesday called on Minister for Interior Sheikh Rashid Ahmed and discussed matters related to mutual interest and cooperation.\nThe delegation members included members of Iranian parliament and major businessmen including Ismail Hussain Zeehi, Dr Malik Fazli, Dr Muzafar, Dr Mohsin Pirhadi , Dr Ali Muzaffar and Mohtarma Ilham Azad.\nDuring the meeting prevailing regional situation was also discussed besides discussion on controlling terrorism and illegal human movements at borders.Both sides agreed to continue joint efforts between two countries for long-lasting peace and stable government in Afghanistan.\nBoth sides stressed the need to enhance coordination between members’ parliaments and relevant ministries of two countries.\nPakistan and Iran unanimously agreed to establish a special committee on effective implementation of agreements on exchange of prisoners.\nSheik Rashid thanked the delegation for stance of Iranian government and its people on Kashmir and Palestine.\nHe said both countries were engaged in historical, traditional and religious bonds.He urged to make joint efforts by both countries for long-lasting peace in Afghanistan. He added durable peace in Afghanistan was a prerequisite for stability in the region and the international world.\nHe assured that travelling and immigration facilities would be further improved for those Zaereen travelling to Iran.\nHead of Iranian delegation Dr Ahmad Amirabadi Firhani said mutual relationship would further enhance with the exchange of parliamentary delegations between two countries.\nHe stressed the need to enhance the level of trade activities between the two countries from existing level.\nHe said unity in Muslim Ummah was the only way to face conspiracies of enemies of Islam.\nHe expressed deep grief and sorrow over the loss of precious lives in recent earthquake in Harnai, Balochistan.\nHe also condoled the death of renowned scientist Dr Abdul Qadeer Khan and appreciated his rememberable services.\nSheikh Rashid extended invitation to his Iranian counterpart through the head of the delegation to visit Pakistan.\nHe expressed the hope that this visit will help expanding relations between the two countries.",
  "retrievedAt": "2025-08-11T21:26:47.510Z"
}
