{
  "title": "Pakistan Post jumps five places in world ranking",
  "link": "https://www.app.com.pk/national/pakistan-post-jumps-five-places-in-world-ranking/",
  "date_published": "2021-10-12T13:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP):Pakistan Post has exceeded up to five places in the world rankings from 67 to 62, according to a report issued on Tuesday by Universal Postal Union, the global organization of postal services.\nThe global organization of postal services “the Universal Postal Union (UPU)” has released its 2021 rankings of 168 countries bearing postal services.\nPakistan Post has improved international ranking by 32 places during last three years from 94 positions to 62, said a media press release. However, in 2018, Pakistan Post was at 92 positions.\nThe UPU Report examined the state of postal development around the world in 2021, building on the Integrated Index for Postal Development (2IPD) which currently ranks 168 countries across four dimensions: reliability, reach, relevance and resilience.\nThe report exploits the information embedded in the 2IPD’s reliability pillar, which measures the delivery times of mail items, to quantify the operational disruptions caused by the COVID-19 pandemic.\nThe main finding was that the logistical bottlenecks experienced in 2020 have severely affected the reliability of postal operations, with average domestic delivery times increasing by 13% in 2020 with respect to 2019, before returning to pre-crisis levels in 2021.\nThe results of the report also suggested that, even if disruptions in global supply chains were eventually absorbed, gaps in postal development were likely to remain a considerable challenge for the sector in the coming years.\nIt may be mentioned here that during this period, Pakistan Post has also increased its revenue by Rs 5 billion and successfully reduced its annual deficit in a record development.\nWith the completion of Pakistan Post’s digital franchises and digitization, not only the standard of service to the public rather its global ranking would be further improved.\nPakistan Post is eyeing the top 5 in the world till next year and this task will be accomplished with hard work, said Director General Pakistan Post.",
  "retrievedAt": "2025-08-11T21:26:50.749Z"
}
