{
  "title": "Reports of widespread corruption in Afghan regimes under US occupation",
  "link": "https://www.app.com.pk/national/reports-of-widespread-corruption-in-afghan-regimes-under-us-occupation/",
  "date_published": "2021-10-12T13:38:00.000Z",
  "source": "APP",
  "content": "In 2008, US Congress set up the Special Inspector General for Afghan Reconstruction (SIGAR) after they found $145 billion were used without oversight.\nPentagon stated the total cost of war in Afghanistan since 2001 was $825 billion while President Biden suggested it to be over $2 trillion. However, independent sources estimated the expenditures to be much higher. Watson Institute of Brown University suggested US wars have cost over $8 trillion to the US taxpayers in direct and indirect costs of War on Terror.\nIn 2007, Afghan Defence Minister Abdul Rahim Wardak ordered 1.3 million sets of new uniforms with rare camouflage pattern, from Canadian company Hyper Stealth.\nThis change from previous pattern in $28 million in 2007 and $72 million for next decade till 2017. Interesting thing is that these uniforms were never tested or evaluated in the field, and there was just 2.1% forest cover across Afghanistan.\nDaud Wardak, son of former Afghan Defence Minister Abdul Rahim Wardak had just been reported buying $20.9 Million Beverly Hills Mansion in the US. He already owns $5.2 million Miami Beach residence.\nAn extensive ring road around Afghanistan was funded by multiple grants and donors, totaling billions during the course of the war.Towards the end of the project, a 233-kilometer section in the North, between the towns of Qeysar and Laman, led to $249 million being handed out to contractors, but only 15% of the road being built, a SIGAR audit reported. Between March 2014 and September 2017, there was no construction on this section, and what had been built deteriorated, the report concluded. USAID declined to comment.\nAn expensive hotel and apartment complex was commissioned next to the US Embassy in Kabul, for which the US government provided $85 million in loans. In 2016, SIGAR concluded “the $85 million in loans is gone, the buildings were never completed and are uninhabitable, and the U.S. Embassy is now forced to provide security for the site at additional cost to U.S. taxpayers.”\nThe audit concluded the contractor made unrealistic promises to secure the loans, and that the branch of the US government who oversaw the project never visited the site, and neither did the company they later hired to oversee the project. A State department spokesperson said they did not manage the construction and it was “a private endeavor.”\nThe Pentagon created the Task Force for Business and Stability Operations (TEBSO) expanded from Iraq to include Afghanistan in 2009, for whose operations in Afghanistan Congress set aside $823 million.\nOver half the money actually spent by TTFBSO – $359 million of $675 million – was spent on indirect and support costs, not directly on projects in Afghanistan, SIGAR concluded in an audit.\nThey reviewed 89 of the contracts TFBSO made, and found “7 contracts worth $35.1 million were awarded to films employing former TFBSO staff as senior executives.\nThe facts highlighted in the report should serve as eye opener for the entire world and especially for the US led Western alliance which occupied Afghanistan to bring in a democratic, corruption free and lawful society and instead ended up joining hands with the corrupt mafia.\nInternational community needed to understand that all problems including terrorism could only be addressed by addressing local concerns and better approach was peaceful engagement.\nThere were above the state elements even in the visibly most advanced countries of the world that plunder the resources of states and make fool of the masses as well as the elected representatives. Sorry tales of corruption emerging from Afghanistan should serve to reveal fault lines in the US led coalition’s policies.\nHeavy reliance on corrupt previous regime that encouraged the US for pushing military led option based on the interests of corrupt had been a major factor in the US failure in Afghanistan.\nIt was time for the US and other powers of the world to get engaged with Afghans. Taliban had showed positive gestures for inclusiveness and positive engagement with the world. Option of isolating Afghans had neither served better in the past will nor do so in the future.\nPakistan had long insisted to find a peaceful solution to Afghanistan conflict; however, the US had been following hard approach as was advocated by India. It was generally believed that those benefiting from Afghan Conflict were intentionally denying peaceful and negotiation option for their vested interests.",
  "retrievedAt": "2025-08-11T21:26:49.452Z"
}
