{
  "article_id": "2025-03-07_763fed464561bb8274812a92f5b065ab",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-reviews-psdp-schemes-for-the-fy-25-26-directs-local-residents-should-be-exempt-from-toll-taxes/",
    "retrieved_at": "2025-08-27T13:26:14.097Z"
  },
  "metadata": {
    "title": "NA body reviews PSDP schemes for the FY-25-26, directs local residents should be exempt from toll taxes",
    "author": null,
    "date_published": "2025-03-06T19:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 593,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 06 (APP): The Standing Committee on Communications held its eighth meeting here on Thursday under the Chairmanship of Aijaz Hussain Jakhrani, MNA. In line with Sub-Rules (6) and (7) of Rule 201 of the Rules of Procedure and Conduct of Business in the National Assembly, 2007, the Committee reviewed the PSDP schemes for the upcoming financial year 2025-26. The Ministry of Communications informed that the preparation process is currently underway, following the PSDP formulation guidelines issued by the Ministry of Planning, Development, and Special Initiatives on January 29, 2025. The Committee expressed dissatisfaction, emphasizing that despite repeated recommendations in the last three meetings, the Ministry of Communications had not expedited the process or coordinated with relevant Ministries for timely submission. As a result, the Committee was unable to review and provide recommendations before the March 1st deadline. Unlike other Ministries, which submitted their schemes on time, the Ministry of Communications failed to do so, despite the Budget Call Circular being issued to all Ministries on January 29, 2025. The Ministry informed that the PSDP will be submitted on March 17, 2025, during the next Standing Committee meeting after thorough consultations with the Ministry of Planning, Development, and Special Initiatives. It was stated that the number of ongoing schemes will be reduced from 105 to 80 based on priority, making space for new national-level projects, including M-6. The Ministry further assured that the M-6 Sukkur-Hyderabad project will be prioritized under the PSDP, CPEC, and financial assistance from Azerbaijan to ensure its completion in a single phase. The NA body directed the Ministry to present its final decision on March 17, 2025, and the Chairman instructed that the Secretary of the Ministry of Planning, Development, and Special Initiatives be invited to attend in person. The Ministry shared the PSDP schemes related to Pakistan Post and the National Transport Research Center before the Committee. The ongoing schemes were also reviewed along with their details. The Committee instructed the Ministry to present clear priorities for these schemes in the next meeting. The Ministry emphasized the importance of completing ongoing projects before initiating new ones. The Committee was briefed that the salaries of the Highway and Motorway Police were not equivalent to those of the district police. It recommended their adjustment to ensure parity in the next finance bill. The Committee directed that local residents should be exempt from toll taxes. Regarding the Calling Attention Notice on the increased toll taxes on M-9 and N-5, as well as the excessive number of toll plazas/stations not adhering to the required 35 km gap, the Committee recommended that the concerned official from the NHA, along with the Hon. Member who moved the Calling Attention Notice, may visit the area and submit a report to the Committee for further recommendations. The Ministry presented a one-page summary of all ongoing schemes, as directed by the Committee, including all relevant details. The meeting was attended by the Honorable Members of the Standing Committee, including Sardar Muhammad Yaqoob Khan Nasar, Haji Jamal Shah Kakar, Ms. Akhtar Bibi, Dr. Darshan, Mir Shabbir Ali Bijarani, Mr. Nazir Ahmed Bhugio, Mr. Ali Khan Jadoon, Mr. Mehboob Shah, Mr. Abdul Latif, Mr. Ramesh Lal, and Mr. Hameed Hussain, all MNAs. Additionally, Syed Waseem Hussain, MNA and Mover of the Calling Attention Notice, participated in the meeting. Eng. Gul Asghar Khan, Parliamentary Secretary for Communications, was also present. Senior officials from the Ministry of Communications, the Ministry of Planning and Development and Special Initiatives, along with representatives from its affiliated departments, were also present at the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}