{
  "title": "PIA gets TCO certificate, set to resume UK operations next month - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan International Airlines (PIA) announced on Wednesday that it has received Third Country Operator (TCO) approval for flight operations in the United Kingdom and is expected to return to British skies next month, according to a statement.\n\nIn July, the UK removed Pakistan from its Air Safety List, allowing Pakistani airlines to now apply to operate flights in Britain. The development came after the UK Department for Transport concluded an aviation security ins­pection at Islamabad Inter­nat­ional Airport on Thursday, declaring Pakistan’s security arrangements “satisfactory and in line with international standards”.\n\nHaving received the TCO certification, the national carrier announced that it would now be allowed to operate direct flights and carry not only passengers but also cargo.\n\n“In the first phase, flight operations to Manchester will be resumed, after which Birmingham and London will be included in the B network,” the statement read, adding that the carrier was informed about the approval a day prior.\n\n“The same day, the British Department of Transport also issued PIA Security and Cargo ACC3 certificates for five years,” PIA added.\n\n“These certificates, issued by international aviation organisations, are a manifestation of complete confidence in PIA’s air operations and safety.” it said.\n\nIn a post on X, the national carrier expressed gratitude to the prime minister, foreign minister, defence ministry and Pakistan Civil Aviation Authority for their assistance in getting operations resumed.\n\nThe carrier was banned from flying to the European Union, the UK and the United States in June 2020, a month after one of its Airbus A-320s plunged into Karachi’s Model Colony, killing nearly 100 people.\n\nThe ban followed the grounding of 262 pilots whose licences then-aviation minister Ghulam Sarwar Khan termed “dubious”.\n\nThe ban on operating in Europe was lifted in November 2024.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2412355916e5b12.webp",
  "retrievedAt": "2025-10-12T04:20:17.600Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944316/pia-gets-tco-certificate-set-to-resume-uk-operations-next-month",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T07:43:20.000Z"
}
