{
  "title": "WEF warns of weak global growth, structural disruptions - Business - DAWN.COM",
  "author": null,
  "content": "• Chief Economists’ Outlook highlights persistent shocks, growing fragmentation shaping a ‘new economic environment’\n• Emerging markets in Mideast, south and east Asia, and Pacific region seen as engines of growth\n• China faces mixed prospects\n\nISLAMABAD: The World Eco­n­omic Forum (WEF) says the global economy is entering a period of weak growth and systematic disruption, with findings of the Chief Economists’ Outlook pointing to the emergence of a new economic environment shaped by persistent disruption and growing fragmentation.\n\nThe outlook report, published on Tuesday, highlights sharp reg­i­onal fault lines, noting that eme­r­g­­ing markets are expected to be the main engines of growth. The Middle East and North Africa (Me­na), South Asia and East Asia and Pacific are seen as bright spo­ts, with one in three chief economists expecting strong or very strong growth in these regions.\n\nGrowth expectations for South Asia have softened slightly. Thirty-one per cent of chief economists expect strong or very strong growth in the year ahead, down from 33pc in April, while the share expecting moderate growth has risen from 55pc to 66pc. Across South Asia, 64pc of surveyed chief economists expect moderate inflation over the next year, 74pc anticipate no cha­­n­­ge in monetary policy and 80pc ex­­pect fiscal policy to remain steady.\n\nThe outlook for China is more mixed, with 56pc of chief economists anticipating moderate gro­w­­­­th, though deflationary pressu­res are expected to persist. Gro­w­­th is expected to remain more sta­­­gnant in advanced economies. In Europe, 40pc expect weak growth with fiscal loosening (74pc) and low or moderate inflation (88pc). In the United States, most chief economists (52pc) anti­cipate weak or very weak growth and high inflation (59pc) as monetary policy is loosened (85pc).\n\nChief economists overwhelmingly agree that today’s disruptions are structural rather than cyclical. Large majorities anticipate long-term disruption in natural resou­r­ces and energy (78pc), technology and innovation (75pc), trade and global value chains (63pc) and glo­bal economic institutions (63pc).\\\n\nThis marks an important shift, as the global economy is not me­­rely weathering isolated shocks but realigning, raising the stakes for new forms of leadership, cooperation and resilience.\n\n“The contours of a new economic environment are alr­eady taking shape, defined by disruption across tra­de, technology, resources and ins­titutions,” said Saadia Zahidi, Ma­­naging Director, World Economic Forum. “Leaders must adapt with urgency and collaboration to turn today’s turbulence into tomorrow’s resilience.”\n\nStructural shifts in the global economy are playing out most visibly in trade, fiscal policy and debt. Some 70pc of surveyed chief economists rate the current level of trade disruption as “very high”, far above other domains of the economy, and over three-quarters also expect disruption to trade and global value chains to cascade into other domains.\n\nIn financial markets and monetary policy, 45pc of surveyed economists rate disruption as high or very high, yet only 21pc expect it to last.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:11:39.981Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944267/wef-warns-of-weak-global-growth-structural-disruptions",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T00:23:31.000Z"
}
