{
  "title": "India plans ‘Cold Start’ exercises next month - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: India’s Army, Navy and the Air Force will conduct a joint exercise named ‘Cold Start’ in the first week of October to test drones and counter-drone systems that officials dubbed as the biggest such drill to be conducted since Operation Sindoor, The Hindu said on Tuesday.\n\nIt said the exercise was likely to be held in Madhya Pradesh.\n\nThe drill aimed at assessing the effectiveness and shortcomings of the current air defence capabilities. Confirming the development, a senior official was quoted as saying the exercise would focus on evaluating operational readiness against evolving aerial threats.\n\nThe Cold Start doctrine was developed by the Indian armed forces involving rapid, integrated offensive operations by combined arms units. It would thus bypass traditional slow troop mobilisation to achieve conventional objectives within a limited timeframe.\n\nDrill aimed at assessing shortcomings of current air defence capabilities\n\nThe doctrine was developed after Operation Parakram exposed India’s slow response to the 2001 Parliament attack, the doctrine aims to provide a swift, decisive, and limited military response to terrorism without triggering a full-scale war. Analysts, however, say it carries a significant risk of escalating conflict to the nuclear level given Pakistan’s possession of tactical nuclear weapons.\n\nIndustry partners, research and development agencies, academia, and other stakeholders, too, will participate in the ‘Cold Start’ exercise.\n\nSpeaking at a conference on “Counter UAVs & Air Defence Systems — The Future of Modern Warfare” in Delhi, India’s Chief of Integrated Defence Staff Air Marshal Ashutosh Dixit making a pointed reference to Pakistan said, “They too are working to ‘become like India’, so we must always stay a step ahead.\n\n“Our counter-drone and GPS jamming systems performed effectively during Operation Sindoor, ensuring no damage from adversary drones. But the adversary has also learned our capabilities. Next time, we have to be ahead and much better,” The Hindu quoted him as saying.\n\nHe said the vision for the future involves an integrated defence system, inspired by the Sudarshan Chakra concept, to counter drones, UAVs, hypersonic weapons, and other threats. There is a need for systems usable in both peace and wartime, taking into consideration anti-social elements acquiring drone technology, necessitating widespread counter-drone capabilities.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:11:14.191Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944192/india-plans-cold-start-exercises-next-month",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T01:18:00.000Z"
}
