{
  "title": "Minimum prices for major crops urged - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Ass­e­mbly Standing Committee on Nat­ional Food Security and Research on Tuesday urged the government to immediately announce minimum support prices for major crops, warning that farmers may shift to more profitable alternatives in the absence of clear pricing policies.\n\nAt the meeting chaired by Syed Tariq Hussain, the committee stressed that timely intervention prices were essential for market stability and food security. Minister for National Food Security Rana Tanveer Hussain supported the recommendation and informed the committee that approval for the wheat support price had been obtained, with an official announcement expected shortly. He added that further approvals requiring engagement with the International Monetary Fund (IMF) would be pursued as needed.\n\nThe committee also asked the ministry to provide a detailed report on crop damage from recent floods. On rising sugar prices and domestic shortages, it directed the ministry to submit data on the rates at which sugar was exported and later re-imported.\n\nMembers were briefed on the proposed National Agriculture Biotech­nology Policy (NABP) 2025, which aims to tackle challenges related to food demand, climate stress, and low yields. The policy focuses on conventional biotechnology, genetically modified crops, new plant breeding tools, and the regulation of GM commodity imports and exports.\n\nFarmers may quit staple crops sans govt support\n\nConcern was expressed over Pakistan’s lag in crop productivity compared to its regional peers, which have adopted biotechnology. The ministry attributed this gap to continued hesitation regarding GMOs, citing concerns related to public health, the environment, and ethics. Many countries, it noted, share similar reservations about altering natural processes.\n\nThe committee advised the ministry to proceed cautiously, calling for comprehensive safety protocols and regulatory oversight. It recommended that clearance from the Bio-Safety Committee be mandatory for all biotech-related initiatives and asked the ministry to submit the second-phase feasibility report of NABP 2025 in the next meeting.\n\nThe session also covered issues in the tobacco sector. A point of order by MNA Asad Qaiser on the challenges faced by tobacco growers was deferred due to his absence. However, the committee reiterated that tobacco remains a significant cash crop and must be accorded appropriate policy attention. It urged the ministry to safeguard the interests of both farmers and companies and called for more effective use of Pakistan Tobacco Board (PTB) funds, particularly in seed development and research.\n\nTobacco companies were asked to submit written reports outlining key issues and proposed solutions. Regarding previously proposed solar-powered processing technologies, industry representatives stated that these were not fully viable due to specific curing requirements, but noted potential in hybrid models that combine solar and electric power.\n\nThe PTB was directed to present data on price differentials between flavoured tobacco and fillers in domestic and international markets. The ministry was also tasked with coordinating with other departments to counter tobacco smuggling.\n\nThe committee recommended allo­­­­­cating a portion of PTB’s resou­rces toward Corporate Social Res­p­onsibility projects to support development in tobacco-growing areas. The FBR shared data on FED and CESS collections from the tobacco sector over the past five years.\n\nFinally, the committee expressed concern about the weak enforcement of seed regulations by provinces. While enforcement authority has been devolved, only Punjab has taken meaningful action. The absence of provincial secretaries at the meeting was criticised, and the committee called for better coordination between federal and provincial governments to improve compliance.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:11:28.851Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944273/minimum-prices-for-major-crops-urged",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T00:23:38.000Z"
}
