{
  "title": "Iran will not abandon uranium enrichment, says Khamenei - World - DAWN.COM",
  "author": null,
  "content": "TEHRAN: Iran’s supreme leader Ayatollah Ali Khamenei on Tuesday said the Islamic republic would not give in to pressure to abandon its enrichment of uranium.\n\nKhamenei, in a televised add­ress, also called any talks with the United States a “dead end” that were of no benefit to his country.\n\nHis statement came as European powers seeking to reimpose tough sanctions on Iran over its nuclear programme met with the Islamic republic’s top diplomat, without any signs of a compromise.\n\n“The American side has been adamant that Iran must not have (uranium) enrichment,” Khamenei said.\n\n“We did not surrender and we will not. We did not and will not yield to pressure in this matter or any other matter,” he added. The supreme leader went on to say talks with the United States would only bring harm to Iran.\n\nNo sign of sanctions breakthrough in meeting with European delegation\n\nNegotiating with America “not only brings no benefit, but also causes major harm under the current conditions, some of which might even be described as irreparable”, he said.\n\n“Let us not forget the experience of these past 10 years, and the other side — which is the subject of our discussion for now — is the United States,” he continued, referring to the landmark 2015 nuclear deal that Washington withdrew from three years later.\n\n“This other side consistently breaks promises, lies about everything, deceives and threatens militarily at every opportunity,” Kha­menei said.\n\n“One cannot negotiate with such a party. In my view, negotiations with the United States on the nuclear issue, and perhaps on other issues as well, are a complete dead end.” European countries and the United States suspect the Iranian government of seeking to acquire an atomic bomb. Tehran has vigorously denied that, insisting it has a right to civilian nuclear energy.\n\nIsrael in June carried out a major military campaign against Iranian nuclear sites, with President Donald Trump joining by ordering US warplanes to drop bombs on key targets.\n\nThe Trump administration, which had long pushed for the reimposition of sanctions, has voiced a willingness to hold talks with Iran, which doubts Washington’s sincerity.\n\nMeeting on the sidelines of General Assembly\n\nEuropean powers seeking to soon reimpose tough sanctions on Iran over its nuclear programme met on Tuesday with Tehran’s top diplomat, but there were no signs of compromise.\n\n“Iran must never obtain a nuclear weapon,” German Foreign Minister Johann Wadephul told reporters before the meeting on the sidelines of the UN General Assembly in New York.\n\nBut he added: “The chances of reaching a diplomatic solution before the sanctions go into effect are slim.” Iran’s foreign ministry in a statement called the sanctions “unjustified and illegal.” But it added without specifics: “It was agreed that consultations with all parties involved would continue.” Iran’s foreign minister has until the end of Saturday to reach a deal with his British, French, German and EU counterparts to avoid the reinstatement of UN sanctions, which had been suspended under a deal signed in 2015.\n\n‘The most dangerous weapon’\n\nIranian Foreign Minister Abbas Araghchi met in New York with his counterparts from the three European powers as well as EU foreign policy chief Kaja Kallas.\n\nIran and the Europeans blame one another for the failure of diplomatic efforts to reach a new agreement on Tehran’s nuclear program, long a rancorous sticking point between the two sides.\n\nEuropean countries and the United States suspect the Iranian government of seeking to acquire an atomic bomb. Tehran has vigorously denied that, insisting it has a right to civilian nuclear energy.\n\nIsrael in June carried out a major military campaign against Iranian nuclear sites, with President Donald Trump joining by ordering US warplanes to drop bombs on key targets.\n\nThe Trump administration, which had long pushed for the reimposition of sanctions, has voiced a willingness to hold talks with Iran, which doubts Washington’s sincerity.\n\nIAEA Director General Rafael Grossi said that US envoy Steve Witkoff was exploring different ways of communicating with Iran, without specifying further details. The United States has not commented on any contact with Iran in New York.\n\nTrump, addressing the UN General Assembly, contended that US warplanes succeeded in “totally obliterating” Iranian nuclear sites.\n\n“My position, it’s very simple. The world’s number-one sponsor of terror can never be allowed to possess the most dangerous weapon,” Trump said.\n\nThe European side has set three conditions to extend the sanction relief period to allow more time for negotiations on a comprehensive treaty.\n\nThey include the resumption of direct negotiations without preconditions, full access for International Atomic Energy Agency (IAEA) inspectors to Iranian nuclear sites, and accurate information on the location of enriched materials. The European side believes that none of the conditions have been met.\n\nTehran accuses the European powers of exerting political pressure that undermines negotiations and claims to have produced a “balanced” proposal, the details of which have not been disclosed.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2410202065ca58c.webp",
  "retrievedAt": "2025-10-12T04:20:26.229Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944250/iran-will-not-abandon-uranium-enrichment-says-khamenei",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T00:23:51.000Z"
}
