{
  "title": "Farooq Sattar takes aim at Sindh govt, Murtaza Wahab over delay in Karachi’s development projects - Pakistan - DAWN.COM",
  "author": null,
  "content": "Muttahida Qaumi Movement-Pakistan (MQM-P) leader Dr Farooq Sattar on Wednesday took aim at the Sindh government and Karachi Mayor Murtaza Wahab over the delay in development projects in the metropolis.\n\nKarachi’s key development projects —from the long-delayed K-IV water supply scheme and Red Line bus corridor to stalled roadworks like the Karimabad underpass and Malir Expressway—remain stuck due to chronic funding gaps, utility relocation issues, regulatory hurdles, and weak inter-agency coordination, leaving the city’s residents waiting years for essential infrastructure.\n\nAddressing a press conference in Karachi, Sattar said, “They cannot conceive a development project, nor can they deliver it.”\n\nDuring the presser, the MQM leader talked about the Green Line Bus Rapid Transit (BRT) project. Recently, the Karachi Metropolitan Corporation (KMC), backed by the PPP-led Sindh government, halted the federally funded Rs6 billion project of the Green Line Bus extension, citing the PIDCL’s failure to obtain a no-objection certificate (NOC) from municipal authorities before restarting the work.\n\n“An excuse was made that a NOC was not obtained, and that is why work was stopped. I think this is all an inter-departmental problem. The KMC is a government department, and the Sindh government has been elected by the people,” he said.\n\nHe questioned the need for delaying work on the project even if an NOC was required, adding that all the necessary approvals had been obtained in 2017.\n\nHe alleged that the reason for stopping work on the project was that the credit was going to the MQM, which the Karachi mayor “could not digest”. He said that Wahab had made hundreds of promises to the residents of the metropolis but had not fulfilled even a single one.\n\n“If the PPP-led provincial government or the Karachi mayor does something right, then there should be an award worth thousands of dollars for them,” he quipped.\n\nHe further said that the provincial government had failed to complete several projects, including the K-IV project that was launched in the 2000s to ease Karachi’s water woes.\n\n“From 2008 to 2022, they sat on this project similar to how a chicken sits on an egg for 21 days. However, after 21 days the egg hatches […] they sat for 14 years on the first phase of the K-IV project […] but they did not complete it.”\n\nHe further said, “This is an infertile [sic] government. You should not expect them to complete any project. You should not expect them to give relief to the people.”\n\nHe said that an underpass being constructed at Karimabad was being ignored, while work had been abandoned on an underpass in Gulistan-i-Jauhar. He added that a flyover had been promised for the Korangi Causeway in 2022, which had also not been followed through on.\n\nHe also highlighted the damage done to Shahrah-i-Bhutto during the recent rainfall.\n\n“Pray for thanks that some of it was damaged while it was being constructed. What would have happened if it had occurred after it had been constructed? How many lives would have been lost? How many cars would have been damaged?”\n\nHe called on the Sindh government to seek forgiveness from the people of Karachi due to the state of affairs in the city and to make up for their lapses.\n\nLast month, PPP Chairman Bilawal Bhutto Zardari had called out the Centre over the inordinate delays in the K-IV water project, saying he had expected the premier to demonstrate the “same speed and efficiency in Karachi as he does in Lahore.”\n\nThe Sindh government has expressed strong reservations over the “inadequate allocation” in the federal budget, saying it was taking the matter “very seriously” and in the process of reviewing the entire budget.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2415185552668ec.webp",
  "retrievedAt": "2025-10-12T00:11:00.205Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944333/farooq-sattar-takes-aim-at-sindh-govt-murtaza-wahab-over-delay-in-karachis-development-projects",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T10:57:39.000Z"
}
