{
  "title": "TLP protesters reach Shahdara bridge in Lahore; halt march overnight - DAWN.COM",
  "author": null,
  "content": "Tehreek-i-Labbaik Pakistan (TLP) supporters reached Lahore’s Shahdara bridge late on Friday night as the religious party attempted to march towards Islamabad and hold an anti-Israeli demonstration outside the US embassy.\n\nA spokesperson for the party told Dawn.com that they have stopped the march for the night.\n\nA Dawn.com correspondent in Lahore reported earlier on Friday evening that the protesters were trying to remove obstacles at the city’s Chauburji Chowk and march ahead.\n\nA statement by Edhi spokesperson Younis Bhatti said several policemen had been injured in clashes with TLP protesters. The statement added that Edhi volunteers moved the injured personnel to various hospitals in the city.\n\nMeanwhile, TLP spokesperson Usman Naushahi told Dawn.com that one of the protesters had died and 22 were injured.\n\nAhead of the march, without naming the TLP, the US embassy in Islamabad posted on social media platform X that “the US consulates general in Lahore, Karachi, and Peshawar are monitoring planned protest activity across Pakistan on October 10”.\n\n“These protests may cause traffic delays/detours due to closed or blocked roads in the vicinity of the demonstrations. The duration of the protests is unknown. We advise US citizens to avoid large gatherings and remain aware of their surroundings,” the embassy said in the post.\n\nMinister of State for Interior Affairs Tallal Chaudhry slammed the TLP for violence during its protest in Lahore, stating that mob politics no longer had a place in Pakistan.\n\n“The Pakistani government and state are absolutely clear that protesting is a political, religious and fundamental right, but it has been enshrined in the Constitution with certain terms and conditions,” the state minister said at a press conference.\n\n“If people will exercise their right to protest, they must do so in line with our conditions.”\n\nChaudhry highlighted that the TLP had brought mobs to protests and attacked security forces in the past, which had led to deaths and “damage to our image”.\n\n“Mob rule has no place in Pakistan,” Chaudhry emphasised.\n\nPointing out that a peace pact had been reached between Hamas and Israel, with which the people of Gaza were happy, he asked what was the purpose of the protest.\n\n“I will give the media footage showing them using sticks, chemicals, glass balls and tennis balls with nails lodged in them,” he added. “They fire these at police and Rangers personnel like slingshots and have injured over a dozen of them.\n\n“This mob, numbering under 2,000, left their central office in Samanabad and headed towards Ravi Road via Bund Road. They successfully made it because the police did not use force,” the minister said. “There were some blockades, but force was not used.”\n\nThe minister maintained that “police personnel deployed there were not equipped with anything other than the anti-riot gear”.\n\n“The gunmen guarding the DIG overseeing the operation or [security measures] were also unarmed,” he added.\n\nThe minister added that when TLP leadership claimed injuries among their workers, CCTV footage showed the religious party’s supporters and workers shooting in the air and also destroying cameras deployed as part of the Safe City project. “Why did they do so if they were peaceful?”\n\nMeanwhile, in the National Assembly, Speaker Ayaz Sadiq and Parliamentary Secretary Asia Ishaq also questioned that if the people of Palestine were happy with the recent peace agreement between Israel and Hamas, then why was the TLP coming to the capital for a protest.\n\nBefore the march began, roads in Islamabad were blocked and mobile internet services suspended. In anticipation of the protest, the Islamabad administration had also started placing shipping containers at Faizabad Interchange — the historic site of several TLP sit-ins.\n\nIt emerged earlier today that the Ministry of Interior had directed the Pakistan Telecommunication Authority (PTA) to suspend 3G and 4G services in Islamabad and Rawalpindi.\n\nA directive dated October 9 and addressed to the Pakistan Telecommunication Authority (PTA) chairman stated the ministry had “accorded approval to suspend 3G/4G services in the twin cities of Islamabad and Rawalpindi, starting from 12am tonight till further orders.”\n\nThe missive, a copy of which is available with Dawn.com, directed the PTA to take “further necessary action” in this regard in coordination with the Islamabad commissioner and police chief, and the Rawalpindi regional police officer.\n\nThe ministry did not provide a reason for suspending services, but the development does come amid verious other measures being taken by the authorities ahead of the TLP protest.\n\nIslamabad traffic police also issued a diversion plan, referring to the “law and order” situation in the Faizabad area.\n\nThe plan, posted on Islamabad police’s X account, said the entry of all heavy vehicles in the federal capital would not be allowed until further orders and detailed the diversion routes for smaller vehicles around the Faizabad area.\n\nA Dawn report, citing sources, earlier said around 500 containers would be used to seal the Red Zone in Islamabad, covering Attaturk Avenue, Third Avenue, Margalla Road, and Khayaban-i-Suharwardy as well as the capital’s entry and exit points.\n\nThese containers were being placed at key locations, including Serena Chowk, Express Chowk, Nadra Chowk, Agha Khan Road near Marriott Hotel, Margalla Road near Trail 3 and Luqman Hakeem Road. Other blockades were being set up at Faisal Avenue’s Zero Point and Faisal Chowk, the report said.\n\nIt added that entry points into the capital from Rawat T-Cross, Chungi No 26 and Faizabad will also be sealed with containers. The metro bus and electric bus services on 21 different routes were suspended on Thursday evening and these would remain suspended today as well.\n\nSome educational institutions also announced closures in view of the rally and the state’s preparations to counter it.\n\nThere are also reports of roads being blocked in Jhelum and Jhelum.\n\nThe police were also deployed at the Peshawar motorway toll plaza, with large containers placed on the roadway and the route towards Islamabad closed. Vehicles traveling on the roadway were asked to turn back.\n\nSeparately, according to a Dawn report, the capital police had started detaining local TLP leaders, activists and workers, taking into custody at least 280 people on Thursday.\n\nThe report said about 7,000 security personnel, including 5,500 policemen, 1,000 Frontier Constabulary and 500 Rangers, would be deployed across the capital to intercept the TLP gathering and maintain law and order. Armoured Personnel Carriers (APCs) and vehicles equipped with anti-riot gear, including tear gas shells and rubber bullets, would also be deployed at various locations.\n\nTo avoid any law and order situation in Rawalpindi, the city police and administration have imposed Section 144 till October 11 and sealed major entry and exit routes with more than 300 containers.\n\nSection 144 of the Criminal Procedure Code is a legal provision that empowers district administrations to prohibit an assembly of four or more people in an area for a limited period.\n\nAs part of the security plan, more than 6,500 police personnel, including 1,150 traffic police, contingents of Punjab Constabulary, and the newly formed Riot Management Police (RMP), have been deployed in Rawalpindi. Personnel from other districts have also been called in to assist the local force.\n\nOn Thursday, Minister of State for Interior Talal Chaudhry said that the government always allowed peaceful marchers and demonstration, however, the TLP had not sought permission for its protest in the capital.\n\nLate on Thursday, violence had also broken out in Punjab, after police launched a crackdown on the headquarters of TLP in a bid to arrest its chief, Saad Rizvi. The clashes left several people injured, including around a dozen policemen.\n\nAn October 8 order by the Punjab Home Department, a copy of which is available with Dawn.com, says that Section 144 has been imposed in the province for 10 days.\n\nThe order states that the Punjab government has received credible reports from law enforcement and intelligence agencies indicating a “serious and imminent threat to public peace, tranquility, and the safety of life and property across the province”.\n\n“Multiple credible threat alerts, regarding possible terrorist activities planned by hostile groups, including RAW, TTP, BLA, Daesh etc., aimed at targeting minorities or Muslim scholars to trigger sectarian unrest have been received. Assemblies, rallies, gathering, sit-ins, processions, demonstrations, jalsa, etc., could present a convenient target for such terrorist attacks and the possibility of an untoward incident cannot be ruled out.\n\n“[…] There is a strong apprehension that certain political, sectarian or anti-social elements may engage in activities, assemblies, gatherings or demonstrations that are likely to cause a breach of public peace, disturb the public order and create a security risk for the general public and critical infrastructure,” the order read.\n\nApart from a ban on assembly of four or more persons, the order also places a restriction on carrying, brandishing and displaying arms in public spaces, a ban on “misuse of loudspeakers, public address systems and audio amplifying devices for provocative, sectarian or inflammatory content”, and a ban on publishing, disseminating of displaying provocative, hateful or sectarian material.\n\nA notification by the University of Punjab, also available with Dawn.com, said that the varsity would remain closed today, as per the instructions of the government.\n\nMeanwhile, a statement by the Punjab Public Service Commission’s media and production deputy director said exams for the Punjab Enforcement and Regulatory Authority Sub-Divisional Officer’s post, scheduled for Oct 11 and 12, had been postponed following the imposition of Section 144. The statement, however, did not specify a new date for the exams.\n\nAdditional reporting by Nauman Liaquat and Hamid Asghar",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/101720115ef07c3.webp",
  "retrievedAt": "2025-10-12T04:19:27.722Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1947867/tlp-protesters-reach-shahdara-bridge-in-lahore-halt-march-overnight",
  "dateList": "2025-09-24",
  "date_published": "2025-10-10T04:45:14.000Z"
}
