{
  "title": "City managers push for energy-efficient construction in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: City managers have decided to strictly implement new building codes on all upcoming construction projects with the goal of improving energy conservation and efficiency.\n\nThe Capital Development Authority (CDA) will ensure implementation of the National Energy Conservation Building Codes 2023.\n\nExplaining these codes, an official said that owners of buildings will be directed to prefer energy efficient construction material and install low voltage and energy saving electric material.\n\nHe said that new building plans would not be approved if they did not adhere to the said codes. A meeting was held at the CDA headquarters on Tuesday with CDA chief Mohammad Ali Randhawa in the chair. The meeting was attended by National Energy Efficiency and Conservation Authority (NECCA) Managing Director Sardar Moazzam, CDA board members and others.\n\nBuilding owners asked to prefer energy saving and low voltage electric material\n\nDuring the meeting, a briefing was given by CDA officials regarding the adoption and implementation of the Energy Conservation Building Codes 2023 and Pakistan Engineering Council by-laws.\n\n“The meeting was informed that the CDA has already issued a notification to ensure the implementation of the Energy Conservation Building Codes. The meeting decided that the implementation of NEECA building codes will be mandatory for all new constructions and buildings in Islamabad,” said a statement issued by the CDA.\n\n”The financial aspects of constructions, keeping in view energy saving and conservation for the implementation of the building codes, were also reviewed. It was noted that the implementation of these codes will also lead to financial savings for citizens through energy conservation.”\n\nThe meeting discussed the adoption and implementation of the building codes for energy efficiency and conservation. Similarly, various measures related to the establishment of electric vehicle charging stations in government and commercial buildings and areas were also deliberated upon.\n\nThe meeting was told that NEECA was also conducting various training programmes in relevant institutions for the implementation of these codes. Furthermore, to ensure implementation, NEECA has developed software and tools, including the Building Performance Database Tool, ECBC Compliance Tool and Residential Load Factor Tool.\n\nThe CDA chairman directed the development of a financial model to bring old residential and commercial buildings into compliance with the new codes. He said that for pre-existing and old buildings, the new codes will be implemented in phases after a financial review. The meeting also held a detailed discussion on the prime minister’s vision regarding introducing electric vehicle charging stations.\n\nAccording to CDA, the meeting was informed that measures were being taken to establish charging stations at all petrol pumps in Islamabad. Additionally, steps were being taken to set up charging stations in government and commercial buildings and areas.\n\nThe NEECA chief said that electricity will be provided to NEECA-registered charging stations at a subsidised rate. The meeting agreed to register CDA’s electric feeder buses with NEECA.\n\n“The meeting concluded with a consensus on energy conservation, construction in accordance with Energy Efficient Building Codes, and the provision of EV charging stations across Islamabad,” it said.\n\nNEECA is working under Ministry of Energy and according to its website its main vision is “to steer Pakistan towards a culture of conservation and efficient use of energy resources to achieve sustainable development.”\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:19:59.118Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944190/city-managers-push-for-energy-efficient-construction-in-islamabad",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T00:24:08.000Z"
}
