{
  "title": "PHC stops anti-corruption body from taking action against presiding officers - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court on Tuesday stopped Khyber Pakhtunkhwa Anti-Corruption Establishment (ACE) from taking any negative action against five presiding officers of respective polling stations in the last year general elections, who were summoned in an inquiry into alleged irregularities during polls.\n\nA bench consisting of Justice Sahibzada Asadullah and Justice Mohammad Ijaz Khan issued notices to ACE director and an assistant director and Election Commission of Pakistan through chief election commissioner, seeking their response to a petition jointly filed by five of the presiding officers, who challenged the inquiry and issuance of notices to them by ACE on Aug 29 for appearance.\n\nThe bench directed ACE to continue with the inquiry in accordance with law, but not to take any action against the petitioners till further order.\n\nThe petitioners including a lecturer at a local college, Ms Saima, and four others have requested the court to set aside and quash the impugned inquiry and the notices issued to them as the same were illegal and unconstitutional.\n\nSeeks ACE, ECP response to plea against inquiry into election ‘irregularities’\n\nBarrister M Yaseen Raza Khan appeared for the petitioners and said that his clients served as presiding officers at their respective polling stations during the general elections held in Feb 2024.\n\nHe stated that in the aftermath of the general elections, petitioners and others similarly placed presiding officers faced a heavy backlash from the candidates, who were unsuccessful in securing highest votes/seat in the assembly. He added that in that regard different complaints were filed against the petitioners and others before ECP under the relevant provisions of Elections Act, 2017.\n\nHe said that general allegations were levelled by all unsuccessful candidates, pertaining to the alleged tampering in the official records at the close of poll. He stated that it was alleged that presiding officers, including the petitioners, tampered with and issued fake and fabricated Forms-45 to returned candidates and uploaded the same on the website of ECP.\n\nBarrister Khan submitted that petitioners were attending the inquiry proceedings before the relevant committees constituted by ECP under Elections Act and filed their replies etc as well.\n\nHe stated to the utter surprise of the petitioners, they received the impugned notices from ACE on Aug 29 for attendance in preliminary inquiry of July 16, 2025 initiated on the complaint of Taimoor Saleem Khan Jhagra, one of the candidates, regarding alleged irregularities and misconduct by presiding officers and others during the polls.\n\nHe said that the petitioners were directed to appear before an assistant director of ACE for the purpose of recording their statements in connection with the impugned inquiry.\n\nThe counsel stated that the petitioners appeared on the requisite date and recorded their statements. He said that the petitioners categorically informed the assistant director that they were on special election duty, on the orders of ECP, and as such their actions and complaints pertaining thereto were to be dealt with under Elections Act as ACE had no jurisdiction to inquire into any matter pertaining to elections.\n\nHe argued that the official was also informed that complaints, having the same allegations, were already filed by the same complainant before ECP, which were pending adjudication under Elections Act.\n\nHe stated that the petitioners recorded their statements to the effect that no illegality whatsoever was committed by them during the process of the last general elections.\n\nHe argued that the official kept the matter pending and informed the petitioners to expect further contact from ACE in connection with the inquiry.\n\nThe counsel contended that Elections Act and rules established a comprehensive and specialised legal framework for the conduct of elections, the resolution of election disputes and prosecution of election-related offenses.\n\nHe said when ECP, a constitutional body, was already seized of the complaint regarding election-related allegations, any parallel inquiry by the officials of ACE, an executive agency, on the same allegations, fell outside the exclusive legal mandate established for election matters.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:20:02.064Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944173/phc-stops-anti-corruption-body-from-taking-action-against-presiding-officers",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T00:24:14.000Z"
}
