{
  "title": "Stocks recover overnight losses in cautious trade - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The stock market reversed its overnight bearish trend on Tuesday, as value-hunting by investors helped the KSE-100 index close in the green zone.\n\nDespite volatility caused by rollover pressure, the benchmark index settled at 157,945, up 390 points.\n\nThe index touched an intraday high of 158,831.22 and a low of 157,416.54 during the session.\n\nGains in major stocks, including United Bank, Bestway Cement, and Bank Al-Habib, contributed 432 points to the index. However, losses in stocks such as Lucky Cement, Meezan Bank, Habib Bank, Fauji Fertiliser, and Bank of Punjab collectively weighed down the index by 255 points.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, described the session as a battle between bullish and bearish forces. Despite this, the index managed to stay firm around the 158,000 mark.\n\nA key highlight of the day was Oil and Gas Development Company’s announcement of its FY25 earnings per share of Rs39.50, accompanied by a Q4 dividend of Rs5.00, bringing total FY25 payouts to a record Rs15.05.\n\nMarket rumours circulated regarding a potential resolution of circular debt in the power sector, suggesting that the government may sign a financing agreement with 18 banks — including Habib Bank, Meezan Bank, United Bank, MCB Bank, and Bank Alfalah — to raise Rs1.25-1.75tr for the settlement of debts.\n\nInvestor participation remained subdued, with trading volume falling by 8.67pc to 1.52bn shares, while the traded value eased by 3.57pc to Rs58.72bn. K-Electric was the volume leader, with 44.6m shares changing hands.\n\nLooking ahead, analysts expect the market to continue consolidating within the 155,000-159,000 range as investors remain cautious in light of economic challenges, particularly ahead of the IMF’s economic review, which begins on Sept 25.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d33637baedc.gif",
  "retrievedAt": "2025-10-12T04:20:02.154Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944276/stocks-recover-overnight-losses-in-cautious-trade",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T00:23:38.000Z"
}
