{
  "title": "IMB rightly recognises polio challenges in Islamabad, Kabul: GPEI - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Global Polio Eradication Initiative (GPEI) has welcomed a report from the Independent Monitoring Board (IMB) on polio.\n\nAccording to GPEI, the report hi­­gh­lighted the geopolitical shifts imp­acting all global health efforts, inclu­ding the GPEI.\n\n“The programme agrees with the IMB that the reduction in historic donor support — if realised — will create new challenges.\n\nIn response, the GPEI is identifying ambitious, operational shifts that will help countries fully leverage and align more limited resources to address the resurgence of wild poliovirus in the final endemic countries and counter longstanding barriers to reaching children with polio vaccines in subnational regions facing humanitarian crises,” it stated.\n\n“The IMB rightly recognises the challenges in Pakistan and Afghan­istan that drove a surge in transmission in 2024. Each national programme — alongside the GPEI Technical Ad­­v­isory Group — has developed tailored strategies to address persistent risks and obstacles. This includes building trust with communities and frontline workers to address vaccine hesitancy, implementing tactics to reach children in hard-to-access areas, strengthening monitoring mechanisms, and continuing to collaborate closely with local authorities to strengthen cross-border coordination and disease surveillance efforts,” it stated.\n\nIMB report highlights geopolitical shifts impacting all global health efforts\n\n“The GPEI agrees with the IMB’s emphasis on renewed political commitment and improved accountability measures to help facilitate rapid, high-quality outbreak response effo­rts. Regional planning and cross-border collaboration are critical to containing virus spread in outbreak cou­ntries.\n\nFor example, a comprehensive Lake Chad Basin coordination plan has received support from seven key countries that aims to synchronise ca­­mpaigns, enhance surveillance activities, and reach mobile and border po­­pulations. Countries in the Horn of Africa and Yemen are also ta­­king co­­ncrete steps to intensify co­­or­dination to end protracted variant po­­­liovirus spread in this bloc,” it stated.\n\n“Integrating polio services with other health programmes will help boost overall immunity and meet the bro­a­der health needs of communities now. In 2024, the GPEI’s integration efforts were strengthened, with more than 40pc of campaigns delivering ‘plu­­ses’ — other childhood vaccines, nutritional supplements, or other health interventions.\n\n“The GPEI is also working with ministries of health and Gavi to boost IPV coverage and support country efforts to improve routine immunisation and integrated delivery systems — a cornerstone of the eradication strategy,” it stated.\n\n“GPEI values the IMB’s ongoing oversight and its shared dedication to eradicating polio worldwide. The programme is carefully reviewing each recommendation and will provide a comprehensive response. We will continue working closely with the IMB, affected countries, and partners to enhance the programme’s effectiveness — strengthening immunisation efforts, mainstre­aming gender-sensitive approaches, refining disease monitoring, reinforcing health systems, and ultimately ensuring that no child is paralysed by polio ever again,” the GPEI stated.\n\nA polio expert, while talking to Dawn, said that polio cases were reduced due to Covid-19 in Pakistan.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:11:40.475Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944269/imb-rightly-recognises-polio-challenges-in-islamabad-kabul-gpei",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T00:23:31.000Z"
}
