{
  "title": "Punjab unveils flood relief package, but sets no timeline - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Rs1m for destroyed, Rs500,000 for partially damaged houses\n• Farmers to receive Rs20,000 per acre of submerged land, Rs500,000 for each head of cattle lost\n• ‘Relief cards’ planned to avoid long queues at aid centres\n• Jalalpur residents say govt focused on saving motorway, neglecting villages\n• Dozens of Jamshoro villages affected; funeral procession negotiates floodwaters in Manjhand\n\nLAHORE / DADU: The Punjab government on Tuesday announced a relief package for people affected by recent floods, but stopped short of giving a date for its distribution.\n\n“A sum of Rs1 million will be given to the owner of a destroyed house and Rs500,000 for partially damaged houses,” Punjab Inform­ation Minister Azma Bokhari told a press conference.\n\nShe said that farmers whose land had been submerged would receive Rs20,000 per acre, while compensation of Rs500,000 would be provided for each cow or buffalo lost.\n\n“All these payments are being made from the Punjab government’s own resources without seeking external aid,” she said, taking a jibe at the PPP that has been pressing the federal government to appeal to the international community for help.\n\nMs Bokhari said that “relief cards” would be introduced so that the flood victims could receive aid without standing in long queues.\n\nShe said 10,000 employees had been deployed to conduct surveys in flood-affected areas, but no timeframe had been set for compensation payments.\n\nThe minister said that more than 4.7 million people and 2.1 million livestock had been affected across 27 districts and 4,794 villages, including areas along three rivers. “For relief and rescue operations, 2,213 teams are still working in the field,” she added.\n\nMs Bokhari said Chief Minister Maryam Nawaz had visited every flood-hit area and claimed the provincial government had set an example in relief and rescue operations, while criticising opposition parties for politicising the issue.\n\nBreaches in Sutlej embankment\n\nMeanwhile, catastrophic flooding triggered by three breaches in the Noraja Bhutta embankment along the river Sutlej has inundated vast swathes of Multan, Bahawalpur and Lodhran districts, leaving thousands homeless and critical infrastructure severely damaged.\n\nThe embankment gave way at three locations — Noraja Bhutta union council in Jalalpur Pirwala, Bahadurpur and Jhangra. One breach widened to 400 feet, while two others stretched 30 to 40 feet.\n\nThe breaches diverted the Sutlej’s flow into nearby villages, submerging dozens of settlements, including Jhan­gra, Bahadurpur, Noraja Bhu­tta, Kotla Chakar, Tarut Bash­arat, Basti Lang, Basti Kanu, Depalpur and Khairpur Dha.\n\nThe floodwaters also damaged the M5 motorway and Gilani Road, creating a lake between the two roads. Authorities carried out a controlled breach at Gilani Road to divert water towards the Chenab River.\n\nA senior irrigation official said 70,000 to 80,000 cusecs of water was still flowing in the Sutlej and could reach the area within a day or two. He said efforts were underway around the clock to plug the breaches, which could take up to 12 days to seal completely.\n\nHe said that the authorities were also diverting the water to the canals at Sulemanki and Islam headworks and 20,000 to 25,000 cusecs of water in the Sutlej would further decrease near Noraja Bhutta, which would take the usual course to enter the Chenab River.\n\nMeanwhile, the residents of these union councils were forced to live on Gilani Road and other embankments under the open sky, many without tents or food.\n\nShakir Kanu of Basti Kanu told Dawn that water would not recede in their areas until the breaches at the Noraja Bhutta dyke were plugged.\n\nHe said that most houses in his locality were destroyed or collapsed, while some were under threat due to the continuously rising water.\n\n“The government is making efforts to save the motorway and bringing heavy stones, but no effort is being made to save our areas,” he lamented.\n\nMr Kanu further said that the people and cattle heads were not getting proper food and they were also facing medical issues.\n\nOn CM Maryam Nawaz’s instructions, 44 additional machines were dispatched to the breach site in Lodhran, with senior ministers overseeing the operation.\n\nPunjab Relief Commi­ssioner Nabil Javaid said that 4.7 million people had been affected across 27 districts, with 271 relief camps and 300 medical camps set up, while over 2.6m people and 2.1m animals had been moved to safety.\n\nAccording to Provincial Disaster Management Authority (PDMA) Dire­ctor General Irfan Ali Kathia, the overall water flow in Punjab’s rivers is normal and water levels in flood-affected areas are significantly receding, where rehabilitation measures are ongoing.\n\nDadu villages submerged\n\nIn Sindh, as a medium flood passes through the Kotri Barrage, several parts of Jamshoro district have been submerged.\n\nThese include parts of Sehwan, Laki Shah Sadar, Amri, Sun, Manjhand, Lakha, Indpur, Budhapur, Aliabad, Khanot, Petaro, Kotri, Khanpur, and Karokho, among others.\n\nHomes , infrastructure and agricultural land in these regions has suffered extensive damage. In Sehwan, 10 more villages have come under floodwater. The flood has crossed the bridge on Indus Highway and reached the historic Lal Bagh area. Water has also entered the graveyard near Lal Bagh and inundated nearby homes.\n\nElectricity supply has been completely suspended in the riverine areas, leaving residents in a lurch, while road links have been severed as connecting thoroughfares remain under water.\n\nIn addition, several parts of Manjhand are under water. Villagers from Goth Detha, located near the shrine of Shah Owais Qarani, are stranded after their road link was severed by rising floodwaters.\n\nThe area’s plight was depicted in a video shared on social media, showing a funeral procession trudging though three to four feet of water.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d326c277ef2.jpg",
  "retrievedAt": "2025-10-12T00:11:40.573Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944207/punjab-unveils-flood-relief-package-but-sets-no-timeline",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T00:23:25.000Z"
}
