{
  "title": "Hopes of Western refuge sink for Afghans in Pakistan - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: In their Pakistan safehouse, Shayma and her family try to keep their voices low so their neighbours don’t overhear their Afghan mother tongue. But she can belt out Bob Dylan’s “The Times They Are a-Changin’” any time she likes, and no-one would guess it comes from a 15-year-old refugee in hiding.\n\n“In the kitchen, the sound is very good,” she told AFP alongside her sister and fellow young bandmates.\n\nBy now, Shayma should have been testing the acoustics of her new home in New York.\n\nBut before her family’s scheduled February flight, US President Donald Trump indefinitely suspended refugee admissions, stranding around 15,000 Afghans already prepared to fly out from Islamabad.\n\nThousands more are waiting in the city for relocation to other Western nations, but shifting global sentiment towards refugees has diminished their chances and put them at risk of a renewed deportation drive by Pakistan, where they have long exhausted their welcome.\n\nFor girls and women, the prospect is particularly devastating: a return to the only country in the world that has banned them from most education and jobs.\n\n“We will do whatever it takes to hide ourselves,” said Shayma’s 19-year-old bandmate, Zahra.\n\n“For girls like us, there is no future in Afghanistan.”\n\nNot a transit camp\n\nAfter the Taliban’s return to power in 2021, tens of thousands of Afghans travelled to Pakistan to register refugee and asylum applications with Western embassies, often on the advice of officials.\n\nMany had worked for the US-led Nato forces or Western NGOs, while others were activists, musicians or journalists.\n\nFour years on, thousands are still waiting, mostly in the capital Islamabad or its outskirts, desperately hoping that one of the embassies will budge and offer them safe haven.\n\nHundreds have been arrested and deported in recent weeks, and AFP gave interviewees pseudonyms for their protection.\n\n“This is not an indefinite transit camp,” a Pakistan government official disclosed on condition of anonymity. He said Pakistan would allow Afghans with pending cases to stay if Western nations assured the government that they would resettle them.\n\n“Multiple deadlines were agreed but they were not honoured,” he added.\n\nLove for music\n\nOvercoming social taboos, Shayma and her sister Laylama attended the after-school lessons run by an American former arena rocker but had to move to Pakistan after Taliban returned to power.\n\nOne of 10 siblings, Laylama sold sunflower seeds to help support the family. She had cherished a stringless plastic guitar, until she encountered the real thing.\n\nBut fearing retribution from the Taliban government, which considers music anti-Islamic, Laylama’s father burned her guitar. “I cried all night,” the 16-year-old said.\n\nSince they were smuggled into Pakistan in April 2022 to apply for refugee status with the United States, Shayma and her bandmates have had to move four times, driven deeper into hiding.\n\nAt the start of Pakistan’s crackdown in 2023, the US embassy provided the government with a list of Afghans in its pipeline that should be spared, according to a former staffer with the State Department’s Coordinator for Afghan Relocation Efforts. That office, and the protections it offered, have been dismantled by the Trump administration.\n\n“Leaving these refugees in limbo is not just arbitrary, it’s cruel,” said Jessica Bradley Rushing of the advocacy coalition AfghanEvac.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68d323367b788.jpg",
  "retrievedAt": "2025-10-12T00:11:14.360Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944193/hopes-of-western-refuge-sink-for-afghans-in-pakistan",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T01:18:00.000Z"
}
