{
  "title": "Pakistan women’s team start training in Sri Lanka’s Colombo for World Cup - Sport - DAWN.COM",
  "author": null,
  "content": "The Pakistan women’s team on Wednesday started training for the Cricket World Cup, in Sri Lanka’s Colombo, the Associated Press of Pakistan reported.\n\nThe Women in Green arrived in the Sri Lankan capital late on Tuesday as the tournament is set to start on September 30 in India’s Guwahati.\n\nThe eight-nation showpiece will be co-hosted by India and Sri Lanka from Sept 30 to Nov 2. However, Pakistan — under an International Cricket Council (ICC) hybrid model decided by the ICC due to political strains between New Delhi and Islamabad — will play all their matches of the event in Colombo.\n\n“The team on Wednesday participated in its first training session at the Ranasinghe Premadasa Stadium,” APP reported.\n\nThe session focused on batting, bowling, and fielding under the guidance of head coach Muhammad Wasim, APP added.\n\nBefore the World Cup begins, Pakistan will play two crucial warm-up matches.\n\nTheir first encounter will be against Sri Lanka on September 25, followed by a match against South Africa on September 28.\n\nDespite losing the recent one-day International (ODI) home series against South Africa, Pakistan were well prepared and had no extra pressure to face arch-rivals India in the forthcoming ICC World Cup, captain Fatima Sana said on Tuesday.\n\nThe Fatima-led team won the third and final ODI against South Africa in Lahore on Monday, but the tourists took the series 2-1.\n\n“There is no extra pressure [on us] for the match against India as all the World Cup games carry similar pressure. Therefore, we will take that match [against India] as any other game,” Fatima told reporters in Lahore before leaving for the tournament.\n\n“We will try to take a good start [to the World Cup] against Bangladesh and then move forward with a good momentum.”\n\nFatima insisted that the way Pakistan tried to chase a 300-plus target in the second ODI against South Africa showed the hosts were heading in the right direction. The Green Shirts lost that close match by 25 runs.\n\nPakistan had qualified for the World Cup on the back of an unbeaten run in the ICC Women’s World Cup Qualifiers held in Lahore in April of this year.\n\nPakistan’s World Cup schedule:\n\nOctober 2: Pakistan take on Bangladesh.\n\nOctober 5: The Women in Green play India.\n\nOctober 8: Pakistan face Australia.\n\nOctober 15: Pakistan play against England.\n\nOctober 18: Pakistan compete against New Zealand.\n\nOctober 21: Pakistan face South Africa.\n\nOctober 24: Pakistan’s final group stage match against Sri Lanka.\n\nOctober 29: Semi-final in Colombo if Pakistan qualify.\n\nNovember 2: Final if the Green Shirts qualify.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/242153279ccc3f6.webp",
  "retrievedAt": "2025-10-12T00:10:59.043Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944348/pakistan-womens-team-start-training-in-sri-lankas-colombo-for-world-cup",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T14:07:41.000Z"
}
