{
  "title": "ECC green-lights proposals for commercial import of used vehicles - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Economic Coordination Committee (ECC) of the Cabinet on Wednesday decided to amend relevant provisions of the Import Policy Order, 2022 to allow the commercial import of used vehicles.\n\nAccording to a statement issued by the Finance Division, “The ECC considered a summary regarding the commercial import of used vehicles and, after detailed discussion, accorded approval to the proposals.”\n\nInitially, only vehicles not older than five years will be permitted until 30th June 2026, after which the vehicle age limit shall stand removed, it added.\n\nAs per the statement, Federal Finance and Revenue Minister Muhammad Aurangzeb chaired the ECC meeting virtually from New York.\n\nThe ECC further directed that “such commercial importation would remain subject to strict compliance with prescribed environmental and safety standards”.\n\n“The committee also approved the imposition of 40 per cent regulatory duty in addition to the existing customs duties, on the commercial import of used vehicles (less than five years old),” it added.\n\n“This enhanced duty will remain applicable until 30th June 2026. Thereafter, the duty shall be reduced gradually by 10 percentage points per year, reaching zero by 2029-30, in line with the recommendations of the Tariff Policy Board.”\n\nThe statement further read that on another summary moved by the Cabinet Division, the ECC considered and approved a technical supplementary grant of Rs800 million in favour of the Pakistan Virtual Asset Regulatory Authority (PVARA).\n\nThe ECC’s decisions will now be approved by the federal cabinet.\n\nThe meeting was attended by Federal Minister for Petroleum Ali Pervaiz Malik, Federal Minister for National Food Security and Research Rana Tanveer Hussain, Federal Minister for Power Sardar Awais Ahmad Khan Leghari, federal secretaries and senior officials from concerned ministries and regulatory bodies, the statement concluded.\n\nLast month, local auto parts manufacturers warned of a potential shutdown of Pakistan’s car assembly industry within the next two years if the government proceeded with plans to liberalise the commercial import of used vehicles from September.\n\nFormer chairman of the Pakistan Association of Automotive Parts and Accessories Manufacturers (PAAPAM), Aamir Allawala, raised concerns during a media briefing at various vending units, stating that used vehicles already account for 25pc of the market — over 40,000 units annually. In contrast, used car market share stands at zero in India, 0.3pc in Vietnam, and 1.2pc in Thailand, he noted.\n\nAllawala said import duties on completely built-up (CBU) units in Pakistan range from 50–100pc, compared to 125pc in India, 52pc in Vietnam, and 80pc in Thailand. The negligible used car imports in these countries are the result of both tariff and administrative measures, he added.\n\nIn May, as the International Monetary Fund was pushing the government for rationalisation of tariffs on the auto industry, the All Pakistan Car Dealers and Importers Association (APCDIA) urged the government to allow the import of used vehicles with certain conditions through banking channels in the budget FY26.\n\nThis step will eliminate the outflow of foreign exchange through the kerb market and will promote a documented economy as all transactions will be done through banking channels, the association said, adding that this will not only promote tax culture but also make all importers bound to submit sales data to the Federal Board of Revenue to bring transparency in this process.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2421591855cebf3.webp",
  "retrievedAt": "2025-10-12T00:10:58.812Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944359/ecc-green-lights-proposals-for-commercial-import-of-used-vehicles",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T17:16:19.000Z"
}
