{
  "title": "Commerce Minister Kamal seeks to expand trade with Asean - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan on Tuesday reaffirmed its commitment to strengthen trade, investment, and people-to-people ties with Southeast Asia, as Commerce Minister Jam Kamal Khan met ambassadors from seven Association of Southeast Asian Nations (Asean) member states.\n\nThe meeting brought together senior diplomats from Indonesia, Malaysia, the Philippines, Thailand, Brunei, Vietnam, and Myanmar, reflecting the broad Asean representation in Islamabad.\n\nMr Jam told the ambassadors that Pakistan seeks not only to increase bilateral trade but also to develop long-term partnerships in technology, skills development, and infrastructure. He highlighted potential in technology transfer, value addition in agriculture, and leveraging Pakistan’s skilled workforce to elevate trade from its current level.\n\nThe minister also briefed attendees on Pakistan’s new trade policy, vehicle import regulations, and tariff rationalisation efforts led by Prime Minister Shehbaz Sharif. He updated them on progress toward a Free Trade Agreement with the Gulf Cooperation Council.\n\nDescribing Pakistan as a gateway to Central Asia, Mr Jam noted that the country’s ports have gained importance under new transit trade agreements that reduce costs for regional partners. He encouraged Asean companies to invest in Pakistan’s Special Economic Zones under the China-Pakistan Economic Corridor.\n\n“Pakistan welcomes you to export here, add value, and re-export your products,” he said, emphasising the need for stronger multilateral trade links. He also announced the formation of a Trade Dispute Resolution Commission, a first in Pakistan’s history, to help international firms resolve conflicts quickly.\n\nThe Asean envoys welcomed Pakistan’s outreach, recognising significant potential for expanded commercial cooperation.\n\nThe Malaysian ambassador invited Pakistani firms to participate in Malaysia’s growing semiconductor industry, while others noted existing Asean investments in Pakistan’s construction and power sectors.\n\nPublished in Dawn, September 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:20:28.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1944274/commerce-minister-kamal-seeks-to-expand-trade-with-asean",
  "dateList": "2025-09-24",
  "date_published": "2025-09-24T00:23:38.000Z"
}
