{
  "title": "PM Shehbaz Sharif extends Eid greetings to the nation",
  "author": null,
  "content": "LAHORE, Mar 30 (APP):Prime Minister Muhammad Shehbaz Sharif has extended heartfelt Eid-ul-Fitr greetings to the nation.\nIn his felicitation message issued on the occasion of Eid-ul-Fitr 1446 Hijrah,\nthe premier said, “Eid day teaches us  happiness, thankfulness, brotherhood and empathy.”\nHe said that the holy month of Ramadan emphasis on forbearance, patience and sacrifice and it was necessary for us to continue practicing these characteristics even after Ramadan besides sticking to Islamic principles.\nShehbaz Sharif said, “Today the country is facing threats from internal and external enemies.”\nHe further said there was a need to stay protected from all sorts of extremism, hatred and sectarianism.\n“We need to be united for integrity and stability of the country besides not letting any conspiracy to succeed,” he added.\nHe said, “It is our collective responsibility to strengthen economy, society and national solidarity” and added that incumbent government was making all out efforts for country’s economic revival, stability of society and maintaining law and order. “We need to make joint efforts for putting the country on the road to progress.”\nHe said that country was going through a war against terrorists adding that officers and jawans of the Pak armed forces were sacrificing their lives for restoring law and order in the country.\nMuhammad Shehbaz Sharif said that today we pray to the Allah Almighty to elevate ranks of all martyrs and express solidarity with their family members. “Today we also pray to the Allah Almighty to elevate ranks of martyrs of Jafar Express incident and equally share the grief of their family members. We need to remember our innocent brothers who are facing atrocities in Indian Illegally Occupied Jammu and Kashmir besides Palestine. Pakistan is standing with the freedom struggle of people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) and Palestinian people and would continue supporting them.”\nHe said that the international community should play its role in stopping human rights violations and solve their genuine problems. He appealed to the people to share joys of Eid-ul-Fitr with weak and deserving brothers and sisters, relatives and neighbours and play their role in forming a welfare society.\nHe prayed that may Allah Almighty grant us courage to understand the significance of Eid-ul-Fitr and implement it in the real sense.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:07:17.560Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-shehbaz-sharif-extends-eid-greetings-to-the-nation/",
  "dateList": "2025-03-30",
  "date_published": "2025-03-30T16:32:00.000Z"
}
