{
  "title": "Education Minister offers 80 fully funded scholarships to Syrian students",
  "link": "https://www.app.com.pk/national/education-minister-offers-80-fully-funded-scholarships-to-syrian-students/",
  "date_published": "2022-11-06T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 06 (APP): Federal Minister for Education and Professional Training Rana Tanveer Hussain has offered 80 fully funded scholarships (Undergraduate & Graduate) to Syrian students under various programs and mainly in the fields including medicine, dentistry, engineering, physical, natural & applied sciences, agriculture, education and etc.\nHe offered these scholarships during his productive bilateral visit to Arab Republic of Syria on invitation of Dr. Darem Tabba, Minister of Education, Syria, a press release on Sunday said.\nRana Tanveer Hussain’s visit was a follow up visit of Syrian Education Minister to Pakistan last year.\nDuring his visit , Rana Tanveer Hussain held meetings with Hussein Arnous, Prime Minister of Arab Republic of Syria, Mr. Bassam Bashir Ibrahim, Minister of Higher Education, Mr. Namir Habib Makhlouf, Governor Homs and Mr. Mahmoud Zanubua, Governor Hama, Syria.\nThe Syrian prime minister while conveying his felicitations and best wishes for Prime Minister Shehbaz Sharif mentioned that Pakistan is a brotherly country which stood by Syria in its hard times. Minister Rana Tanveer Hussain also conveyed Prime Minister Shehbaz Sharif’s best wishes to the Syrian premier and People of Syria.\nDuring the meeting, which was also attended by Syrian Education Minister and Pakistan’s Ambassador to Syria, both sides agreed to further strengthen collaborations in the field of Education, Skills and Scientific research. Besides, his visit to Ministry of Education and Ministry of Higher Education, Federal Minister Rana Tanveer Hussain also visited the Pakistan International School Damascus, which is considered as one of the top ranked educational institute in Syria.\nHe, accompanied by the Syrian Education Minister and Governor Homs, also visited the National Center for Distinguished (NCD), Homs, where he was received and briefed by Dr. Hala Al Dakkak, President of the Distinction & Creative Agency, Syria.\nFederal Minister while appreciating the NCD residential model aimed at selecting & nurturing the best talent, assured that Pakistan will provide teachers in basic sciences to serve in NCD for one year in response to the request made by Dr. Hala.\nFederal Minister Rana Tanveer, accompanied by Syrian Education Minister and Governor Hama, also visited the Hama Education Platform (HEP) meant to deal with distance educational learning operations, where he witnessed live lectures being broadcasted on Syrian Education channel.\nFollowing HEP, the delegation also visited Industrial High School of Hama, which is a TVET sector training institute.\nMinister Rana Tanveer Hussain accompanied by his counterpart Syrian Education Minister also attended the launching ceremony of educational initiative “Iqra (read)” at the Basic Education School in Qatana City, Damascus.\nDuring the delegation level talks at the Ministry of Education and Ministry of Higher Education, Federal Minister, Rana Tanveer Hussain offered 80 fully funded scholarships (Undergraduate & Graduate) to Syrian side under various programs and mainly in the fields including medicine, dentistry, engineering, physical, natural & applied sciences, agriculture, education and etc.\nHe also mentioned that out 20 slots out of 80 shall be offered at Pakistan’s top ranked Quaid-e-Azam University (QAU) with preference to students from NCD, Homs.\nHe also mentioned that six months fully funded (local hospitality) research fellowships at QAU were on offer for Syrian students and faculty members.\nWhile understanding the importance of agriculture sector in both countries, Federal Minister proposed for consortium of agriculture and livestock universities between Pakistani and Syrian universities which will encourage MSc & PhD students/scholars to carry out joint research relevant to common agriculture & livestock issues of both sides.\nThe consortium will nominate faculty for exchanger visits between Pakistan & Syria as well as to provide research facilities for joint research endeavours.\nFederal Minister informed that Pakistan will be represented by Agriculture Universities in Faisalabad, Peshawar, Rawalpindi, Tandojam and Multan as well as by the University of Veterinary and Animal Sciences, Lahore.\nThe Pakistani side also offered a capacity development program for Syrian school and university teachers at the National Academy of Higher Education at HEC in various modules focusing on teachers’ development and leadership qualities for which the duration and need assessment will be agreed by both sides.\nAllama Iqbal Open University and National Curriculum Council Pakistan will collaborate with Syrian Directorate of distance learning for knowledge exchange and proposal for establishment of AIOU campus in Syria.\nFederal Minister also informed that HEC will establish Pakistani cultural corners in Syrian universities mainly located in Damascus, Aleppo, Latakia, Homs and Hama.\nSyrian side also welcomed Pakistan Education Minister proposal for establishment of Visual Arts Center by National College of Arts at Syria.\nBoth sides also agreed to send a group of 10-15 school level students to Islamabad and Damascus for 10 days to get familiarity about the education and culture of both countries.\nFederal Minister Rana Tanveer assured Syrian side of sending teachers in basic sciences to teach at NCD Hama fort one year. It was also agreed to sign a separate MoU in the field of TVET sector between NAVTTC Pakistan and Syrian side.\nSyrian side while thanking Pakistan’s Education Minister also conveyed that President of Arab Republic of Syria has approved a special program for Pakistani students and faculty to avail scholarships in various Syrian universities. Syrian will also workout for establishing a cultural center in Islamabad.\nIn order to materialize and monitor the overall engagements agreed between Pakistan and Syria, both sides agreed to form a Joint Working Group (JWG) consisting of senior officials from both sides in areas of School education, Higher education and TVET sector together with ambassador(s) of the two countries.\nThe group will meet biannually and submit its report to both sides.\nBoth sides acknowledged the efforts of Air Marshal (Retd) Saeed Muhammad Khan, ex Ambassador of Pakistan to Syria for his active role in fostering the bilateral ties between both Countries.",
  "retrievedAt": "2025-08-11T15:51:07.537Z"
}
