{
  "title": "PM promises to revolutionize health sector",
  "link": "https://www.app.com.pk/national/pm-promises-to-revolutionize-health-sector/",
  "date_published": "2020-02-15T08:41:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 15 (APP):Prime Minister Imran Khan Saturday said that the government was committed to revolutionize health sector in the country and the decision to waive off customs duty on import of medical equipment was a step to achieve the goal.\nAddressing Insaaf Health Card distribution ceremony at the Governor’s House here, he said the duty-free import of medical equipments would encourage hospitals to provide better health facilities to the masses, adding more incentives would be given to the private sector to establish hospitals as government alone could not establish hospitals.\nThe ceremony marked the conclusion of Insaaf Health Card distribution in all 36 districts of Punjab under which 4.8 million families out of a total of 7.2 million have been handed the cards.\nA family can spend Rs 720,000 annually for medical treatment on the Insaaf Health Card.\nPrime Minister Imran Khan distributed Insaaf Health Cards under the Health Sahulat Program to the deserving families of Lahore, Gujrat and Mandi Bahauddin.\n“Distribution of Insaaf Health Cards to 7.2 million families in Punjab was a step towards emulating the ideal state of Madinah established by Last Prophet of Allah Hazrat Muhamamd (S.A.A.W.)”, the prime minister said.\nThe Prime Minister Imran Khan said illness was a catastrophe for a poor family and Insaaf Health Card would provide relief to common man to combat the diseases.\n“PTI won two-third majority in the KPK assembly in the 2018 general elections due to its health reforms and improving governance”, he said, adding that people of the province came to know for the first time about a welfare state.\nHe said the distribution of free health card in Punjab was a step towards a welfare state of Pakistan.\nThe prime minister regretted the fact that some elements in the medical community in Punjab had labeled MTI reforms in the government hospitals as privatization, adding that the government would give autonomy to the state-run hospitals to enhance their performance.\nQuality health facilities in the government hospitals were linked with their improved managements, he observed while drawing the attention of Chief Minister Punjab Sardar Usman Buzdar and Punjab Health Minister Dr. Yasmin Rashid to the fact to expedite MTI Health reforms in the province.\n“My ideal of a welfare state is based on humanity and the acceptance of responsibility by the government to help the destitute in the hour of need”, Imran Khan added.\nThe prime minister said he never claimed to make Pakistan an Asian Tiger but had always wished to turn the country into a welfare state which took care of the needs of its citizens, adding that he learnt of the welfare states and its working during his days in England where the government provided medical, social welfare and legal aid to the masses.\nHe said the plight of a poor cancer patient and his family motivated him to set up Shaukat Khanum Memorial Hospital after retirement from cricket, adding that he decided to spend life for those who were ignored by the state.\nImran Khan said “State of Madinah was not created in a day and it took time before Prophet Muhammad (PBUH) found Islamic welfare society”.\nHe accepted responsibility for the recent hike in sugar and flour prices in the country, adding that the government would hold accountable to all those involved in the hoarding of wheat and sugar. He said the government was evolving a mechanism so that such situation did not arise in future.\nOn economy, the prime minister said the government inherited a trade deficit of Rs 40 billion, adding that the country exports stood at Rs 20 billion while its imports were 60 billion rupees and the devaluation of rupee also caused further economic challenges.\nHe reiterated his optimism to turn Pakistan into a great country in the coming years. Pakistan was destined to greatness and the days were not far away when the foreigners would seek jobs in the country, he added.\n“The biggest hurdle in the way to progress is the mafia and I will defeat them”, he expressed resolve before a charged crowd of PTI workers present at the ceremony.\nThe prime minister said he had restored the respect of the green passport to a great extent.\nIn her address, Punjab Health Minister Dr. Yasmin Rashid said the Insaaf Health Cards services had started in all 36 districts of Punjab and poor people were reaping the benefits of the Prime Minister’s vision for free health facilities to all and sundry.\nShe also thanked Chief Minister Punjab Sardar Usman Khan Buzdar for his support.\nYasmin Rashid said that Insaaf Health Card facilities had been provided to all districts in the province within one year, adding that the distribution of cards had started in Rajanpur on February 24 last year.\nShe said the government had spent Rs 14 billion on the project, adding that 4.8 million cards had been distributed while cards were also given to seventy thousand disables persons as well. She said the card holder could get treatment from the designated hospitals for heart, kidney, and other ailments.\nDr. Yasmin Rashid said 28,000 new jobs had been given in the health department under the Punjab Public Service Commission.\nShe said the distribution of rest of the cards in Lahore district would complete by the end of March this year.\nIn his address, Chief Minister Punjab Sardar Usman Khan Buzdar said the journey which started from Rajanpur had come to fruition with the distribution of health cards in Lahore, Gujrat and Mandi Bahauddin districts.\nHe said 139,000 Insaaf Health cards had been distributed to the deserving families in Gujrat, 46,300 in Mandi Bahauddin and 511,000 health cards in Lahore today. He said the health cards would provide free health facilities to the people from all section of the society.\nHe said 2 new hospitals including Punjab Institute of Blood Diseases and Bone marrow Transplant Center and Punjab Institute of Cardiology II would be built in Lahore, adding that no new hospitals were established in Lahore during the last 30 years.\nHe said Children Hospital and Sir Ganga Ram Hospitals were also being upgraded, adding that a state of the art Emergency Center would be established in the Services Hospital Lahore.\nGovernor Punjab Chaudhry Muhamamd Sarwar, provincial Ministers Mian Mehmood ur Rasheed, Fayaz ul Hassan Chohan, Mian Aslam Iqbal, Ijaz Alam Augustine, President PTI Punjab Ijaz Chaudhry, PTI leadership, Chief Secretary Punjab, government functionaries, lawyers, journalist and large number of PTI office-bearers and party workers attended the Insaaf Health Card ceremony.",
  "retrievedAt": "2025-08-11T18:48:07.090Z"
}
