{
  "title": "AJK President concludes Malaysia visit on high note",
  "link": "https://www.app.com.pk/national/ajk-president-concludes-malaysia-visit-on-high-note/",
  "date_published": "2020-02-14T22:48:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Feb 15 (APP):Azad Jammu and Kashmir President Sardar Masood Khan Saturday thanked Malaysian Prime Minister Dr. Mahathir Muhammad for his principled and courageous stand on the Jammu and Kashmir issue and his call for the implementation of the UN Security Council resolutions to give the Kashmiris their democratic right to determine their own political future.\nThe President also thanked the Malaysian Parliament for establishing a Friends of Kashmir Group.\n“We hope that this will lead to the establishment of a Caucus on Kashmir in the Malaysian Parliament”, he said.\nMasood Khan conveyed these messages to the top leadership of Malaysia during his meetings with Deputy Prime Minister Wan Azizah binti Wan Ismail, Foreign Minister Saifuddin Abdullah, Health Minster Dr. Dzulkefly Ahmad and State Minister for Industry, Trade and Investment Datuk Mohd Rafiq, AJK Presidential secretariat said in a statement released to the media.\nPresident Masood Khan said that the people of Jammu and Kashmir wanted the realization of their right to self-determination recognized and pledged to them by the UN Security Council.\nThey do not want a confrontation or war or endless strife.\nHe told his interlocutors that Kashmiris had been subjected to brutalities for the past 72 years, including killings, massacres, blinding, rape and disappearances; but since August 5, 2019, the entire territory of Indian Occupied Jammu and Kashmir (IOJK) was under a relentless occupation lockdown and communication blockade.\n“The people and the land are both under punitive, imperialistic siege”, he said, adding that in this dark hour of Kashmir’s history, the leadership and people of Malaysia have stood by Kashmiris and had demanded an end to occupation of the territory and repression taking place there.\n“I salute Malaysia for not yielding to immense Indian pressure to retract its position on Kashmir. The Malaysian example clearly shows that nations have to bear costs for upholding norms of justice and protection of human rights of people living under foreign occupation and alien domination”, he said.\nThe President also sought the guidance of the Malaysian leadership for resolving the Jammu and Kashmir dispute through peaceful and diplomatic means while keeping the UN SC resolutions intact as the starting point of any negotiations on the issue.\nMasood Khan underlined that the people of Pakistan and Jammu and Kashmiri were keen to learn from the experience of ASEAN which had invested time, energy and political will in confidence building measures and conflict resolution mechanisms to resolve amicably the Association’s internal problems and its issues with neighbouring countries.\nThe AJK President said that because of MAPIM leader Haji Mohd Azmi Abdul Hamid’s three visits to Azad Kashmir, in the recent past, new avenues are being explored to cement Malaysia- Kashmir ties.\nDuring a visit to the MAPIM headquarters, he thanked Haji Mohd Azmi for bringing Malaysian and ASEAN parliamentarians and representatives of civil society organizations to Muzaffarabad.\nElaborate plans, he said, had been made by the two sides to establish a Malaysia-Kashmir Cultural Centre in Muzaffarabad later this year.\nBesides, MAPIM would be donating ambulances to the AJK government as a goodwill gesture.\nHe also thanked MAPIM for launching the Malaysian Kashmir Youth Movement under its banner.\nSuhail Qamaruddin is its President and State Minister Rafiq its Patron.\nPresident Masood Khan said that AJK was keen to receive, facilitate and host Malaysian tourists in all parts of the liberated State which is also a “paradise on earth” because of its alpine beauty and stunning landscapes.\nIn addition, Azad Kashmir and Malaysia can collaborate in the areas of extraction of precious and semi-precious stones, halal food, SMEs and the trade sector.\nThe Malaysian telecommunications enterprises could also help in building telecom infrastructures in AJK.\nAzad Kashmir, he said, is also keen to attract Malaysian investment in industrial and agricultural sectors and would promote exchanges of faculty and students of higher learning institutions.\nDuring his visit to Malaysia, President Masood Khan also addressed a gathering of over 200 students of the prestigious University of Kuala Lumpur which specializes in natural sciences and new technologies.\nAfter his meeting with the Malaysian Foreign Minister Saifuddin Abdullah, he also addressed, at the Foreign Ministry premises, members of the International Relations Committee of the Malaysian Youth Parliament as well as the Malaysian Youth Council. After explaining the plight of the Kashmiris living in IOJK, the President said that the Malaysian youth can play an important role in creating awareness about ongoing genocide in IOJK, mobilize international opinion for putting an end to repression in IOJK and help create an enabling environment for the restoration and exercise of the fundamental rights of the Kashmiris including their right to self-determination.\nPresident Masood appealed to the Malaysian youth to communicate to the world forums, including the UN and influential parliaments, to stress the need for an end to the lockdown and repression in IOJK, the reversal of the illegal steps taken on August 5 by India and stop land grab in the occupied territory. The Malaysian youth, he said, has already created a platform for working with the global civil society, including the Indian civil society, to mould world opinion for the expeditious resolution of the Jammu and Kashmir dispute.\nPresident Masood Khan also addressed an interactive seminar at the MAPIM headquarters which was attended by representatives from Palestine, Syria, Turkey, Bangladesh, Indian community and Malaysian women organizations, among others.\nThey all expressed their resolve to accelerate their endeavours for saving Kashmiris from the scourge of genocide and make humanitarian interventions. They emphasized that the Bharatiya Janata Party and the Rashtriya Swayamsevak Sangh should not be allowed to “copycat” and replicate the pattern of occupation and legalization of illicit settlements in the West Bank and present this as a fait accompli to the people of Jammu and Kashmir who are the owners of their land and territory.\nPresident Masood Khan on the occasion said that Kashmir was an international issue and would require an international coalition to save Kashmiris from total annihilation. “To crush the will of the Kashmiris seems to be a part of a global pattern; the response, therefore, should also be at the global level”, he said.",
  "retrievedAt": "2025-08-11T18:48:12.445Z"
}
