{
  "title": "FAO, Ehsaas explore options to drive forward progressive agriculture and nutrition agenda",
  "link": "https://www.app.com.pk/national/fao-ehsaas-explore-options-to-drive-forward-progressive-agriculture-and-nutrition-agenda/",
  "date_published": "2020-02-15T00:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar in a meeting with a delegation of Food and Agriculture Organization (FAO) led by Director-General FAO, Qu Dongyu explored collaborations for Ehsaas, the Prime Minister’s flagship poverty alleviation programme.\nThis was Dongyu’s first official visit to any country in Asia. The meeting discussed avenues of cooperation to drive forward the progressive agriculture and nutrition agenda and working closely to deliver to the small farmers and disadvantaged people in rural areas of Pakistan.\nPoverty in Pakistan is closely linked to agriculture as our country is being faced with several agricultural issues predominantly small landholdings, subsistence farming and exploitation by extractive middlemen and monopolies which are major contributors to poverty.\nHence, Ehsaas has been designed to promote equalities, which amongst other things stands on Jobs and Livelihoods of which agriculture is a core element.\nIn her opening statement, Dr. Nishtar stated, ‘This is an opportune time that FAO has come to the table with Ehsaas.\nThe government realizes that in our agriculture-based economy, tackling agriculture is fundamental to poverty reduction since the sector employs 43.5% of labour force and contributes to around 21% of our GDP.’\nAdding further, she said, ‘With the convening of ‘Ehsaas Development Partners’ Forum’, ‘Ehsaas Rural Value Chain Building Committee’ and ‘Pakistan National Nutrition Coordination Council’, Ehsaas is fully determined to change the landscape of poverty in the country through a multisectoral approach by capitalizing on FAO’s technical expertise and strategic advice in a well-coordinated manner across agriculture, food and nutrition.’\nAcknowledging the multisectoral construct of Ehsaas, Dongyu said, ‘FAO looks forward to partner with the Ehsaas particularly in endeavours around food security and agriculture development to support vulnerable farmers and is excited to explore new collaborations on the road ahead’.\nHe continued, “In line with Ehsaas vision, FAO will extend technical assistance in food and agriculture to benefit the vulnerable and small farmers.\nFAO and Ehsaas can together help communities reach their full potential by tackling the social and agricultural determinants of poverty, through sustainable agriculture, food and nutrition programmes”.\nThe FAO is part of Ehsaas Value Chain Building Committee, which comprises of diverse stakeholders exploring how to most effectively shape a value chain building policy to address challenges faced by farmers in rural areas of Pakistan.\nThe FAO is also a member of Ehsaas Development Partnership Group, which provides integrated, coherent and aligned technical support to the Government of Pakistan for the implementation of Ehsaas strategy.\nIn 2018, FAO launched its five-year Country Programming Framework (CPF) in Pakistan, underscoring three high-priority development collaborations, including zero hunger, climate smart resilient agriculture and sustainable ecosystems, and inclusive and efficient agriculture and food systems.",
  "retrievedAt": "2025-08-11T18:48:12.694Z"
}
