{
  "article_id": "2025-09-01_c558c2ea6f95ea6c8082b79052b31f53",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fresh-wave-of-exceptionally-high-flood-likely-in-rivers-sutlej-beas-ravi-chenab-ffc/",
    "retrieved_at": "2025-09-06T10:45:28.632Z"
  },
  "metadata": {
    "title": "Fresh wave of exceptionally high flood likely in rivers Sutlej, Beas, Ravi, Chenab: FFC",
    "author": null,
    "date_published": "2025-09-01T17:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 383,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 01 (APP):The Federal Flood Commission (FFC) has said that a fresh flood wave of exceptionally high flood is likely to start in river Sutlej, Beas, Ravi and Chenab during the next 72 hours. According to daily FFC report on Monday, very high to exceptionally high flows (subject to releases from Indian reservoirs) in rivers Sutlej, Ravi, and Chenab along with the associated nullahs of rivers Ravi and Chenab from Tuesday (Sept 2 to 4 (then continue downstream onwards). Urban flooding in Lahore, Gujranwala and Gujrat Divisions is also expected during the said period. Exceptionally high flood will continue in river Sutlej at Ganda Singh Wala. River Chenab at Panjnad is expected to attain very high to exceptionally high flood during 4th to 5th September 2025 while River Indus at Guddu is expected to attain very high flood during 6th to 7th September 2025. For the next 24 hours Flood Forecasting Division (FFD) Lahore has predicted scattered to widespread thunderstorm/rain with scattered heavy to very heavy falls with isolated extremely heavy falls over Punjab (Gujranwala and Lahore Divisions) including upper catchments of rivers Sutlej, Beas and Ravi. Scattered thunderstorm/rain with isolated heavy falls may also occur over the upper catchments of river Chenab along with Islamabad, Rawalpindi and Gujrat Divisions during the same period besides, isolated thunderstorm/rain over upper catchments of rivers Indus and Jhelum along with Khyber Pakhtunkhwa (Peshawar, Kohat, Bannu & DI Khan Divisions) and Punjab (DG Khan, Multan, Faisalabad, Sargodha, Sahiwal and Bahawalpur Divisions). For the next 72 hours (1st to 3rd September 2025) widespread heavy to very heavy rainfall, along with torrential downpours at scattered locations, is expected over the upper catchments of rivers Sutlej & Beas (Upstream of Ganda Singh Wala), Ravi, and Chenab, as well as in Lahore and Gujranwala Divisions. Scattered thunderstorm rain with heavy to very heavy rainfall is also expected in the upper catchments of river Jhelum and Gujrat Division during the said period. Tarbela Dam is at its Maximum Conservation Level (MCL) of 1550 feet since August 27, 2025. Mangla Reservoir stands at 1225.90 feet which is 16.10 feet below its MCL of 1242 feet. The combined live storage of Tarbela, Chashma and Mangla reservoirs stands at 12.023 MAF, which is 90.29% of the total available live storage capacity of 13.316 MAF.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}