{
  "article_id": "2025-09-01_8c4337bec8da10a4eab986d749954718",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-health-minister-launches-anti-polio-campaign/",
    "retrieved_at": "2025-09-06T10:46:41.114Z"
  },
  "metadata": {
    "title": "Federal Health minister launches anti-polio campaign",
    "author": null,
    "date_published": "2025-09-01T13:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KARACHI, Sep 01 (APP):Federal Minister for National Health Services, Regulations and Coordination Syed Mustafa Kamal on Monday launched a National Anti-Polio Campaign at Sohrab Goth, to protect millions of children under the age of five from the virus. While addressing the anti-polio launching ceremony, he underscored that the polio vaccine is safe, effective, and vital for saving the lives of children. He further said that misconceptions portraying it as harmful or religiously prohibited were inaccurate. The Minister emphasized that polio workers have been directed to request cooperation respectfully, while law enforcement agencies will be present only for the security of vaccination teams. The Minister pointed out that coercion strengthens negative perceptions and undermines the campaign. Kamal cautioned that refusals remained a pressing challenge. He urged the members of the National and Provincial Assemblies to engage with communities patiently and constructively. He emphasized that better communication, respectful dialogue, and trust-building are essential, and that the campaign must rely on persuasion rather than pressure. It was also stated that significant development work had been carried out in Sohrab Goth and along the Super Highway to resolve long-standing grievances of citizens. Thousands of people who had suffered previously are now benefitting from improved infrastructure, while hospitals and graveyards have also been established to meet essential community needs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}