{
  "article_id": "2025-09-01_b25808b0bcd41b20235036bf0603cb18",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-launch-national-culture-policy-to-revive-heritage-project-soft-image/",
    "retrieved_at": "2025-09-06T10:44:40.924Z"
  },
  "metadata": {
    "title": "Pakistan to launch National Culture Policy to revive heritage, project soft image",
    "author": null,
    "date_published": "2025-09-01T10:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 314,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 01 (APP):Pakistan will soon launch a National Culture Policy aimed at reviving its heritage, strengthening the creative sector, and projecting a positive image abroad, This was stated by the Federal Minister for National Heritage and Culture, Aurangzeb Khan Khichi in an interview with APP. He said the policy has been framed through consultation with provinces, writers, artists, and cultural experts, and will provide institutional backing to neglected cultural and literary communities. \"For too long, culture has been ignored. This policy is a national commitment to our identity and creativity,\" Khichi remarked. The minister emphasized that the initiative is designed to counter negative narratives and highlight Pakistan's civilizational legacy, including sites such as Mehrgarh, Harappa, Mohenjodaro, and Taxila. Outlining international engagement, Khichi said Pakistan has cultural cooperation agreements with 86 countries and is working to expand that number to 125. Participation in this year's Lok Mela is also expected to double, with 12 foreign countries setting up pavilions. To boost heritage tourism, the government is establishing a Buddhist Cultural and Information Center at Lok Virsa, Islamabad, and upgrading facilities at key sites including Shah Allah Ditta Caves. Provinces have also been asked to improve infrastructure at Buddhist sites to facilitate international visitors. Khichi further disclosed that Pakistan has submitted four nominations to UNESCO for the World Heritage List, the first since 1998. Parallel efforts are underway to digitize the National Library, Pakistan Academy of Letters, and archaeological records to preserve heritage and expand global access. He added that Pakistan's first degree-awarding institution in the arts will be launched by year-end to support students seeking international recognition. Meanwhile, PNCA has begun offering exhibition space to young artists at minimal cost, while Lok Virsa has started art classes for wider public participation. \"The National Culture Policy will allow Pakistan to tell its real story-of history, creativity, and a civilization rooted in peace,\" the minister concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}