{
  "title": "0.5 mln women suffering from blindness in Pakistan: Al Shifa Trust",
  "link": "https://www.app.com.pk/national/0-5-mln-women-suffering-from-blindness-in-pakistan-al-shifa-trust/",
  "date_published": "2024-06-27T09:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 27 (APP):The prevalence of blindness and vision impairment is higher in females than males while presently almost half a million women in Pakistan are suffering from blindness and vision impairment, said Brig. (R) Prof. Dr. Sabihuddin, Head of the Cataract Department at Al-Shifa Trust Eye Hospital here Thursday.\nIn a ceremony to celebrate June as Cataract Awareness Month, Dr. Sabihuddin informed that Al Shifa Trust(AST) annually performs 52 thousand surgeries free of charge.\nHe said that there are around 2.2 billion blind or visually impaired people in the world and the complication may have been avoided in at least 1 billion of these cases.\nVision impairment is four times higher in low- and middle-income ranges compared to high-income areas while according to WHO estimates, vision impairment results in an annual global productivity loss of $411 billion, posing a significant financial burden.\nDr Sabihuddin urged the government to set up more facilities to deal with the influx of eye patients.\nHe noted that with the rising population and an increase in average age, the number of cataract patients is increasing in the country, and a large number of women have blindness having no access to eye facilities.\nAccording to Dr. Sabihuddin, Pakistan is one of the top countries with diabetes patients resulting high rate of eye disease.\nHe said cataracts are age-related degeneration and cannot be controlled, however, government should strengthen the eye departments in all state-run hospitals, including those established at the district level.\nHe informed that AST performs almost 100 to 120 surgeries daily and has thirty air-conditioned operation theatres, twenty-five expert doctors, six anaesthetists, and state-of-the-art diagnostic facilities.\nDr Sabihuddin stated that the outreach program frequently organizes surgical camps in remote areas, conducting almost 100 surgeries daily.\n“We have the best facilities and expert doctors to treat the complicated cases,” he said, adding that ophthalmology and cataract surgery are the largest departments of the hospital, providing specialized care to patients with different conditions.\nDr. Sabihuddin said AST has all the latest technologies and expertise, and trust hospitals in Sukkur, Kohat, Muzaffarabad, and Chakwal are performing 52 thousand cataract surgeries annually free of charge.\nHe added that the Cataract Department has completed one million surgeries since its founding.\nThe Resource Generation and Communication Department of AST and Cataract Surgery and General Ophthalmology Department organized an activity in which students from the School of Public Health and Department of Optometry, Pakistan Institute of Ophthalmology, AST staff members and media persons participated.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:31:58.453Z"
}
