{
  "title": "ECP to conduct LB elections in Punjab, Islamabad peacefully",
  "link": "https://www.app.com.pk/national/ecp-to-conduct-lb-elections-in-punjab-islamabad-peacefully/",
  "date_published": "2024-06-27T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 27 (APP): The Election Commission of Pakistan (ECP) here on Thursday held a high-level meeting regarding the holding of local body elections in Punjab and Islamabad. Chaired by Chief Election Commissioner Sikandar Sultan Raja, the meeting was attended by Federal Secretary for Interior, Chief Commissioner Islamabad, Chief Secretary Punjab, Secretary Local Government of Punjab and Secretary Election Commission of Pakistan and other senior officials, said a press release.\nChief Election Commissioner Sikandar Sultan Raja said that it was the constitutional and legal responsibility of the ECP to conduct local bodies’ elections in Punjab province and the federal capital.\nHe said that the ECP was fully prepared to conduct local body elections in Islamabad and Punjab province in peaceful manner.\nThe Commission issued strict instructions and directed that all constitutional and legal requirements regarding the holding of local government elections in Punjab and Islamabad should be fulfilled as soon as possible so that the ECP could take immediate action to ensure the holding of local government elections.\nEarlier, Federal Secretary for Interior Khurram Ali Agha and Chief Commissioner Islamabad Mohammad Ali Randhawa told the Commission that the summary regarding the conducting local bodies elections in the federal capital and the notification of specific seats of the Metropolitan Corporation had been sent to the Prime Minister’s office.\nThe amendment required in Section 17 of the ICT Local Government Act, 2017 has already been approved by the Cabinet Committee for Disposal of Legislative Cases (CCLC).\nChief Secretary Punjab Zahid Akhtar Zaman and Local Government of Punjab Mian Shakeel Ahmed told the Commission that the new government of Punjab had made the necessary amendments in the Punjab Local Government Act 2022 and the preparation of the new draft law regarding the holding of local government elections in the province.\nThe local government formed a high-level committee headed by Zeeshan Rafiq which held its five meetings and the recommendations of the Committee will be submitted to the provincial cabinet in the next few days. Along with this, the results of the new census will be revealed. Work has also started on new constituencies, delimitation of local areas, redistributions of the number of members in the councils, he told.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:30:50.349Z"
}
