{
  "title": "Govt to table resolution in NA to counter US resolution on Pakistan: Dar",
  "link": "https://www.app.com.pk/national/govt-to-table-resolution-in-na-to-counter-us-resolution-on-pakistan-dar/",
  "date_published": "2024-06-27T10:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 27 (APP): Deputy Prime Minister and Foreign Minister Muhammad Ishaq Dar informed the National Assembly on Thursday that the government would bring a resolution in the House to counter the resolution passed by the US House of Representatives on June 25.\nWinding up the discussion on a cut motions, he said, “The government has taken note of the resolution passed by the US House of Representatives on Pakistan. We will also pass a resolution in response to the US’s resolution, and the draft resolution will be shared with the opposition and treasury benches.”\nHe said, “We must show our sovereignty and unity. We must show we mean business… I will request all to come together and present a clear resolution in response to the US resolution.”\nThe deputy prime minister also read out a statement earlier issued by the Foreign Office saying, “Pakistan has taken note of the passage of House Resolution 901 by the US House of Representatives on June 25. We believe that the timing and context of this particular resolution do not align well with the positive dynamics of our bilateral ties and stem from an incomplete understanding of the political situation and electoral process in Pakistan. Pakistan, as the world’s second-largest parliamentary democracy and fifth-largest democracy overall, is committed to the values of constitutionalism, human rights, and the rule of law in pursuance of our own national interest.”\nHe said that Pakistan believed in constructive dialogue and engagement based on mutual respect and understanding. Such resolutions, he noted, were neither constructive nor objective.\n“We hope that the US Congress will play a supportive role in strengthening Pakistan-US ties and focus on avenues of mutual collaboration that benefit both our peoples and countries,” he added.\nDar highlighted that Prime Minister Shehbaz Sharif’s government was actively addressing the issue of Palestine, making clear Pakistan’s stance on the matter.\nHe said that Pakistan had boldly condemned the situation in Palestine at the OIC, demanded an end to the war, removal of obstacles to humanitarian assistance, a ceasefire based on pre-1967 borders, and that Al-Quds should be the capital of Palestine.\nThe Palestine issue has also been raised at the G-8 foreign ministers’ summit in Turkey and at Heads of State Summit held in Oman.\nThe deputy prime minister said, Pakistan had dispatched 24,000 metric tons of humanitarian goods to Palestine, with more aid in the pipeline. Regarding the Kashmir issue, he said that it had been raised at the OIC, and a Contact Group on Kashmir meeting was also held.\nHe thanked friendly countries for their support on the matter.  He said that due to Pakistan’s lobbying efforts, the OIC had appointed a permanent envoy on Islamophobia for the first time.\nThe deputy prime minister rejected the impression that Pakistan faced isolation at the international level, pointing out that Pakistan had been elected as a non-permanent member of the UN Security Council by securing 182 votes out of 187, which showed the confidence of the international community in Pakistan.\nPakistan would use this important forum to highlight important issues including Palestine and Kashmir, he added. About Pakistan-China relations, he said that China was a best friend of Pakistan, and during the recent visit, Prime Minister Shehbaz Sharif revived and upgraded the China-Pakistan Economic Corridor (CPEC).\nRelations with Afghanistan were also on the priority agenda of the government and Pakistan being in contact with Afghanistan and working out dates for a visit to Kabul, he said, adding “We want a strong and peaceful Afghanistan.”\nPakistan would cooperate with Afghanistan in eradicating polio, he said. Dar said that the government was pursuing economic diplomacy as a way forward to put the country on a growth trajectory.\nHe said Pakistan had the potential to come out of the difficult economic situation. The deputy prime minister said that the Special Investment Facilitation Council (SIFC) had been established to create a one-window operation for investors.\nHe said that Pakistan had the potential to overcome its difficult economic situation. The issue of students in Kyrgyzstan had been resolved amicably, he added.\nWelcoming the idea of discussing foreign policy in the House, he said, “We are ready to share with the opposition the foreign policy of the government led by Prime Minister Shehbaz Sharif.”\nHe also supported the idea of giving overseas Pakistanis the right to vote, suggesting amendments to the constitution to provide representation for overseas Pakistanis in both houses.",
  "retrievedAt": "2025-08-11T03:31:19.237Z"
}
