{
  "title": "Media, humanitarian organizations’ close collaboration sought to improve disaster response, community resilience",
  "link": "https://www.app.com.pk/national/media-humanitarian-organizations-close-collaboration-sought-to-improve-disaster-response-community-resilience/",
  "date_published": "2024-06-27T17:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 27 (APP):The Secours Islamique France (SIF) and journalists on Thursday developed consensus on the need for closer collaboration between media and humanitarian organizations to improve disaster response and build resilience in Pakistan’s most vulnerable communities.\nThe Secours Islamique France (SIF) Pakistan Mission organized a successful Media Meetup, bringing together media professionals and representatives to discuss the crucial role of media in disaster reporting and response. The event aimed to strengthen partnerships between media and non-governmental organisations (NGOs) for better disaster response in Pakistan.\nOn the occasion Head of Mission, SIF-Pakistan, Altaf Abro said the 2010, 2022 and 2023 floods revealed a recurrent phenomenon of climate change-driven natural disasters aggravated by anthropogenic activities.\nHe said the role of media in influencing policy and decision making was critical that was helpful in expanding outreach to other beneficiaries.\n“Our activities are vast but no ripple effects being created out of it and therefore media collaboration is important to mobilize stakeholders to enhance community resilience,” he added.\nManager Operations, SIF-Pakistan, Feroza Zahra briefed the participants about the working and scope of SIF interventions in the areas of food security, poverty, WASH, climate change, disaster risk reduction, child welfare, shelter, gender equity, inclusion and environment protection.\nDifferent documentaries and pictorials on the work of SIF were also showcased on the occasion.\nThe participants discussed increased cooperation between media and NGOs for enhanced disaster reporting and response, media’s role in policy shaping and collaboration for greater visibility and beneficiary reach, accessibility issues in remote areas, including Balochistan, need for pre-disaster reporting and training reporters in disaster journalism, data sharing and validation, risk area identification and support for climate-hit communities.\nThey also agreed to improving coordination between media and NGOs, enhancing pre-disaster awareness and reporting, validating and sharing data responsibly, conducting training and simulation exercises for journalists and ensuring inclusive and meaningful project implementations in vulnerable areas.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:31:08.461Z"
}
