{
  "title": "Smog to persist in major cities as weather conditions worsen in Nov, Dec: NDMA",
  "link": "https://www.app.com.pk/national/smog-to-persist-in-major-cities-as-weather-conditions-worsen-in-nov-dec-ndma/",
  "date_published": "2024-11-12T07:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):Smog conditions are expected to persist across urban centers in Punjab, Khyber Pakhtunkhwa, including Lahore, Faisalabad, Multan, Bahawalpur, Peshawar, Mardan, and Nowshera, throughout November and December due to high humidity, low wind speeds, and upper atmospheric pressure.\nIn an advisory on Tuesday, the National Disaster Management Authority (NDMA) urged the public to take necessary precautions.\nThe advisory highlights the rising smog levels in the affected areas, driven by the current weather conditions, and advises residents to avoid prolonged outdoor exposure and adopt protective measures to safeguard their health.\nThe advisory states that the National Emergency Operation Centre has been monitoring the current smog situation in Pakistan and surrounding regions.\nAccording to the advisory, the team has access to advanced ground-based and space-based monitoring tools, enabling the analysis and projection of pollution emissions from various sources, including industry, transportation, and agriculture.\nThis includes emissions from stubble burning, volatile organic compounds, nitrogen oxides, surface-level ozone, and particulate matter like PM10 and PM 2.5. By analyzing aerosol optical depth data, the team is identifying hotspots heavily impacted by smog.\nThe NDMA advisory recommends several measures to mitigate the effects of smog, such as avoiding unnecessary outdoor exposure during peak smog hours, especially in the morning, and wearing masks during outdoor activities.\nStaying hydrated, using dehumidifiers and air purifiers to improve indoor air quality, and adopting efficient transportation methods—like carpooling and eco-friendly driving, along with using COx and NOx filters—are also advised.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:15:20.463Z"
}
