{
  "title": "ECP establishes Monitoring Centers to handle LG by-election complaints",
  "link": "https://www.app.com.pk/national/ecp-establishes-monitoring-centers-to-handle-lg-by-election-complaints/",
  "date_published": "2024-11-12T11:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):Election Commission of Pakistan (ECP) has set up Election Monitoring and Control Centres (EMCCs) to record and address public complaints during the local government by-elections in Sindh and provincial assembly by election in Balochistan scheduled for November 14.\nECP spokesperson said that EMCCs will be set up at four levels—provincial, divisional, district, and at the ECP Secretariat in Islamabad—to efficiently manage complaints specific to each region.\nThe centers will promptly address complaints related to the by election process in the by-elections being held in PB-8 Sibbi and several constituencies in Sindh.\nTrained staff have been deployed in the center to ensure continuous monitoring of social and electronic media, as well as the prompt resolution of complaints.\nThe spokesperson encouraged individuals to submit their complaints about the LG by-elections to the EMCC by emailing complaints@ecp.gov.pk. Complaints can also be filed through a 24/7 helpline at 051-111-327-000 for added convenience. The control center is equipped with monitoring capabilities for both social media and electronic media. Moreover, complaints can be lodged via fax at 051-9204404.\nThis multi-tiered approach ensures efficient complaint resolution and offers accessible support to the public. The ECP is dedicated to upholding the integrity of the electoral process and promptly addressing any concerns.\nComplaints can be submitted at EMCCs on November 13 from 8 AM to 5 PM. Starting November 14, the control rooms will continue coordinating with relevant personnel and stakeholders, staying operational until the electoral process is complete.\nThe media is reminded that they may broadcast provisional results only one hour after polling ends, clearly labeling them as provisional and unofficial. The commission warns that violations will result in strict legal action.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:14:57.052Z"
}
