{
  "title": "Khalid Maqbool for opening of top 12 university’s campuses in Karachi",
  "link": "https://www.app.com.pk/national/khalid-maqbool-for-opening-of-top-12-universitys-campuses-in-karachi/",
  "date_published": "2024-11-12T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):Federal Minister for Education and Professional Training, Dr Khalid Maqbool Siddiqui has said that campuses of over 12 prominent universities from across Pakistan, currently without chapters in Karachi, would soon be launching campuses in the commercial hub of Pakistan.\nDr Khalid Maqbool Siddiqui highly appreciated the efforts of Vice Chancellor Pakistan Institute of Fashion & Design (PIFD) Professor Hina Tayyab Khalil and her entire team, in the success of the PIFD.\nHe welcomed PIFD’s arrival in Karachi and said the PIFD’s Karachi Chapter would be operational soon and we are going to witness a new era through the launching of campuses of prominent education institutes in the port city.\nThe minister emphasized that the government’s recent initiatives reflect Pakistan’s commitment to progress, especially in making quality education accessible across the country.\n“Pakistan is on the right path toward development, and the launching of campuses of more educational institutions in Karachi highlights our nation’s dedication to fostering knowledge and learning,” remarked Dr Siddiqui.\nHe also underscored that humbleness is a true reflection of education, inspiring students to uphold this value.\nDr. Siddiqui applauded Professor Hina Tayyab Khalil, for her hard work in establishing PIFD’s Karachi campus, which is set to become operational by February 2025.\nHe recognized her efforts in expanding PIFD’s impact and offering local students increased access to specialized fashion and design education.\nSpeaking on the occasion, Sindh Governor, Kamran Khan Tessori said that Pakistan is going to achieve more economic stability. We all have to make joint efforts to make the country stronger and economically stable, he added.\nIn his address Chairman of the Higher Education Commission Prof Mukhtar Ahmed expressed his full support and cooperation to the PIFD. The society also needs the education of arts and fashion, he added.\nEarlier, Vice Chancellor PIFD Professor Hina Tayyab Khalil presented an introduction and achievements of PIFD.\nIn the end, Dr Khalid Maqbool Siddiqui was presented with a souvenir as a token of appreciation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:14:55.772Z"
}
