{
  "title": "World Science Day for Peace and Development marked",
  "link": "https://www.app.com.pk/national/world-science-day-for-peace-and-development-marked/",
  "date_published": "2024-11-12T15:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 12 (APP):Pakistan Science Foundation (PSF) in collaboration with UNESCO and other partners organized an event to mark World Science Day for Peace and Development through raising awareness about the critical role of science in modern society and its impact on addressing contemporary global challenges.\nThe event was organized on Tuesday with the support of the Economic Cooperation Organization Science Foundation (ECOSF) and the Pakistan Academy of Sciences.\nCelebrated annually since 2001, World Science Day highlights the vital role science plays in society and fosters public engagement in discussions about key scientific issues.\nThis year’s theme, “Why Science Matters – Engaging Minds and Empowering Futures,” underscores the significance of science in shaping a sustainable and inclusive future.\nThe 2024 celebration holds additional significance as it coincides with the launch of the International Decade of Sciences for Sustainable Development (2024-2033), recently declared by the United Nations General Assembly (UNGA).\nLed by UNESCO, this decade-long initiative focuses on mobilizing the global scientific community to tackle complex challenges through interdisciplinary approaches.\nIt encourages collaboration across diverse fields—from basic and applied sciences to social and human sciences, as well as emerging interdisciplinary domains. With an emphasis on resilience, equity, and environmental sustainability, the Decade supports the Sustainable Development Goals (SDGs) and a shared commitment to a safer, more prosperous world.\nThe event featured insightful remarks from Mr. Kar Hung Antony Tam, Officer-in-Charge of UNESCO Office in Pakistan, emphasizing the engagement of youth and women in science, technology and innovation; Prof. Dr. Muhammad Akram Shaikh, Member Science, PSF; Prof.\nDr. Seyed Komail Tayebi, President, ECOSF; and Dr. Aneel Salman, Oil & Gas Development Company Limited (OGDCL)- Islamabad\nPolicy Research Institute (IPRI) Chair of Economic Security at IPRI, who delivered a keynote on the pivotal role of science and technology\nin achieving a sustainable future for Pakistan.\nIn his address, Chief Guest Prof. Dr. Aslam Baig, Secretary General, Pakistan Academy of Sciences, highlighted the role of Pakistani scientists in supporting the country in the advancement of nuclear technology.\nHe also emphasized on the importance of science and technology for Pakistan’s development.\nAttendees included students, teachers, government officials, scientists, researchers, science communicators, and journalists who actively engage in the field of science.\nAs part of the day’s activities, an interactive science show for students was conducted by the Pakistan Science Club. The session focused on making science fun and accessible, aiming to ignite students’ interest in STEM (Science, Technology, Engineering, and Mathematics) fields.\nThe event was a reminder of science’s transformative potential and underscored the importance of empowering future generations to contribute to a sustainable and resilient Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:14:07.432Z"
}
