{
  "title": "President stresses upon secrecy, transparency in I-voting process",
  "link": "https://www.app.com.pk/national/president-stresses-upon-secrecy-transparency-in-i-voting-process/",
  "date_published": "2020-07-21T07:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP):President Dr. Arif Alvi Tuesday stressed that the secrecy of vote and transparency in the I-voting (internet-voting) process must be ensured while developing the electronic voting system (EVS). He further said that the system should be efficient, possessing the technical capacity to cater the large number of overseas voters on poll-day.\nHe made these remarks while chairing a meeting to review progress on the EVS, at Aiwan-e-Sadr, a press release said. The meeting was attended by the Secretary IT and Telecommunication Shoaib Ahmed Siddiqui, Secretary to President Tariq Najeeb Najmi and Chairman National Database and Registration Authority (NADRA) Usman Yousaf Mobin. Officials from the Election Commission of Pakistan and NADRA were also present.\nThe president directed that a committee of experts be formed to assess the technical capacity and reliability of the system and to propose possible solutions. The report along with recommendations would be presented before the parliament.\nHe said that I-voting system should be transparent and people should have complete confidence in it. He also highlighted the importance of maintaining voters’ secrecy, and fulfilling all the legal requirements.\nThe president was briefed about the steps being taken for establishing an effective and reliable I-Voting system for overseas Pakistanis. It was apprised that all measures were being taken for the development of a fool-proof voting system.\nThe president was also briefed about the technical efficacy, secrecy and safety aspects of the system. The EVS being developed had been pilot tested in the bye-elections, the meeting was informed, and an independent evaluation of the system would also be conducted.\nThe meeting underscored the primacy of putting the system to test prior to poll-day to detect and overcome any technical issues.",
  "retrievedAt": "2025-08-11T19:31:24.059Z"
}
