{
  "title": "Pak Embassy in Brussels honours mountaineer Paul Hegge",
  "link": "https://www.app.com.pk/national/pak-embassy-in-brussels-honours-mountaineer-paul-hegge/",
  "date_published": "2020-07-21T02:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 21 (APP):The Embassy of Pakistan in Brussels held a webinar on the National Day of Belgium to honour Paul Hegge, the first Belgian mountaineer to ever ascend K2. The 53-year-old Hegge made headlines when on July 21, 2018 he along with a group of other climbers scaled the 8611km high K2 peak, which is also known as Mount Godwin-Austen. “Climbing K2 is a big test, but it teaches you how to tackle big challenges in your life,” Hegge told the audience while narrating his experience of mounting K2, the world’s second highest peak.\n“Up to only a few years ago more than one out of four climbers attempting K2 never came back, so it is really a dangerous mountain, but [at the same time] it is also extremely beautiful. It is located in an area which is the most beautiful place for mountaineers,” he reckoned.  Hegge, who reached the summit of Gasherbrum II and Everest before climbing K2 said that technically climbing this peak was difficult as it was extremely steep and icy.\nAccording to Hegge those aspiring to climb K2 need to train harder and take great care of their preparations. He said en route to ascending K2 one had to spend more or less two months in the camping on snow. “Climbing K2 is like entering into a different sort of world where you need a tremendous amount of concentration just to stay alive. You constantly face the danger of avalanches, passing by your right and left. So it is really very very challenging.\n“But in order to tackle these challenges you need to prepare yourself from day one. The first thing is that you need to have a drive [for climbing]. Then [the second thing is that], you need to prepare step by step by learning techniques to cope with the problems you face while climbing. He said the third thing was perseverance and resilience to achieve your goal. “It is very necessary to do physical and mental exercise to do such kind of climbs.”\nLastly, he said while embarking on such expeditions it was vital to have a good team as only then could one reach his destination. He said if someone would claim to have climbed the K2 solo, he would be skeptical as this mountain could not be ascended like that.\nHegge also screened some excerpts from the 55-minute documentary, he made during the K2 expedition. The movie may scare off some people but it provides guidelines to those who dream to mount K2.\nEarlier, in his opening remarks Pakistan’s Ambassador to Brussels, Zaheer Aslam Janjua extended felicitations to the people of Belgium on their National Day. He said Pakistan and Belgium enjoyed cordial relations, since the establishment of diplomatic ties between the two countries in 1951. “Our countries are partners in bringing peace and security to our regions as well as social and economic development for our peoples.\n“We closely cooperate, both bilaterally and within the context of the European Union and the United Nations.”He said trade between the two countries and friendship between their parliaments had bolstered their ties. “We are optimistic that we will see further expansion of cooperation despite the global social and economic setbacks caused by coronavirus pandemic,” he added.  Later, a video game on scaling K2 while beating COVID- 19 was launched on the occasion.",
  "retrievedAt": "2025-08-11T19:31:27.264Z"
}
