{
  "article_id": "2025-03-02_476faa34094c29219fc6f2f49465d0fb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/hsa-starts-423-posts-recruitment-process/",
    "retrieved_at": "2025-08-27T13:16:27.488Z"
  },
  "metadata": {
    "title": "HSA starts 423 posts’ recruitment process",
    "author": null,
    "date_published": "2025-03-02T18:31:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 344,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 02 (APP):Health Services Academy (HSA) has been tasked with recruiting for 423 positions, ranging from PPS-1 to PPS-22, across 10 different public health projects. The Ministry of National Health Services, Regulations, and Coordination (NHSRC) has assigned this responsibility to ensure transparency, efficiency, and merit-based recruitment process under the Public Sector Development Program (PSDP). According to Nadeem Sajjad Kayani, Controller of Examinations and Focal Person for PSDP Projects at HSA, the academy has already successfully conducted recruitment for five major teaching hospitals in the federal capital, where over 150,000 candidates underwent screening tests in a transparent manner. Based on this success, the Ministry of Health has further strengthened its trust in HSA by assigning another large-scale recruitment task. This new recruitment drive involves conducting screening tests, psychological assessments, skill and trade tests, and other evaluation stages for 71,487 applicants. Talking to the media, Nadeem Sajjad Kayani said that on the direction of Vice-Chancellor HSA Dr Shehzad Ali Khan, the academy will conduct the recruitment process using modern technology, including Optical Mark Recognition (OMR) systems, and transparent policies. He emphasized that all testing phases will be conducted according to international standards, utilizing advanced assessment technology to eliminate any possibility of error or malpractice. The use of OMR systems will not only ensure transparency in written examinations but will also facilitate an effective evaluation of candidates' actual skills in skill and trade tests. The academy aims to ensure merit-based selection, bringing qualified and skilled professionals into public health projects. These recruitments are part of various Prime Minister public health initiatives, including the elimination of Hepatitis C, the National Health Support Project, the establishment of Jinnah Medical Complex and Research Center, diabetes prevention programs, quality medicine supply chains, community health centers, and primary healthcare facilities. The Ministry of Health and the Health Services Academy have already initiated the screening process, ensuring transparency in the recruitments. A final list of selected candidates will soon be submitted to the ministry for swift deployment of successful applicants. This initiative marks a significant milestone in strengthening Pakistan's public health system.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}