{
  "title": "Govt, ILO to forge collaborative path to enhance social justice, decent work",
  "link": "https://www.app.com.pk/national/govt-ilo-to-forge-collaborative-path-to-enhance-social-justice-decent-work/",
  "date_published": "2023-11-29T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 29 (APP): Special Assistant to the Prime Minister on Overseas Pakistanis and Human Resource Development Jawad Sohrab Malik held a meeting with Assistant Director-General & Regional Director, International Labour Organization (ILO) Ms. Chihoko Asada-Miyakawa here at the Ministry of Overseas Pakistanis on Wednesday.\nJawad Sohrab Malik reaffirmed the commitment of the Government of Pakistan to the Global Coalition for Social Justice and Accelerator on Jobs and Social Protection along with its dedication to the shared goal of ensuring Decent Work for all.\nHe emphasized the importance of collaborative efforts to achieve this objective, highlighting the need for a comprehensive approach.\nHe commended the ILO’s initiatives, particularly its efforts towards the national skills passport, said a press release.\nSAPM reiterated his commitment to supporting the scaling of this initiative and emphasized the significance of human capital development and skills training for women to address gender disparities faced by them during work.\nDuring the meeting, Ms. Chihoko Asada-Miyakawa expressed interest in assisting the Government of Pakistan in developing a national roadmap for safe, fair, and inclusive labor migration.\nRecognizing the pivotal role of labor migration in today’s globalized world, both parties underscored their commitment to creating an environment that protects the rights and well-being of workers.\nShe praised the Government of Pakistan’s dedication and stressed the importance of building robust partnerships to effectively address challenges and capitalize on opportunities in the realm of labour migration.\nReflecting the shared vision of the Government of Pakistan and the ILO, this collaborative endeavor marks a pivotal step towards fostering social justice, promoting decent work, and ensuring the well-being of workers in Pakistan.\nSAPM assured Ms. Chihoko Asada-Miyakawa of continued cooperation and joint efforts in achieving these vital objectives.",
  "retrievedAt": "2025-08-11T10:44:55.537Z"
}
