{
  "title": "Politically stable, economically strong Pakistan vital for protection of Indian minorities: Solangi",
  "link": "https://www.app.com.pk/national/politically-stable-economically-strong-pakistan-vital-for-protection-of-indian-minorities-solangi/",
  "date_published": "2023-11-29T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 29 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Wednesday said that a politically stable and economically strong Pakistan was vital for the protection of the rights of minorities in India, especially Kashmiris who had been struggling for their right to self-determination for over seven decades.\nAddressing the Kashmir seminar, jointly organised by the Friends of Kashmir and the Kashmir Media Service, he said Pakistan had always extended its moral, political and diplomatic support for the just cause of Kashmiris and would continue to do so till freedom of the occupied territory.\nHe said India was a so-called democracy where minorities were being mistreated and victimised by the majoritarian Hindu hardliners.\nHe said after the unfortunate Jaranwala incident, the Government of Pakistan expressed solidarity with the victims, but the Government of India never supported the victims of the atrocities of Hindutva brigade.\nHe said the reports by international human rights organizations, including Amnesty International, Human Rights Watch, US State Development, Reporters Without Borders and others had been exposing incidents of atrocities against the minorities in India.\nSolangi said atrocities against religious minorities were continuing in India without any check and the international community had kept silent due to certain considerations.\nThe minister said that unlike the Government of Pakistan, the Modi regime never supported the oppressed minorities of India who were continuously targeted by the extremist Hindu organisations.\nThe Indian Government had forced various social media platforms to block the Pakistani social media accounts in India, and thus tried to hide the facts and figures about plight of minorities in the country, he added.\nThe minister said despite martyrdom and injuries to thousands, and displacing tens of thousands others, the spirit of Palestinians for freedom could not be dampened and defeated.\nSolangi said Pakistan had raised its voice all over the world in support of Palestine. Despite Israeli attack on Gaza, the voice for the rights of Palestinians had strengthened worldwide, he added.",
  "retrievedAt": "2025-08-11T10:45:01.622Z"
}
