{
  "title": "BISP committed to provide financial assistance to 10 million deserving families: Dr Amjad",
  "link": "https://www.app.com.pk/national/chairperson-bisp-proposes-establishment-of-endowment-fund-for-underprivileged-families/",
  "date_published": "2023-11-29T11:39:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 29 (APP):Chairperson Benazir Income Support Program (BISP), Dr. Muhammad Amjad Saqib here Wednesday said that BISP is committed to provide financial assistance to nearly 10 million deserving families.\nWhile addressing a gathering of BISP employees at City University Mosque in Peshawar, Dr. Muhammad Amjad Saqib underscored the moral responsibility to alleviate the financial difficulties of needy families, outlining a strategic approach to lift them out of poverty.\nHighlighting BISP’s possession of authentic data for deserving families, Dr. Amjad Saqib urged philanthropists to adopt the principles of ‘Mawakat’, fostering collaboration to support underprivileged families.\nHe proposed the establishment of an endowment fund dedicated to the welfare of needy families.\nIn his address, Dr. Amjad Saqib advocated for linking children from impoverished families to technical skill areas, promoting holistic development.\nDr. Amjad Saqib also emphasized the need for dialogue with Point of Sale (POS) agents for stipend payments to ensure transparency.\nDuring his visit to BISP Tehsil Office in Peshawar, Dr. Amjad Saqib personally engaged with needy women, instructing staff to provide facilities using available resources.\nDr. Amjad Saqib urged employees to maintain cleanliness standards in offices, displaying kindness to needy women.\nEmphasizing collective responsibility, he stated, “It is our duty to make the Benazir Income Support Program an exemplary institution.”\nDr. Amjad Saqib also interacted with the students at City University Peshawar.\nHe highlighted the importance of both traditional education and practical training for holistic development.\nHe said that experience of successful individuals and professional attitude may contribute to the business growth.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:45:25.000Z"
}
