{
  "article_id": "2025-02-16_194f240cf1c2d12dce7094e4390063e3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/asas-international-school-hosts-power-play-day-2025-to-highlight-students-skills/",
    "retrieved_at": "2025-08-27T12:47:35.041Z"
  },
  "metadata": {
    "title": "ASAS International School hosts ‘Power Play Day 2025’ to highlight students’ skills",
    "author": null,
    "date_published": "2025-02-16T13:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 539,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 16 (APP):ASAS International School on Sunday hosted its \"Power Play Day 2025,\" an event designed to highlight the skills, teamwork, and physical abilities of its students through various sports, recreational activities, and extracurricular events. The event was graced by the presence of the School Director, Dr. Arshad Zia and Branch Head Saba Mubashar, said a press release. Also joining the event were distinguished guests, including Deputy Director General of Pakistan Sports Board, Syed Naveed ur Rehman, and former Member of National Assembly, Asia Nisar. These esteemed guests appreciated the hard work and enthusiasm of the students and commended the participation of children from the Inclusive Education Group. Saba Mubashar, in her opening speech, welcomed the guests and parents, stating, \"Today is a special occasion for us. Through this event, we aim to teach our children not only the value of participating in sports but also the importance of teamwork, hard work, and self-confidence. Our inclusive Education Group children have shown remarkable performances in this event, and we take pride in our unwavering commitment for making our educational environment inclusive and accessible for every child.\" ASAS International School's mission is to create an educational space where every child can excel, regardless of their background or abilities. The school firmly believed in fostering a culture of inclusion, respect for diversity, and equal opportunity. ASAS International School is the only institution in the twin cities of Islamabad and Rawalpindi that prepares children with intellectual disabilities and autism to sit in mainstream classes. Dr. Arshad Zia, in his message, said, \"Power Play Day 2025 showcased the best of our children's hard work and dedication. This event's aim is not only to promote physical sports but also to improve both the mental and physical well-being of our students. It was a moment of pride for us to see children from our Special Education Group participating in the event. We believe that events like these foster self-confidence and enhance the overall development of our students. Sports play a vital role in children's well-being, and we are delighted to witness not only our mainstream children but also our Special Education Group children actively engaging in the activities, showcasing their talents. This event proves that every child has access to opportunities for growth and success.\" Chief Guests Syed Naveed ur Rehman and Asia Nisar also shared their messages, \"We are pleased to see that ASAS International School has provided children with the opportunity to showcase their talents through physical activities. The inclusion of children with special needs in sports is a significant step forward. In today's world, where children spend much of their time on smartphones and technology, we must emphasize the importance of keeping children engaged in physical activities to maintain both their mental and physical health.\" Children from Preschool to O-Level participated enthusiastically in various games and activities, demonstrating their abilities and spirit. Power Play Day 2025 had not only promoted sports but also provided a memorable experience for the children, celebrating their hard work and enthusiasm. ASAS International School will continue to organize such events in the future to further promote sports and extracurricular activities, allowing children's physical, mental, and creative abilities to be nurtured and developed in the best possible way.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}