{
  "title": "President for practicing Islamic teachings to ensure Inter-Faith harmony, global peace",
  "link": "https://www.app.com.pk/national/president-for-practicing-islamic-teachings-to-ensure-inter-faith-harmony-global-peace/",
  "date_published": "2023-01-25T11:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP):President Dr. Arif Alvi on Wednesday called for practicing cherished principles of Islam which called upon everyone to practice one’s own religion without interfering in other’s religions.\nPracticing such principles ensures political, social, cultural, legal and religious freedoms for the followers of all religions, respecting and protecting their places of worship and allowing followers of all religions to pray in their worship places, he added.\nThe President expressed these views while addressing the opening session of the International Inter-Faith Peace Conference titled “Respect for Humanity and its Importance”, in Islamabad.\nChairman Inter-Faith Council for Peace and Harmony, Maulana Syed Muhammad Abdul Khabeer Azad, and Founder of the Community of Sant’ Egidio, Prof Dr Andrea Ricardi, also addressed the session, whereas Secretary General of the Muslim World League, Muhammad bin Abdul-Karim Al-Issa, addressed the occasion through a recorded video message.\nThe Conference was attended by the national and international scholars of different religions, and people from different walks of life.\nThe President said that all the religions of the world preached peace, security and harmony in society but unfortunately, followers of different religions forget and neglect these teachings and resort to war on the basis of vested interests, nationalism, racism, land, resources or politics.\nHe said that it was the duty of the Islamic society to protect the religious places of other religions, provide security and respect to their religious leaders and give equal rights to them under the law. He added that Muslim societies are responsible to protect the honor, dignity, life and properties of followers of all other religions.\nThe President said that religion was wrongly labelled as the reason for war as most of the wars fought in the recent history were by those countries which had the knowledge, education and information, were developed but still they fought amongst themselves and with the others on the basis of their hegemonic designs and self-serving vested interests.\nThe President said that human beings learn more from making observations from what was happening in reality around them and less from the history and academic debates and in the same manner countries and nations do not learn from their past mistakes of waging senseless wars but repeat the same mistake again and again like USA and USSR invaded Vietnam and Afghanistan and learned a bitter lesson, but soon forgot and invaded again in Afghanistan and Ukraine.\nSimilarly, he added, that jews went through harrowing experience of Holocaust but the same Jews who were victims of holocaust forgot their experience and are perpetrating cruelty and inhuman treatment on Palestinians.\nThe President condemned the abhorrent act of burning and desecration of the Holy Quran in Sweden and urged upon international community to take notice of this heinous and abhorrent act and take all necessary measures to provide justice and put in place a mechanism to prevent rehappening of such shocking acts in future.\nHe emphasized that religious sentiments of followers of all religions need to be respected and safeguarded and no one should be allowed to hurt and insult religious sentiments of the followers of other religions in the garb of freedom of expression.\nHe added that hate speech, speech inciting violence, promoting racism and bigotry should be curbed and discouraged at all forums.\nThe President called for ending discrimination in the treatment of refugees, saying that refugees should not be discriminated on the basis of their colour, race, religion, or place of origin.\nHe said that Pakistan hosted 4 million Afghan refugees for 4 decades without discrimination and imposing conditions, and the world needed to learn from Pakistan’s generosity and experiences.\nProf Dr Andrea Ricardi soeaking on the occasion appreciated Pakistan’s hosting of the Afghan refugees.\nHe said that dialogues among communities were essential for promoting peace and harmony, adding that different religions needed to coexist peacefully.\nHe said that minorities had a right to their identity as it strengthened the foundations of a nation.\nHe said that dialogue should be promoted at all levels of society and different religions should compete on promoting good and the welfare of humanity.\nHe said that war was the mother of poverty, and religions could help reduce wars, conflicts, and hatred in the world.\nSecretary General of the Muslim World League in his video message called for establishing international society based on mutual coexistence, love and humanity.\nHe said that behind the great diversity in religions and religious beliefs lay the wisdom of Allah Almighty and the people needed to learn this wisdom and live in peace and harmony together despite their differences and diversity of views.\nHe said that different religious communities needed to come together and hold dialogue on the commonalities among them instead of promoting hatred and differences.\nMaulana Abdul Khabeer Azad on the occasion called for establishing international laws preventing hate speech.\nHe said that the world had become a global village and people with different views needed to learn to live together peacefully.\nHe said that Pakistan had been a flag-bearer of love, tolerance, hospitality, and had fought against terrorism and religious extremism.\nHe said that Pakistani religious scholars had issued a unanimous religious decree against suicide attacks, terrorism and extremism.\nEarlier, the President distributed awards among the representatives of different religions for their efforts towards the promotion of peace, harmony and respect for humanity.",
  "retrievedAt": "2025-08-11T05:49:34.961Z"
}
