{
  "title": "No vengeance, otherwise entire PTI leaders would have been in jail in 9 months: Marriyum",
  "link": "https://www.app.com.pk/national/no-vengeance-otherwise-entire-pti-leaders-would-have-been-in-jail-in-9-months-marriyum/",
  "date_published": "2023-01-25T16:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Wednesday said no political victimization had been carried out during the last nine months of the coalition government as otherwise all the entire leadership of Pakistan Tehreek-e-Insaf (PTI) would have been in jail by now.\n“Some elements are trying to politicise the arrest of Chaudhary Fawad Hussain associating it with freedom of expression, but let me be clear this is not a political arrest. Rather he has been arrested in a case of hurling life threats to the ECP officials and their families,” the minister said while addressing a news conference.\nShe vehemently rejected the notion of “political revenge”. Action against Fawad was taken on a complaint lodged by the Secretary of Election Commission of Pakistan (ECP) at the Kohsar Police Station (Islamabad) for threatening the ECP officials, she maintained.\nShe reiterated that the government had not instituted any case against the PTI leaders as action against them was being taken by the institutions on account of their wrongdoings, so there was no question of political victimization.\n“No politician gets happy with the arrest of another politician as it is against the spirit of democracy,” she said, urging the media and the public to understand the “difference between a political arrest and a legal one”.\nMarriyum said it was for the people, the judiciary and other institutions to decide where to draw a line. “If (PTI Chairman)Imran Khan or his spokespersons were allowed to abuse the institutions and then let off scot free the other political parties and 220 million people of Pakistan should also be given the same privilege.”\nShe said for the past nine months the coalition government leaders had been exercising restraint over the abusive language used by the “foul-mouthed” PTI leaders and took no adverse action against them on that count.\nThe minister boasted that no bullet was fired at any journalist, nor their ribs were broken during the last nine months. On the contrary, the PTI government resorted to every step to muzzle the media’s voice.\nThe talk shows of those journalists, who criticized the PTI government, were off aired, and even the then information minister endorsed attacks on the newsmen, she added.\nMarriyum recalled that Pakistan Muslim League-Nawaz (PML-N) leader Nawaz Sharif was disqualified for having an Iqama (foreign residential permit) as part of the political victimization, but he neither abused the institutions, nor did intimidate their heads and families.\nHe (Nawaz Sharif) used to appear before the NAB (National Accountability Bureau) court on a daily basis with his daughter Maryam Nawaz, but never maligned that institution, she added.\nRecalling the misuse of the power and state resources during the “misrule of Imran Khan”, she said on his orders, NAB and the Punjab Police raided the houses of Prime Minister Shehbaz Sharif.\nShahid Khaqan Abbasi was arrested in her presence, she said, adding Imran Khan took revenge by making arrests of his political opponents without warrants.\nShe said Imran Khan’s spokespersons and ministers used to announce on TV screens prior to the arrest of his political opponents. He sent all the opposition leadership behind bars and even dragged their sisters and mothers in courts just to satisfy his ego.\nImran Khan, she said, had the audacity to name families of his political opponents in public gatherings. Maryam Nawaz was arrested twice in false cases, but she got vindicated after her acquittal from the courts.\nShe recalled that Imran Khan in his address (as prime minister) to the Pakistani community in the United States had announced that he would remove the air conditioner from the jail barrack where Nawaz Sharif was locked up.\nHe issued orders to the jail authorities that PM Shehbaz Sharif should not be given a chair in the jail, she said, adding Rana Sanaullah was also falsely implicated in the heroin case and her wife was forced to wait outside the jail who had gone there for giving diabetes medicine to his husband.\nThe then opposition leaders, she said, fought their cases in the courts and never abused the institutions and judges.On the contrary, the PTI leadership had started threatening the Election Commission when it gave a verdict against it in the prohibited funding case. They threatened the Chief Election Commissioner of dire consequences if he disqualified their leader Imran Khan.\nShe questioned the rude and intimidating behaviour of the PTI leadership against the institutions and judges. It was the PTI which launched a malicious campaign against the martyrs of Pakistan Army from its official accounts and tried to create mutiny among its rank and file, she mentioned.\nThe minister said there was a context behind such attitude of the PTI whose leader Imran Khan spared nobody and even resorted to abusive language against female judge and others.\nShe said the PML-N had submitted record of its 40 years and now it was time for Imran Khan to answer about his four-year rule. If Nawaz Sharif could face the courts so did Imran Khan.\nMarriyum said the coalition government focused on resolving the problems of people and had no interest in carrying out any political victimization. “We are striving to fix the economic mess left by the PTI government which is still hell bent on creating political instability under its unfinished agenda which is aimed at destroying the country.”\nShe said the national economy would have been growing at 10 per cent if the “project Imran” were not launched. “We have the experience, intention and visionary leadership which will take practical steps to give relief to the people,” she affirmed.",
  "retrievedAt": "2025-08-11T05:49:19.928Z"
}
