{
  "title": "Fuel price relief ‘denied’ as govt raises levy to Rs80 - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif’s government burnt the midnight oil to block about a Rs10 per litre reduction in major petroleum products — petrol and diesel — by amending the Petroleum Products (Petroleum Levy) Ordinance 1961.\n\nGovernment officials said the government was already charging the maximum permissible petroleum levy on petrol, high-speed diesel (HSD) and high-octane blending component (HOBC) at Rs70 per litre, which is why a new law was required to keep the prices unchanged at the existing level.\n\nThis was done through an amendment to the petroleum levy law and an increase in the levy to Rs80 per litre. The government has decided not to let the petroleum prices decline further, which could trigger increased demand, encourage carbon emissions and cost higher foreign exchange.\n\nIn the global market, petrol and HSD prices have dropped by about $6 and $5 per barrel, respectively, over the past two weeks. The prime minister announced that funds raised through the increase in levy would be spent on road construction in Sindh and Balochistan, apparently to ensure political support from coalition partners.\n\nThe government has also given an undertaking to the IMF to impose about Rs5 per litre carbon levy as part of the $1.3bn Resilience and Sustainability Facility with effect from July 1.\n\nPetroleum Products Ordinance amended to prevent price drop\n\nTherefore, the ex-depot petrol price has been kept unchanged at Rs254.63 per litre. Petrol is mostly used in private transport, small vehicles, rickshaws and two-wheelers and directly impacts the budget of the middle and lower-middle classes.\n\nThe ex-depot price of high-speed diesel has been kept unchanged at Rs258.64 per litre.\n\nThe government is now charging about Rs96-97 per litre on petrol and diesel as taxes.\n\nPublished in Dawn, April 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:34:45.704Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904539/fuel-price-relief-denied-as-govt-raises-levy-to-rs80",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T01:25:14.000Z"
}
