{
  "title": "Suffering of Palestinians ‘must end’, Macron tells Netanyahu - World - DAWN.COM",
  "author": null,
  "content": "• Calls for ‘opening all humanitarian aid crossings’ into besieged territory\n• Israeli PM visits Gaza, opposes establishment of Palestinian state\n\nPARIS: France’s President Emmanuel Macron told Israel’s leader during a phone call on Tuesday that the suffering of Gazan civilians “must end” and that only a ceasefire in Gaza could free remaining Israeli prisoners.\n\n“The ordeal the civilian populations of Gaza are going through must end,” Macron posted on X after the call with Prime Minister Benjamin Netanyahu.\n\nHe also called for “opening all humanitarian aid crossings” into the besieged Palestinian territory.\n\nThe United Nation has warned that Gaza’s humanitarian crisis is spiralling out of control, with no aid having entered the territory for weeks.\n\nPalestinian group Hamas said on Monday that Israel had offered a 45-day ceasefire if it releases half of the remaining prisoners held in Gaza. A Hamas official told AFP that Israel had also demanded that the Palestinian fighters disarm to secure an end to the Gaza war, but that this crossed a “red line”.\n\nMacron said he told Netanyahu “the release of all hostages” and the “demilitarisation of Hamas” were still an absolute priority for France.\n\nHe said he hoped for “a ceasefire, the release of all hostages, humanitarian aid, and then finally reopening the prospect of a political two-state solution”.\n\nMacron irked Israel last week when he suggested Paris could recognise a Palestinian state during a United Nations conference in New York in June.\n\nIsrael insists such moves by foreign states are premature.\n\nBut Macron has said he hopes French recognition of a Palestinian state will encourage not just other nations to follow suit, but also countries who do not recognise Israel to do so.\n\nPalestinian state\n\nNetanyahu told Macron that the establishment of a Palestinian state would be a “huge reward for terrorism”.\n\nA statement released by Netanyahu’s office said the two leaders spoke by phone and the Israeli prime minister expressed to the French president his “strong opposition to the establishment of a Palestinian state, stating that it would be a huge reward for terrorism”.\n\n“The prime minister told the French president that a Palestinian state established just minutes away from Israeli cities would become a stronghold of Iranian terrorism, and that a vast majority of the Israeli public firmly opposes this — and this has been his consistent and long-standing policy.”\n\nThe day before the call, Macron told the president of the Ramallah-based Palestinian Authority, Mahmud Abbas, that he would support a plan for the PA to govern post-war Gaza, if it underwent reform.\n\n“It is essential to set a framework for the day after: disarm and sideline Hamas, define credible governance and reform the Palestinian Authority,” Macron told Abbas in a phone call, according to a post on X.\n\n“This should allow progress towards a two-state political solution, with a view to the peace conference in June, in the service of peace and security for all,” wrote Macron.\n\nRare Gaza visit\n\nNetanyahu made a rare visit to Gaza on Tuesday, his office announced, as the military pressed on with its air and ground assault against the Palestinian territory.\n\n“Prime Minister Benjamin Netanyahu visited the northern Gaza Strip today,” a statement from his office said.\n\nThe military resumed its offensive on Gaza on March 18, ending a two-month ceasefire with Hamas that had largely halted the fighting in the war-battered territory.\n\nSince then, Israeli forces have seized large parts of the territory as hundreds of thousands of people fled from areas where the military intensified its assault.\n\nSenior Israeli officials including Netanyahu have repeatedly said that only military pressure would force Hamas into releasing the remaining prisoners held in Gaza.\n\nPublished in Dawn, April 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fed5fab47ab.jpg",
  "retrievedAt": "2025-10-12T02:34:28.063Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904485/suffering-of-palestinians-must-end-macron-tells-netanyahu",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T01:25:01.000Z"
}
