{
  "title": "UK top court rules definition of ‘a woman’ based on sex at birth - World - DAWN.COM",
  "author": null,
  "content": "Britain’s Supreme Court ruled on Wednesday the legal definition of a “woman” is based on a person’s sex at birth, a landmark decision with far-reaching implications for the bitter debate over trans rights.\n\nIn a win for Scottish gender-critical campaigners who brought the case to the UK’s highest court, five London judges unanimously ruled “the terms ‘woman’ and ‘sex’ in the Equality Act 2010 refer to a biological woman, and biological sex”.\n\nHowever, the court underlined that the Equality Act also protected transgender people from discrimination.\n\nThe act “gives transgender people protection” through the protected characteristic of gender reassignment, but also protecting against discrimination in their acquired gender, Justice Patrick Hodge said handing down the verdict.\n\nIt is the culmination of a years-long battle between the Scottish government and campaign group For Women Scotland (FWS) — which launched an appeal to the Supreme Court after losing pleas in Scottish courts over an obscure legislation aimed at hiring more women in public sector bodies.\n\nDozens of FWS and other gender critical campaigners, who argue that biological sex cannot be changed, cheered with joy after the ruling, hugging and crying outside the court.\n\n“This has been a really, really long ride,” said Susan Smith, co-director of For Women Scotland, adding the campaigners were “enormously grateful for this ruling”.\n\n“Today, the judges have said what we always believed to be the case: that women are protected by their biological sex,” she said, adding “women can now feel safe that services and spaces designated for women are for women”.\n\nAhead of the verdict, trans rights activists raised concerns that a ruling in favour of FWS could risk discrimination against trans people in their chosen gender.\n\n“The court is well aware of the strength of feeling on all sides which lies behind this appeal,” Hodge said, recognising the fight of women against sex discrimination, as well as a “vulnerable” position of the trans community.\n\nLGBTQ charity Stonewall said the UK court ruling was “incredibly worrying for the trans community”.\n\n“Stonewall shares the deep concern at the widespread implications for today’s ruling from the Supreme Court,” said Simon Blake, CEO of the UK-based charity.\n\nAt the heart of the legal battle were clashing interpretations of the Equality Act.\n\nWhile the Scottish government argued that the Equality Act afforded trans women with a Gender Recognition Certificate (GRC) with the same protections as a biological female, FWS disagreed.\n\nIn its judgement, the Supreme Court ruled that the devolved Scottish government’s “interpretation is not correct” and that the Equality Act was inconsistent with the 2004 Gender Recognition Act which introduced GRC certificates.\n\nAccording to the judges, allowing for the Scottish government’s interpretation would “cut across the definitions of man and woman” in the Equality Act “in an incoherent way”.\n\nAnd, single-sex spaces and services including changing rooms, hostels and medical services “will function properly only if sex is interpreted as biological sex”, the judgement added.\n\nDespite underlining protections from discrimination, the ruling will be a blow for transgender women and their ability to access single-sex spaces — a significant contention in the polarised debate on trans rights.\n\nThe debate has been particularly vicious in the UK, pitting gender critical activists against trans rights campaigners and often resulting in bitter, even hateful discourse.\n\nOne of the most prominent supporters of gender critical campaigns is Harry Potter author JK Rowling, who lives in Scotland and has been the target of hate but also been accused of transphobia.\n\nThe ruling also comes at a time when transgender rights are under threat in the United States under President Donald Trump.\n\nSince retaking office, Trump has declared the federal government would recognise only two sexes, male and female, sought to bar trans athletes from women’s sports and curbed treatments for trans children.\n\nThe latest UK ruling could pile pressure on Prime Minister Keir Starmer’s government — which has remained largely silent on trans issues since coming into power last July — to further clarify legislation.\n\nThe opposition Conservative administration had blocked Scottish legislation to make gender change easier in 2022 and has supported the clarification of sex as biological sex rather than assumed gender.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/161541242c859ad.jpg",
  "retrievedAt": "2025-08-25T14:14:18.297Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904636/uk-top-court-rules-definition-of-a-woman-based-on-sex-at-birth",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T11:15:33.000Z"
}
