{
  "title": "Federal govt asks SC to dismiss pleas of IHC judges in transfer case - Pakistan - DAWN.COM",
  "author": null,
  "content": "The federal government on Wednesday urged the Supreme Court to dismiss the pleas against the transfer of judges to the Islamabad High Court (IHC) and the subsequent changes in the seniority list.\n\nIn February, Justice Sardar Mohammad Sarfraz Dogar from the Lahore High Court (LHC), Justice Khadim Hussain Soomro from the Sindh High Court (SHC) and Justice Muham­mad Asif from the Balochistan High Court (BHC) were transferred to the IHC.\n\nThe controversy centres around the alteration of the judges’ seniority list after these transfers as Justice Dogar was made the senior puisne judge, which paved the way for his appointment as the acting IHC CJ after Justice Aamer Farooq’s elevation to the SC.\n\nAccording to the petitions filed by five IHC judges among others, these three cannot be considered judges of the IHC until they have taken a fresh oath in accordance with Article 194 of the Constitution.\n\nIn its response, the federal government sought the dismissal of the pleas as the three judges have been “transferred as per the constitution … [and they] are not required to take new oath after transfer” as under Article 200, it did not mean a new appointment.\n\n“[The judges were transferred to] “bring transparency in judiciary, not affect judicial independence,” read the response submitted by the Islamabad additional attorney general — a copy of which is available with Dawn.com.\n\n“Article 200(1) deals with the power of the president to transfer judges from one high court to another, thereby attributing a clear permanence to the transfer,” it contended.\n\n“No use of the term ‘for such period’ or ‘during the period’ in clause (1) of Article 200 clearly reflects that the transfer thereunder, unlike clause (3), [is] not in the nature of a temporary arrangement,” the response added.\n\n“Permanency of transfer under Article 200(1) is also evident from the fact that to send the transferee judge back to his parent High Court, the President will have to follow the entire procedure provided under Article 200(1) again.”\n\nMeanwhile, the Islam­abad High Court Bar Association (IHCBA) announced in a statement today that it was withdrawing its plea in the case, stating that it is a “constitutional matter that must be resolved by constitutional institutions”.\n\nThe association added that the case involved the judges themselves, and that was why it should not be an aggrieved party in the matter.\n\nThe IHCBA noted that its executive committee unanimously signed an agreement to withdraw the plea.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/161745207e855e7.jpg",
  "retrievedAt": "2025-08-25T14:14:18.800Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904644/federal-govt-asks-sc-to-dismiss-pleas-of-ihc-judges-in-transfer-case",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T14:14:26.000Z"
}
