{
  "title": "Venues for LA Olympics 2028 announced as cricket returns after century - World - DAWN.COM",
  "author": null,
  "content": "Los Angeles 2028 Olympic Games organisers confirmed on Tuesday that cricket — which is making its return to the Olympics for the first time in more than a century — will be held at a purpose-built venue in Pomona, just east of Los Angeles.\n\nCricket is returning to the Olympics for the first time since the Paris Games in 1900 with a proposed six-team Twenty20 format for men and women in Los Angeles.\n\nThe International Olympic Committee (IOC) had said in October 2023 that cricket’s inclusion had the potential to activate and engage new audiences, with the sport’s worldwide fan base estimated at 2.5 billion people.\n\nEarlier reports had suggested cricket could have been staged thousands of miles from Los Angeles in New York.\n\nThe International Cricket Council (ICC) has also welcomed the announcement of the venue for cricket at LA28, in a press release issued on its website.\n\n“We welcome the announcement of the venue for cricket at Los Angeles 2028 as it is a significant step towards the preparation for our sport’s return to the Olympics,” ICC Chairman Jay Shah was quoted in the press release.\n\nUniversal Studios will play host to squash’s Olympics debut, with the sport taking place on Courthouse Square — the mock-up town square featured prominently in Oscar-winning movies such as ‘Back to the Future’ and ‘To Kill a Mockingbird’.\n\nAn iconic Hollywood studio lot and the golden sands of Venice Beach are also among an array of Los Angeles landmarks that will stage events for the 2028 Olympic Games.\n\nIn an updated list of venues for the Games, LA28 confirmed venues for surfing, triathlon, and baseball, amongst other sports.\n\nVenice Beach meanwhile will host the triathlon — relocating from its initial venue in Long Beach — and will also be the starting point for the men’s and women’s marathon, as well as the cycling road races.\n\nThe venue for surfing was also confirmed, with the competition taking place at Trestles Beach in the coastal town of San Clemente, roughly 61 miles (98 kilometres) from Los Angeles.\n\nTrestles is widely considered to be one of the best surfing locations in California, known for consistent waves and a classic point break.\n\nBaseball will take place at Dodger Stadium, the home of the Los Angeles Dodgers, which also hosted the sport at the 1984 Los Angeles Olympics.\n\n“We’ve promised the world an incredible Olympic Games and today we’re proud to share the plan that will make it happen,” LA28 chief executive Reynold Hoover said in a statement.\n\n“The 2028 Olympic venue plan invites communities from across the region to celebrate the Games coming to their backyard with the most exciting sports staged at some of the world’s top-tier existing stadiums and arenas, famous beaches and purpose-built temporary structures.”\n\nLos Angeles mayor Karen Bass said the venue plan announced on Tuesday would “bring the Games to all corners of our city like never before”.\n\n“From the Sepulveda Basin to the iconic shores of Venice Beach, our world-famous neighborhoods as well as our hidden gems will be on full display for all to experience and enjoy,” Bass said.\n\nOther event venues announced on Tuesday include horse racing’s Santa Anita Park, which will host the equestrian events and Anaheim’s Honda Center, which will host volleyball.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/16125237c24794f.jpg",
  "retrievedAt": "2025-08-25T14:14:23.062Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904615/venues-for-la-olympics-2028-announced-as-cricket-returns-after-century",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T07:40:59.000Z"
}
