{
  "title": "Judge halts Trump move to revoke 500,000 migrants’ legal status - World - DAWN.COM",
  "author": null,
  "content": "NEW YORK: A federal judge on Monday blocked US President Donald Trump’s administration from quickly revoking the legal status of hundreds of thousands of immigrants from Venezuela, Cuba, Nicaragua and Haiti.\n\nThe ruling by District Judge Indira Talwani in Boston is the latest order against Trump’s rapid push to carry out mass deportations, particularly targeting Latin Americans.\n\nIn March, the administration said it was moving to revoke the legal status of some 532,000 Cubans, Haitians, Nicaraguans and Venezuelans who came to the United States under a “parole” programme initially launched by former president Joe Biden in Oct 2022.\n\n“The court grants emergency relief staying the Termination of Parole Processes for Cubans, Haitians, Nicaraguans, and Venezuelans,” Talwani wrote in her order.\n\nThe parole programme allowed entry to the United States for two years for up to 30,000 migrants per month from the four countries, which have grim human rights records.\n\nIn her order, Talwani said the Trump administration had acted on a flawed interpretation of immigration law, with expedited removal applicable to non-citizens entering the United States illegally, but not those authorised to be in the country, such as through the parole programme.\n\nUnder Trump’s revocation, the immigrants would have lost their legal protection effective April 24, just 30 days after the Department of Homeland Security published its order in the Federal Register.\n\nTrump has vowed to deport “millions” of undocumented migrants in his second term, after running an election campaign that focused on illegal immigration. Among other measures, he has invoked rare wartime legislation to fly hundreds of alleged members of a Venezuelan gang to El Salvador, which is imprisoning the migrants.\n\nPublished in Dawn, April 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:34:07.013Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904547/judge-halts-trump-move-to-revoke-500000-migrants-legal-status",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T01:25:28.000Z"
}
