{
  "title": "After salary hike leak, Nepra limits access to information - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Taking stern action over recent leaks about unauthorised salary increases, the National Electric Power Regulatory Authority (Nepra) has put a tight lid on the circulation of official files, including certain decisions, besides punitive action against some officials.\n\nThe five-member regulatory authority comprising four provincial members and a chairman has decided to limit access to official records, including meeting minutes. This raises questions about the transparency of the regulatory process.\n\nIn a fresh order, the regulator said, “access to signed minutes of meetings will be restricted to the authority and director consumer and industry (C&I), with the IT department maintaining a log of downloads to prevent misuse”.\n\nAdditionally, working papers and annexures will be available for download on Enterprise Content Management (ECM) only to authorised professionals, while “sensitive documents will be password protected,” the order said.\n\nConsequently, the IT department has been directed to revoke general ECM access for staff and download permissions for working papers will be limited to designated professionals. Moreover, all heads of departments have been instructed to submit soft copies of their working papers and hard copies only to the C&I director.\n\nInformed sources said Nepra had also punished staff, which it suspected could have leaked documents about unprecedented increases in salaries of the members and chairman without the federal cabinet’s approval. They said one of the members was also amending international regulations to promote blue-eyed associates by replacing existing professionals.\n\nThe power regulator has come under criticism from within and outside for charging hefty consumer fees for appeals and reviews of regulatory decisions.\n\nLast week, the government confirmed that the chairman and members of Nepra unilaterally increased their salaries earlier this year without prior clearance from the federal cabinet. The government told the national assembly that salary of the Nepra chairman went beyond Rs3.247 million and those of members Rs2.943m.\n\nEarlier, Cabinet Secretary Kamran Ali Afzal had told a Senate panel on Feb 18 that Nepra had been asked to provide reasons for the salary hike as the increase violated Section 8 of the Nepra Act, and the authority must submit a written explanation for its decision. Mr Afzal further emphasised that all regulatory bodies fall under the jurisdiction of the prime minister or the federal cabinet.\n\nThe National Assembly was told that the Nepra chairman and members were also entitled to medical facility, gratuity equal to one basic pay worth Rs772,780 for chairman and Rs701,005 for members for each completed year of service. The salary increases during the last five years (FY21 to FY25) included the yearly Ad hoc Relief Allowance announced by the government in the budget.\n\nPublished in Dawn, April 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:14:48.967Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904545/after-salary-hike-leak-nepra-limits-access-to-information",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T01:25:14.000Z"
}
