{
  "title": "Four Karachi Port Trust high-ups named in probe over dredging contract violations - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Defence ministry asked to take action against ‘two naval officers working on deputation’ at KPT\n• Ministry of Maritime Affairs to take action against ex-KPT chairman Sayadian Zaidi, GM Raghibul Khair\n• PM orders KPT board to invite bids afresh for multibillion-rupee maintenance dredging contract\n\nKARACHI: Prime Minister Shehbaz Sharif has ordered strict action against four senior Karachi Port Trust (KPT) officials, including two belonging to the Pakistan Navy, after a high-level inquiry held them responsible for committing serious violations in the award of a multibillion-rupee contract for maintenance dredging of Karachi port, it has emerged.\n\nOfficial documents reviewed by Dawn suggested that the PM also ordered the KPT Board of Directors to “review the procurement process while ensuring that the re-tendering process is carried out in strict compliance with the Public Procurement Regulatory Authority Rules 2007”.\n\nSources said there has been no permanent chairman in the KPT for a long time and one of the general managers had been holding the “look-after charge” until April 5.\n\nThey said the Prime Minister’s Inspection Team (PMIT) had conducted an inquiry into the allegations that the KPT last year recommended the award of the dredging contract to an alleged favourite firm by ignoring the report of a technical committee that expressed concern over its capacity to dredge the channel.\n\nA committee, led by the PMIT chairman and comprising the cabinet secretary, managing director of the PPRA, a representative from the Intelligence Bureau and two co-opted members, investigated the matter thoroughly and submitted a 32-page report to the prime minister last month.\n\nIn the report, a copy of which is available with Dawn, the PMIT named then KPT chairman Syed Sayadian Raza Zaidi and three general managers — retired Rear Admiral Habibur Rehman, Rear Admiral Rizwan Ahmed and Engineer Raghibul Khair — responsible for the “lapses and aberrations” in executing the dredging tender process and recommended to the prime minister “strict disciplinary action” against them.\n\nThe officials said since the responsible persons include two high-ranking naval officers, the prime minister ordered authorities to share the probe report with the “ministry of defence to initiate appropriate disciplinary action against Pakistan Navy officers serving on deputation at KPT”.\n\nAccording to a PM Office letter sent to the ministry of maritime affairs, the prime minister asked the authorities to take disciplinary action against then KPT chairman Zaidi and Engineer Raghib “for acts of omission and commission in the procurement process as highlighted in the report”.\n\n‘Invitation for bids’\n\nIt all began in July last when the KPT invited bids for dredging four million cubic meters to maintain its navigation channel. Four international companies applied and three of them proposed dredging with equipment larger than 15,000 cubic meters capacity.\n\nIt is worth mentioning here that dredging a channel involves removing accumulated sediments, mud, trash and other debris from the sea bottom to maintain its depth and width. Maintenance dredging refers to the removal or relocation of sediment that builds up on the seafloor of existing shipping channels in order to preserve the required depth and to ensuring the safe and efficient operation of ports.\n\nThe fourth bidder, China Harbour Engineering Company (CHEC), proposed underpowered equipment due to which a technical team of the KPT disqualified it. However, the final evaluation report declared the Chinese company eligible and qualified for the dredging award due to its lowest bid.\n\nLater, one of the three remaining bidders moved the PPRA which also raised concerns over the transparency of the process adopted by the KPT.\n\nWhen the issue was highlighted by the media, the prime minister tasked the PMIT with investigating the matter, any deviations, omissions, or violations in the technical and financial evaluation of the tendering process as well as to review the rationale for qualifying or disqualifying bidders, identify responsible individuals or departments, and provide recommendations for addressing the issues and safeguarding public interest.\n\nThe committee reviewed the role of former chairman Zaidi and was of the view that he “did not address the observations raised by the concerned officers and allowed the deletion of capacity condition in the tender document”.\n\nIt said that he did not take any advice or consultation from the legal department on the tender documents and PPRA and observed that “ulterior motives cannot be ruled out”.\n\nAbout GM-Engineering Rear Admiral Habibur Rehman, the committee observed that “he was evasive of his duties as GM-E and encouraged the shifting of the handling of maintenance dredging works to GM (P&D) which under the job description, falls under his domain”.\n\nIt stated: “The officer himself committed that he was not competent enough to handle his own assignment, which clearly reflects his incompetency putting KPT at a technical and financial loss.”\n\nThe officer was blamed for a delay in the maintenance dredging despite the fact that the job fell within his purview as the GM-E.\n\nThe committee found that Rear Admiral Rizwan Ahmed being the GM-Operations of KPT did not raise objections on the issues and facilitated the chairman despite the fact that he was responsible for the safe entry and sailing of vessels at the KPT channel.\n\nThe report also stated that GM (P&D) Engineer Raghib accepted the assignment of handling of maintenance dredging tender despite the fact that it fell under the purview of GM-E Habibur Rehman.\n\nPublished in Dawn, April 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:34:21.215Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904509/four-karachi-port-trust-high-ups-named-in-probe-over-dredging-contract-violations",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T01:25:34.000Z"
}
