{
  "title": "Farmers hold protests across Punjab against low wheat prices - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL: Wheat farmers across Punjab are protesting against what they say are unjust wheat support prices and poor government procurement policies.\n\nFrom Sheikhupura to Dera Ghazi Khan, demonstrations, sit-ins and clashes with police have erupted as farmers demand fair compensation for their produce.\n\nFarmers’ organisations and opposition parties, including Jamaat-i-Islami and Kissan Ittehad, have joined the protests.\n\nAs wheat harvesting has begun across thousands of acres in Sheikhupura, farmers are complaining about low market rates ranging from Rs2,200 to Rs2,500 per 40kg.\n\nWhile the crop is healthy and timely, farmers say they are left with little to no savings after spending heavily on fertilisers, seeds and pesticides.\n\n“We borrowed from fertiliser dealers just to grow the wheat. Now we can’t even cover the cost,” said farmer Muhammad Ashraf.\n\nAnother grower, Muhammad Nasir, accused the government of economic neglect. Farmers also alleged that grain traders are refusing to buy wheat at reasonable prices.\n\nThey have appealed to Prime Minister Shehbaz Sharif and Punjab Chief Minister Maryam Nawaz to take immediate action.\n\nRAHIM YAR KHAN: The district chapter of Kissan Board Pakistan (KBP) staged a protest outside the deputy commissioner office here against the government’s refusal to procure wheat and its failure to set fair prices.\n\nLed by KBP district president Haji Ahmed Yar Wallana, the protesters said prices of agricultural inputs were rising while the price of produce was falling.\n\nThey criticised the lack of irrigation water during wheat sowing in Sadiqabad tehsil, which reduced yields.\n\nProtesters demanded a wheat support price of Rs4,500 per 40kg, a sugarcane price linked to its sweetness, and subsidised electricity for agricultural tubewells.\n\nSARGODHA: Kissan Bachao Tehrik held a protest rally demanding a wheat price of Rs4,700 per maund.\n\nThe rally, led by President Nasir Javed Ghuman, marched from district courts to the commissioner’s office. Mr Ghuman alleged that government policies only benefit industrialists, especially those owning sugar mills, and accused them of ignoring farmers’ needs.\n\nProtesters warned if their demands were not met, they would halt the supply of agricultural goods across Punjab and stage sit-ins outside the parliament.\n\nGUJRANWALA: In Gujranwala, farmers and JI activists set up protest camps and staged a rally demanding announcement of an official wheat support price.\n\nHowever, tensions ran high in Hafizabad when police dismantled protest camps at Fawara Chowk and Ghanta Ghar Chowk.\n\nLed by JI district emir Malik Shaukat Ali Phulrwan and Kissan Board Vice President Chaudhry Amanullah Chattha, protesters clashed with police as they attempted a rally.\n\nFour people were arrested and several injured in baton charges.\n\nCivil society and bar associations condemned the police action and called for the release of detained protesters.\n\nSAHIWAL: Kisan Ittehad and JI jointly held a rally from Pakpattan Chowk to the deputy commissioner office.\n\nThey submitted a charter of seven demands including a Rs4,000 wheat support price, Rs10 roti, flat-rate agricultural tubewell bills, cheaper farm inputs, interest-free loans, and fair sugarcane rates.\n\nLeaders including Muhammad Hussain and Tayab Baloch warned that protests would move to Lahore and Islamabad if their demands were not met.\n\nDERA GHAZI KHAN: Farmers in Rajanpur staged a protest outside the DC office demanding the reopening of the Dajal Canal.\n\nThey said the canal was crucial for irrigation in the arid zone and its closure has left farmlands barren.\n\nProtesters warned of massive crop loss and economic disaster if water supply was not restored.\n\nChanting slogans like “no farmers, no food — no life,” they demanded urgent government action.\n\nDeputy Commissioner Shafqatullah assured protesters that the matter was being taken up with the irrigation department for early resumption of water flow.\n\nFollowing his assurance, the farmers ended their sit-in.\n\nPublished in Dawn, April 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:14:30.686Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904521/farmers-hold-protests-across-punjab-against-low-wheat-prices",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T01:25:40.000Z"
}
