{
  "title": "Rally held in Islamabad to express solidarity with PPP leader Farhatullah Babar - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Activists of the civil society, local members of the Pakistan Peoples Party (PPP) and representatives of media and lawyers on Tuesday held a rally outside the National Press Club (NPC) to condemn the act of the Federal Investigation Agency (FIA) of launching an inquiry against former senator and human rights activist Farhatullah Babar on the basis of an ambiguous complaint filed by an ordinary citizen against him on corruption charges.\n\nCarrying placards and banners inscribed with slogans to express solidarity with Mr Babar, the speakers condemned the baseless allegations levelled by the FIA and demanded immediate withdrawal of notices.\n\nMr Babar, who is the also head of the PPP’s Human Rights Committee, has long been an advocate for transparency and human rights.\n\nThe speakers in their speeches said that Mr Babar was known for his commitment to human rights and minority rights and was a man of integrity.\n\nProminent among those who attended the rally were co-chairperson of the Human Rights Commission of Pakistan (HRCP) Munizae Jahangir, Imtiaz Alam, Tahira Abdullah, Nasir Zaidi, Dr Bashir, Tariq Ghouri, Tariq Usmani, Farhat Fatima, PPP Senator Sehar Kamran, retired Capt Syed Wasif, Tariq Ghouri, incharge of the PPP Central Secretariat Syed Sibte Haider Bukhari and Chairman of the Shaheed Bhutto Foundation Asif Khan.\n\nWhen some of the speakers criticised the PPP leadership for not raising its voice over the FIA action, some of the party leaders present at the rally assured the participants that the party would firmly stand by Mr Babar and raise the matter with the concerned quarters.\n\nIt may be recalled that the FIA last week issued a questionnaire to Mr Babar, directing him to submit comprehensive financial records and asset details.\n\nThe notice, signed by FIA Deputy Director Mohammad Afzal Khan Niazi mandated Mr Babar to disclose “full details” of movable/immovable assets, bank accounts, and vehicles registered in his name, income tax declarations, tax submissions, and sources of income, besides details of all the properties held by his spouse and dependents.\n\nMoreover, the former senator has also been asked to provide details of the benefits, foreign funds and Senate privileges received during his senatorship and documentation of public expenditures.\n\nPublished in Dawn, April 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67fed23c962ef.jpg",
  "retrievedAt": "2025-08-25T14:14:30.607Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904477/rally-held-in-islamabad-to-express-solidarity-with-ppp-leader-farhatullah-babar",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T01:25:46.000Z"
}
