{
  "title": "CM Murad blasts Punjab for opening TP Link Canal amid Sindh water shortage - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sindh Chief Minister Murad Ali Shah on Wednesday strongly criticised the Punjab government for opening the Taunsa-Panjnad (TP) Link Canal, calling it “irresponsible”.\n\nThe Sindh government on Tuesday wrote to the Indus River System Authority (Irsa) over the “transfer” of water from the Indus River after the canal was opened on Tuesday. The Sindh irrigation director regulations wrote requesting that the transfer of water from the Indus River to the Jhelum-Chenab system be stopped.\n\nWhile inaugurating the Comprehensive Cancer Centre at Karachi’s Dow University of Health Sciences, the chief minister slammed the canal opening, adding that Punjab was “weakening its own case, while ours is getting stronger”, a press release said.\n\n“We are currently facing a 50 per cent shortage of water. In such a situation, opening the TP Link Canal was irresponsible,” he stated. “We will not rest until there is a formal announcement to shut down the canals project,” he said.\n\nOn February 15, Punjab Chief Minister Maryam Nawaz and Chief of the Army Staff Gen Asim Munir inaugurated the ambitious Cholistan project to irrigate south Punjab’s lands amid public uproar and strong reservations in Sindh. The Sindh Assembly also passed a unanimous resolution against the project in March.\n\nThe past few months have seen nationwide protests from political parties and civilians against the proposed canal project.\n\nIn February, the Awami Tehreek staged a 12-kilometre-long march in Karachi to protest against the project, while the PPP in March staged demonstrations and rallies across Sindh against the new canals.\n\nEarlier in April, the Grand Democratic Alliance and PTI staged a sit-in outside the Karachi Press Club and led a rally to Empress Market against the proposed construction of the canals.\n\nOn Sunday, nationwide protests were held against corporate farming, the construction of six canals, the lack of wheat support price, and the privatisation of Pakistan Agricultural Storage and Services Corporation.\n\nAccording to the press release, the inauguration ceremony for the cancer centre was attended by Higher Education Commission Sindh Chairman Professor Tariq Rafi, Dow University Vice Chancellor Dr Saeed Qureshi, medical professionals, provincial secretaries, government officials and others.\n\n“Today is a historic day for the people of Sindh,” Murad said. “This cancer centre will greatly benefit patients suffering from this life-threatening disease.”\n\nAddressing the gathering, the CM said that the centre would transform cancer care in the province by providing cutting-edge, affordable treatment to patients throughout the region, the press release added.\n\nHe announced that three more advanced machines had been installed at the facility and appealed to philanthropists and the private sector to support the initiative.\n\n“The new facility is not merely a medical institution but a symbol of hope, innovation, and resilience,” the chief minister emphasised. “[It] is a beacon for families fighting cancer.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/1621031815bf5e2.jpg",
  "retrievedAt": "2025-08-25T14:14:17.619Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904654/cm-murad-blasts-punjab-for-opening-tp-link-canal-amid-sindh-water-shortage",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T16:38:25.000Z"
}
