{
  "title": "Paltry rise in electricity demand in March - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Amid a 4.4 per cent increase in power consumption in March over last year, the public sector distribution companies (Discos) sought about Rs1.5 per unit negative quarterly tariff adjustment (QTA) for January-March and another three paise per unit negative fuel price adjustment (FCA) for electricity consumed in March.\n\nThe Rs1.51 per unit negative QTA, involving a total of Rs51.5 billion already overcharged by all Discos for the third quarter of FY25 was already made part of the tariff reduction announced by the prime minister for April to June.\n\nThe National Electric Power Regulatory Authority (Nepra) has called two back-to-back public hearings on April 29 to consider both QTA and FCA petitions from Discos.\n\nThe lower QTA stems from a combination of lower capacity charges, operations, maintenance and fixed costs on account of incremental sales and fewer system losses mainly due to relative stability in the exchange rate and decline in the interest rates.\n\nThe decline in fuel cost is mainly because of substantially higher costs allowed by Nepra through a 20pc increase in base tariff effective July 1, 2024. About 75pc of the total power supply during March came from domestic fuel sources, almost 20pc of that at zero fuel cost.\n\nPower firms seek to refund Rs1.5 under quarterly adjustment\n\nThe Central Power Purchasing Agency (CPPA), which filed the petition for negative adjustment of fuel cost for March, said the power consumption was 4.4pc higher than the same month last year and almost 22pc higher than February. It reported that electricity delivered to Discos stood at 8,114 gigawatt hours (GWh) in March against 6,666 GWh in February.\n\nThe power companies have claimed in their petitions that the average fuel cost amounted to Rs9.22 per unit in March compared to Rs9.34 per unit in the same month last year.\n\nThe CPPA said about 8,409 GWh of electricity was generated at an estimated fuel expenditure of Rs79.5bn (Rs9.46 per unit) in March, of which 8,114GWh energy was delivered to Discos at a cost of Rs74.85bn (at Rs9.22 per unit). However, the reference fuel cost already charged to consumers in March stood at Rs9.256 per unit, hence a refund of three paise per unit.\n\nHydropower lost its top position with about 15.42pc share in the overall grid owing to unfavourable hydrological conditions. Last year, hydropower had contributed 28pc electricity to the grid in March. Nuclear energy emerged as the largest electricity supplier to the national grid with a 26.4pc share.\n\nThe third biggest share in the national grid came RLNG at 18.17pc, followed by local coal at 16.57pc. This was followed by 11.64pc share from local local gas. Imported coal contributed 6.5pc to the national grid.\n\nThe LNG-based power generation was the most expensive, with its cost in March reported at Rs23.11 per unit, followed by Rs17.74 per unit from imported coal and Rs12.24 per unit on local coal.\n\nPublished in Dawn, April 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:14:46.781Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904540/paltry-rise-in-electricity-demand-in-march",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T01:25:14.000Z"
}
