{
  "title": "Hydel project mismanagement infuriates Public Accounts Committee - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Body refers procurement scandals and illegal decisions to NAB, FIA\n• Land acquisition delay cited as systemic problem for over a decade\n• PAC Chairman Junaid Akbar Khan claims recovery of Rs118bn in two months\n\nISLAMABAD: The Public Accounts Committee (PAC) on Tuesday highlighted the glaring inefficiencies and massive financial mismanagement in key national hydropower projects.\n\nA meeting of the PAC, chaired by MNA Junaid Akbar Khan, reviewed audit objections related to the Ministry of Water Resources. Audit officials raised concern over the Dassu Hydropower Project, where changes in the scope of work had led to significant increases in the contract cost. Despite years of planning, land acquisition and resettlement remain incomplete, drawing sharp criticism from committee members.\n\n“HaIf the issues weren’t resolved, why was the project initiated?” questioned chairman PAC, Mr Akbar.\n\nWater Resources Secretary Syed Ali Murtaza responded by shifting responsibility to the Khyber Pakhtunkhwa government, stating that land transfer had still not been executed. “Land settlement issues have not been completed in the last 13 years,” he said describing the land acquisition a systemic problem.\n\nMNA, Malik Amir Dogar, pointed out that a project originally estimated at Rs4 billion has now ballooned to Rs36 billion. “This is like throwing dust in the nation’s eyes,” remarked MNA Sanaullah Khan Masti Khel, while Senator Shibli Faraz called for stern action against responsible officials, stating, “This is not someone’s personal project. It is a blatant example of arrogance and incompetence towards national exchequer.”\n\nThe committee handed over the matter to the National Accountability Bureau (NAB) for investigation. “We cannot allow such waste of the nation’s money to go unchecked”, said PAC chairman Akbar.\n\nThe committee also raised questions regarding the appointment of retired Lt Gen Sajjad Ghani as Chairman of the Water and Power Development Authority (Wapda). Members expressed concern over the recurring trend of appointing retired military officials to key civilian posts, asking pointedly why such roles seemed reserved for generals alone.\n\nDuring the audit of accounts for the DHPP, for the period from July, 2022 to June, 2023, members were informed that the project was approved in 2014, at a cost of Rs486 billion. As the land acquisition is re-current problem, the cost of the complete project has escalated to more than Rs1.7 trillion today.\n\nNeelum-Jhelum project\n\nThe committee also examined the status of the Neelum-Jhelum Hydropower Project (NJHPP). Responding to a query by Senator Shibli Faraz, officials confirmed that the project is currently non-operational since last May, due to the collapse of a tunnel. The revelation sparked further concern among committee members regarding the project’s structural and operational integrity.\n\nThe Auditor General’s office informed the Public Accounts Committee that the contract for the construction of the NJHPP was awarded to a joint venture of CGGC-China Machinery Engineering Corporation (CMEC). However, auditors raised serious objections to a decision by the NJHPP Board of Directors to reduce the performance security from 10 per cent to 5 percent of the contract value an action deemed illegal.\n\nThis unauthorized reduction reportedly resulted in financial relief of over Rs10.9 billion for the contractor.\n\nEquipment scandal\n\nAudit officials reported that used concrete testing equipment was purchased for the Diamer-Bhasha Dam project — from the very party responsible for conducting the tests. This raised immediate red flags, with PAC members demanding an inquiry.\n\nWhen questioned by Chairman Akbar on why second-hand machinery was procured, officials claimed it was sourced from the sole global manufacturer. However, audit authorities insisted that a full investigation was necessary, citing potential conflicts of interest and calling the matter one of “national interest”.\n\nThe PAC referred the case to the FIA for further inquiry.\n\n“Every audit report reveals criminal negligence,” remarked committee member Khawaja Sheraz Mahmood.\n\nLack of preparation\n\nFrustration ran high during the session when an FIA representative appeared unprepared to brief the committee on an ongoing investigation. “Are we here just to have tea?” snapped the PAC cairman, expressing disappointment at the lack of coordination among accountability institutions.\n\nIn an informal conversation with journalists following the meeting, Mr Akbar said all committee members were disappointed with the state of affairs. “Every project seems to be in worse shape than the last,” he noted. “If someone’s performance is poor, they’ll be summoned to every meeting.”\n\nHe highlighted that electricity could be made available at Rs1.50 per unit if mismanagement were addressed, and reiterated that a Rs4 billion project ending up at Rs36 billion had been referred to NAB.\n\n“In just two months, this committee has recovered Rs118 billion,” he added. Regarding the Toshakhana records, Mr Akbar mentioned that details dating back to 1947 had been requested, but the sheer volume of data may delay their publication.\n\nPublished in Dawn, April 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:15:02.511Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904488/hydel-project-mismanagement-infuriates-public-accounts-committee",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T01:25:01.000Z"
}
