{
  "title": "Biden slams Trump ‘destruction’ in first post-presidency speech - World - DAWN.COM",
  "author": null,
  "content": "Former US president Joe Biden, in his first major speech since leaving the White House, railed on Tuesday against his successor Donald Trump’s frenetic government overhaul, claiming the “hatchet” effort put Americans’ retirement benefits at risk.\n\n“Fewer than 100 days, this administration has done so much damage, and so much destruction — it’s kind of breathtaking it could happen that soon,” Biden told a conference of disability advocates in Chicago.\n\n“They’ve taken a hatchet to the Social Security administration, pushing 7,000 employees out the door,” said the former president, referring to the national agency which pays out retirement and disability benefits.\n\nWearing a blue suit and tie, and standing in front of American flags, the 82-year-old Democrat spoke for around a half-hour, displaying at times the signs of ageing that prompted him to abandon his re-election campaign last year.\n\nHe stumbled over some sentences as he read from a teleprompter and struggled to get through winding off-the-cuff anecdotes, cutting himself off with a favourite phrase, “anyways”.\n\nPresident Trump, in a jab at Biden, posted a short video on social media of one of the rambling anecdotes, without comment.\n\nBiden’s choice of topic, Social Security, aimed to ramp up pressure on Trump over his rampaging government overhaul efforts.\n\nHe highlighted staff reductions at the agency that Trump and his billionaire aide Elon Musk have pushed as part of their “Department of Government Efficiency”, saying the Social Security “website is crashing” and hindering retirees from getting their benefits.\n\nThe programme, which more than 65 million Americans rely on, is colloquially known in Washington as the “third rail of politics” for its sensitivity to voters.\n\nMany Americans “literally count on social security to buy food, just to get by”, Biden said, and “many of these beneficiaries, it’s their only income. If it were cut or taken away, it would be devastating, devastating for millions of people”.\n\nHe bashed Trump’s commerce secretary, former hedge fund manager Howard Lutnick, over a recent remark in which he said “fraudsters” would complain about a missing check, but not his mother-in-law.\n\nBiden scoffed at that characterisation, saying, “What about the 94-year-old mother living all by herself — who doesn’t have a billionaire in the family?”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/161235361528767.png",
  "retrievedAt": "2025-08-25T14:14:27.600Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1904608/biden-slams-trump-destruction-in-first-post-presidency-speech",
  "dateList": "2025-04-16",
  "date_published": "2025-04-16T07:10:25.000Z"
}
