{
  "title": "Pakistan, Turkey two countries, one nation: Air Chief",
  "link": "https://www.app.com.pk/national/pakistan-turkey-two-countries-one-nation-air-chief/",
  "date_published": "2021-01-17T08:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP):Chief of the Air Staff, Pakistan Air Force (PAF) Air Chief Marshal Mujahid Anwar Khan has said that Pakistan and Turkey were two countries, one nation as they not only shared common culture and faith rather also have similar interests and challenges.\nThe Air Chief was addressing the board members of Association of Justice Defenders and Strategic Studies Center (ASSAM) in Turkey, said a PAF press release received here.\nThe Air Chief said that Pakistan fully supported Turkey on Cyprus and other regional issues and also stood by Ankara in its war against terrorism.\nThe Air Chief also lauded Turkey’s support to Azerbijan during latter’s conflict with Armenia to liberate territories occupied for nearly 30 years.\nReferring to the regional situation in South Asia, the Air Chief said that India had been persistently rejecting Pakistan’s repeated and visible peace gestures and continued to sponsor its proxies in Afghanistan to destabilize Pakistan through terrorist activities.\nHe further added that the ever-deteriorating situation in Kashmir and plight of its people were a big question mark for the global community as it was unfortunate to see economic interests taking precedence over moral and ethical values.\nHe thanked Turkish President, Foreign Minister, and Parliament Speaker for their supportive statements on Kashmir issue at various international forums.\nExpressing his views on defence cooperation between Pakistan and Turkey, the Air Chief underscored the ever-increasing relationship between the two defence industries and termed the bilateral cooperation as “exemplary”.\nHe pointed out that military cooperation must be built on economic cooperation, and added that joint projects, exercises, production, training, and technology sharing are leading areas of cooperation between the two countries.\nHe stressed that in order to cope with contemporary challenges and common interests, both the countries needed to further strengthen their defence cooperation.\nASSAM was a Think Tank organization founded in Turkey to work for unity and welfare of Muslim countries. Meeting with ASSAM members was the concluding event of Air Chief’s 4-day official visit to Turkey.",
  "retrievedAt": "2025-08-11T20:15:00.390Z"
}
