{
  "title": "Revelations about Goswami further expose Indian sinister designs; vindicates Pakistan’s position: FO",
  "link": "https://www.app.com.pk/national/revelations-about-goswami-further-expose-indian-sinister-designs-vindicates-pakistans-position-fo/",
  "date_published": "2021-01-17T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 17 (APP):Foreign Office spokesperson Sunday said the transcripts included in Mumbai police charge-sheet against the Republic TV anchorperson, Arnab Goswami, in the TRP case, had further exposed India’s sinister designs and vindicated Pakistan’s long held position.\nThe transcripts provided further evidence of how this whole enterprise from ‘false flag’ operation to massive electoral success was scripted and fully realized, the foreign office spokesperson said in a press release.\n“We had, at the outset, rejected India’s malicious propaganda against Pakistan and highlighted that the biggest beneficiary of the Pulwama attack in February 2019 was the BJP government, as it secured landslide victory in the ensuing Lok Sabha elections,” it was added.\nIn recent months, the world community was presented with irrefutable evidence of India’s state-sponsorship of terrorism against Pakistan and anti-Pakistan disinformation and smear campaign globally, the spokesperson said.\n“The latest revelations further confirm what Pakistan has consistently pointed out: The BJP government stages “false flag” operations; maligns Pakistan with terrorism-related allegations; stokes hyper-nationalism in the country; claims to have launched so-called “surgical strike”; and then deviously manipulates national sentiment in its bid to win elections,” he added.\nThe spokesperson further said that the pattern was unmistakable, and had been repeated to suit the RSS-BJP regime’s electoral calculations.\nThe transcripts also illustrated the unholy nexus between the ‘Hindutva’ regime and its cronies in the Indian media.\nOn the one hand, they showed how far and deeply the extremist agenda of the RSS-BJP combine has permeated India’s institutions and pillars of the State.\nOn the other hand, they showed how the rights and freedoms of Indian citizens and democratic values in Indian society were being seriously jeopardized through cynical manipulation, the spokesperson said.\n“Equally important, they show how actions of this reckless regime driven by considerations of domestic politics are gravely imperiling regional peace and security,” it was added.\nPakistan, the spokesperson said, for its part, would continue to counter Indian falsehoods with truth and act firmly and responsibly in the face of India’s provocations.\n“We hope that the international community would take full cognizance of the situation and hold India accountable for its actions vitiating the regional environment and endangering peace and security in South Asia,” he added.",
  "retrievedAt": "2025-08-11T20:14:56.680Z"
}
