{
  "title": "Charlie Chaplin’s imitator amusing thousands of netizens amid coronavirus",
  "link": "https://www.app.com.pk/national/charlie-chaplins-imitator-amusing-thousands-of-netizens-amid-coronavirus/",
  "date_published": "2021-01-17T12:32:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 17 (APP):Donning a black blazer and matching bowler hat, a youth in Peshawar is bringing smiles and laughter to hundreds of thousands of people amid the coronavirus pandemic by imitating Charlie Chaplin, the famous comedian, on the city’s roads and through uploading his videos on TipTop.\nUsman Khan, a resident of Gulbahar area, has gain popularity on the social media because of his ditto comedy style of Charlie Chaplin. He has attracted some 760,000 followers from across the globe within 45 days of uploading his first video on Tiptop.\nEach of his videos has been viewed by hundreds of thousands along with comments admiring his performance. His videos on Youtube are titled as `Pakistani Charlie’.\n“Charlie Chaplin was a world renowned comedian of silent movies and imitating his style of acting has also made me popular on the social media,” Usman said while talking to APP.\nHe said he had natural instinct of performing as a comedian. From the childhood he used to share jokes and comic with family members and friends. “Being a comedy lover, I also used to watch the videos of Charlie Chaplin and liked his acting,” he added.\nLike Charli Chaplin who passed his childhood in London in poverty, Usman has to work hard to meet both ends meet. He earns his livelihood by selling toys as a vendor in Peshawar’s Saddar Bazar. He still manages to spare his time for his hobby of acting.\n“The objective of performing like Charlie Chaplin is to bring smiles on the faces of people, who are presently depressed due to the COVID-19 pandemic,” Usman told APP.\nHe said the people of the region had to go through the agonies and tragedies due to the decade long wave of terrorism, where bomb blasts, suicide bombing and target killings were order of the day.\n“The people of the whole world and especially this region need relief from depression and mental stress for which I have started comedy acting,” Usman remarked.\nHe said he would like to perform in any comedy show, film or drama, if he was extended any offer in that regard. His only objective was to bring laughter to the people, either through the social media or any other platform, he added.\nUsman said as he had gained popularity he was focusing more on Charlie Chaplin’s acting to bring improvement in his performance. At present he could copy only four to five percent of Charlie Chaplin.\n“Wherever I go for performing, people gather around me. They cheer and appreciate me, besides taking selfies,” he said. “The people’s response, especially a bout of laughter after seeing my work encourages me to continue to work for amusing the public.”\nSome friends help Usman in making videos. He always plays the main role, and side ones are performed by his friends.",
  "retrievedAt": "2025-08-11T20:14:56.064Z"
}
