{
  "title": "Heavy Mechanical Complex signs agreements with 6 leading Chinese enterprises",
  "link": "https://www.app.com.pk/national/heavy-mechanical-complex-signs-agreements-with-6-leading-chinese-enterprises/",
  "date_published": "2020-06-18T04:37:00.000Z",
  "source": "APP",
  "content": "BEIJING, June 18 (APP)::The Heavy Mechanical Complex (HMC) Taxila on Thursday signed business cooperation agreements with six leading Chinese enterprises covering the fields of industrial engineering, steel, air-conditioning and ventilation, infrastructure, engineering consulting, and transfer of technology and industry-academia exchanges.\nThe business cooperation agreements were inked in an signing ceremony co-hosted by the HMC and and Pakistan’s Embassy in Beijing.\nSpeaking on the occasion, Pakistan’s Ambassador to China Ms Naghmana A Hashmi congratulated the HMC and its partner enterprises on securing valuable opportunities for win-win cooperation.\nShe said the ceremony was taking place in an adjusted format via video link, which showed the ability of Pakistan and China to adapt to the conditions and forge ahead with their all-weather strategic cooperative partnership regardless of the challenges or circumstances.\n“In recent years, our cooperation has manifested in the China-Pakistan Economic Corridor (CPEC),” she added.\nAs a flagship project of the visionary Belt and Road Initiative (BRI), CPEC had further demonstrated the cardinal principles of Pakistan-China friendship, Ambassador Hashmi said.\nShe said CPEC’s next stage of even higher-quality development would accelerate industrial capacity modernization and relocation. Looking past the immediate pandemic, business cooperation between the HMC and the leading Chinese enterprises would further complement and contribute to bilateral industrial capacity cooperation, she added.\nSpecial Assistant to the Prime Minister on Information Asim Bajwa, who is also the Chairman of CPEC Authority, was the chief guest on the occasion.\nThe ceremony was also attended by Chinese Ambassador to Pakistan Yao Jing, the Pakistan Atomic Energy Commission chairman, and the top leadership of HMC.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:21:34.337Z"
}
