{
  "title": "PM wants all CPEC projects be completed on priority: Asim Bajwa",
  "link": "https://www.app.com.pk/national/pm-wants-all-cpec-projects-be-completed-on-priority-asim-bajwa/",
  "date_published": "2020-06-18T03:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP):Special Assistant to Prime Minister on Information and Broadcasting Lt. Gen (Retd) Asim Saleem Bajwa Thursday said that the Prime Minister had directed to complete all CPEC projects on priority.\nThe vision and direction of PM is very clear that is to continue each and every project and complete them as soon as possible,\nhe said while addressing a signing ceremony of Business Cooperation Agreements in various fields between leading Chinese entrepreneurs and Heavy Mechanical Complex (HMC) in Taxila.\nHe said all those projects which were held up due to procedural delay or technical reasons would be handled on priority.\nReferring to misleading news disseminated by some detractors, he said CPEC was becoming a fast reality and it had been witnessed by all that even COVID-19 could not hamper the progress of CPEC projects.\nLIVE #APPNews : Chairman #CPEC Authority and SAPM on Information and broadcasting General (r) Asim Saleem Bajwa talking with media at HMC #Taxila @AsimSBajwa https://t.co/o6HNtQFUqd\n— APP  #StayHomeSaveLives  (@appcsocialmedia) June 18, 2020\n“We are all set to launch CPEC Phase-II in a deliberate, prepared and in an institutionalize manner with full consciousness of transparency,” he said.\nAsim Bajwa who also heads CPEC Authority said as per direction of the PM, loan burden on the government in Phase-II would be reduced by opting the business to business mode with the Chinese firms who would be invited to come to Pakistan and partner with the Pakistani companies for investment.\n“We are connecting the companies from the two countries among themselves and a new business council for this purpose is also going to be announced soon,” he said.\nUnder the banner of CPEC, he said a lot of new projects and business activities were going to happen in days to come.\nHe said Pakistan-China relationship and development of CPEC was not restricted to one government but rather it spanned over decades.\nAsim Bajwa said that a process of mass industrialization was going to be initiated in the country under second phase of China Pakistan Economic Corridor (CPEC) that would ensure self-reliance in various fields.\nAsim Bajwa maintained that under second phase railway sector would be revamped by up-grading the mainline (ML-1) railway line from Karachi to Peshawar.\n“Manpower would be totally revamped, underpasses and overhead bridges would be built at all railway crossings, and speed of trains would significantly enhance,” he said.\nHe said latest technology and industry would now be relocated to Pakistan and for this purpose preferred Special Economic Zones (SEZs) were being established in all provinces under CPEC.\n“We are close to signing development agreement of Rashakai in Khyber Pakhtunkhwa, work progress on Dhabeji SEZ in Sindh was going well while Allama Iqbal Economic Zone in Punjab has already been inaugurated”.\nHe said the signing of agreements between HMC and Chinese companies would help enhancing exports and substituting the imports besides boosting employment opportunities in the country.\nThe revamping of HMC with the help of China will contribute in import substitution and prevent us from importing heavy machinery from abroad and we will be relying heavily on HMC, he said and requested all companies who were ready to install industries in SEZs to place their orders with HMC to get their machines as per their demand.\nFurther the Special Assistant said that development of agriculture sector was also part of CPEC Phase-II and with the help of China, all types of heavy agricultural machinery would now be manufactured at HMC that earlier were used to be imported from abroad.\nMeanwhile Chinese Ambassador Yao Jing said the agreement would help strengthening mutual economic cooperation.\nHe said the second phase of CPEC, China would help Pakistan in building its capacity in various fields including manufacturing, agriculture and science and technology.\nAmbassador of Pakistan to China Naghmana Hashmi said through a video link that Pakistan China cooperation would further enhance HMC capacities to play role in the country’s development.\nChairman Atomic Energy Commission Muhammad Naeem also spoke on the occasion.",
  "retrievedAt": "2025-08-11T19:21:37.443Z"
}
