{
  "title": "Lockdown imposes in federal capital’s four sub-sectors: Health officials",
  "link": "https://www.app.com.pk/national/lockdown-imposes-in-federal-capitals-four-sub-sectors-health-officials/",
  "date_published": "2020-06-17T23:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP):The district administration on Thursday imposed lockdown in four sub-sectors of federal capital to protect citizens from carrying Coronavirus in prevailing high-risk situation in these areas.\nAs the novel Coronaviurs (COVID-19) death toll in the city reached 90, the health authorities decided to seal four sub-sectors of federal capital to contain the spread amongst the citizens in specified areas.\nAccording to official sources, as per data 441 persons were tested positive with COVID-19 in Sector I-8, and 427 in the sector I-10.\nEarlier the sector G-9 was sealed after 430 cases were confirmed with the COVID-19 and the administration decided to lockdown two sub sectors there as well.\nDeputy Commissioner (DC) Islamabad Hamza Shafqaat had stated that the decision was taken in response to the District Health Office’s recommendation to seal G-9/2 and G-9/3 along with the sector’s markiz, commonly known as Karachi Company.\nEarlier residents of all sub-sectors were given enough time to make the necessary arrangements and obtain essential items, while the administration also made arrangements during this period.\nThe DC had said that people will not be allowed out of their homes during the lockdown except to buy essentials, however medical stores and food outlets in the area will stay open during the lockdown.\nAll activities, including weddings, events and gatherings were not allowed in these areas.\nAccording to the National Command and Operations Center (NCOC) data more cases have been reported in Islamabad in last 24 hours, taking the toll of the infected COVID-19 persons to 9,637 in the city. The number of recovered patients has reached 2,439.\nThe District Health Officer (DHO) Dr Zaeem Zia said that although there is a hike in cases in Islamabad, the brighter side is the number of tests per million in Islamabad. “We are ensuring diagnosing and isolating the infected ones and will keep diagnosing more and will ensure necessary actions in place to contain virus.”\nIt is pertinent to mention here that a notification was issued by District Magistrate Islamabad said “In exercise of the powers under Epidemic Diseases Control Act, 1958 and after notification of COVID-19 confirmed cases on line list of NIH duly traced by the surveillance teams and in order to prevent the community spread of the COVID-19 virus in the area, the sector I-8/3, I-8/4, I-10/1, and I-10/2 Islamabad along with main marakiz of I-8 and I-10 are hereby sealed w.e.f. 18 June 2020, 12:01 a.m., in public interest and until further orders.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:21:32.974Z"
}
