{
  "title": "Qureshi chairs meeting of Public Diplomacy Group for building closer linkages",
  "link": "https://www.app.com.pk/national/qureshi-chairs-meeting-of-public-diplomacy-group-for-building-closer-linkages/",
  "date_published": "2020-06-18T03:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi Thursday chaired the inaugural meeting of the Consultative Group on Public Diplomacy in line with his vision to enhance and upgrade the communication toolkit of the Foreign Office.\n“Operationalization of the Consultative Group marks the launch of another key institutional reform premised on forging closer linkages between the Foreign Office and other stakeholders, and inducting fresh thinking and new ideas into the policy formulation process,” a Foreign Office statement said.\nThe dedicated group set up by the foreign minister comprises eminent scholars, field specialists and former Ambassadors and aims at bringing focused attention to various aspects of the Ministry of Foreign Affairs’ public diplomacy initiatives including projecting Pakistan’s real image abroad, and more effectively highlighting the country’s rich artistic, cultural, literary and sports heritage.\nFederal Minister for National History and Literary Heritage, and Minister for Federal Education and Professional Training, Shafqat Mahmood; former Senator Javed Jabbar; Ambassador Zamir Akram; Ambassador Tasnim Aslam; Ambassador Shahid Kamal, along with. Emran Akhtar, and Ms. Selina Rashid participated in the meeting, together with senior officials of the ministry.\nDeliberations focused on concrete steps needed to more purposefully engage foreign media, academia, think tanks as well as publics at large. Proposals to harness public-private synergies, and more effectively utilize modern platforms of communication and outreach, including the virtual space, came under discussion.\nTo spearhead initiatives in priority domains, Working Groups on Digital Diplomacy, Cultural Diplomacy and Sports Diplomacy have been established.\nThis builds upon earlier initiatives launched pursuant to “Vision Foreign Office” including upgradation of Ministry’s website, the “FM Direct App” and the “FM Connect” series of meetings and interactions with thought leaders from various walks of life. Among other reform initiatives, the Advisory Council of Foreign Affairs deliberates and conducts research on core foreign policy issues, while a Strategic Communication Division is in the process of being set up.\nThe reforms are in line with Prime Minister Imran Khan’s vision of further enhancing, modernizing and expanding efficacy of Pakistani diplomatic apparatus to meet the demands and challenges of twenty-first century diplomacy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:21:34.967Z"
}
