{
  "title": "Pakistan, Nigeria agree to promote defence cooperation",
  "link": "https://www.app.com.pk/national/pakistan-nigeria-agree-to-promote-defence-cooperation/",
  "date_published": "2022-03-17T16:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 17 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Thursday welcomed Major General ® Bashir Salihi Magashi, the visiting Minister for Defense of Nigeria, who is on a 3-day bilateral visit to Pakistan.Identifying new vistas for advancing bilateral relations, the two sides agreed on promoting bilateral cooperation between Pakistan and Nigeria in the defence arena.\nThe Foreign Minister expressed satisfaction over the bilateral collaboration in the security, aviation and counter-terrorism fields.\nUnderscoring common history, shared values and perceptions as solid pillars of trust-based ties with Nigeria, he expressed complete satisfaction at the positive trajectory of Pakistan-Nigeria relations, reinforced by presence of expatriate communities in each country and 50% increase in Pakistani exports to Nigeria last year.\nHighlighting Pakistan’s ‘Engage Africa’ policy to expand diplomatic footprint and deepen trade and investment partnerships with Africa, Foreign Minister Qureshi briefed on the steps taken in this regard, including opening 5 new Embassies and relocating 6 Trade Sections in Africa and organizing Trade Conferences in East and West African regions in Kenya (Jan 2020) and Nigeria (Nov 2021) respectively.Welcoming the presence of Nigerian students in Pakistani universities, both sides concurred on realizing further opportunities for Nigerian diplomats and students in Pakistani institutions and continuing with the tradition of regular exchanges at multiple levels.The Foreign Minister welcomed Nigeria’s participation in the forthcoming 48th OIC-CFM in Islamabad and expressed keenness to welcoming Muhammadu Buhari, President of Nigeria for bilateral visit to Pakistan at the earliest convenience.",
  "retrievedAt": "2025-08-11T14:33:06.831Z"
}
