{
  "title": "Green Youth Movement to provide eco-friendly jobs, empowerment to youngsters: Dar",
  "link": "https://www.app.com.pk/national/green-youth-movement-to-provide-eco-friendly-jobs-empowerment-to-youngsters-dar/",
  "date_published": "2022-03-17T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 17 (APP):Special Assistant to the Prime Minister (SAPM) on Youth Affairs Muhammad Usman Dar said the youth would be provided green clubs, green jobs, green election and green eco-innovation through Kamyab Jawan Green Youth Movement to drive climate action for environmental conservation.\nThe Green Youth Movement launching ceremony was attended by Federal Minister for Information and Broadcasting Chaudhry Fawad Hussain, Planning Minister Asad Umar, Minister of State for Climate Change Zartaj Gul, SAPM on Youth Affairs Muhammad Usman Dar, SAPM on Climate Change Malik Amin Aslam here on Thursday.\nAddressing the Kamyab Jawan Green Youth Movement under the Prime Minister’s “Clean Green Pakistan” programme to engage the youth to promote eco-friendly culture across the country, he said the Green Youth Movement (GYM) would provide 65,000 jobs in the country as the jobs creation was the main purpose of the programme.\nKamyab Jawan GYM Clubs have been set up in 137 public sector universities across the country. Usman Dar announced that the ‘Skills for All’ scholarships programme would be scaled up to provide maximum numbers of scholarships to the students in hi-tech whereas Prime Minister Imran Khan was taken on board in this regard.\nUnder the ‘Skills for All’ programme, scholarships were being provided to 200,000 youth to acquire technical education in modern and traditional fields.\nKamyab Jawan Sports Talent Hunt Drive being launched to revive sports culture in Pakistan was providing access to thousands of youth to sports grounds.\nPrime Minister Imran Khan has laid the foundation of a transparent and merit base programme in the shape of KJP whereas the data and information regarding the programme has been made public, which may be checked on https:kamyabjawan.gov.pk/, he added.\nThe government, he said under the KJP over Rs 42 billion soft loans were disbursed to 27,000 youth in Azad Jammu and Kashmir, Gilgit-Baltistan and all the provinces.\nThrough the KJP loan scheme, around 60,000 youth have been provided employment opportunity in agriculture, manufacturing and services sectors, he added. Kamyan Jawan Marakiz has been established as one window operation portals providing counseling, advocacy, education and awareness on various technical and skill-based employment opportunities under the KJP.\nThe KJP, under the vision of Prime Minister Imran Khan has been working to empower, educate and engage the youth to produce entrepreneurs, experts and national heroes.   Under the initiative, around 2.5 million students of 137 universities participate would take part in green youth moment and would provided jobs to 65000 youth across the country.\nExecutive Director Higher Education Commission (HEC), Dr Shahista Sohail the Kamyab Jawan Programme in collaboration with HEC has been running five youth engagement initiative including Green Youth Moment (GYM).\nThe GYM with the collaboration British Council would bring change in the country. The youth qualified from the universities would play their role for the promotion of agriculture and forestry, renewable energy, eco-tourism, preservation of water and adequate disposal of liquid and solid waste at designated places.\nMomi Saleem speaking on the occasion said that under the Kamyab Jawan Green Youth Movement, financial and technical support would be provided to the youth for eco-system restoration and eco-innovation.\nThe captain of GYM clubs would be selected through green elections under the vision of Prime Minister Imran Khan to politically motivate the youth. The Program will be supported by British Council under its Pakistan Youth Leadership Initiative program.\nUnder this initiative, program will be executed through 137 public universities and Green Youth Movement Clubs. Green Clubs will be developed in all public sector Higher Education Institutions engaging 2.5 million youth.",
  "retrievedAt": "2025-08-11T14:33:08.444Z"
}
