{
  "title": "Pakistani-American women leaders strong anchor for Pakistan-US relationship: Ambassador",
  "link": "https://www.app.com.pk/national/pakistani-american-women-leaders-strong-anchor-for-pakistan-us-relationship-ambassador/",
  "date_published": "2022-03-17T16:01:00.000Z",
  "source": "APP",
  "content": "In his welcome remarks, Ambassador of Pakistan to United States Asad Majeed Khan lauded the achievements of Pakistani and Pakistani-American women and termed women empowerment as a force multiplier for change and the continued socio-economic progress of the country. He noted that today the women of Pakistan were breaking barriers, crossing new boundaries, and venturing into new frontiers. They were in fact proud and equal partners in national development. He especially highlighted the role of Pakistani-American women towards strengthening of Pak-US bilateral relations. ‘Pakistani-American Women through their role as leaders can act as strong anchor to Pakistan-US relationship’, stated the Ambassador United States Representative Sheila Jackson Lee in her remarks.She acknowledged the achievements and vital involvement of women not only in Pakistan, but also in the U.S. where the Pakistani American women had made their mark in every sector. “When women succeed America succeeds. When Pakistani American women succeed, America and Pakistan succeed”, observed Ms. Jackson. Sheen encouraged women to strive for even greater leadership and decision-making roles. During his virtual keynote address, Assistant Secretary of State for South and Central Asian Affairs Ambassador Donald Lu highlighted contributions of prominent women leaders of Pakistan including Malala Yousafzai and others. Ambassador Lu reiterated that US was committed to working with Pakistan on empowerment of women. He also highlighted various initiatives taken by the US and the valuable contribution of U.S.-Pakistan Women’s Council—a public-private partnership working to catalyze commitments from the private sector, civil society and government leaders in both Pakistan and the United States to further women’s economic empowerment in Pakistan. Pakistan first woman Surgeon General, Lt Gen Nigar Johar, HI(M), in her message, noted that women in Pakistan were making their mark in every field of life. She emphasized the need for greater gender inclusiveness at all levels especially in the decision-making processes.\nShe encouraged young females to have confidence in their abilities and employ their talent for excelling in their respective fields. During the panel discussion, prominent Pakistani American women leaders highlighted their life journey and shared their valuable experiences. The speakers included, Ms. Nabeela Khattak, entrepreneur in the US, Ms. Nargis Ali, IT Professional and CEO Sure Secure Solutions, Ms. Sadaf Jaffer, Member New Jersey General Assembly, Ms. Shamila Chaudhry, President, Pakistan-American Foundation (APF), Sabrina Siddiqui, Wall Street Journalist and Hena Khan, an award-winning writer and storyteller.The event was attended by large number of prominent women representing the US government, State and County level legislatures, private sector, professional organizations, and academics.\nAmerican women leaders strong anchor for Pakistan-US relationship: Ambassador",
  "retrievedAt": "2025-08-11T14:33:06.008Z"
}
