{
  "title": "PM, Bahrain’s National Guard Commander discuss matters of mutual interest",
  "link": "https://www.app.com.pk/national/pm-bahrains-national-guard-commander-discuss-matters-of-mutual-interest/",
  "date_published": "2022-03-17T14:11:00.000Z",
  "source": "APP",
  "content": "National Guard Commander of Bahrain General Shaikh Mohammed bin Isa Al Khalifa called on Prime Minister Imran Khan here on Thursday and discussed matters of mutual interest.\nThe National Guard Commander conveyed cordial greetings of the King and the Crown Prince and Prime Minister of the Kingdom of Bahrain to Prime Minister Imran Khan. Highlighting the high esteem accorded to the Bahraini leadership by the government and people of Pakistan, the Prime Minister warmly reciprocated the sentiments.\nThe Prime Minister reaffirmed Pakistan’s long-standing fraternal ties with Bahrain, rooted deep in shared faith, values and cordiality. The Prime Minister lauded the efforts on both sides to build an enhanced partnership and underscored the imperative of forging deeper and diverse economic, trade and investment cooperation.\nLauding the successful measures by Bahrain against Covid-19, Prime Minister Imran Khan thanked the Bahraini leadership for the care afforded to Pakistani expatriates during the pandemic and urged further strengthening of this strong bond of friendship between the two countries.\nNational Guard Commander of Bahrain expressed his country’s firm resolve to further expand cooperation with Pakistan in diverse fields. He expressed thanks for Pakistan’s steadfast support and underlined that the two countries always stood by each other at difficult times. He congratulated the Prime Minister on the designation of 15 March as International Day to Combat Islamophobia by the United Nations (UN) as a result of a landmark resolution introduced by Pakistan, on behalf of the Organisation of Islamic Cooperation (OIC).\nThe Prime Minister conveyed that he looked forward to welcoming His Majesty the King as well as the Crown Prince and Prime Minister of Bahrain in Pakistan at the earliest convenience.\nPakistan and Bahrain enjoy traditionally close and fraternal ties. Bilateral relations with Bahrain have been following an upward trajectory since Prime Minister Imran Khan’s visit to the Kingdom of Bahrain in December 2019, on the invitation of His Majesty King Hamad bin Isa Al Khalifa.",
  "retrievedAt": "2025-08-11T14:33:14.370Z"
}
