{
  "title": "PM for further strengthening Pakistan-Austria cooperation in diverse areas",
  "link": "https://www.app.com.pk/national/pm-for-further-strengthening-pakistan-austria-cooperation-in-diverse-areas/",
  "date_published": "2022-03-17T17:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 17 (APP): Prime Minister Imran Khan on Thursday said that Pakistan desired to add further substance to its excellent bilateral cooperation with Austria across the broad range — including trade, investment, higher education, IT, tourism, climate change, and so on.\nHe emphasized that Pakistan highly valued its long-standing and cordial relations with Austria.\nThe Prime Minister was talking to Federal Minister for European and International Affairs of Austria, Alexander Schallenberg, who called on him here.\nDuring the meeting, the focus was on bilateral relations, regional situation and international issues.\nThe Austrian Foreign Minister thanked the Prime Minister for receiving him and informed that he was accompanied by a big business delegation. He conveyed greetings of the Federal Chancellor of Austria.\nThe Prime Minister recalled his recent phone conversation with Federal Chancellor Karl Nehammer and stated that he was looking forward to welcoming him to Pakistan at the earliest opportunity.\nHe particularly thanked Austria for its collaboration in the establishment of Pakistan-Austria Institute of Applied Sciences and Technology at Haripur and stated that Pakistan looked forward to establishing further such institutions, in cooperation with Austria, given the world class quality of Austria’s institutions of higher learning particularly in engineering and technology.\nThe Prime Minister expressed Pakistan’s serious concern at the conflict in Ukraine and stressed the imperative of finding a diplomatic solution.\nHe underscored that Pakistan upholds the fundamental principles of the UN Charter.\nThe Prime Minister recalled that he had from the outset emphasized that conflict does not resolve anything and that Pakistan was consistently pressing for continued efforts for a solution through dialogue and diplomacy.\nHe further noted that he had been highlighting that conflict adversely impacts developing countries, which could now be seen in rising oil prices and food inflation.\nRecalling his recent phone conversation with President of the European Council Charles Michel, the Prime Minister said that countries like Pakistan could play a facilitating role towards a diplomatic solution.\nIn the regional context, he emphasized that the world’s attention must not shift from Afghanistan and that urgent steps were needed to be taken to prevent humanitarian and economic crises in Afghanistan.\nThe Prime Minister stressed the need for continued engagement of the international community to preserve the development gains made over the last two decades and to promote the shared goals of peace and stability in Afghanistan.\nHe urged the international community to take notice of serious human rights violations by India in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) which have increased since India’s illegal and unilateral actions of 5 August 2019.\nThe Prime Minister said that the world must impress upon India to comply with its international obligations to allow Kashmiris to exercise their right to self-determination as per international law and the relevant UNSC resolutions.\nHe raised recent grave act of firing of an Indian missile into Pakistani territory, which has raised serious questions about India’s security protocols and technical safeguards against accidental or unauthorized launch of missiles in a nuclearized environment.\nThe Prime Minister urged the world community to play its due role in upholding the strategic stability in the region.",
  "retrievedAt": "2025-08-11T14:33:02.114Z"
}
