{
  "title": "Women’s participation in political process signifies gender equality: Law Minister",
  "link": "https://www.app.com.pk/national/womens-participation-in-political-process-signifies-gender-equality-law-minister/",
  "date_published": "2023-08-03T12:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP): Minister for Law and Justice Senator Azam Nazeer Tarar on Thursday said that women’s full and equal participation in political and electoral processes signifies gender equality in the country.\nHe was addressing the ‘National Dialogue on Women Inclusive Electoral Processes, said a press release issued here.\nThe minister said that when women participate in elections – as voters, candidates, electoral administrators, or party supporters, political processes are more inclusive and democracy is strengthened.\nHe further added that women’s full participation in political and electoral processes has been enumerated in international instruments such as the International Covenant on Civil and Political Rights (ICCPR) and the Convention on the Elimination of all Forms of Discrimination against Women (CEDAW), both of which have been ratified by Pakistan.\nThe minister said that under the Elections Act 2017, the ECP may declare the election void if the turnout of women voters is less than ten per cent of the total votes polled in a constituency. The commission may conduct public awareness programs and media campaigns regarding the importance of maximum voter enrollment and participation in elections especially by women, he said\nAzam Nazeer Tarar said that there shall be seats in the National Assembly allocated to each Province, Islamabad Capital Territory, and the Federally Administered Tribal Areas and seats reserved for women and non-Muslims, as specified in Article 51 of the Constitution.\nThe ECP will annually publish disaggregated data of registered men and women voters in each National Assembly and Provincial Assembly constituency highlighting the difference in number of registered men and women voters, he said.\nThe law minister said that the Presiding Officer may at any stage on the polling day during or after the polling, prepare and send a special report to the Returning Officer and to the commission if he has reason to believe that women voters have been restrained from exercising their right to vote based on any express or implied agreement.\nA political party when making the selection of candidates for elective offices, including membership of the Parliament and Provincial Assemblies, shall ensure at least five per cent representation of women candidates, he concluded.",
  "retrievedAt": "2025-08-11T09:03:31.066Z"
}
