{
  "title": "PM’s Health Insurance Scheme for journalists, artists historic step of Shehbaz Sharif: Marriyum",
  "link": "https://www.app.com.pk/national/pms-health-insurance-scheme-for-journalists-artists-historic-step-of-shehbaz-sharif-marriyum/",
  "date_published": "2023-08-03T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said that the health insurance scheme for journalists and artists was a historic decision of Prime Minister Shehbaz Sharif.\nWhile addressing the signing ceremony of the Memorandum of Understanding between the Ministry of Information and Broadcasting and State Life Insurance Corporation for the health insurance of journalists and artists here Thursday, she said that the prime minister took a historic decision for the health insurance of journalists and artists, which was starting from today, for the first time in the history of Pakistan.\nShe said that Rs 1 billion had been allocated for each category of journalists and artists from all over Pakistan in the current fiscal year. She said that the prime minister had issued directives that the money allocated in the budget for journalists and artists should not be limited to announcements only but practical steps should be taken on this project.\nThe minister said that the registration for health insurance was started two weeks ago for journalists and media workers and one week ago for artists.\nShe said that the foundation of the health insurance card scheme was laid during the Nawaz Sharif tenure as prime minister. She said that keeping in mind the experience of State Life Insurance Corporation, the Ministry of Information was going to issue health insurance cards for journalists and artists community.\nThe minister said that Prime Minister Shehbaz Sharif will issue health insurance cards on August 7 to both journalists and artists. Marriyum said that in a short period of 15 months, the government had done important legislation for the welfare of journalists, linking their minimum wages with government business. She said that health facilities would be provided to journalists in the form of health insurance cards.\nThe federal minister said that various surgeries including renal surgery, heart surgery and cardiac surgery including indoor and outdoor medical facilities were covered under the health insurance scheme while ambulance service would also be provided under this card.\nShe said that many value additions have also been done by State Life Insurance in the scheme. Marriyum Aurangzeb said that along with health insurance scheme, the welfare of journalists and artists had also been arranged by the incumbent government.\nShe said that in a short period of 15 months, Rs 120 million have been recovered and paid to newspaper employees in the form of salaries, while health insurance including job security of media workers has been started.\nThe federal minister said that in the last four years, the country was facing serious economic crisis and important projects were delayed. She said that Prime Minister Shehbaz Sharif not only rescued these projects but also restored them and ensured their completion.\nThe minister thanked the entire team of the Ministry of Information for making the health insurance scheme for journalists and artists a success.\nMinister for Law and Justice Nazir Tarar, Prime Minister’s Coordinator for Economy and Energy Bilal Azhar Kayani, Secretary Information Sohail Ali Khan, Principal Information Officer Mubashar Hassan and Chairman State Life Insurance Corporation Shoaib Javed participated in the ceremony.",
  "retrievedAt": "2025-08-11T09:03:38.162Z"
}
