{
  "title": "Senate body wants LHC CJ intervention in IUB drugs, video scandal",
  "link": "https://www.app.com.pk/national/senate-body-wants-lhc-cj-intervention-in-iub-drugs-video-scandal/",
  "date_published": "2023-08-03T15:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP): Senate Standing Committee on Federal Education and Professional Training Thursday decided to approach Chief Justice (CJ) Lahore High Court (LHC) requesting him to constitute a commission to probe into the Islamia University Bahawalpur (IUB) drugs and video Scandals issue.\nThe committee that met here with Irfan-ul-Haque Siddiqui in the chair decided to address the matter by writing a letter to the LHC CJ, urging the constitution of a judicial commission to conduct a thorough inquiry.\nThe IUB Vice-Chancellor briefed the Senate body regarding concerning issues of drug sales, scandals, exploitation, and dissemination of obscene material involving students and teachers on Campus.\nHe informed the committee about ongoing investigations by the Punjab Higher Education Department and a special inquiry committee established by the CM Punjab.\nNotably, three university officers were in police custody for their involvement in illegal contraband drug possession, the committee briefed. The matter of harassment and obscene videos was still under investigation.\nIn light of the gravity of the issues, Senator Siddiqui remarked that this has the potential to not only disrupt education but also affect the lives of female students.\nDuring the meeting, the committee reviewed “The Higher Education Commission (Amendment) Bill, 2023,” presented by Federal Minister Rana Tanveer Hussain.\nSenator Mian Raza Rabbani who attended the meeting on a special invitation provided valuable historical context and proposed amendments to the bill, which were appreciated by Minister Hussain.\nSenator Mushtaq Ahmed also put forward amendments regarding the HEC’s autonomy and the Chairman’s term of office, advocating for a four-year tenure.\nFollowing extensive deliberations, the committee unanimously approved the Bill with the proposed amendments.\nThe Senate Panel deliberated on matters pertaining to the establishment of higher education institutions in Multan and Sialkot.\nThe Committee engaged in a comprehensive discussion on three private member bills aiming to establish higher education institutions in the mentioned cities.\nSenator Siddiqui emphasized the importance of adhering to the HEC’s prerequisites and documentation requirements before considering these bills.\nThe Committee deferred the consideration of two Bills, while one Bill for the establishment of Lahore University of Management and Technology was dropped on the continued absence of the mover.\nAddressing the broader concern of mass approval of university-related Bills by the National Assembly, the Committee chairman reassured the public that the Senate’s education committee was committed to scrutinizing each bill meticulously, aligning with the criteria set forth by the HEC.\nAdditionally, the Committee thoroughly discussed “The Federal Urdu University of Arts, Sciences and Technology, Islamabad (Amendment) Bill, 2023,” which aims to enhance the university’s efficiency by addressing existing gaps.\nSenator Rabbani’s proposed amendments received unanimous approval.\nDuring the meeting, the Chairman HEC provided a detailed briefing on the issues faced by the university and informed the committee about the inquiry committee established by the President of Pakistan to investigate administrative issues and illegal appointments.\nThe chair took note of the administrative shortcomings and decided to hold the committee meeting in Karachi to gain a comprehensive understanding of the challenges it faces.\nFurthermore, the committee approved the private member bill titled “The Federal Board of Intermediate and Secondary Education (Amendment) Bill 2023,” aimed at replacing wods “Federal Government” with “Appropriate Authority” for streamlined functioning and prompt decision-making.\nAmong others, the meeting was attended by Senators, Prof. Dr Mehr Taj Roghani, Fawzia Arshad, Jam Mahtab Hussain Dahar, Engr Rukhsana Zuberi, Rana Maqbool Ahmed, Molvi Faiz Muhammad, Ahmed Khan, Secretary Federal Education, and senior officials from relevant departments.\nWhile Prof. Sajid Mir, Syed Muhammad Sabir Shah, Palwasha Muhammadzai Khan, and Waqar Mehdi attended the committee meeting as movers.",
  "retrievedAt": "2025-08-11T09:03:22.577Z"
}
