{
  "title": "President for enhancing ties with UK, South Korea, Malawi",
  "link": "https://www.app.com.pk/national/president-for-enhancing-ties-with-uk-south-korea-malawi/",
  "date_published": "2023-08-03T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP): President Dr Arif Alvi on Thursday said that Pakistan wanted to enhance its relations with the United Kingdom (UK), the Republic of Korea, and Malawi in the fields of trade, economy, and culture.\nThe president made these remarks while talking to the High Commissioner-designates of the United Kingdom and Malawi, and the Ambassador-designate of the Republic of Korea to Pakistan.\nThe envoys presented their diplomatic credentials to the president and separately called on him, at Aiwan-e-Sadr.\nTalking to Jane Marriot, the UK’s High Commissioner to Pakistan, the president said that Pakistan attached utmost significance to its longstanding ties with the UK, which were grounded in historic connections and enduring people-to-people linkages.\nHe remarked that both countries needed to further expand and promote economic and trade relations for the mutual benefit of the two sides.\nHe also lauded the contributions of the Pakistani diaspora in the UK towards its socio-economic development.\nPresident Alvi underscored the need for strengthening cultural ties and people-to-people contacts.\nHe highlighted that both governments were committed to establishing and maintaining a more robust and long-term relationship.\nHe also urged that the world needed to prevent and discourage the incidents of the Islamophobia in the world.\nSpeaking to Park Ki Jun, the ambassador of the Republic of Korea, the president said that Pakistan highly valued its multidimensional relationship with Korea, encompassing political, economic, scientific, cultural, and people-to-people linkages.\nHe mentioned that Pakistan and Korea had tremendous potential to increase bilateral trade to further strengthen economic relations.\nHe said that Pakistan was open for business and investment, and would welcome Korean investment in all sectors of its economy.\nThe president informed that Pakistan offered some of the most exotic mountaineering and religious Buddhist sites, and would welcome Korean tourists to visit and explore these sites.\nTalking to Younos Abdul Karim, the high commissioner of Malawi to Pakistan, the president expressed Pakistan’s deep appreciation for its historical and brotherly ties with Malawi, which were marked by shared interests, values, and goals.\nHe stressed the need for expanding economic, political, and cultural relations between the two countries.\nThe president congratulated the envoys on their appointments and expressed the hope that they would play their role to further boost bilateral cooperation with Pakistan.",
  "retrievedAt": "2025-08-11T09:03:34.684Z"
}
