{
  "title": "PM thanks President Xi for “powerful” message of support, solidarity with Pakistan",
  "link": "https://www.app.com.pk/national/pm-thanks-president-xi-for-powerful-message-of-support-solidarity-with-pakistan/",
  "date_published": "2023-08-03T03:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP): Prime Minister Shehbaz Sharif on Thursday thanked Chinese President Xi Jinping for his “powerful” message of support and solidarity with Pakistan on completion of the Decade of China-Pakistan Economic Corridor (CPEC).\nIn his message, which was also read out by Chinese Vice Premier He Lifeng at a ceremony marking 10 years of CPEC held here, President Xi had assured that China would always stand firm with Pakistan regardless of any change in international landscape.\nHe also emphasised that both countries would continue to improve overall planning and deepen cooperation.\n“Highly grateful to H.E. President Xi Jinping for his powerful message of support and solidarity with Pakistan on the occasion of the completion of the Decade of CPEC,” Prime Minister Shehbaz wrote on a social media platform.\nHe said that President Xi’s emphasis on building CPEC into “an exemplary project of high quality Belt and Road Cooperation” reflected his commitment to the well-being of the people of Pakistan.\nHe said indeed, CPEC had achieved many milestones over the course of last ten years in the fields of high quality infrastructure, energy, and socio-economic growth.\n“As the flagship project of BRI, CPEC matured into a story of transformation under the leadership of Mian Nawaz Sharif. Pakistan is ready to share this story with our friends and partners around the world,” the prime minister remarked.\nHe said Pakistan would never be able to thank President Xi Jinping enough for his singular contribution to taking the China-Pakistan Strategic Cooperative Partnership to new heights.\n“I am determined to work with more energy and passion to make the second phase of CPEC a resounding success,” he resolved.",
  "retrievedAt": "2025-08-11T09:03:42.863Z"
}
