{
  "title": "Global action a must to save other faultless, vulnerable countries from climate disasters: PM",
  "link": "https://www.app.com.pk/national/global-action-a-must-to-save-other-faultless-vulnerable-countries-from-climate-disasters-pm/",
  "date_published": "2023-08-03T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP): Prime Minister Shehbaz Sharif on Thursday called for timely decisions and actions, warning that climate disasters could also hit other countries like Pakistan with even no contribution to the emissions.\nThe prime minister, addressing a seminar on climate change, urged the international community to stand for the future and work hard as the calamities like flash floods in Pakistan could hit any other country too.\nHe said Pakistan was among ten countries facing the impacts of climate change despite having no fault.\n“We need to stand for our future. We need to work hard. Let us accept the challenge, work out a plan, and not waste time to save generations,” the prime minister remarked.\nHe said it had been a year since the most devastating floods in history put one-third of Pakistan under water and caused large-scale destruction of infrastructure including millions of acres of standing crops and houses.\nHe said it was the worst flood he had seen in his entire life as Sindh looked like River Indus flowing all around.\nHe said despite the government had spent billions of rupees, the challenge was not yet over.\nHe thanked the friendly countries and donors for timely rescue and questioned what would be the consequences if the country was hit again bu a similar disaster.\nThe prime minister asked what was the fault of the countries like Pakistan which had been facing the crisis of “unknown consequence.”\nHe urged the international community to ponder over the situation and suggest solutions as the countries like Pakistan could not afford the debt burden.\nHe said Pakistan was still dealing with IMF program with a huge gap between its exports and imports.\n“If we have such a terrible natural accident, we need extra money to deal with the situation. This needs the answer. Come forward with the solid recommendation for implementation in letter and spirit,” he remarked.\nOn the very issue, the prime minister wrote on a social media platform that the floods had inflicted an overall loss of $30 billion on Pakistan’s economy.\nHe said Pakistan used the unprecedented floods to warn the world of impending disasters induced by climate change.\nWe called for prompt global action and a show of solidarity to help the countries most vulnerable to climate change impacts, he added.\nPrime Minister Shehbaz said under the 4RF framework, Pakistan had been working on recovery, rehabilitation and rebuilding of the flood-affected regions.\nHe said the federal cabinet recently approved a landmark National Adaptation Plan 2023, which would ensure that country’s policies, infrastructure, and communities were fully equipped to tackle the challenges.\n“Together with our partners and friends, we will ensure the success of the climate journey,” he commented.",
  "retrievedAt": "2025-08-11T09:03:33.269Z"
}
