{
  "title": "PML-N stands strong on timely elections for fresh mandate, national unity: Javed Latif",
  "link": "https://www.app.com.pk/national/pml-n-stands-strong-on-timely-elections-for-fresh-mandate-national-unity-javed-latif/",
  "date_published": "2023-08-03T12:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP): Federal Minister Javed Latif on Thursday categorically said that the Pakistan Muslim League Nawaz (PML-N) is against any postponement of elections because it believes that for achieving a fresh mandate on timely elections is also essential for national unity.\nTalking to media, he asserted that his party firmly opposes any delay in the upcoming general elections, believing that the elections will undoubtedly benefit the country. While some people claim democracy has weakened in the past 15 months, he countered that the Pakistan Tehreek-e-Insaf (PTI) government had a deliberate agenda to undermine the democracy.\nHe highlighted PML-N’s commitment to the country by making bold decisions to safeguard the state and preserve democracy. He emphasized that the people place their hopes in former Prime Minister Nawaz Sharif as the only leader capable of leading the country towards prosperity and progress.\nHe said Nawaz Sharif was ousted from power by international adversaries, working alongside local collaborators, due to his endeavors in fortifying Pakistan’s defense and launching the game-changing China Pakistan Economic Corridor (CPEC) projects. Similarly, he contends that former Prime Minister Zulfikar Ali Bhutto was executed through the involvement of international forces and their local agents.\nAccording to his remarks, in 2013, the PML-N took on the responsibility of steering the country in the right direction. He expressed strong confidence, asserting that no external influence could prevent Nawaz Sharif from becoming the country’s prime minister for the fourth time, following a resounding victory in the 2023 elections, supported overwhelmingly by the people.\nJaved Latif said the conspiracy behind the May 9 and 10 mutiny was orchestrated by PTI in alliance with hostile international forces that oppose the progress and prosperity of the country.\nJaved Latif expressed his concern over the fact that despite being a proven culprit, Imran Khan was not being punished but instead provided unprecedented privileges not even requested by him.\nThe Toshakhana case is straightforward and does not require additional evidence to prove why Imran is not being punished. From day one, he believed Imran was unfit for any position. However, qualified individuals were declared disqualified to make way for an insolvent person.\nEven innocent leaders were treated as culprits and disqualified individuals are receiving favorable treatment despite the failure of launch Impran project.\nPML-N does not support destructive measures like hurling petrol bombs; anyone supporting progress and prosperity will be encouraged, while those against it will not be tolerated, he concluded.",
  "retrievedAt": "2025-08-11T09:03:32.968Z"
}
