{
  "title": "Wafaqi Mohtasib team holds Khuli Katchery in Kotli (AJ&K)",
  "link": "https://www.app.com.pk/national/wafaqi-mohtasib-team-holds-khuli-katchery-in-kotli-ajk/",
  "date_published": "2024-11-15T13:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP):Under the directions of Wafaqi Mohtasib, Ejaz Ahmad Qureshi, the Director General, Wafaqi Mohtasib Secretariat Ashfaq Ahmad accompanied by Consultant Khalid Sial, held an open court (Khuli Katchery) at Kotli (AJ&K) and heard complaints against the federal entities there. They also issued instructions to the official concerned representing the federal government organizations and disposed of many complaints on the spot, said a press release issued here on  Friday.\nThe Khuli Katchery was attended by a large number of complainants and they aired their grievances against the Electricity, Sui Gas, Passport Office, NADRA, BISP, Pakistan Post, Postal Life Insurance and National Savings. With a view to prompt redressal of complaints, the Wafaqi Mohtasib Secretariat officials issued on the spot instructions to the officials representing the Federal Agencies, who assured their fullest cooperation in this regard.\nSpeaking on the occasion, DG Wafaqi Mohtasib Secretariat said that the officials belonging to Federal entities must discharge their responsibilities in accordance with the rules and regulations and to desist from any kind of wrong doing. The Wafaqi Mohtasib officials also met the local media representatives after the Khuli Katcheri and briefed them on Wafaqi Mohtasib’s initiatives, powers and the procedure for lodging complaints to seek redressal.\nEarlier, the Wafaqi Mohtasib’s officials also delivered an awareness lecture dilating upon the procedure to lodge a complaint and how to get relief from the Wafaqi Mohtasib Office. They stated that any person can lodge a complaint on a simple piece of paper in the form of an application addressed to the Wafaqi Mohtasib adding that each and every case is decided within the 60 days. They informed that the Wafaqi Mohtasib, Ejaz Ahmad Qureshi resolved 193,000 complaints during the last year, which is also a record. They stated that the Wafaqi Mohtasib has established a regional Office in the AJ&K, Muzaffarabad sometime back with a view to facilitating the people of Azad Jammu and Kashmir, which is now fully functional.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:20:30.846Z"
}
