{
  "title": "Strong digital, AI infrastructure vital to enhance competitiveness in education, agri sectors: Castro",
  "link": "https://www.app.com.pk/national/strong-digital-ai-infrastructure-vital-to-enhance-competitiveness-in-education-agri-sectors-castro/",
  "date_published": "2024-11-15T07:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP): Vice President of the Information Technology and Innovation Foundation (ITIF) Daniel Castro emphasized that a strong digital and artificial intelligence (AI) infrastructure was crucial for Pakistan to enhance its competitiveness in agriculture, government services, education, and healthcare sectors.\nCastro, also Director of ITIF’s Center for Data Innovation, and a prominent voice on information technology and internet policy, is currently in Pakistan, engaging in various discussions on digital transformation.\nHe is an expert on a variety of issues related to information technology and internet policy, including privacy, security, intellectual property, Internet governance, e-government, and accessibility for people with disabilities.\nSpeaking on “The Economic Value of Internet Freedom” here he underscored the importance of investing in data infrastructure, creating diverse datasets, and fostering innovation to position Pakistan as a strong player in the tech landscape.\nHe noted that developing a robust AI ecosystem could help Pakistan leverage domestic data in new ways, suggesting that cultural data creation and innovation ecosystems could play a role in enhancing Pakistan’s tech capabilities.\nDrawing comparisons, he said that for countries like China, AI extends beyond tech, supporting industries such as genomics, solar energy, and electric vehicles. He proposed that Pakistan could similarly utilize AI to make agriculture, government services, education, and healthcare more effective and competitive.\nHowever, Castro highlighted connectivity as a critical component, stressing that Pakistan’s ambitions in AI and digital policy could be hampered without reliable digital infrastructure.\nAs Pakistan seeks to expand its exports from $3.5 billion to $25 billion within three years, Castro suggested strategic steps to build digital service capabilities.\nHe said in order to remain competitive, Pakistan needed to upskill Pakistan’s workforce in AI, citing the CEO of NVIDIA’s view that while AI won’t directly replace jobs, workers proficient in AI tools will have a clear advantage.\nHe said that training Pakistani workers in AI could enable them to enhance productivity, moving beyond lower-value outsourced tasks.\nAdvocating certain changes in Pakistan’s education policy, he suggested a shift from traditional four-year degrees to shorter courses, online learning, and micro-credentials that are affordable and relevant to employers.\nHe called for universities to collaborate with employers to design programs aligned with industry demands, helping professionals transition into new roles.\nHe said that a holistic approach would strengthen Pakistan’s workforce, foster innovation, and support its ambitious export targets by integrating AI, digital services, and educational reform.\nHe underscored the importance of progressive tech policies, stating that a focus on digital openness and infrastructure would attract AI innovation and boost Pakistan’s tech sector.\nHighlighting the need for forward-thinking tech policies, he emphasized that Pakistan could use its growing digital infrastructure to drive progress across other sectors, such as agriculture, healthcare, and education.",
  "retrievedAt": "2025-08-10T15:20:35.245Z"
}
