{
  "title": "World leaders hail Azerbaijan’s excellent organization of COP29",
  "link": "https://www.app.com.pk/national/world-leaders-hail-azerbaijans-excellent-organization-of-cop29/",
  "date_published": "2024-11-15T07:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 15 (APP):Guests representing various countries, officials, media representatives and experts, as well as world leaders commended the successful organization of the 29th session of the Conference of the Parties (COP29) to the UN Framework Convention on Climate Change by Azerbaijan, expressing their optimism that the COP29 negotiations would yield productive results.\nAccording to AZERTAC news agency, in the plenary session, Muhammad Shehbaz Sharif, Pakistan’s Prime Minister, congratulated Azerbaijani President Ilham Aliyev on the successful organization of the COP29 in Baku, calling him “Dear Brother”.\nMostafa Madbouly, Prime Minister of the Arab Republic of Egypt, expressed his gratitude to Azerbaijan for the high-level organization of the COP29 and wished the country a successful conference.\nGiorgia Meloni, Prime Minister of Italy, said she was delighted to see Azerbaijan as the President of COP29, which is considered as part of the climate initiative for peace, expressing her gratitude to Azerbaijan for the organization of COP29.\nIrakli Kobakhidze, Prime Minister of Georgia, also expressed his deep appreciation to the President of Azerbaijan for the excellent organization of the COP29.\nJudith Suminwa Tuluka, Prime Minister of the Democratic Republic of the Congo, thanked Azerbaijan and personally President Ilham Aliyev, for hosting in Baku such a momentous event for humanity.\nMaia Sandu, President of Moldova, expressed her deep gratitude to President Ilham Aliyev and the Government of Azerbaijan for hosting COP29 in Baku.\nAddressing the COP29 Leaders’ Summit, Siaosi Sovaleni, Chair of the Pacific Islands Forum, Prime Minister of the Kingdom of Tonga, commended the President and people of Azerbaijan for the sincere hospitality and the opportunity to convey to the world community the challenges and position of small island countries of Oceania.\nPatricia Scotland, the Commonwealth Secretary-General, expressed her gratitude for the two memorandums signed with the organization represented by the government of Azerbaijan and Azercosmos.\nDickon Mitchell, Prime Minister of Grenada, Chair of the Caribbean Community (CARICOM), expressed his confidence that COP29 would be remembered as a “Good COP”.\nMafalda Duarte, Executive Director of the Green Climate Fund (GCF), underlined that the GCF had undertaken significant steps to ensure access to funding.\nIbrahima Cheikh Diong, Executive Director of the Fund for Responding to Loss and Damage, emphasized the leadership of Azerbaijan in launching the Fund’s activities, drawing attention to the new financial commitments undertaken by the countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:20:34.046Z"
}
