{
  "title": "Iran ready to hold talks to resolve issues hampering bilateral trade, says envoy - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Iran’s Consul General in Quetta, Ali Reza Raghai, has said that Tehran is fully prepared to hold talks to resolve issues hampering Pakistan-Iran bilateral trade.\n\nHe stressed that Iran seeks to engage in trade through land, sea and air routes, and expressed disappointment over the lack of cooperation on these fronts from Pakistan.\n\nSpeaking at a session held at the Quetta Chamber of Commerce and Industry on Thursday with members of the Senate Standing Committees on Commerce and Finance, the Iranian ambassador said: “We are not here to compete, but to highlight mutual trade issues. The doors of the Iranian Consulate are always open for traders.”\n\nThe session was attended by Chair­person of the Senate Standing Comm­ittee on Commerce Anusha Rehman, Chair­man of the Senate Finance Com­mittee Saleem Mand­viwalla, Senators Manzoor Kakar, Jan Mohammad Buledi, Bilal Mandokhail, Samina Zehri, and others. Consul General Raghai was accompanied by his team.\n\nEarlier, President of the Quetta Chamber of Commerce, Haji Mohammad Ayub Marriani, Senior Vice President Haji Akhtar Kakar, and Vice President Mir Wais Khan Kakar briefed participants on the hurdles facing Pakistan-Iran trade.\n\nThey said the condition of Electronic Import Form (EIF) has frozen bilateral trade between Iran and Pakistan.\n\nThe Electronic Import Form is a tool used by the State Bank of Pakistan to monitor and regulate imports.\n\nThey said that Iranian authorities were holding Pakistani cargo trucks for 15 to 20 days without explaining the reason. They also complained that while only 10 Pakistani items are exported to Iran, hundreds of Iranian goods are being imported to Pakistan. Concerns were also raised about increased attestation and visa fees.\n\nIn response, Iran’s Consul General Raghai said Iran is ready to hold talks to eliminate trade barriers and urged businessmen of Pakistan to formally communicate grievances of Pakistani transporters to Iran.\n\nHe questioned why Iranian containers are still restricted from entering Pakistan in post-Covid situation, despite prior agreements to keep the Mirjaveh border open for 24/7.\n\n“We are prepared to meet Pakistan’s demand of 500,000 meters of tiles, but the tariffs on Iranian tiles have been increased by 200 per cent by Pakistan,” he added. “We welcome Pakistan’s exports of meat, rice, and other items, but face challenges in response.”\n\nMr Raghai further said that communications sent to Pakistan’s Foreign Office often go unanswered.\n\n“When we speak to the chief minister or other authorities, we’re told permission must come from Islamabad. We must be told why two of our containers have been held for over a year,” he asked.\n\nThe Iran envoy reiterated that the Iranian Consulate is open to all traders and it encourages them to share their concerns so that solutions can be found collectively. He also criticised the imposition of new conditions on proposed visits to Chaman and Taftan borders.\n\nPublished in Dawn, Aug 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/171012375946d93.jpg?r=101314",
  "retrievedAt": "2025-08-16T06:51:34.548Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928198/iran-ready-to-hold-talks-to-resolve-issues-hampering-bilateral-trade-says-envoy",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T00:51:07.000Z"
}
