{
  "title": "Peshawar High Court stays ECP action against PTI lawmaker from Chitral - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Peshawar High Court on Friday stopped the Election Commission of Pakistan from proceeding further on a recent notification to de-notify a Pakistan Tehreek-i-Insaf MNA from Chitral and declaring his seat vacant.\n\nA bench consisting of Justice Syed Arshad Ali and Justice Dr Khurshid Iqbal issued notices to the respondents including ECP and speaker of the National Assembly seeking their response to a petition filed by MNA Abdul Lateef challenging the order of the ECP of disqualifying him and subsequent notification of declaring his seat vacant by de-notifying him as an MNA on July 29, 2025.\n\nThe bench fixed Aug 20 for next hearing of the petition.\n\nThe petitioner has requested the court to declare as unconstitutional, unlawful and without jurisdiction the impugned order of July 29 passed by ECP in three cases against him and the corresponding notification of the same date.\n\nPetitioner Abdul Lateef claims Election Commission not following due process\n\nHe requested the court to declare that the impugned order and notification were passed in violation of due process of law and principle of natural justice.\n\nHe further prayed the court to declare as unlawful the reference forwarded against him by the National Assembly speaker.\n\nSenior lawyer Muhammad Muazzam Butt appeared for the petitioner and requested the bench to grant interim relief to his client by suspending the impugned notification.\n\nThe bench observed that as the notification had already been issued in the light of the order of the ECP, therefore it had attained finality.\n\nMr Butt apprehended that as the seat had been declared vacant, therefore, the ECP could announce by-election on it and could issue its schedule. He requested the bench to at least suspend operation on the impugned notification by the ECP so that by-elections should not be announced.\n\nThe bench pronounced restraining the ECP from conducting further proceedings on the impugned notification.\n\nMr Lateef’s disqualification by the ECP stemmed from his conviction by an anti-terrorism court in Islamabad in May on account of his involvement in a May 9, 2023, protest.\n\nMr Butt stated that the ECP had issued a ‘Most immediate’ notice on July 17, 2025, requiring the appearance of the petitioner in person or through a counsel on July 29.\n\nHe stated that the basis of the notice was a petition filed by a person named Fazalur Rehman against the present petitioner, with the NA’s speaker. He added that the speaker had referred the petition as a reference to the Election Commission under Article 63(2) of the Constitution.\n\nHe stated that the ECP through another notice on a complaint of one Sajad Ali Brohi, also required the appearance of the petitioner on July 29.\n\nMr Butt stated that the notice indicated that the complainant sought the petitioner’s de-seating as an MNA based on a judgment passed by the ATC on May 30 in Islamabad.\n\nHe stated that during the petitioner’s appearance, a press release issued by the ECP came to notice, which suggested that the petitioner’s case was distinguished from three other MNAs, and the commission awaited clarity on the petitioner’s conviction status based on a short order passed by the Islamabad High Court in appeals filed by co-accused in the same matter.\n\nHe said that at that time the detailed judgment had not been released by the IHC.\n\nMr Butt stated that when his client case was called, it was revealed that the detailed judgment had been released by the high court on the same day.\n\nHe contended that the distinction between the short order and detailed judgment was significant: the short order set aside the impugned judgment in general, whereas the detailed judgment set it aside specifically concerning the appellants in that case and not the petitioner.\n\nHe argued that the petitioner submitted to the ECP that only the notice had been served and no accompanying documents — be it the reference from the speaker, the complaints, or related material — had been provided.\n\nThe counsel stated that the petitioner requested access to these documents to file a written reply, including jurisdictional objections, but the court declined to accept his plea.\n\nHe contended that under Article 63(2) of the Constitution, it was incumbent upon the Speaker to provide notice and material to the petitioner to allow him an opportunity to respond. He added that the Speaker failed in this duty, undermining the principles of natural justice.\n\nHe contended that under Article 63, the ECP was mandated to decide a reference within ninety days, but in the instant case the commission disregarded procedural obligation and went ahead with the matter in haste.\n\nPublished in Dawn, August 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/02135514b470200.png",
  "retrievedAt": "2025-08-16T06:50:18.633Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928096/peshawar-high-court-stays-ecp-action-against-pti-lawmaker-from-chitral",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T00:51:54.000Z"
}
