{
  "title": "Fuel and food costs push July inflation to 4.1pc - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Headline consumer inflation rose to 4.1 per cent in July, up from 3.2pc a month earlier, driven by a rebound in fuel and food prices, official data released by the Pakistan Bureau of Statistics (PBS) showed on Friday.\n\nThe uptick in inflation over the past two months is attributed primarily to higher petroleum product prices, record-high retail sugar rates, and a nationwide rise in meat prices.\n\nDespite the month-on-month increase, average annual inflation for FY25 dropped sharply to 4.49pc from 23.41pc in the previous year, aided by a high base effect, declining food prices, and lower transport costs. Economists describe the current trend as disinflation — a slowdown in the pace of rising prices, not a general decrease as seen in deflation — though the cost of living remains high for many households.\n\nThe latest CPI data showed a 2.9pc increase in July on a month-on-month basis, indicating a reversal of the disinflationary trend. However, inflation for July 2025 remained the lowest compared to the corresponding month of the previous year, when it stood at 11.1pc.\n\nInflation had previously fallen into single digits in August 2024 — at 9.6pc — for the first time in over three years, continuing a declining trend until the recent rebound.\n\nFood inflation in July increased by 2.2pc in urban areas and 1.5pc in rural areas, while non-food inflation reached 5.9pc in urban areas and 5.4pc in rural regions. This marks a return to positive growth in food prices after four consecutive months of decline.\n\nIn July, core inflation — excluding volatile food and energy components — stood at 7pc in urban areas and 8.1pc in rural areas.\n\nUrban food items that saw notable month-on-month price increases included fresh vegetables (45.76pc), chicken (29.73pc), tomatoes (19.92pc), potatoes (10.97pc), onions (9.36pc), and sugar (6.11pc). Smaller increases were also recorded in the prices of gur, rice, meat, butter, milk products, and pulses.\n\nConversely, declines were noted in eggs (14.85pc), fresh fruits (7.17pc), wheat flour (1.03pc), spices (0.97pc), besan (0.93pc), beans (0.83pc), and cooking oil (0.66pc), among other items.Non-food categories also witnessed significant price hikes, including gas charges (22.91pc), electricity (14.18pc), transport services (4.77pc), motor fuel (4.45pc), and plastic products (3.74pc). Increases were also seen in household services, house rent, liquified hydrocarbons, motor vehicles, and construction materials.\n\nPublished in Dawn, Aug 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/0210284564d01be.png",
  "retrievedAt": "2025-08-16T06:51:16.092Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928178/fuel-and-food-costs-push-july-inflation-to-41pc",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T00:51:14.000Z"
}
