{
  "title": "GB traders vow to continue protest at Pak-China border - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Traders in Gilgit-Baltistan (GB) on Friday continued their protest for a 23rd consecutive day, blocking a key trade route with China and vowing to continue until the government scraps federal taxes they call illegal.\n\nThe protest on the Karakoram Highway has halted all Pakistan-China trade and travel through the border crossing, leaving thousands of people, including Chinese nationals and foreign tourists, stranded in the area.\n\nProtesters, who have gained the support of local political, youth and religious parties, argue that the region’s disputed constitutional status exempts it from federal taxation.\n\n“The federal government is reluctant to solve the genuine demands of local people,” said Mohammad Ishaq, one of the protest organisers.\n\nProtesters argue that federal taxes are illegal due to region’s disputed status\n\n“They are just demanding how federal taxes can be collected from the people who are not constitutional citizens of Pakistan and the region is a disputed status area.”\n\nHe added that protesting traders would not back down from their “principle stance of “No taxation without representation”.\n\nThe tax dispute has paralysed the local economy for the last eight months, rendering thousands jobless, including transporters, hotel owners, shopkeepers and customs agents.\n\nAyub Waziri, a member of the GB Assembly, said the issue extends beyond the trading community.\n\n“This is an issue of the GB people,” Waziri said, explaining that because the region is not constitutionally part of Pakistan, all federal taxes imposed there are illegal.\n\nMr Waziri said that during the last year negotiations, officials from the Federal Board of Revenue had admitted that GB falls in a “non-tariff zone”.\n\nHe said the federal government has since formed a committee to resolve the issue and that the GB government is acting as a mediator.\n\nThe protest movement intensified on Friday as hundreds of people in rallies from multiple areas joined the blockade to show solidarity.\n\n“The protest movement has awakened GB people for their rights,” said Moulana Sharfuddin, a leader of Tanzeem Ahl-i-Sunnat wal Jamat, GB, expressing his support.\n\nProtesters claim the standoff has left them victims of federal policies.\n\nAhmed Nabi, a protester, told Dawn that billions of rupees worth of items imported through the Sost Dry Port have been held up for the last month.\n\nHe said many items have expired, while others stored in the open have been damaged by rain because Pakistan Customs officials are not clearing local consignments.\n\nJaved Hussain, another organiser, alleged that speedy clearance of goods is “allowed to only a handful of people”.\n\n“The economic exploitation of local people will never be accepted,” he said.\n\nPublished in Dawn, Aug 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/021053079d8d32f.png",
  "retrievedAt": "2025-08-16T06:51:32.336Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928200/gb-traders-vow-to-continue-protest-at-pak-china-border",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T00:51:07.000Z"
}
