{
  "title": "CJP Afridi asks bar associations to play active role in judicial reforms - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Chief Justice of Pakistan (CJP) Yahya Afridi on Friday urged bar associations to play an active role in legal and judicial reforms, emphasising structured engagement to improve justice delivery and ensure inclusive representation.\n\nIn this regard, he also stressed the need for streamlining government support to bar associations for maximum impact and cost-efficiency.\n\nThe CJP, while presiding over a meeting in Peshawar, reviewed institutional linkages between bar associations and the Law and Justice Commission of Pakistan (LJCP) and shared insights from recent visits to remote districts across the country, where he assessed judicial infrastructure and identified implementation gaps caused by poor coordination.\n\nCJP Afridi also highlighted the need to include bar associations in judicial development efforts, especially regarding judicial complexes.\n\nThe meeting was attended by senior judicial and government officials, including Peshawar High Court Chief Justice S.M. Attique Shah, Pakistan Bar Council Vice Chairman Tahir Warraich, KP Bar Council Vice Chairman Ahmed Farooq Khattak, and representatives from the Supreme Court, high courts, law and justice commission, the provincial government, and the Ministry of Law and Justice.\n\nMeets PHC chief justice, KP lawyers\n\nTo bridge coordination gaps, the LJCP will post senior representatives in each province, based at high courts, to serve as liaisons with district bars. Their responsibilities would include raising awareness about justice sector initiatives, identifying local priorities, and overseeing grassroots reforms. Bar associations will be invited to submit development proposals to district development committees (headed by district and sessions judges), ensuring federal and provincial departments participate in planning and avoid resource duplication.\n\nThe CJP urged provincial departments to remain engaged with designated officers for timely execution of justice-related projects. Highlighting persistent issues such as poor infrastructure, unreliable power, and limited digital access in remote districts, he called for targeted interventions.\n\nProvincial governments were instructed to integrate these initiatives into their annual planning and prioritise gender-sensitive facilities such as shelters for female litigants.\n\nHe also encouraged bar associations to take full advantage of Continuing Legal Education (CLE) programmes offered by the judicial academy. He called for wider dissemination of the training calendar and appointment of focal persons within bars to coordinate participation.\n\nBar representatives appreciated the inclusive approach and thanked the CJP for acknowledging the difficulties faced by both litigants and lawyers. Federal and provincial stakeholders pledged full support in realising the goal of accessible, efficient, and citizen-centric justice delivery.\n\nSeparately, CJP Afridi and the PHC chief justice met a delegation of lawyers from Khyber Pakhtunkhwa at the Supreme Court registry in Peshawar.\n\nThe delegation included representatives from the KP Bar Council, High Court Bar Association, and 35 district bar associations.\n\nThe CJP briefed them on ongoing justice reforms under LJCP, noting that, for the first time, Bar representatives have been included as members of the Commission to foster participatory decision-making in legal policy.\n\nHe also shared key outcomes from the recent meeting of the National Judicial Policy-Making Committee (NJPMC), including addressing enforced disappearances through a dedicated response committee; directives to high courts to protect judicial officers from external interference; establishment of commercial litigation corridors and model criminal trial courts and time-bound adjudication in 13 case categories; piloting of a double-docket court regime; introduction of court-annexed mediation and a professional excellence index; standardisation of district judiciary appointments and training; biometric case verification and video link attendance for under-trial prisoners and witnesses; ethical guidelines for AI use in judicial settings; and improved welfare measures for judicial officers.\n\nExpressing concern over inadequate infrastructure in underdeveloped regions — particularly the lack of solar power and digital connectivity — the CJP reiterated the need for targeted reforms to bridge regional disparities.\n\nIn a major move towards inclusive justice, he announced a new legal aid initiative to ensure no litigant is left unrepresented. Under this initiative, financially distressed litigants will be entitled to state-funded legal representation from magistrate courts to the Supreme Court, while bar associations will be allowed to nominate competent lawyers for this purpose.\n\nReiterating the importance of CLE programmes, the CJP urged lawyers to make full use of training opportunities at the Federal Judicial Academy. He listened attentively to the delegation’s concerns and assured them of his commitment to addressing these issues in coordination with relevant institutions. He reaffirmed the judiciary’s resolve to promote transparency, access to justice, and collaborative reform.\n\nPublished in Dawn, Aug 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/0209552635eb8c9.png",
  "retrievedAt": "2025-08-16T06:51:48.670Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928207/cjp-afridi-asks-bar-associations-to-play-active-role-in-judicial-reforms",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T00:51:07.000Z"
}
