{
  "title": "Bangladesh to unveil democratic overhauls on revolution anniversary - World - DAWN.COM",
  "author": null,
  "content": "Bangladesh’s interim government said on Saturday it will release its slate of democratic overhauls on August 5, the one-year anniversary of the overthrow of the previous autocratic administration.\n\nThe South Asian nation of around 170 million people has been in political turmoil since a student-led revolt ousted then-prime minister Sheikh Hasina on August 5, 2024, ending her 15-year rule.\n\nMuhammad Yunus, the 85-year-old Nobel Peace Prize winner who is leading the caretaker government as its chief adviser until elections are held, has said he inherited a “completely broken down” system of public administration.\n\nYunus previously pledged to unveil a “big package” to overhaul democratic institutions.\n\nBut efforts to reach agreements have made slow progress as political parties jostle for power ahead of elections, slated for early 2026.\n\nYunus’s government has warned that political power struggles risk jeopardising the gains that have been made.\n\nOn July 29, Yunus said he was working to “build a broad national consensus around a renewed political system — one that delivers inclusive, participatory, and credible elections”.\n\nYunus’s office said on Saturday that the “July Proclamation” would be “presented to the nation … in the presence of all political parties involved in the mass uprising”.\n\nHasina’s rule saw widespread human rights abuses, including the mass detention and extrajudicial killings of her political opponents.\n\nHer government was also accused of politicising courts and the civil service, staging lopsided elections and dismantling democratic checks on its power.\n\nHasina, 77, fled to India, where she has defied court orders to attend her ongoing trial on charges amounting to crimes against humanity.\n\nProtests began on July 1, 2024, with university students calling for reforms to a quota system for public sector jobs.\n\nThey culminated on August 5, 2024, when thousands of protesters stormed Hasina’s palace as she escaped by helicopter.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/02163348f281a84.png",
  "retrievedAt": "2025-08-16T06:49:52.405Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928259/bangladesh-to-unveil-democratic-overhauls-on-revolution-anniversary",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T11:40:41.000Z"
}
