{
  "title": "India will buy Russian oil despite Trump’s threats, NYT reports - World - DAWN.COM",
  "author": null,
  "content": "Indian officials have said they would keep purchasing oil from Russia despite the threat of penalties that United States President Donald Trump said he would impose, the New York Times reported on Saturday.\n\nReuters could not immediately verify the report.\n\nThe White House, India’s Ministry of External Affairs and the Ministry of Petroleum and Natural Gas did not immediately respond to requests for comment.\n\nTrump on Wednesday imposed a 25 per cent tariff on goods imported from India starting August 1 along with additional penalties, potentially straining relations with the world’s most populous democracy.\n\nTrump indicated in a Truth Social post that India would face additional penalties for the purchase of Russian arms and oil. However, he later said that he did not care what India does with Russia.\n\nOn Friday, Trump told reporters that he had heard that India would no longer be buying oil from Russia.\n\nTwo senior Indian officials said there had been no change in policy, according to the NYT report, which added that one official said the government had “not given any direction to oil companies” to cut back imports from Russia.\n\nReuters had earlier reported that Indian state refiners stopped buying Russian oil in the past week as discounts narrowed in July.\n\nOn July 14, Trump threatened 100pc tariffs on countries that buy Russian oil unless Moscow reaches a major peace deal with Ukraine. Russia is the top supplier to India, responsible for about 35pc of India’s overall supplies.\n\nOn Monday, Trump said most partners that do not negotiate separate trade deals would soon face tariffs of 15-20pc on their exports to the US, well above the broad 10pc tariff he imposed in April. His administration will notify some 200 countries soon of their new “world tariff” rate.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/30175759992f612.png",
  "retrievedAt": "2025-08-16T06:49:57.609Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928255/india-will-buy-russian-oil-despite-trumps-threats-nyt-reports",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T09:57:51.000Z"
}
