{
  "title": "Transport dept is not responsible for Red Line delays, Sindh Assembly told - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Sharjeel terms relocating utility connections a major challenge in construction\n• Says govt aims to digitise entire transport department by 2026\n\nKARACHI: Replying to lawmakers’ written and verbal queries during the Question Hour in the Sindh Assembly, Sindh Senior Minister Sharjeel Inam Memon informed the house on Friday that the provincial transport department was not responsible for delays in completion of the much-awaited Red Line-Bus Rapid Transit (BRT) project.\n\nMr Memon, who also holds the portfolios of transport and information department, said every aspect of the Red Line project was being monitored by local experts and international consultants.\n\nHe said that work was underway on major development schemes in the city, and progress was being made rapidly on two sections of the Yellow Line BRT with a bridge expected to be completed by August.\n\nIn reply to a verbal question raised by Muttahida Qaumi Movement-Pakistan Dr Fouzia Hameed, the minister acknowledged that occasional delays might occur due to technical or administrative issues, but overall, the work was progressing smoothly. He stated that relocating utility connections was always a major challenge.\n\n“Several stages had to be completed to remove the gas line from the Yellow Line BRT route, and at times, unexpected issues also arise,” he added.\n\nHighlighting the provincial government’s efforts to provide top-notch travel facilities to the people of the provincial, the senior minister said that the Peoples Bus Service, which currently transported 110,000 passengers daily, was a testament to this commitment.\n\n“The government plans to introduce more buses to tackle the long-standing transportation issue in the province, including Karachi,” he added.\n\nHe said that Pakistan’s first EV-buses had been introduced by the Sindh government and added that EV-scooters would be provided to women free of cost by the end of August.\n\nResponding to another question, he said that the provincial government aimed to digitise the entire transport department by 2026.\n\n“Route permits have already been digitised, ensuring a more efficient and transparent system,” he added.\n\nReplying to a call attention notice by Dr Fouzia Hameed on illegal constructions in the city, Qasim Siraj Soomro said that action had been taken against those involved and the government was working to curb illegal constructions.\n\nCall for separate educational board for Christians\n\nIn his call attention notice, minority member Mahesh Kumar said that the subject of ethics had been given to minority children in the textbooks.\n\n“The subject of ethics should be for everyone,” he said and asked the provincial government to replace the subject of ethics with religious studies in the educational institutions.\n\nHe also demanded the creation of a separate educational board for the Christian community.\n\nEducation Minister Sardar Shah, while responding to the notice, said that a single curriculum was brought during the PTI era, which the Sindh government had opposed.\n\nHe said that at that time Muslim children were being taught Islamiat and non-Muslims were taught ethics. “We reviewed the curriculum in 2022 and work was in progress for replacing the subject of ethics with religious studies.”\n\nIn response to a notice from MQM-P’s Najam Mirza regarding admissions of children through the Centralised Admission Policy (CAP), the education minister said that the CAP had been extended to the entire province and admissions were automatically done by computer without any human intervention.\n\nHe said that preference was given to A1 grade and A grade in admissions.\n\nThe assembly session, chaired by Speaker Owais Qadir Shah, witnessed a unique display of Independence Day spirit, with women members wearing green and white dresses. Later, Speaker Syed Awais Qadir Shah adjourned the house to Monday.\n\nPublished in Dawn, Aug 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:50:46.077Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928166/transport-dept-is-not-responsible-for-red-line-delays-sindh-assembly-told",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T00:51:33.000Z"
}
