{
  "title": "US envoy visits Gaza sites as UN says hundreds of aid-seekers killed - World - DAWN.COM",
  "author": null,
  "content": "• Witkoff holds talks with Netanyahu\n• HRW says Israel using starvation as a weapon of war\n• Author David Grossman calls Israel’s Gaza campaign ‘genocide’\n\nGAZA CITY: President Donald Trump’s special envoy inspected a US-backed food distribution centre in war-torn Gaza on Friday, as the UN rights office reported that Israeli forces had killed hundreds of hungry Palestinians waiting for aid.\n\nMeanwhile, award-winning Israeli author David Grossman called his country’s campaign in Gaza “genocide” and said he was using the term with a “broken heart”.\n\nThe visit by Steve Witkoff came as a report from global advocacy group Human Rights Watch (HRW) also accused Israeli forces of presiding over “regular bloodbaths” close to the US-backed aid points.\n\nThe UN’s rights office in the Palestinian territories said at least 1,373 people had been killed seeking aid in Gaza since May 27 — 105 of them in the last two days of July.\n\n“Most of these killings were committed by the Israeli military,” the UN office said, breaking down the death toll into 859 killed near the US-backed food sites and 514 along routes used by UN and aid agency convoys.\n\nThe US ambassador to Israel, Mike Huckabee, posted on X that he and Witkoff had visited Gaza “to learn the truth” about the private aid sites run by the Gaza Humanitarian Foundation (GHF), which is supported by the United States.\n\n“We received briefings from IDF (the Israeli military) and spoke to folks on the ground. GHF delivers more than one million meals a day, an incredible feat!” Huckabee said.\n\nThe foundation, on its own X account, posted that it had been a “privilege and honor” to host Witkoff and Huckabee as the group delivered its 100-millionth meal in Gaza, fulfilling Trump’s “call to lead with strength, compassion and action”.\n\nGaza’s civil defence agency said 11 people were killed by Israeli fire and air strikes on Friday, including two who were waiting near an aid distribution site run by GHF.\n\n‘Beyond imagination’\n\nIn its report on the GHF centres on Friday, Human Rights Watch accused the Israeli military of illegally using starvation as a weapon of war.\n\n“Israeli forces are not only deliberately starving Palestinian civilians, but they are now gunning them down almost every day as they desperately seek food for their families,” said Belkis Wille, associate crisis and conflict director at Human Rights Watch.\n\nWitkoff meets Netanyahu\n\nAfter arriving in Israel, Witkoff held talks with Prime Minister Benjamin Netanyahu over how to resolve the ongoing war, feed desperate civilians and free the remaining Israeli prisoners.\n\nIn a recent video, German-Israeli prisoner Rom Braslavski, 21, while watching recent news footage of the crisis in Gaza pleaded with the Israeli authorities to secure his release.\n\n‘Genocide’\n\nIn the meantime, award-winning Israeli author David Grossman called his country’s campaign in Gaza “genocide” and said he was using the term with a “broken heart”.\n\n“For many years, I refused to use that term: ‘genocide’,” the prominent writer and peace activist told Italian daily La Repubblica in an interview published on Friday.\n\n“But now, after the images I have seen and after talking to people who were there, I can’t help using it.” Grossman told the paper he was using the word “with immense pain and with a broken heart.”\n\nHe also won Israel’s top literary prize in 2018, the Israel Prize for Literature, for his work spanning more than three decades.\n\nPublished in Dawn, August 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/688d3e30beffb.jpg",
  "retrievedAt": "2025-08-16T06:51:56.603Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928137/us-envoy-visits-gaza-sites-as-un-says-hundreds-of-aid-seekers-killed",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T00:51:00.000Z"
}
