{
  "title": "PM Shehbaz vows support as monsoon batters GB, AJK - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Child dies, father rescued after glacier burst in GB’s Bagrot Valley\n• Four jump into river to rescue family member, three missing\n• 295 dead, over 700 injured nationwide in monsoon-related disasters\n• Corruption alleged in GB early warning, protection projects\n\nISLAMABAD / GILGIT: Prime Minister Shehbaz Sharif on Friday reaffirmed the federal government’s full support for relief and recovery efforts in flood-hit Gilgit-Baltistan (GB) and Azad Jammu and Kashmir (AJK).\n\nChairing a high-level meeting to review the monsoon damage, the prime minister ordered an urgent overhaul of the Pakistan Meteorological Department’s early warning infrastructure to make it more proactive and effective.\n\nHe also directed authorities to restore and repair road and communication networks on an emergency basis to ensure timely aid delivery and mobility in affected areas.\n\nAccording to the Prime Minister’s Office, the meeting focused on immediate relief efforts, future disaster preparedness and federal assistance to the affected regions.\n\nExpressing sorrow over the loss of lives and widespread destruction caused by torrential rains, PM Shehbaz reiterated his government’s solidarity with the people of GB and AJK.\n\n“The federal government stands shoulder to shoulder with the administrations and citizens of Gilgit-Baltistan and Azad Kashmir in this hour of grief,” he said. “I will soon visit Gilgit-Baltistan to express solidarity with the victims and a comprehensive federal relief package will be announced to support recovery and rehabilitation efforts.”\n\nThe prime minister directed all federal departments to coordinate with regional authorities to conduct swift damage assessments and prioritise life-saving interventions. He stressed the need for a coordinated and rapid response to minimise further losses and ensure timely assistance to those affected.\n\nDuring the briefing, National Disaster Manag­ement Authority (NDMA) Chairman Lt Gen Inam Haider Malik informed the premier that monsoon-related disasters had caused 295 deaths and over 700 injuries nationwide. More than 1,600 homes have been destroyed and 376 livestock lost.\n\nHe also warned of continued flood threats in rivers and streams, noting potential minor flooding at Tarbela, Chashma, Taunsa and Kalabagh, and moderate flood levels at Head Marala and Guddu on the Chenab River. He cautioned that monsoon activity is expected to intensify towards the end of August.\n\nThe meeting was attended by AJK Prime Minister Chaudhry Anwarul Haq, GB Chief Minister Haji Gulbar Khan, Deputy Prime Minister Ishaq Dar, Minister for Climate Change Dr Musadik Malik and Information Minister Attaullah Tarar, among others.\n\nSeparately, Minister for National Health Services Syed Mustafa Kamal called on PM Shehbaz on Friday to brief him on ongoing projects and reform efforts in the health sector. The meeting also covered other matters related to the Ministry of Health, according to a statement from the PM’s Office.\n\nTragedies mount in GB\n\nIn Gilgit-Baltistan’s Haron area, four members of a family drowned in the Ghizer River while trying to rescue a man reported to be mentally unwell, who had jumped into the water. Rescue 1122 officials said that one family member was rescued, while two women and a man remain missing.\n\nGB government spokesperson Faizullah Faraq said Chief Minister Haji Gulbar Khan has ordered all available resources to be deployed in the search and rescue operation.\n\nIn a separate incident, a glacier burst in Bagrot Valley on Friday led to the death of a 12-year-old boy, while his father was injured. The pair had been crossing the glacier in Barchi village on foot when it collapsed.\n\nThe GB spokesperson confirmed they fell into a ravine and were buried under debris. The father was rescued after several hours by locals and Rescue 1122.\n\nWhile a billion-rupee early warning system had been installed in the area under the UNDP-funded Glof-II Project, it failed to function during the incident.\n\nOpposition leader from the constituency, Syed Sohail Abbas Shah, alle­ged large-scale corruption in the implementation of early warning and protection projects, accusing both the government and international organisations.\n\nEmergency declared\n\nSpokesperson Fai­zullah Faraq announced that an eme­rgency has been imp­osed across GB. He urged the federal government to step in and assist with flood relief and the rehabilitation of affected people.\n\nFresh flash floods have struck the Khanbari area of Diamer district, dest­roying standing crops, farmland and irrigation infrastructure. The search continues for the 11th day for missing tourists along the Babusar Highway.\n\nPM Shehbaz is expected to visit GB soon.\n\nPublished in Dawn, August 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:52:04.988Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928144/pm-shehbaz-vows-support-as-monsoon-batters-gb-ajk",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T00:50:53.000Z"
}
