{
  "title": "Maritime ministry mulls ferry service to Iran, Iraq amid land travel ban - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Amid a deadlock in negotiations over the government’s decision to ban land travel to Iran for pilgrims during Arbaeen — the chehlum of Imam Husain — the Maritime Mini­stry is planning to launch a ferry service to facilitate travel of Zaireen (pilgrims) to Iran and Iraq.\n\nHowever, the detailed road map for the service is expected to be finalised in the coming weeks.\n\nOn Friday, Minister for Mari­time Affairs Muhammad Junaid Anwar Chaudhry called for the swift launch of Pakistan’s first ferry service, stressing the need for immediate reforms to licensing procedures and financial facilitation for operators.\n\nThese reforms aim to ensure affordable sea travel, support pilgrims and boost maritime connectivity.\n\nIn a meeting with Shipping and Ports Director General Alia Shahid, the minister highlighted the benefits of sea travel, pointing out that ferry services could offer a reliable and cost-efficient travel option for Zaireen heading to Iran and Iraq.\n\n“Beyond tourism and business, this service can greatly facilitate religious travel. We can offer pilgrims a secure, affordable and efficient option for their journeys,” said Mr Chaudhry.\n\nHe also emphasised the potential economic benefits of the service, noting that every year, between 700,000 and one million Pakistani Zaireen travel to Iran and Iraq. If 20 per cent of these pilgrims opt for ferry services in the first three years, it could result in 140,000 to 200,000 passengers annually, representing significant economic potential.\n\nThe meeting also revealed that stakeholder consultations, including with private operators and regional maritime authorities, are underway. Feasibility studies and regulatory frameworks are being finalised, with a pilot lau­nch expected in the coming weeks.\n\n“If implemented effectively, this service could become a vital new transport link across the region,” the minister said.\n\nTo streamline the process, the minister instructed that the ferry licensing process be fully digitalised and integrated into the Pakistan Single Window platform, similar to the existing ship registration process. He specifically ordered that the current six-month licensing period be reduced to just one month.\n\n“There’s no justification for a half-year delay,” he said. “We must eliminate red tape and act decisively.”\n\nIn an effort to attract private sector participation, the minister also called for exploring flexible financial models for ferry operators.\n\n“Our aim is to support, not hinder, entrepreneurs who wish to invest in this sector,” he added.\n\nThe Ministry of Maritime Affairs has proposed a hybrid financial model, where the country’s financial management system relies on bank and insurance guarantees to support the venture.\n\nDeadlock over land travel ban\n\nMeanwhile, the deadlock continues between the federal government and political groups representing the Shia community over the ban on land travel for pilgrims.\n\nThe negotiation team, which included Nasir Shirazi, Allama Ahmed Iqbal Rizvi and Asad Naqvi from Majlis Wahdat-i-Muslimeen (MWM), and Allama Shabbir Meesami, Allama Arif Wahidi and Zahid Akhunzada from the Shia Ulema Council (SUC), submitted a written proposal to the Ministry of Interior on Thursday.\n\nThe proposal called for the immediate reversal of the government’s decision to ban land travel to Iran for the pilgrims.\n\nThe government has been urged to facilitate the movement of around 80 buses stranded in Quetta to reach the Gabd-Rimdan border crossing. However, the government’s response was delayed, as key officials were occupied with security meetings ahead of the Iranian president’s arrival on Saturday (today).\n\nAs a result, neither the Minister of State for Interior nor any senior official from the Ministry of Interior could meet with the joint delegation from MWM and SUC.\n\nOne member of the negotiating team said they were awaiting the government’s response and would announce their future strategy after the government’s decision.\n\n“The government must take this matter seriously. We want the issue to be resolved through dialogue, so that the pilgrims may travel to Karbala,” said Nasir Shirazi, secretary general of MWM.\n\n“But it seems the authorities are not understanding the pressure we are under, with many pilgrims also belonging to the Ahle Sunnah school of thought.”\n\nPublished in Dawn, August 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/02074357655d883.png",
  "retrievedAt": "2025-08-16T06:52:14.136Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928145/maritime-ministry-mulls-ferry-service-to-iran-iraq-amid-land-travel-ban",
  "dateList": "2025-08-02",
  "date_published": "2025-08-02T00:50:53.000Z"
}
