{
  "title": "Operation to rid Kurram of ‘spoilers’ launched - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Law enforcers take over bunkers and check posts amid plan to secure Parachinar route in next few days\n• Jirga demands probe into violations and non-compliance with peace accord\n\nPESHAWAR/ KURRAM: In order to rid restive Kurram of miscreants and secure the highway connecting the district with other parts of the country, a security operation has started in the Bagan area of the tribal district, officials said on Sunday.\n\n“The forces have begun the operation to sanitise the area in and around Bagan by taking over check posts and destroying bunkers along the route,” sources privy to the details of the operation said.\n\nThey said security forces and paramilitary Frontier Corps were leading the operation, with the police closely following behind.\n\nAccording to officials, the law enforcement agencies’ personnel were moving into the villages, but the miscreants had already fled and evacuations were already underway from the residential areas. “The plan is to secure the road in the next couple of days to allow the trucks to start moving (between Kurram and Peshawar),” they said.\n\nThe law enforcers had taken control of the bunkers on the mountains and a search operation was expected during the night, officials said, adding that security forces were deployed in lower Kurram and the operation would be carried out in four villages.\n\nDuring a news conference held in Kurram on Sunday, Regional Police Officer Abbas Majeed Marwat said that the first convoy left successfully for Parachinar, followed by a second convoy. He said locals had committed that the third convoy should carry more supplies and they would support it, but the attack took place that resulted in several deaths.\n\n“According to the agreement signed by both groups action will be taken against the spoilers placing hurdles … and security forces and police will jointly take action and are taking action,” RPO Marwat said, adding that social media was being monitored and action was being taken.\n\nOn Jan 17, the provincial government issued a notification for setting up camps in order to accommodate the temporarily displaced persons due to a possible offensive against miscreants in Kurram’s Bagan, Mandori, Charkhel, Chapri Paraw and Chapri areas.\n\n“Action against few miscreants present in the affected areas has become inevitable. The state stands with peaceful citizens,” read a statement issued by Barrister Mohammad Saif, the KP government’s spokesperson.\n\nThe statement came after a high-level meeting held to take stock of the situation in the Kurram district. In the meeting, it was decided to take strict action against the miscreants without discrimination. Barrister Saif said that the provincial government had been trying to peacefully restore peace in the area for the last three months, but some miscreants had been conspiring to sabotage the accord.\n\nJirga demands probe\n\nMeanwhile, members of the grand jirga, which brokered a peace accord between the warring groups on December 31, demanded a joint investigation team (JIT) headed by a judge to investigate violation of the peace accord and action against those openly supporting the militants.\n\nThe members, in a letter addressing the president, the prime minister, the chief of army staff, the federal interior minister, and the KP chief minister and governor, read that they were of the opinion that what the jirga had said was not being acted upon neither were the state institutions acting upon the written agreement signed in 2024. The letter, issued on Saturday, read that the regional military leadership had assured a convoy would depart on January 16 and would be escorted by the police, the military and the FC in addition to the aerial support by five helicopters.\n\nIt read that people from all the villages and other militants started firing at the convoy with light and heavy weapons when it was passing through Bagan where trucks were looted and four drivers were killed, while some were still missing.\n\n“Those deployed for security never resisted… Reports about the killing of five militants were aired on television which were wrong,” the jirga members claimed, adding that state institutions had completely failed in maintaining peace in the restive district.\n\nBagan sit-in\n\nLocals in Bagan are also holding a sit-in which has entered its fourth week. On January 17, a local elder from Bagan town, Haji Karim, said their demands were yet to be accepted.\n\n“We have four demands. Operation against miscreants in the district, de-weaponisation, demolishing the bunkers and compensation for the over 500 shops and houses that were destroyed in an attack following the Nov 21 ambush on a Parachinar-bound convoy,” Mr Karim told Dawn.\n\nThe KP health department on Sunday issued a statement which read that emergency medicines were dispatched to Parachinar, adding that the medicines were being handed over to the medical superintendent in Parachinar to manage the emergency situation effectively.\n\nThe statement, quoting secretary health Adeel Shah, read that a total of 4,000 kilogrammes of medicines worth Rs5 million were transported through two flights of the KP’s government’s helicopter.\n\nKurram ordeal\n\nA passenger convoy which came under attack on November 21, 2024, in Bagan triggered armed clashes between two groups, leaving over 130 people, including women and children, dead. On November 22, the Bagan bazaar came under attack when over 500 shops besides several houses were burnt to the ground.\n\nAlthough the main transportation route between Peshawar and Parachinar passing through Bagan has remained closed for over 100 days, life in Bagan, an area located on the main route some 60 kilometers north-west of the district headquarters Parachinar with around 24,000 registered voters, is also at a standstill.\n\nAfter the months-long violence, a grand jirga announced a peace accord. However, the agreement faced a major blow when a convoy carrying aid supplies to Parachinar came under attack in Bagan on January 16, the same area where the November 21 attack had taken place. Before this, the convoy of the ex-deputy commissioner was attacked only a few days after the agreement.\n\nPublished in Dawn, January 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:55:38.870Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886401/operation-to-rid-kurram-of-spoilers-launched",
  "dateList": "2025-01-20",
  "date_published": "2025-01-20T01:19:38.000Z"
}
