{
  "title": "UN races to feed one million Palestinians - World - DAWN.COM",
  "author": null,
  "content": "ROME: The UN’s World Food Programme said on Sunday it was moving full throttle to get food to as many Gazans as possible after border crossings reopened as part of a long-awaited ceasefire deal.\n\n“We’re trying to reach a million people within the shortest possible time,” the WFP’s Deputy Executive Director Carl Skau said, as the Rome-based UN agency’s trucks began rolling into the strip.\n\n“We’re moving in with wheat flour, ready to eat meals, and we will be working all fronts trying to restock the bakeries,” Skau said, adding the agency would attempt to provide nutritional supplements to the most malnourished.\n\nAn initial 42-day truce between Israel and Hamas is meant to enable a surge of sorely needed humanitarian aid into the Palestinian territory after 15 months of conflict.\n\nWFP plans ready meals with vouchers and cash for people to buy their own food ‘to bring back some dignity’\n\n“The agreement is for 600 trucks a day… All the crossings will be open”, Skau said.\n\nThe first WFP trucks entered Gaza through the Kerem Shalom crossing in the south and through the Zikim crossing in the north, the agency said in a statement, as it began trying to pull “the war-ravaged territory back from starvation”.\n\n“We have 150 trucks lined up for every day for the next at least 20 days,” Skau said, adding that the WFP was “hopeful that the border crossings will be open and efficient”.\n\nThere needs to be “an environment inside (Gaza) that is secure enough for our teams to move around”, so that food “does not just get over the border but also gets into the hands of the people”.\n\n“It seems so far that things have been working relatively well … We need to now sustain that over several days over weeks”, he said.\n\nBakeries ‘top priority’\n\nBefore the ceasefire came into effect, WFP was operating just five out of the 20 bakeries it partners with due to dwindling supplies of fuel and flour, as well as insecurity in northern Gaza.\n\n“We’re hoping that we will be up and running on all those bakeries as soon as possible,” Skau said, stressing that it was “one of our top priorities” to get bread to “tens of thousands of people each day”.\n\n“It also has a psychological effect to be able to put warm bread into the hands of the people”. WFP also wants to “get the private sector and commercial goods in there as soon as possible”, he said.\n\nThat would mean the UN agency could replace ready meals with vouchers and cash for people to buy their own food “to bring back some dignity” and allow them “frankly to start rebuilding their lives”.\n\nWFP said in a statement that it has enough food pre-positioned along the borders — and on its way to Gaza — to feed over a million people for three months.\n\nPublished in Dawn, January 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/678d9fc164dfc.gif",
  "retrievedAt": "2025-08-26T07:49:35.078Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886463/un-races-to-feed-one-million-palestinians",
  "dateList": "2025-01-20",
  "date_published": "2025-01-20T01:20:20.000Z"
}
