{
  "title": "PTI to challenge £190m case ruling tomorrow - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Says funds intended for Malik Riaz’s account, not for the state\n• Claims Bushra’s imprisonment politically motivated, aimed at pressuring Imran\n\nISLAMABAD: The opposition Pakistan Tehreek-i-Insaf (PTI) on Sunday announced its intention to challenge the decision in the £190 million Al-Qadir Trust case in the high court tomorrow (Tuesday), with PTI leader Salman Akram Raja alleging that the funds were misinterpreted by the current government, claiming they were to be deposited into property tycoon Malik Riaz’s account, not returned to the state.\n\nThe party also decided to continue talks at different levels, including with the government and the powers that be.\n\nSpeaking at a news conference at KP House, Mr Raja revealed that nine accounts of Malik Riaz’s family were seized over suspicious transactions in the United Kingdom and one of the transactions was with Hasan Nawaz, son of PML-N supremo Nawaz Sharif.\n\nOn the other hand, there was an allegation that 16,000 acres of land were given to Malik Riaz, and the Supreme Court gave a verdict that the property tycoon had to pay Rs460 billion to the Malir Development Authority (MDA).\n\nUK authorities then decided to send the amount to the Supreme Court and directed the Malik Riaz family to leave the United Kingdom, he said.\n\nHe claimed that the UK authorities did not find any crime in it and just directed the family to leave the country in light of the Supreme Court’s verdict.\n\nIt was a bilateral agreement between the National Crime Agency (NCA) of the UK and Ali Malik, and it was decided that the amount would be deposited in the Supreme Court’s account. There was a sentence in the press release issued by the NCA that the amount would be returned to the state of Pakistan.\n\nIt was claimed that the money had to be returned to the state, which was totally wrong, and the fact was that the amount had to be submitted in the account of the Supreme Court, he said.\n\nAs the NCA requested that the agreement not be disclosed, approval was obtained from the federal cabinet through sealed envelopes. As Malik Riaz got the Sindh land free of cost, so that money has to be given to the state through the Supreme Court.\n\nThe amount was deposited in the foreign reserve account, and the equivalent amount, i.e. Rs34 billion, was deposited in the Supreme Court’s account. Meanwhile, Malik Riaz also deposited the amount due to which the Supreme Court transferred Rs50bn to the federal government and Rs44bn to the Sindh government’s accounts, he added.\n\nHe said that in the judgement, it had been written that the land was initially transferred to Zulfikar Bukhari and then to Imran Khan.\n\nIt was because the trust was not established at that time and once the trust was established, land was transferred in the name of Imran Khan and Bushra Bibi. “Although we are going to challenge it in a few days, it is a fact that ‘controversial judges’ are being appointed,” he alleged.\n\nMr Raja said it was condemnable that Bushra Bibi had been imprisoned just because her name was included in the list of trustees.\n\nWithout naming the establishment, he said PTI would continue holding talks at different levels as the party wanted to continue to play a role in the country’s politics.\n\nReplying to questions, Mr Raja claimed that judges were under pressure.\n\nPTI leader Kanwal Shauzab also criticised Bushra Bibi’s imprisonment, accusing the government of targeting her to exert pressure on Imran Khan.\n\n“The fact is that the Form-47 government will not be able to give mental torture to Imran Khan, and that is why Bushra Bibi went to jail and surrendered herself,” she said.\n\nChallenge\n\nThe PTI is all set to challenge the Al-Qadir Trust case in the high court on Tuesday.\n\nPTI Central Information Secretary Sheikh Waqqas Akram said in a statement that the party would file an appeal at the earliest with the high court, aiming to quash the contentious verdict and correct the egregious miscarriage of justice.\n\nHe expressed confidence that the names of Imran Khan and Bushra Bibi would be cleared in the first hearing because the decision was a “blatant travesty of justice, driven by political motivations and fabricated charges”.\n\nMr Akram remained hopeful that the court would order the immediate release of Mr Khan, as the decision was a grave injustice and a mockery of Pakistan’s justice system.\n\nHe emphasised that Imran Khan, having committed no wrongdoing, steadfastly refused to compromise his principles and decided to fight his more than 200 cases in the courts.\n\nHe vowed that the PTI founder would seek to clear his name through the judicial process instead of resorting to underhanded deals because he believed in the supremacy of the Constitution, the rule of law and democracy.\n\nThe PTI leader vowed that “power usurpers’ arm-twisting tactics” would ultimately fail, as they had in the past.\n\nHe emphasised that it would be better to accept the ground reality and immediately release all political prisoners, including Imran Khan and his wife, besides establishing a powerful judicial commission comprising senior Supreme Court judges to investigate the May 9 and Nov 26 incidents.\n\nPublished in Dawn, January 20th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:49:52.564Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886403/pti-to-challenge-190m-case-ruling-tomorrow",
  "dateList": "2025-01-20",
  "date_published": "2025-01-20T01:19:38.000Z"
}
