{
  "title": "‘America first’: Trump becomes 47th president of the United States - World - DAWN.COM",
  "author": null,
  "content": "Donald Trump was sworn in for a historic second term as president on Monday, pledging a blitz of immediate orders on immigration and the US culture wars as he caps his extraordinary comeback.\n\nWith one hand raised in the air and the other on a Bible given to him by his mother, the 47th US president solemnly took the oath of office beneath the huge Rotunda of the US Capitol.\n\nMain takeaways from speech:\n\nBeginning his speech, Trump thanked his predecessors and Vice President Kamala Harris, saying: “The golden age of America begins right now.”\n\nHe said the US would flourish again and be respected all over the world from now on.\n\nTrump said the US would not allow itself to be taken advantage of, saying: “During every single day of the Trump administration, I will very simply put America first.”\n\nHe said his government would “reclaim” the sovereignty of the US, restore safety and “rebalance” the scales of justice.\n\nTrump said his “top priority” was to create a free, proud and prosperous nation. “America will soon be greater, stronger and far more exceptional than ever before.”\n\nHe said he returned to the presidency confident and optimistic that “we are at the start of a thrilling new era of national success”, adding that a “tide of change is sweeping the country and sunlight is pouring over the entire world and America has the chance to seize this opportunity like never before”.\n\nTrump said there were “plentiful” challenges facing his administration but they would be “annihilated by this great momentum that the world is now witnessing in the US”.\n\nGoing on the attack, he said: “Our government confronts a crisis of trust. For many years, a radical and corrupt establishment has extracted power and wealth from our citizens while the pillars of our society lay broken and seemingly in complete disrepair.”\n\nHe criticised the prior government for failing to protect American citizens while “providing sanctuary and protection to dangerous criminals … that have illegally entered our country from all over the world”.\n\nTrump criticised the US public health system for not delivering in times of disaster and still consuming resources, along with the education system.\n\n“All of this will change starting today.”\n\nHe said his reelection was a “mandate to completely and totally reverse a horrible betrayal … and to give the people back their faith, wealth and democracy and indeed their freedom”.\n\nTrump vowed: “From this moment on, America’s decline is over.”\n\nHe said that over the past eight years, “I have been tested and challenged more than any president in our 250-year history, and I’ve learned a lot along the way.”\n\nRecounting his Pennysylvania assassination attempt, Trump said: “I was saved by God to make America great again,” prompting a standing ovation from those in attendance.\n\nTrump said his administration of “American patriots” would bring hope, prosperity and safety to citizens of every “race, religion, colour and creed”. “January 20th, 2025 is Liberation Day,” he added.\n\nPaying tribute to his voters from the African-American and Hispanic communities, he said: “National unity is now returning to America.”\n\nLaying out his plans for the executive orders he intends to sign, Trump said he would begin the “complete restoration of America and the revolution of common sense”.\n\nTrump said he would announce a “national emergency” at the southern border with all illegal entry halted and kicking off the process of returning “millions of criminal aliens back to the places from which they came”.\n\nHe said he would reinstate his “remain in Mexico” policy and end the practice of “catch and release”. “I will send troops to the southern border to repel the disastrous invasion of our country,” he said, adding that cartels would also be designated as foreign terrorist organisations.\n\nRegarding the economy, he said: “I will direct all members of my cabinet to marshall the vast powers at their disposal to defeat what was record inflation and rapidly bring down costs and prices. The inflation crisis was caused by massive overspending and escalating energy prices, and that is why today I will also declare a national energy emergency.”\n\nTrump said the US would drill and exploit its substantial fossil fuel reserves\n\n“We will drill baby, drill you. America will be a manufacturing nation once again.”\n\nHe continued: “We will bring prices down, fill our strategic reserves up again, right to the top, and export American energy all over the world. We will be a rich nation again, and it is that liquid gold under our feet that will help to do it with my actions today, we will end the green New Deal, and we will revoke the electric vehicle mandate, saving our auto industry and keeping my sacred pledge to our great American auto workers.”\n\nTrump said that instead of taxing US citizens, his administration would apply tariffs and tax foreign countries.\n\n“For this purpose, we are establishing the external revenue service to collect all tariffs, duties and revenues that will be massive amounts of money pouring into our treasury coming from foreign sources. The American dream will soon be back and thriving like never before to restore competence and effectiveness to our federal government.”\n\nRegarding free speech and censorship, he said that “after years and years of illegal and unconstitutional federal efforts to restrict free expression”, he would sign an executive order to immediately stop all government censorship and bring back free speech to the US.\n\n“Never again will the immense power of the state be weaponised to persecute political opponents, something I know something about. We will not allow that to happen. It will not happen again. Under my leadership. We will restore fair, equal and impartial justice under the constitutional rule of law, and we are going to bring law and order back to our cities.\n\n“This week, I will also end the government policy of trying to socially engineer race and gender into every aspect of public and private life. We will forge a society that is colour-blind and merit-based. As of today, it will henceforth be the official policy of the United States government that there are only two genders, male and female.”\n\nContinuing regarding his social policies, he said he would reinstate service members expelled from the military for objecting to the Covid-19 vaccine mandate.\n\n“I will sign an order to stop our warriors from being subjected to radical political theories and social experiments while on duty, it’s going to end immediately. Our armed forces will be freed to focus on their sole mission, defeating America’s enemies.”\n\nHe vowed the build the “strongest military the world has ever seen”.\n\nTrump said his administration would measure its success “not only by the battles we win, but also by the wars that we end, and perhaps most importantly, the wars we never get into.\n\n“My legacy will be that of a peacemaker and unifier. That’s what I want to be, a peacemaker and a unifier. I’m pleased to say that as of yesterday, one day before I assumed office, the hostages in the Middle East are coming back home to their families.”\n\nRegarding foreign policy, Trump said the Gulf of Mexico would be renamed to the Gulf of America and the Panama Canal would be reclaimed.\n\n“We will pursue our manifest destiny into the stars launching American astronauts to plant the stars and stripes on the planet Mars.”\n\nCommenting on his political comeback, Trump said: “Many people thought it was impossible for me to stage such a historic political comeback. But as you see today, here I am, the American people have spoken. I I stand before you now as proof that you should never believe that something is impossible to do in America. The impossible is what we do best.”\n\nSoon after being sworn in as president, the Trump administration took a number of steps, with many changes in effect.\n\nShortly after the inauguration, US border authorities said they had shut down outgoing president Joe Biden’s CBP One legal entry programme, which had allowed hundreds of thousands of migrants to enter the US legally by scheduling an appointment on an app. Existing appointments were cancelled, according to US Customs and Border Protection.\n\nIn several Mexican border cities, migrants saw their appointments on Biden’s CBP One app cancelled just after Trump took office. Some 280,000 people were logging into the app daily to secure an appointment as of Jan 7. In Matamoros, Mexico, a group of migrants from the central Mexican state of Zacatecas arrived at a legal border crossing at midday but were turned back by border authorities who said all appointments were now void, they told a Reuters witness.\n\nTrump’s transition team asked more than a dozen senior career diplomats to step down from their roles, two US officials familiar with the matter said, as the newly inaugurated president moved quickly to shape his foreign policy and the diplomatic corps.\n\nAmong those expected to step aside as Trump was inaugurated were the agency’s No. 3 official John Bass, who was acting undersecretary for political affairs overseeing policy from Asia to Europe and the Middle East, sources said. His planned departure was first reported by the Washington Post.\n\nOne of the sources said all undersecretary and assistant secretary level officials — effectively the entire two layers of officials under the secretary of state — were asked to step down.\n\nNeither the State Department nor the Trump transition team responded to a request for comment.\n\nThe White House issued a statement shortly after Trump’s inauguration listing the new president’s first priorities, among them improved accountability for government bureaucrats.\n\n“On the president’s direction, the State Department will have an America-First foreign policy,” the White House said.\n\nSeparately, the White House announced the US would once again withdraw from the Paris climate deal, removing the world’s biggest historic emitter from global efforts to fight climate change for the second time in a decade.\n\nThe decision would place the US alongside Iran, Libya and Yemen as the only countries in the world outside the 2015 pact, in which governments agreed to limit global warming to 1.5 degrees Celsius above pre-industrial levels to avoid the worst impacts of climate change.\n\nThe announcement, in a document from the White House, reflects Trump’s scepticism about global warming, which he has called a hoax, and fits in with his broader agenda to unfetter US oil and gas drillers from regulation so they can maximise output.\n\nThe Pentagon removed the portrait of Mark Milley, the retired army general and former chairman of the Joint Chiefs of Staff, according to two Reuters witnesses, in a move that happened within two hours of President Trump’s inauguration.\n\nThe Pentagon did not immediately respond to a question about why the portrait was removed days after its unveiling.\n\nTrump had a deep resentment towards Milley, and once called him “slow-moving and thinking” and a “moron”. Hours earlier, Biden had issued a preemptive pardon to Milley and others Trump had targeted for potential retaliation.\n\n“Good morning,” Trump said as he earlier entered the Capitol accompanied by ex-president Joe Biden. Asked how they felt, Biden responded, “Well.”\n\nTrump will usher in another turbulent four-year term with promises to push the limits of executive power, deport millions of immigrants, secure retribution against his political enemies and transform the role of the US on the world stage.\n\nEven before Trump was set to take office, aides detailed a raft of executive actions that he would sign immediately, including 10 focused on border security and immigration, his top priority.\n\nThe president will declare a national emergency at the southern border, send armed troops there and resume a policy forcing asylum seekers to wait in Mexico for their US court dates, an incoming White House official told reporters.\n\nThe inauguration completes a triumphant comeback for a political disruptor who survived two impeachment trials, a felony conviction, two assassination attempts and an indictment for attempting to overturn his 2020 election loss.\n\nShortly before 10am ET (1500 GMT), Trump and incoming first lady Melania Trump arrived at the White House, where Biden and first lady Jill Biden greeted them with handshakes.\n\n“Welcome home,” Biden said.\n\nThe ceremony took place inside the Rotunda of the US Capitol, four years after a mob of Trump supporters breached the symbol of American democracy in an unsuccessful effort to forestall Trump’s defeat by Biden. The swearing-in was moved indoors for the first time in 40 years due to the extreme cold.\n\nTrump, the first US president since the 19th century to win a second term after losing the White House, has said he will pardon “on Day One” many of the more than 1,500 people charged in connection with the January 6, 2021, attack.\n\nBiden, in one of his last official acts, pardoned several people whom Trump has targeted for retaliation, including former White House chief medical adviser Anthony Fauci, former Republican US Representative Liz Cheney and former chairman of the Joint Chiefs of Staff Mark Milley.\n\nTrump will restore the federal death penalty, which Biden had suspended, and require that official US documents such as passports reflect citizens’ gender as assigned at birth, incoming administration officials told reporters.\n\nHe will also sign an order ending diversity, equity and inclusion initiatives in the federal government on his first day, which is also Martin Luther King Jr. Day, the officials said.\n\nBut Trump will not impose new tariffs today, instead directing federal agencies to evaluate trade relationships with China, Canada and Mexico, a Trump official confirmed.\n\n“A tide of change is sweeping the country,” Trump plans to say in his inaugural speech, according to excerpts seen by Reuters.\n\n“With these actions, we will begin the complete restoration of America and the revolution of common sense.”\n\nThe Trumps began the day at St John’s Episcopal Church in Washington, where several tech executives — including the three richest men in the world, Tesla and SpaceX CEO Elon Musk, Amazon CEO Jeff Bezos and Meta CEO Mark Zuckerberg — joined them.\n\nAs he did in 2017, Trump enters office as a chaotic and disruptive force, vowing to remake the federal government and expressing deep scepticism about the US-led alliances that have shaped post-World War Two global politics.\n\nThe former president returns to Washington emboldened after winning the national popular vote over Vice President Kamala Harris by more than two million votes thanks to a groundswell of voter frustration over persistent inflation, though he still fell just short of a 50 per cent majority.\n\nIn 2016, Trump won the Electoral College — and the presidency — despite receiving nearly 3m fewer votes than Hillary Clinton.\n\nJeremi Suri, a presidential historian at the University of Texas at Austin, compared the present era to the late 19th century when Grover Cleveland became the only other president to win non-consecutive terms.\n\nLike now, he said, that was a time of upheaval, as industrial advances transformed the economy, wealth inequality exploded and the proportion of immigrant Americans reached a historical peak.\n\n“What we’re really talking about is a fundamentally different economy, a fundamentally different country in terms of its racial and gender and social makeup, and we are as a country struggling to figure out what that means,” he said.\n\n“It’s an existential moment.”\n\nTrump, who will surpass Biden as the oldest president ever to be sworn into office, will enjoy Republican majorities in both chambers of Congress that have been almost entirely purged of any intra-party dissenters. His advisers have outlined plans to replace nonpartisan bureaucrats with hand-picked loyalists.\n\nEven before taking office, Trump established a rival power centre in the weeks after his election victory, meeting world leaders and causing consternation by musing aloud about seizing the Panama Canal, taking control of Nato ally Denmark’s territory of Greenland and imposing tariffs on the biggest US trading partners.\n\nHis influence has already been felt in the Israel-Hamas announcement last week of a ceasefire deal. Trump, whose envoy joined the negotiations in Qatar, had warned of “hell to pay” if Hamas did not release its hostages before the inauguration.\n\nUnlike in 2017, when he filled many top jobs with institutionalists, Trump has prioritised fealty over experience in nominating a bevy of controversial cabinet picks, some of whom are outspoken critics of the agencies they have been tapped to lead.\n\nThe inauguration will proceed amid heavy security after a campaign highlighted by an increase in political violence that included two assassination attempts against Trump, including one in which a bullet grazed his ear.\n\nEight years ago, Trump delivered a bleak inaugural address vowing to end the “American carnage” of what he said were crime-ridden cities and soft borders, a departure from the tone of optimism most newly elected presidents have adopted.\n\nForeign governments will be scrutinising the tenor of Trump’s speech after he waged a campaign laced with inflammatory rhetoric.\n\nThe traditional parade down Pennsylvania Avenue past the White House will now take place indoors at the Capital One Arena, where Trump held his victory rally on Sunday. Trump will also attend three inaugural balls in the evening.\n\nAmid the pageantry of the day, Trump will begin signing his first executive orders, many of which are likely to face legal challenges.\n\nTrump will be the first felon to occupy the White House after a New York jury found him guilty of falsifying business records to cover up hush money paid to a porn star.\n\nWinning the election also rid Trump of two federal indictments — for plotting to overturn the 2020 election and for retaining classified documents — thanks to a Justice Department policy that presidents cannot be prosecuted while in office.\n\nIn a report last week, Special Counsel Jack Smith said he had enough evidence to convict Trump in the election case if Trump had reached trial.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/20222434baa3297.jpg",
  "retrievedAt": "2025-08-26T07:49:05.320Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886576/america-first-trump-becomes-47th-president-of-the-united-states",
  "dateList": "2025-01-20",
  "date_published": "2025-01-20T15:42:52.000Z"
}
