{
  "title": "Biden issues pardons to protect Milley, Fauci, others from Trump retaliation - World - DAWN.COM",
  "author": null,
  "content": "US President Joe Biden issued pre-emptive pardons on Monday for people Republican successor Donald Trump has targeted for retaliation, including former Chairman of the Joint Chiefs of Staff Mark Milley and former White House chief medical advisor Anthony Fauci.\n\nThe pardon also covers all lawmakers who served on the congressional select committee that investigated the January 6, 2021 storming of the Capitol by Trump supporters, and police officers who testified before it.\n\nTrump, who will return to the presidency later Monday, has repeatedly called for the prosecution of his perceived enemies since winning the White House in November.\n\nBiden praised public servants as the “lifeblood of our democracy.” Without mentioning Trump, he expressed alarm that some of them were subjected to threats and intimidation for doing their job.\n\n“These public servants have served our nation with honour and distinction and do not deserve to be the targets of unjustified and politically motivated prosecutions,” Biden said in a statement.\n\nTrump in December backed a call for the FBI to investigate fellow Republican Liz Cheney over her role in leading Congress’s probe of the January 6, 2021, assault on the US Capitol by his supporters.\n\nFauci often clashed with Trump during the Covid-19 pandemic and his supporters have continued to attack the former senior health official.\n\nMilley was quoted in the book War by Bob Woodward, which was published last month, calling Trump “fascist to the core” and Trump’s allies have targeted him for perceived disloyalty to the former president.\n\nReuters reported in November that the Trump transition team was drawing up a list of military officers seen as connected to Milley to be fired.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/20180959548eb79.jpg",
  "retrievedAt": "2025-08-26T07:49:03.741Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886564/biden-issues-pardons-to-protect-milley-fauci-others-from-trump-retaliation",
  "dateList": "2025-01-20",
  "date_published": "2025-01-20T13:32:40.000Z"
}
