{
  "title": "Trump vows to end ‘American decline’ at inauguration eve rally - World - DAWN.COM",
  "author": null,
  "content": "Donald Trump pledged a blitz of presidential actions to end “American decline”, telling a fired-up inauguration eve rally on Sunday that he would crack down on woke ideology and immigration.\n\nIn a raucous campaign-style gathering in Washington, the 78-year-old Republican promised cheering supporters that he would act with “historic speed” from day one of his White House comeback.\n\n“Tomorrow at noon, the curtain closes on four long years of American decline, and we begin a brand new day of American strength and prosperity,” Trump told a packed sports arena.\n\n“I will act with historic speed and strength and fix every single crisis facing our country.”\n\nBillionaire Trump was joined on stage by Elon Musk — the tech tycoon who will lead a major cost-cutting drive in his administration — and who vowed to make America strong “for centuries”.\n\nThen at the end the rally Trump danced alongside the disco band Village People as they performed their 1970s hit YMCA, which became the unofficial anthem of his election campaign.\n\nMuch of Trump’s hour-long speech focused on immigration, driving home one of the dark messages that helped spur his remarkable victory in November’s presidential election over Democratic Vice President Kamala Harris.\n\n“We’re going to stop the invasion of our borders,” added Trump, who has pledged to launch raids targeting undocumented migrants within days of taking office.\n\nBut he also promised “lots” of executive orders from his first day back in the Oval Office, including one to ban “transgender insanity” and critical race theory from schools and to keep trans athletes out of women’s sports.\n\nTrump also reiterated a promise to release files on the assassinations of former president John F. Kennedy, his brother Bobby Kennedy and civil rights leader Martin Luther King Jr.\n\nLong lines of Trump supporters formed outside the arena despite snowy conditions.\n\n“I wanted to see history unfold before my eyes,” Alan McNeely, 21, a student from Connecticut, told AFP.\n\nEarlier, the future US commander-in-chief paid a highly symbolic visit to Arlington National Cemetery, the resting place of America’s war dead.\n\nTrump laid a wreath at the Tomb of the Unknown Soldier, followed by Vice President-elect JD Vance.\n\nThe somber ceremony contrasted with Trump’s last trip to the cemetery as a presidential candidate in August, when the US army criticised his staff for pushing a cemetery employee.\n\nLater, Trump was set to attend a “candlelight dinner” for supporters.\n\nTrump’s hopes for a huge crowd to see his inauguration at the US Capitol tonight took a blow, however, when forecasts of below freezing weather prompted organisers to move the ceremony indoors.\n\nInstead of being sworn in on the steps of the Capitol, Trump will now take the oath under the massive dome of its Rotunda, last used for the ceremony 40 years ago during the inauguration of Ronald Reagan.\n\n“You’re going to hear President Trump talk about how we are entering a Golden Age of America” in his inaugural speech, his incoming press secretary Karoline Leavitt told “America’s Newsroom” on Fox News.\n\nOutgoing President Joe Biden meanwhile travelled to South Carolina on Sunday, his last full day as US president, to mark a national holiday honoring Martin Luther King Jr.\n\nThe Democrat pointedly urged Americans to “keep the faith in a better day to come” and promised that he was “not going anywhere”, as he prepares to hand over to the man he has branded a threat to democracy.\n\nBut Trump has already been heavily drawn into global affairs before he takes office.\n\nWidely used video-sharing app TikTok credited his “clarity” for being able to restore service in the United States after briefly going dark due to a ban on national security grounds.\n\n“We have to save TikTok,” Trump told the rally.\n\nHe earlier promised to issue an executive order delaying the ban to allow time to “make a deal” to remove TikTok’s US subsidiary from Chinese ownership.\n\nIn the Middle East, the first three Israeli hostages were released on Sunday under a Gaza truce that Trump’s team had been involved in along with Biden’s administration.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2011095669021d1.jpg",
  "retrievedAt": "2025-10-12T00:55:37.109Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886504/trump-vows-to-end-american-decline-at-inauguration-eve-rally",
  "dateList": "2025-01-20",
  "date_published": "2025-01-20T06:13:27.000Z"
}
