{
  "title": "Takeaways from Trump’s pre-inauguration rally speech - World - DAWN.COM",
  "author": null,
  "content": "On the eve of his inauguration, President-elect Donald Trump staged a campaign-style rally in frigid Washington where he and his supporters celebrated his win. Here are some takeaways from Trump’s remarks on Sunday.\n\nAs he has been signalling for weeks, Trump is expected to sign a torrent of executive actions on Monday to make good on his campaign promises.\n\n“The American people have given us their trust, and in return, we’re going to give them the best first day, the biggest first week and the most extraordinary first 100 days of any presidency in American history,” Trump said.\n\nA source familiar with the planning confirmed Trump is preparing to sign more than 200 executive actions on Monday.\n\nThe orders are expected to cover border security, mass deportations, rolling back government diversity initiatives, pardoning Jan 6, 2021, US Capitol attack defendants, boosting oil and gas production, and replacing thousands of career government bureaucrats, among other policy items.\n\nTrump vowed to repeal “every radical and foolish executive order of the Biden administration” within hours of assuming the presidency. Trump and other rally speakers said Trump has been given a clear mandate to carry out his plans.\n\nAlthough critical of his predecessor’s record, Trump largely avoided the name-calling of past rally speeches. It was perhaps a preview of the tone Trump will try to strike on Monday during his inaugural address.\n\nThe existence of the rally itself was unusual. Traditionally with a new president, campaign rhetoric yields to more substantive conversations. The language of transition typically focuses on the handover between administrations.\n\nBut the crowd at the Capital One Arena was indistinguishable from any at Trump’s prior campaign events: men and women clad in red MAGA hats, Trump-adorned shirts and American-flag regalia.\n\nAnd the speakers who took the stage often spoke at the prior events: Ultimate Fighting Championship CEO Dana White, longtime Trump aide Stephen Miller, and two of Trump’s sons, Donald Jr and Eric.\n\nTrump, too, recycled many of his campaign soundbites on border security and crime and played campaign videos on the arena’s screens.\n\nAs the campaign wound down, Trump lamented that his rallies were going away. So Sunday’s event was a nostalgic thank-you of sorts to his supporters.\n\n“We’re all going to be sworn in together. That’s the way I look at it,” Trump said to cheers.\n\nSunday’s scene will likely stand in striking juxtaposition with Monday’s rarefied swearing-in event at the US Capitol, where tech all-stars such as Tesla’s Elon Musk, Amazon’s Jeff Bezos, Meta’s Mark Zuckerberg and Google’s Sundar Pichai are expected to be present. Their companies and many others donated millions to Trump’s inaugural fund.\n\nTrump is aiming to pack his administration with billionaires, including Musk, the world’s richest man, who will head up his government efficiency effort, Commerce nominee Howard Lutnick, Treasury Secretary pick Scott Bessent and Education nominee Linda McMahon.\n\nThe official balls at which Trump is expected to speak Monday night are invitation-only and will likely be populated with mega-donors and the US corporate elite.\n\nThe tension between the populist MAGA diehards and Trump’s corporate allies has already shown itself on issues such as H1-B visas, a visa program for foreign tech workers, and TikTok and may deepen as Trump identifies his near-term priorities. Is there room under Trump’s tent for all of them? We’ll soon find out.\n\nMusk has been at Trump’s side since he won the election in November, so it was no surprise when Trump asked him to come on stage during the rally to cheers from the MAGA faithful.\n\n“We’re looking forward to making a lot of changes, and this victory is the start really,” said Musk, who will chair Trump’s Department of Government Efficiency. But Musk’s advisory role may extend beyond that mandate.\n\nHe is likely to work with Trump’s White House appointees such as Russell Vought and James Sherk to shrink the size of the federal government while also replacing thousands of career employees with hand-picked Trump political employees.\n\nAs befitting his status, Musk was called by Trump to the stage to speak, while JD Vance, who will be sworn in on Monday as vice president, was not. As it was, Trump seemed to be unsure where Vance was in the arena. “Wherever the hell he is,” Trump said, looking about. “He’s here someplace.”\n\nHeader Image: President-Elect Donald Trump speaks at his victory rally at the Capital One Arena on January 19, 2025 in Washington, DC. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/20123611daee5d5.jpg",
  "retrievedAt": "2025-08-26T07:49:08.558Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886519/takeaways-from-trumps-pre-inauguration-rally-speech",
  "dateList": "2025-01-20",
  "date_published": "2025-01-20T07:45:55.000Z"
}
