{
  "title": "Senate Body passes Int’l Institute of Technology Culture and Health Sciences Bill, 2022",
  "link": "https://www.app.com.pk/national/senate-body-passes-intl-institute-of-technology-culture-and-health-sciences-bill-2022/",
  "date_published": "2023-04-13T09:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP): The Senate Standing Committee on Federal Education and Professional Training, in a meeting held here on Thursday passed the International Institute of Technology Culture and Health Sciences Bill, 2022.\nChaired by Senator Irfan-ul-Haq Siddiqui, the meeting was attended by Senator Dr Mehr Taj Roghani, Senator Fawzia Arshad, Senator Jam Mahtab Hussain Dahar, Senator Kamran Murtaza, senior officers of the Ministry of Federal Education and Professional Training and Chairman HEC Dr Mukhtar Ahmed.\nChairman Committee Senator Irfan-ul-Haq Siddiqui stressed the need for systems to be put in place so that unethical practices in the education system were curbed. He stressed the need for HEC to devise a system of rules and conditions that ensures that the Charter granted by HEC to any person or institution was not transferred to any other entity.\nHe further stressed the need for ensuring that all pre-requisites were in place before issuing Clearance Certificates. Irfan-ul-Haq Siddiqui said that the Clearance Certificate once issued for either of the House must be considered valid for the other as well.\nThe Chairman HEC, while clarifying his position, put forward certain cases that had caused the Organization to exercise extreme caution while dealing with issues related to the grant of the Charter.\nTaking up the matter of the National Technology Council Act and issues of technologists regarding their service issues raised by Senator Dr Mehr Taj Roghani, Irfan-ul-Haq Siddiqui directed the Ministry to give a complete briefing on the issue in the next meeting.\nHe also inquired about details of issuance of notification for appointment/posting of Junior Lady Teachers at Islamabad Model Colleges and other similar institutions of learning that have been hiring teachers on daily wages.\nSiddiqui stressed the need to remove all injustices from the system and ensure that the men and women who serve in academia were held in high regard and ensured their rights.",
  "retrievedAt": "2025-08-11T08:18:01.906Z"
}
