{
  "title": "Political consensus key to resolve collective challenges: NA Speaker",
  "link": "https://www.app.com.pk/national/political-consensuskey-to-resolve-collective-challenges-na-speaker/",
  "date_published": "2023-04-13T11:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP): Speaker National Assembly Raja Pervaiz Ashraf on Thursday said that the Constitution reflects the sagaciousness and political wisdom of the then political leadership.\nHe paid tribute to the former prime minister Zulfikar Ali Bhutto for building consensus among political parties to gift Pakistan with the Constitution based on the federal, parliamentary form of governance.\nHe expressed these views while launching NADRA ‘Constitution App’ and unveiling a commemorative coin of Rs 50 in connection with Golden Jubilee celebration of the Constitution of Pakistan.\nThe Speaker said that it was the Parliament which was the only platform to build consensus among divergent political parties. He said, “Building consensus is the key to resolve present socio-economic challenges.” He added that maintaining the sanctity of parliament and the Constitution was the collective responsibility.\nHe also appreciated the performance of NADRA for launching this App. He said that NADRA had gained international repute which was pride for Pakistan.\nPervaiz Ashraf also appreciated the performance of officers and officials of the National Assembly Secretariat for professionally organizing events in connection with the Golden Jubilee celebration of the Constitution.\nHe also directed NADRA to prepare National Assembly App to facilitate members of the National Assembly. Meanwhile, Chairman NADRA Tariq Malik expressed gratitude to the Speaker NA for providing the opportunity to serve the national cause of preparing NADRA Constitution App.\nHe said that NADRA would continue to strive for the best to serve the nation. He said that this App would spread awareness in common people regarding their fundamental constitutional rights as lack of awareness allowed the transgressors to violate these rights.\nIt is pertinent to mention that NADRA had launched the official mobile app that contains the Constitution of Pakistan. The mobile app will help citizens stay informed about their rights and duties as outlined in the supreme law of the land. The users can access the Constitution anytime from anywhere using any internet-connected device.\nThe key features of the app included viewing the structure & Chapters of the Constitution, searching the Constitutional articles and clauses using keywords. The App is also readable in Urdu. It is available on both Apple and Google Play stores.",
  "retrievedAt": "2025-08-11T08:18:05.328Z"
}
