{
  "title": "President upholds ‘dismissal from service’ penalty against woman harasser",
  "link": "https://www.app.com.pk/national/president-upholds-dismissal-from-service-penalty-against-woman-harasser/",
  "date_published": "2023-04-13T11:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP):President Dr Arif Alvi has upheld the penalty of dismissal from service on the Assistant Vice President of the Zarai Taraqiati Bank Limited (ZTBL) after it was proven beyond doubt that he had sexually harassed a female employee of the bank.\nThe President also enhanced the fine of Rs 500,000, imposed by the Federal Ombudsman for Protection against Harassment of Women at Workplace (FOSPAH), to Rs 600,000 on the accused considering the serious mental trauma he must have caused to the victim.\nThe President gave this decision while rejecting a representation filed by an Assistant Vice President ZTBL (the accused) against the decision of FOSPAH. He also rejected the representation filed by ZTBL in this case on account of the bank having no locus standi, said a press release issued by the President’s Secretariat.\nIn his decision, the President stated that the accused had failed to point out any irregularity in the proceedings conducted by FOSPAH which were based on the true appraisal of evidence. “In Pakistan, the message of the constitution, the law, and its implementation is loud and clear that we want to ensure a society where women are free to work and have a safe environment in all public places that allows them to become fully participating members of society”, he added.\nThe President also upheld the order that since the complainant had been terminated from service in utter violation of the law and rules i.e., conducting no regular inquiry against her and providing no opportunity of hearing to her, the termination order of the victim was quite illegal and unlawful and could not stand intact. He further upheld FOSPAH’s direction that it would be deemed as if no order of termination was made and the complainant was still a bank employee, and she would be entitled to all her benefits till today.\nThe President rejected the representation by stating that the accused failed to cross-examine the complainant on vital aspects of the matter i.e., the allegation of sexual harassment and hence for that matter the said allegations were presumed to be admitted and proved on the record. He noted that the evidence produced by the complainant seemed credible and confidence-inspiring, whereas the accused had been unable to shatter or discredit the evidence adduced by the complainant. He held that the Ombudsman had rightly observed in the impugned order that admittedly other male staff was also working in the branch but none of them had been charged by the complainant for any sexual harassment and there seemed no reason to falsely charge the accused.\nAs per the details, a female Officer Grade-II (the complainant) working at ZTBL’s branch in Gujranwala had filed a harassment complaint against the accused before the Ombudsman. She had alleged that the accused’s office was in close proximity to her office and was caught recording her videos on his mobile phone. During the inquiry proceedings before the Ombudsman, the complainant produced her affidavit wherein she stated that the accused had sexually harassed her and on 09.04.2019 the accused had physically touched her. In her cross-examination, the accused did not ask any question on denial of the specific allegation of sexual harassment.\nFOSPAH in its decision had held the accused guilty of sexual harassment of the complainant beyond any doubt and liable to be awarded punishment in terms of the Protection Against Harassment of Women at the Workplace Act, 2010 i.e., major penalties. FOSPAH had recommended the penalty of his dismissal from service along with a fine of Rs. 500,000, payable to the complainant as compensation for the hardships she faced at the hands of the accused.\nZTBL management was also instructed to install CCTV cameras and biometric systems in every branch of the bank to monitor the activities of the employees so as to be used if need be. “It is deplorable on the part of the bank management that they have not followed the mandatory provision of the Act 2010 failing to constitute the inquiry committee for holding probes into harassment cases of the bank”, it added.\nFOSPAH also directed the bank management to make arrangements for awareness and training workshops for its employees under the guideline of FOSPAH and also to display a code of conduct in conspicuous areas of all the bank branches.\nIn addition to rejecting the representation of the accused against FOSPAH’s order, the President also rejected a separate representation filed by ZTBL against the order of FOSPAH in this case on the ground that only a person or party who was aggrieved by the decision of the Ombudsman could file a representation before the President and ZTBL had no locus standi to file a representation. He said that the Islamabad High Court in Haji Adam Vs. FOSPAH had held that PEMRA, being an organization that challenged the initial order, had no locus-standi to become an aggrieved person.",
  "retrievedAt": "2025-08-11T08:18:30.752Z"
}
