{
  "title": "PTI regime’s ‘deliberate negligence’ behind lapse in FIFA Cup’s coverage by PTV: Marriyum",
  "link": "https://www.app.com.pk/national/pti-regimes-deliberate-negligence-behind-lapse-in-fifa-cups-coverage-by-ptv-marriyum/",
  "date_published": "2023-04-13T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP): Federal Minister for Information and Broadcasting Marriyum Aurangzeb on Thursday informed the National Assembly that “deliberate negligence” of the previous Pakistan Tehreek-e-Insaf (PTI) regime to benefit a private channel was behind the lapse in the FIFA World Cup’s coverage by the Pakistan Television (PTV).\nShe apprised the National Assembly that a complete report on the FIFA World Cup’s coverage lapse by the PTV would be tabled before the House after completion to reveal facts behind missing an important international event due to deliberate negligence of the previous regime to benefit a private channel.\nThe Federal Investigation Agency (FIA) was probing the issue of telecasting rights to A-Sports was underway and its report on completion would be presented in the House, she added.\nThe minister was responding to a question of Shagufta Jumani of Pakistan Peoples Party Parliamentarians (PPPP) pertaining to the failure of PTV to live telecast the Federation International Football Association (FIFA) World Cup 2022 hosted by Qatar that had incurred huge revenue loss and deprived the nation of a global event, besides supplementary questions from other assembly members.\nMarriyum said getting the football world cup’s rights was not done in months rather it was a year long process that started in 2021. The previous regime did not start the process timely that left the Pakistani screens deprived of an international event.\nHowever, her ministry under he leadership engaged Tensports to manage coverage of the world cup and got it telecast across country, but the exclusive rights were not available to the PTV, she added.\nEarlier, Parliamentary Secretary for Information and Broadcasting Chaudhary Muhammad Shahbaz Babar told the House that the PTV had always broadcast the international football tournaments.\nHe said the bidding for the FIFA World Cup’s telecast rights was closed in 2021. He alleged that former information minister Chaudhry Fawad Hussain deliberately gave the rights to the private sports channel A-Sports.\nA departmental report, in that regard, was being compiled and would be sent to the Minister for Information who would brief the House soon whereas strict action would be taken against the responsible for the negligence, he added.\nSheikh Rohale Asghar of the Pakistan Muslim League-Nawaz (PML-N) said the FIFA World Cup issue was a previous matter but the Pakistan Super League-8 was aslo not broadcasted live on the PTV and asked the parliamentary secretary to apprise the House about any action if taken in that regard.\nShagufta Jumani, however, rejected the three-member departmental committee probing the issue and termed it a mere eye wash as all of the members were from the PTV, who themselves were responsible for the negligence.\nHe stressed private members should be engaged for a transparent probe.",
  "retrievedAt": "2025-08-11T08:18:29.641Z"
}
