{
  "title": "‘Not to accept’ constitution of SC’s 8-member bench: Ruling alliance",
  "link": "https://www.app.com.pk/national/not-to-accept-constitution-of-scs-8-member-bench-ruling-alliance/",
  "date_published": "2023-04-13T08:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 13 (APP): Parties in the coalition government on Thursday said that they would not accept the apex court’s move to constitute an eight-member “controversial bench” for hearing the ‘Supreme Court (Practice and Procedure) Bill, 2023’ before the completion of its legislative process and implementation.\nIn their joint statement issued here, the ruling alliance said that such a move was never witnessed before in the history of Pakistan and in the conduct of judicial proceedings.\n“This act is tantamount to damaging the credibility of the superior court besides making the process of justice meaningless,” it said.\nTaking exceptions against the constitution of the bench before the set bill was enacted, the statement likened the bench composition with the purported “divide” of the Supreme Court and also validated the ruling alliance’s earlier stance.\nThe honourable judges of the apex court in their judgments themselves had also openly expressed their reservations over “one-man-show”, they recalled.\n“Pakistan is a federating unit and non-inclusion of judges from smaller provinces – Balochistan and Khyber Pakhtunkhwa in the bench is also regrettable,” it said. The statement said that the ruling alliance considers this move an attempt to curtail the Parliament’s power which would be resisted.\nThe constitution of the “disputed bench” in such haste and then fixing the case for hearing clearly indicated that what decision would come.\nAccording to the statement, the action of the Supreme Court and the statement of bar councils on the formation of the controversial bench “is a clear manifestation that the action is not only against justice and fairness but also against the prevailing judicial procedures and established principles”.\n‘All Pakistan Lawyers Convention’, held in Lahore, passed a resolution on October 12, 2019, demanding the Parliament to pass this law. Acting on the demand of the lawyers’ community, the Parliament presented the said bill, the statement added.\nIt was asserted in the statement that “every attempt to take away the authority of the Parliament and interfere in its constitutional jurisdiction will be resisted and there will be no compromise on the supremacy of the Parliament in the light of the Constitution of Pakistan”.",
  "retrievedAt": "2025-08-11T08:18:10.121Z"
}
