{
  "title": "Caretaker govt continues to implement int’l agreements: Solangi",
  "link": "https://www.app.com.pk/national/caretaker-govt-continues-to-implement-intl-agreements-solangi-2/",
  "date_published": "2023-09-08T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 8 (APP):Caretaker Minister for Information and Broadcasting Murtaza Solangi on Friday said the caretaker government respected the international financial agreements and would continue to implement them in true letter and spirit.\nAddressing a news conference here after the first session of two-day meeting of Special Investment Facilitation Council (SIFC), the minister said deliberations were held on the measures which were essential for reducing the government’s expenditures and circular debt.\nHe was flanked by Caretaker Minister for Finance Dr Shamshad Akhtar, Minister for Energy Muhammad Ali, and Minister for Industry and Production Gohar Ijaz.\nSolangi said discussions were also held on working out a schedule for implementing the decisions already taken to carry out privatization of some departments.\nHe said measures to stop misuse of international agreements, if there is any, also came under discussion. Restructuring of the Federal Board of Revenue (FBR), measures for removing bottlenecks in foreign direct investment, including visa policy reforms, and steps to improve performance of different departments were also part of extensive discussion held on the first day of the SIFC meeting.\nHe said an issue of smuggling of commodities, petroleum products and dollars were discussed at length.\nAt the outset of the press conference, the minister said traditionally, a press release was issued to highlight the decisions and discussions of the SIFC, but from now onward, the public would be informed by the caretaker government through briefings by the relevant ministers.\nThe main objectives of SIFC were to boost foreign direct investment in different sectors including mining, information technology and agriculture, the minister remarked.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:33:03.224Z"
}
