{
  "title": "Pakistan asks India to stop human rights violations in IIOJK",
  "link": "https://www.app.com.pk/national/pakistan-asks-india-to-stop-human-rights-violations-in-iiojk/",
  "date_published": "2023-09-08T15:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 8 (APP): Pakistan Friday asked India to honour its obligations under international human rights and humanitarian laws and bring an end to the egregious human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAddressing the weekly press briefing here, the Foreign Office spokesperson said, “Grave and systematic violations of human rights in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) continue to alarm the world conscience. Several international human rights organizations including Amnesty International have addressed a joint open letter to invite the attention of the representatives of G-20 member states, specially invited countries and international organizations, towards the serious human rights violations being committed in IIOJK.”\nShe said, “The letter notes the ongoing repressive policies in IIOJK, including restrictions on freedom of expression, peaceful assembly and association and intensification of crackdown on independent media and civil society groups. Indian occupation forces are systematically using abusive counter terrorism and state security laws, such as the Unlawful Activities (Prevention) Act (UAPA) and Jammu and Kashmir Public Safety Act to incapacitate and persecute human rights defenders and dissenters in IIOJK.”\n“As India hosts the G-20 Summit and presents itself as an important player on the global stage, it should honour its obligations under international human rights and humanitarian laws and bring an end to the egregious human rights violations in IIOJK,” she added.\nShe told that Foreign Minister Jalil Abbas Jilani will chair the 10th Commonwealth Youth Ministerial Meeting (CYMM) to be held from 12 to 15 September 2023 in London.\n“The Commonwealth Secretariat is convening the Commonwealth Youth Ministerial Meeting as Pakistan assumes the Chair of the meeting and plays an active part in setting the agenda ahead of the Commonwealth Heads of Government Summit to be held next year in Samoa. The theme of the meeting is Aim Higher: Delivering More for Young People in the Commonwealth. It aligns with the United Nations Sustainable Development Goals. While in London, the Foreign Minister is also expected to meet with participating ministers and high-ranking officials of the Commonwealth.”\nThe Spokesperson said, “Pakistan’s policy on Afghan refugees has not changed. We have opened our hearts and our homes for the people of Afghanistan whenever they were in difficulty. With the first wave of Afghan refugees coming to Pakistan forty years ago, they have been living in Pakistan, have been working in Pakistan, they have been studying in Pakistan.”\n“We would like the Afghan refugees to return to their homeland in honour and dignity for which it is important that conditions are created for their early return. We remain in contact with Afghan authorities as well as with United Nations High Commissioner for Refugees to work towards that end.”\nTo a question, she said, “Pakistan, as you know, has invited its friends and partners, including the Gulf countries, to come and invest in Pakistan. In the context of SIFC, which has recently been established, we are in contact with all our friends and partners for future investment projects.”",
  "retrievedAt": "2025-08-11T09:31:48.722Z"
}
