{
  "title": "‘Navy Day’ celebrated with traditional fervour",
  "link": "https://www.app.com.pk/national/navy-day-celebrated-with-traditional-fervour/",
  "date_published": "2023-09-08T15:38:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 08 (APP): Pakistan Navy Friday celebrated 58th anniversary of ‘Navy Day’ to honour heroic achievements of Ghazis and Shuhadas who fought gallantly against a much bigger adversary with absolute courage and profound faith in Allah SWT.\nNavy Day is a glorious reminiscence of daring operation ‘SOMNATH’, when Pakistan Navy’s Warships destroyed important shore installations and inflicted irreparable damage to the Indian pride, a Pakistan Navy news release said.\nPakistan Navy lone Submarine GHAZI reigned and remained unchallenged at sea throughout the war, because of which the complete Indian Navy did not dare to come out in the open sea and challenge the Pakistan Navy Fleet.\nIn his message on the occasion, Chief of the Naval Staff Admiral Muhammad Amjad Khan Niazi said that 8th September marks act of bravery of Pakistan Navy’s officers and men who demonstrated invincible courage and absolute audacity during successful bombardment at Dwarka.\nOn this day, we acknowledge the sacrifices of our Shuhadas and Ghazis and honour their valiant spirit which vanquished the devious enemy during the 1965 War.\nThe Naval Chief highlighted that Pakistan Navy besides ensuring own maritime defence also maintains round the clock presence in international waters and engages with regional navies to foster interoperability and promote maritime security at high seas. For this purpose, Pakistan Navy is acquiring state of the art technologies to meet the emerging security challenges at sea while enhancing indigenous capabilities.\nAdmiral underlined that Pakistan Navy had also embarked on nation building initiatives particularly to uplift coastal communities and was making vigorous efforts to invigorate Blue Economy for economic prosperity of the country.\nThe day dawned with special prayers offered in all naval mosques for peace and prosperity of the country and particularly for the success of Kashmir struggle.\nQuran Khawani was arranged for eternal peace of Shuhada of the 1965 war.\nFlag hoisting ceremonies were held at all naval units and establishments.\nThe Commander Karachi laid floral wreath at Mazar-e-Quaid.\nNavy Day events were also organised at Lahore; wherein, Commander Central Punjab interacted with families of Pakistan Navy martyrs and paid tributes to their heroics in war.\nThe students from Bahria College across Pakistan participated in various activities to tribute our Ghazis and Shuhada.\nOther activities of the day included boat rally at Karachi harbour and rallies by students of Bahria Model School.",
  "retrievedAt": "2025-08-11T09:31:51.226Z"
}
