{
  "title": "NTDC endeavour to ensure smooth power supply in winter",
  "link": "https://www.app.com.pk/national/ntdc-endeavour-to-ensure-smooth-power-supply-in-winter/",
  "date_published": "2023-09-08T17:34:00.000Z",
  "source": "APP",
  "content": "MIRPUR  (AJK): September 08 (APP) ::National Transmission and Despatch Company Limited (NTDC) head Engr. Dr. Rana Abdul Jabbar Khan has issued directives to the engineers of Asset Management (North) to develop a maintenance plan for transmission lines and grid stations.\n“The aim is to enhance the reliability of the system and ensure a smooth power supply during winter and adverse weather conditions”, the media wing of NTDC told APP Friday evening.\nManaging Director of the organisation Engr. Dr. Rana Abdul Jabbar Khan emphasized that washing, replacement of insulators, and other maintenance work must be completed before the foggy / winter season.\nThe NTDC Chief was addressing a large gathering of engineers from Asset Management North at WAPDA House. In addition, MD NTDC inaugurated the Transmission Line Monitoring System application and directed immediate monitoring of aging transmission lines, as well as the development of remedial strategies.\nDuring the meeting, Dr. Rana Abdul Jabbar Khan was apprised of the progress of various ongoing tasks, including the pilot project for inspecting transmission lines using quad-copters/drones, the digitalization of utilities, substation automation, transmission line monitoring system, and dissolved gas analysis.\nHe commended the concerned teams for successfully implementing in-house dissolved gas analysis and directed its expansion nationwide at NTDC installations, which will significantly save costs.\nTo further expand the scope of online monitoring of transmission lines, the Managing Director instructed the purchase of three additional quad-copters and the initiation of thermo vision monitoring for grid stations.\nMD NTDC directed live line training to be conducted at Faisalabad, Rawat and Jamshoro in the coming weeks. He also instructed the initiation of Substation Automation System program trainings at the 500 kV New Lahore and 220 kV Gujrat grid stations, as well as the TSG Training Center Lahore. He urged the officers to work diligently within their mandate to ensure smooth power transmission and the removal of system constraints. Deputy Managing Director (AD&M), General Managers, Chief Engineer, Managers and other seniors officers were also present during the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:33:02.569Z"
}
