{
  "title": "Minister pledges strong action on waste management on International Day of Zero Waste",
  "author": null,
  "content": "ISLAMABAD, Mar 29 (APP):Federal Minister for Climate Change and Environmental Coordination, Musadik Masood Malik, urged nationwide action to tackle waste management challenges as Pakistan observes International Day of Zero Waste.\nThis year’s theme, “Towards Zero Waste in Fashion and Textiles,” highlights the pressing need to curb pollution from the textile sector, a major contributor to Pakistan’s economy but also a significant source of waste.\nMinister Malik acknowledged the textile industry’s role in employment and GDP growth but warned that waste from plastics, electronics, and food remains a critical issue requiring urgent attention.\n“Pakistan is implementing robust policies to combat waste,” he said, citing the National Hazardous Waste Management Policy (2022) and the Pakistan National Action Roadmap on Plastic Pollution as key steps toward sustainability.\nThe government is pushing for a shift from a linear to a circular economy, where waste is minimized and resources are reused.\nInitiatives promoting eco-friendly fashion, sustainable packaging, and a forthcoming circular economy policy are part of this strategy.\nMalik emphasized the need for private sector involvement in adopting sustainable practices and called on civil society to promote responsible consumption.\n“Our goal is a future where waste is drastically reduced, resources are preserved, and our environment is protected,” he said, aligning efforts with UN Sustainable Development Goals (SDG 11 and 12).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:06:36.292Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/minister-pledges-strong-action-on-waste-management-on-international-day-of-zero-waste/",
  "dateList": "2025-03-29",
  "date_published": "2025-03-29T08:59:00.000Z"
}
