{
  "title": "President convenes meeting of IIUI board of trustees next month - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: President Asif Ali Zardari has decided to convene a meeting of the board of trustees of International Islamic University Islamabad (IIUI) next month, while the university notified a controversial selection board.\n\nSources said the President House through an official letter informed the education ministry that the president had contested to chair (online) the meeting of BoT of IIUI on April 24. The education ministry was directed to provide agenda/working papers and other material by April 8.\n\n“Yes, President has contested to chair meeting of IIUI BoT on April 24. However, there are chances that date of this meeting will change and meeting will be held well before April 24,” an officer of the education ministry said. The president being chancellor of IIUI chairs the BoT meetings.\n\nMeanwhile, sources said IIUI on March 6 notified three members of the Selection Board.\n\nMember protests university’s decision to form new selection board sans his name\n\nThe new members are: Head of Department of Fast School of Management Fast University Prof Dr Sadia Nadeem, Member Information Technology Higher Education Commission Prof Dr Jamil Ahmad and the Vice Chancellor of Fatima Jinnah Women University Rawalpindi.\n\nAccording to the notification issued by Assistant Director IIUI Ejaz Ahmed, these members will hold office for a period of two years with effect from 06-12-2024.\n\nOn the other hand, member of the board of governors of IIUI Prof Dr Qibla Ayaz protested against the formation of the selection board sans his name.\n\nThrough an official letter on Monday, he recorded his protest to the acting rector IIUI and said: “I am writing to formally express my grave concerns over the recently issued notification by the IIUI regarding the newly appointed members of the Selection Board. As you are well aware, the Board of Governor (BoG) under its authority had duly appointed new members to the Selection Board, including myself. However, notification issued by the administration inexplicably excludes my name, which including others. This is a blatant violation of the explicit decision of BoG and I urged you to immediately rectify this unlawful action.”\n\nHe said that official minutes of the BoG meeting clearly reflected his nomination as a member of Selection Board.\n\n“Any deviation from the official record is not only improper but also raises serious concerns regarding the integrity of the University’s administrative process. The selection board is also statutory body and the inclusion of a BoG member is legal requirement. My nomination fulfilled this statutory obligation, and any attempt to arbitrarily alter this decision is beyond comprehension,” he said.\n\n“This is not first time that my membership of the statutory body of the University has been subjected to such unjust administrative maneuvering. A similar attempt was made by previous administration, which I regretfully challenged before the High Court, resulting in my restoration as a legitimate BoG member,” he said and demanded correction of the notification in line with BoG decision, otherwise he would seek legal resource.\n\nAppointment of rector\n\nMeanwhile, in another development, the education ministry sought legal opinion from the ministry of law and justice regarding the sacking of former IIUI rector Dr Samina Malik.\n\nLast year, she was suspended and removed by Supreme Court, stating that a competent and fit person must be appointed rector.\n\nThe apex court had directed that the chairman HEC or his nominee should be appointed as the acting rector till hiring of the permanent rector.\n\nSubsequently, the ministry of education removed Dr Malik and appointed the chairman HEC as the acting rector.\n\nEducation ministry sources said recently a letter was sent to the law ministry stating that the president of Pakistan was the authority for appointment of the rector IIUI; however, the ordinance of the university is silent about the termination/removal of the rector.\n\n“Also the judgement of the Supreme Court does not explicitly remove the Rector IIUI from service,” read the letter.\n\n“In view thereof, ministry of law and justice division is solicited for advice regarding the suitable course of action to be taken regarding removal or otherwise of the suspended Rector IIUI and for possible recruitment of new Rector IIUI before the matter may be accordingly placed before the President/ Chancellor IIUI,” read the letter.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:07:41.946Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897294/president-convenes-meeting-of-iiui-board-of-trustees-next-month",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:53:49.000Z"
}
