{
  "title": "‘Discriminatory tax policy hit lint production’ - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The committee formed by the prime minister for the revival of the cotton crop on Tuesday recommended uniform tax policies for domestic and imported cotton, along with several other key suggestions.\n\nMinister for National Food Security and Research Rana Tanveer Hussain chaired the first meeting of the 15-member Committee on Cotton Crop Production Enhancement.\n\nWhile making a detailed presentation on the factors that halved lint production in the current fiscal year, Pakistan Central Cotton Committee Vice-Chairman Dr Yusuf Zafar pointed out a discriminatory 18 per cent sales tax reduced the competitiveness of local cotton and discouraged growers.\n\nDr Yusuf Zafar and other stakeholders raised several pressing issues, including the lack of high-quality seeds, proper area zoning, insufficient research on GMO seeds, discriminatory tax policies, undocumented cotton production, and the need for better awareness campaigns.\n\nThe meeting participants emphasised promoting those crops that allow early cotton sowing, like onions and mustard.\n\nCotton, a kharif crop, competes with rice, sugarcane, and other crops for land, water, and farm resources in areas where all these crops can technically be cultivated. It faces significant indirect competition from sugarcane, an annual crop that occupies the land year-round.\n\nThe committee’s primary focus was the immediate steps to increase cotton production. The meeting involved extensive discussions, with stakeholders providing valuable insights and recommendations.\n\nStakeholders blamed the Ministry of Climate Change for the long delays and complex approval system which hindered the release of cotton varieties with new traits.\n\nWhile recommending the promotion of contract farming in cotton, Dr Zafar stated that this model has proved successful in maise, sugarcane, and potato crops.\n\nContract farming is an agreement between farmers and buyers to produce and market agricultural goods. The agreement specifies the terms and conditions of the transaction.\n\nRecently, some textile houses started cotton contract farming in Balochistan and Cholistan.\n\nUnder a drive to revive the crop in the next season, the agricultural departments of Punjab and Sindh have launched a campaign for early sowing.\n\nIn this regard, one million acres in Punjab and 600,000 acres in Sindh have been earmarked for early sowing of the triple genes cotton varieties during February and March.\n\nThe committee recommended an endowment fund for research and development in the cotton sector for climate-smart agriculture, mechanised farming based on specific varieties, heat tolerant and extra-long staple variety development for Balochistan and Sindh coastal areas.\n\nThe participants also proposed the modernisation of the ginning sector through the balancing, modernisation and rehabilitation (BMR) initiative and the introduction of digitisation of income and outgoing bales through the track and trace & trace system at ginning factories.\n\nAt the same time, strengthening linkages with the International Cotton Advisory Committee of the United States was emphasised to learn best practices in cotton-producing countries.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d0e5b72e011.gif",
  "retrievedAt": "2025-10-12T01:54:53.317Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897382/discriminatory-tax-policy-hit-lint-production",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:53:18.000Z"
}
