{
  "title": "Google Wallet launches in Pakistan - Business - DAWN.COM",
  "author": null,
  "content": "Digital wallet app Google Wallet became available in Pakistan on Wednesday, according to a statement issued by the tech giant.\n\nAccording to the statement, Google Wallet provides people a safer, simpler, and more helpful payment experience. It also supports digital items such as loyalty cards and boarding passes. Users can get started by downloading the application through the Google Play Store.\n\n“Pakistan’s digital payments landscape is evolving rapidly, and with more people embracing digital transactions, Google Wallet provides a secure, seamless, and efficient way to make payments, shop, and travel,” said Farhan Qureshi, Country Director for Google Pakistan.\n\n“It will enable Pakistanis to tap-and-pay in stores, check out seamlessly online, and easily access their boarding passes when they travel,” he added.\n\n“Google Wallet helps keep everything protected in one place, no matter where they go. More importantly, this launch will go a long way in supporting financial inclusion in Pakistan and unlock economic opportunities for all,” Qureshi continued.\n\n“This milestone further cements Google’s unwavering commitment to Pakistan, reinforcing our belief in its digital future and potential.”\n\nFrom today, cardholders of Bank AlFalah, Bank of Punjab, Faysal Bank Noor, HBL, Jazzcash, Meezan Bank, and UBL will be able to add their cards to Google Wallet and pay with their Android phones or Wear OS devices — wherever contactless payments are accepted.\n\nAdditionally, cardholders of Allied Bank, easypaisa Digital Bank, JS Bank and Zindigi will be able to add their cards to Google Wallet soon. Payment cards from Google Wallet can be used to pay online or in-app at merchants.\n\nThe statement read that online merchants such as Onic, Gul Ahmed, Sana Safinaz, J. and KE will also be available with PayFast’s integration with Google Pay.\n\nIn addition to storing and accessing payment cards, users can add boarding passes from Batik Air and Thai Airways to Google Wallet. With boarding passes in Google Wallet, travellers will be notified of changes to departure time and gate changes to ensure a hassle-free experience at the airport.\n\nFurthermore, they will be able to tap and pay securely using Google Wallet during their overseas travel, without the need for their physical card.\n\nIf a user already has an eligible credit or debit card saved to their Google account, it will automatically appear in Google Wallet. Simply follow the on-screen steps to set it up for contactless payments.\n\nIf a user does not have a card saved and would like to add a new one, they would have to tap “Add a card” in the carousel at the top of the page, review and accept the issuer’s terms and conditions, and complete the verification process. The card will then be tokenised and ready for use in Google Wallet.\n\nSimilarly, Bookme.pk users can add boarding passes, bus, train, and event tickets, while Sastaticket.pk users can save their boarding passes into Google Wallet.\n\nUsers can start to add digital items such as boarding passes, bus, train, and event tickets into their Google Wallet.\n\nAccording to the statement, privacy and security are the cornerstones of Google Wallet, “offering industry-standard tokenisation to keep transactions safe”.\n\nWhen making a payment, Google Wallet uses an alternate card number (a token) that is device-specific and associated with a dynamic security code that changes with each transaction.\n\nBanks also require verification before adding a card to the user’s device, and screen lock protection ensures that only the user can access the Wallet.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/12124154c98943e.png",
  "retrievedAt": "2025-08-25T15:07:37.417Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897434/google-wallet-launches-in-pakistan",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T08:47:19.000Z"
}
