{
  "title": "PAC questions award of Rs1.8bn contract to NLC by NDMA sans bidding - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Lawmakers express concern over selection of institutions for development projects\n• NDMA chairman given one month to file detailed report\n• Audit objection raised on Rs800m losses due to low-interest investment\n• NHA scrutinised over deficiencies in various projects and non-recovery of funds\n\nISLAMABAD: The controversial award of a Rs1.89 billion contract by the National Disaster Management Authority (NDMA) directly to the National Logistics Cell (NLC) for constructing the National Emerge­ncy Operations Centre came under detailed discussion during the Public Accounts Committee (PAC) meeting on Tuesday.\n\nQuestions were raised by the Public Accounts Committee (PAC), chaired by Junaid Akbar Khan, about the transparency of the bidding process, as only military-affiliated institutions were considered.\n\nThe PAC was convened to review audit reports of the NDMA and the Ministry of Communications. Discussions centered on the financial and operational aspects of disaster management and relief efforts in the country.\n\nThe Auditor General of Pakistan’s office noted that during the financial year 2022-23, bid invitations were extended to three military-affiliated entities — the National Logistics Cell (NLC), Frontier Works Organisation (FWO), and Railcop. However, only NLC submitted a bid, which was subsequently accepted, leading to a single-bid contract award.\n\nThe audit report highlighted that no mechanism was in place to assess price reasonability, raising concerns over compliance with public procurement rules. It also questioned why only military-affiliated organisations were deemed suitable for development projects in the country.\n\nThe PAC chairman instructed NDMA chairman, Lt-Gen Inam Haider Malik, to submit a detailed report within a month.\n\nWhile examining NDMA’s financial practices, the PAC particularly focused on an audit objection regarding Rs800 million loss to NDMA due to low-interest investments.\n\nThe PAC was informed that for the financial year 2022-23, interest paid by National Bank of Pakistan (NBP) was much lower than the policy rates notified by the State Bank of Pakistan. The NDMA officials informed the committee that it was not interested in earning interest. Committee member Omar Ayub Khan criticised the NDMA chairman’s response, stating it was unsatisfactory.\n\nHe emphasised that the State Bank’s regulations regarding fund deposits were clear, and the financial mismanagement warranted further scrutiny. Further deliberations in the PAC meeting focused on NDMA’s procurement practices.\n\nThe audit revealed that NDMA overpaid a vendor, Canteen Stores Department (CSD), a state-owned discount retailer chain that operates a chain of supermarkets in cantonments and other military-administered areas in the country, for food supply packages, while Rs124.841 million was paid in General Sales Tax (GST) despite exemptions for flood relief supplies.\n\nThe committee redirected the mat­ter to the Departmental Accou­nts Committee (DAC) for resolution. Additionally, an audit objection was raised regarding misallocation of a $3 million grant from the Asian Development Bank (ADB) for flood victims.\n\nThe audit revealed that tents and blankets purchased under the grant were redirected to Turkiye and Syria for earthquake relief in contravention of the provisions of the grant agreement and stated purposes.\n\nThe PAC was informed that the ADB grant was specifically meant for activities relating to provision of life preserving services for communities affected by monsoon flood 2022 disaster. Utilisation of grant for other purposes was unjustified and depri­ved the flood affectees 2022 in the country,“ the office of auditor general observed.\n\nPAC members were also informed that NDMA had failed to respond to ADB,\n\nwhich had repeated requested for a comprehensive report on utilisation of the grant. MNA Shazia Marri described it as breach of trust and Omar Ayub Khan called redirecting funds as embezzlement. The PAC requested a report within a month to clarify the matter.\n\nDuring the session, NDMA chairman Lt Gen Inam Haider Malik informed the committee that the country had launched a $30 billion appeal in 2022 to address flood-related damages. However, global commitments fell short of expectations.\n\nHe further stated that the installation of a flood early warning system had been completed, enabling predictions up to 10 months in advance. This system is expected to reduce future flood damages by 45 per cent.\n\nIn a separate review, the PAC scrutinised the National Highway Authority (NHA) over unresolved deficiencies in various projects and the lack of funds recovery. Commit­tee members criticised NHA chairman for negligence, highlighting that the agency had accumulated Rs3.1 trillion in debt.\n\nThey demanded explanations regarding actions taken against contractors for project delays, particularly on the Mianwali-Multan Road, which remains incomplete. The PAC meeting concluded with the formation of a subcommittee under the leadership of Shahida Akhtar Ali. Other members include Riaz Fatyana, Rana Qasim Noon, and Senator Bilal Mandokhail. The subcommittee will assess audit objections from 2010 to 2014 and report its findings accordingly.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:08:07.983Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897391/pac-questions-award-of-rs18bn-contract-to-nlc-by-ndma-sans-bidding",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:53:10.000Z"
}
