{
  "title": "Facing US tariffs, Indian PM Modi vows self-reliance - World - DAWN.COM",
  "author": null,
  "content": "Indian Prime Minister Narendra Modi said on Friday that his country is seeking self-reliance in energy independence and the development of its own powerful defence systems, vowing to defend his country’s interests “like a wall”.\n\nModi delivered his annual Independence Day address from the ramparts of New Delhi’s Red Fort at a time when India faces intense pressure and threats of additional tariffs from the United States.\n\n“Self-reliance is the foundation of developed India,” Modi said after a flypast of military helicopters scattered flower petals above an invited crowd of thousands. “Freedom becomes meaningless if someone becomes too dependent on others.”\n\nTies between New Delhi and Washington have been strained by Trump’s ultimatum that India end its purchases of Russian oil, a key source of revenue for Moscow as it wages its military offensive in Ukraine.\n\nIndia has said it “stands ready” to support efforts to end the Ukraine war and endorses a summit to be held between Trump and Russian President Vladimir Putin in Alaska later today.\n\nHowever, the US has announced that it will double new import tariffs on India from 25 per cent to 50pc by August 27 if New Delhi does not switch its crude suppliers.\n\n“We know that we remain dependent on many countries to meet our energy needs”, said Modi. “But to build a truly self-reliant India, we must achieve energy independence.”\n\nModi did not speak directly about Trump, but said he would “stand like a wall” against any policy that hurts the interests of farmers.\n\nAgriculture employs vast numbers of people in India and has been a key sticking point in trade negotiations.\n\n“When economic selfishness is rising day by day… we must not just sit and worry about the crisis but instead focus on our strengths,” Modi said.\n\nUS Secretary of State Marco Rubio, in a statement congratulating India’s Independence Day, said the relations between the two nations were “consequential and far-reaching”, and wanted to “ensure a brighter future for both”.\n\nModi also urged scientists and engineers to focus on building key sectors and technologies, including fighter jet engines, semiconductor chips and military hardware systems.\n\n“We will have India-made semiconductor chips in the market by the year’s end,” Modi said.\n\nHe added that the country was also working towards building a space station and would have a “defence shield” in the next decade, without giving further details.\n\nModi also honoured the Indian armed forces, which took part in a four-day conflict with arch-rival Pakistan that ended in a ceasefire on May 10.\n\n“India will give a befitting reply to any other misadventure by the enemy,” he added, and referred to New Delhi’s suspension of the Indus Waters Treaty (IWT).\n\n“India has decided that blood and water will not flow together”, he added.\n\nThe May conflict was sparked as New Delhi blamed Islamabad for the April 22 Pahalgam attack without evidence — a claim strongly refuted by Pakistan.\n\nIn response to the attack, India held the IWT in abeyance, violating the agreement itself.\n\nPakistan termed any attempt to suspend its water share an “act of war”, noting the IWT had no provision for unilateral suspension. It later said it was considering court action, citing a violation of the 1969 Vienna Convention on the Law of Treaties.\n\nOn May 6–7, New Delhi launched air strikes that killed civilians. In retaliation, PAF downed six Indian planes in air-to-air combat on May 7. India’s highest-ranking general has also acknowledged that its forces suffered losses in the air, but denied losing six aircraft.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/1516180794af731.jpg",
  "retrievedAt": "2025-10-12T01:54:35.320Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931059/facing-us-tariffs-indian-pm-modi-vows-self-reliance",
  "dateList": "2025-03-12",
  "date_published": "2025-08-15T11:32:20.000Z"
}
