{
  "title": "Elon Musk ordered to make DOGE records public - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: A US judge ordered the government-downsizing team created by President Donald Trump and spearheaded by billionaire Elon Musk to make public all records concerning its operations, which he said had been run in “unusual secrecy”.\n\nIn a lawsuit launched by Citizens for Responsibility and Ethics in Washington (CREW) on Feb 20, the court directed Department of Government Efficiency (DOGE) to release its internal documents.\n\nThe court order requires Trump’s government to file a status report on the production of documents by March 20, and to confer with the plaintiffs on a joint report, including a timeline, by March 27.\n\nSince his return to the White House in January, US President Donald Trump has launched a vast offensive aimed at cutting public spending and reducing the role of the federal government. To that end, he tapped Musk, a top campaign donor turned senior adviser, to lead DOGE, which has cut thousands of government jobs and upended agencies — prompting numerous lawsuits.\n\nJudge asks Trump govt to file status report on documents release by 20th\n\nThe judge said the authority exercised by DOGE “across the federal government and the dramatic cuts it has apparently made with no congressional input appear to be unprecedented.”\n\nIn his court opinion, he added that the “rapid pace” of DOGE’s actions “requires the quick release of information about its structure and activities.” The judge said this was “especially so given the secrecy with which (DOGE) has operated.”\n\nThe judge argued that the entity is covered by the Freedom of Information Act (FOIA) and said “the public would be irreparably harmed by an indefinite delay in unearthing the records.”\n\nLast week, President Trump responded to growing criticism over unprecedented cuts to the US government overseen by DOGE, saying they should be carefully targeted.\n\nThe ruling, the first of its kind, marked an early victory for advocates seeking to force DOGE to become more transparent about its role in the mass firings being conducted in the federal workforce and the dismantling of government agencies by the Republican president’s administration.\n\nThe Trump administration argued DOGE as an arm of the executive office of the president was not subject to FOIA, a law that allows the public to seek access to records produced by government agencies.\n\nBut Cooper, an appointee of Democratic President Barack Obama, said DOGE was exercising “substantial independent authority” much greater than the other components of that office that are usually exempt from FOIA.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:07:42.863Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897365/elon-musk-ordered-to-make-doge-records-public",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:53:30.000Z"
}
