{
  "title": "Planning minister irked by officials’ lethargy on CPEC projects - Business - DAWN.COM",
  "author": null,
  "content": "• Ahsan asks diplomats, EAD to liaise with Chinese for technical, financial assessment of Main Line-1 rail link\n\nISLAMABAD: Plann­ing Minister Ahsan Iqbal has expressed annoyance over the slow progress on mega projects that are part of the China-Pakistan Economic Corridor (CPEC).\n\nOn Tuesday, Mr Iqbal chaired a meeting to prepare for the Joint Cooperation Council (JCC) meeting — the top decision-making body of CPEC — in July.\n\nThe planning minister expressed concern over poor progress on three crucial projects — grid connectivity to Gwadar, water desalination plan and socio-economic development initiatives — which are considered central to the port city.\n\nThe minister also noted that officials have done little to move forward on the critical Karachi-Peshawar Railway Mainline (ML-1) project worth $10bn.\n\nThe minister directed the diplomatic mission in Beijing and the Economic Affairs Division to engage with Chinese authorities to finalise a date for the visit of technical and financial experts to assess the project.\n\nHe stressed the need for early coordination to facilitate the visit, an official statement said while quoting the minister, who is also Pakistan’s focal person on CPEC.\n\nThe planning minister had also issued similar instructions in October and December 2024 as progress on ML-1 remained stalled since PML-N’s previous government from 2013 to 18.\n\nIn the first week of October 2024, the planning minister also pushed for the finalisation of the financing agreement before the visit of the Chinese prime minister in the mid of that month.\n\nOn October 2, while presiding over a meeting on CPEC, Mr Iqbal had urged the ministries of railways and finance to conclude financing terms with China within the next few days, according to a statement released after the meeting.\n\nIn the following meeting on December 6, the planning minister requested China to expedite the visit of its technical and finance teams to Pakistan to finalise the agreement and implementation of the first phase of the ML-1 project and build two model special economic zones in Karachi and Islamabad.\n\nMr Iqbal told the meeting that he had asked the Chinese ambassador to simultaneously dispatch teams of technical and financial experts to expedite consultations.\n\nHe recalled that the Chinese premier, in his October visit to Pakistan, had agreed to send a technical team of railway experts.\n\nA team of financial experts, along with the technical team, would be helpful in finalising financing arrangements for $1.1bn for the first phase of ML-1 between Karachi and Hyderabad.\n\nIt was also agreed that a team of financial experts would accompany the technical team to ensure an efficient resolution of all matters related to the project,“ said an official statement after the December 6 meeting.\n\nIt added that representatives of the economic affairs division and ministries of railways and finance were directed to complete their homework so that both technical and financial aspects could be finalised simultaneously.\n\nThe ambassador had reportedly assured the minister that the technical team would soon visit Pakistan.\n\nThe minister expressed dissatisfaction over the delay in connecting Gwadar to the national grid for electricity supply.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:07:54.792Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897376/planning-minister-irked-by-officials-lethargy-on-cpec-projects",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:53:18.000Z"
}
