{
  "title": "Tax receipts from sugar sector up 54pc - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: In a significant development, the Federal Board of Revenue (FBR) has recorded a 54 per cent increase in sales tax collection from the sugar sector over the past two months, owing to the recovery of arrears and ongoing reforms in the industry.\n\nBut this progress contrasts sharply with the government’s apparent inability to curb retail prices of sugar, leaving consumers to bear the brunt of rising costs.\n\nSugar, which sells for about Rs170 per kg on the market, is one of the major factors in the FBR’s increased sales tax revenue.\n\nAnalysts attribute this trend to ongoing sugar exports, which have squeezed domestic supply and fuelled a price hike.\n\nFinance Minister Muhammad Aurangzeb, in a televised address, attributed the recent surge in tax collection to measures enforced as part of sugar sector reforms. He refrained, however, from addressing the question of rising retail sugar prices.\n\nThe minister also took credit for allowing sugar exports to Afghanistan, claiming that this decision helped curb smuggling to the neighbouring country.\n\nHe claimed sugar had not been smuggled this year and, instead, was exported to Afghanistan. “This is a very beneficial result. We need every single dollar coming in to balance our current account. This is also a very positive outcome,” he said.\n\nAccording to the Pakistan Bureau of Statistics (PBS) data, sugar exports in the first seven months of FY25 soared to 757,597 tonnes, a staggering 2188 per cent increase over 33,101 tonnes during the same period last year. Afghanistan emerged as the primary export destination.\n\n“We collected Rs24 billion sales tax from the sugar sector for December and January, as against Rs15bn last year, with same sales,” a senior tax official said.\n\nThis amount also includes Rs2bn arrears recovery from the sector as well.\n\nThe actual growth in sales tax collection from the sector is 46pc, if arrears are not taken into account.\n\nSince the 2024-25 sugarcane crushing season, the FBR has developed a new, improved production monitoring system for sugar mills. The system features five monitoring tools, including track-and-trace stamps, automatic counters, and video recording.\n\nAccording to the finance minister, the FBR has sealed 10 sugar factories for violation of the law since the introduction of the new system, resulting in a collection of Rs125 million as penalty.\n\nMuhammad Aurang­zeb said this system had helped ensure the sale of the commodity to genuine distributors rather than hoarders.\n\nHe highlighted that alongside technological advancements, FBR officials had been stationed at sugar mills nationwide to curb malpractice.\n\nHe added that enforcement efforts were further bolstered with assistance from the Federal Investigation Agency, the Intelligence Bureau and other law enforcement agencies.\n\nThe minister revealed that the country would have 5.7 million tonnes of sugar, supplemented by a carryover stock from the previous season, during the current season. He expressed hopes that this supply, coupled with improved management, would meet the nation’s demand.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:54:38.401Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897385/tax-receipts-from-sugar-sector-up-54pc",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:53:18.000Z"
}
