{
  "title": "Pakistan, US reaffirm trade and security ties - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The United States and Pakistan on Tuesday reaffirmed their commitment to expanding economic and trade relations while deepening cooperation in counterterrorism and security, the Foreign Office (FO) said.\n\nThe renewed resolve followed a meeting between Deputy Prime Minister and Foreign Minister Ishaq Dar and US Chargé d’Affaires Natalie Baker in Islamabad.\n\n“The two sides, inter alia (among other things), agreed to upscale and strengthen economic and trade relations as well as cooperation in counterterrorism and security domains,” the Foreign Office said.\n\nThe meeting took place at a critical time, just days before the anticipated implementation of a new US travel ban, expected this week.\n\nFO says diplomat deported from Los Angeles was on private trip\n\nThe ban follows President Donald Trump’s Executive Order 14161, titled ‘Protec­ting the United States from Foreign Terrorists and Other National Security and Public Safety Threats’. Signed on Jan 20, 2025, the order was one of Mr Trump’s first actions upon returning to office.\n\nUnder the directive, key US officials, including the Secretaries of State and Homeland Security, the Attorney General and the Director of National Intelligence, were given 60 days (until March 21, 2025) to submit a report identifying countries with inadequate vetting and screening processes. The findings could lead to partial or full travel suspensions for nationals of those countries.\n\nThe order, aimed at strengthening national security and public safety, has drawn criticism for its similarities to Mr Trump’s earlier “Muslim ban”, with concerns that it may disproportionately affect certain regions.\n\nPakistan is believed to be among the countries at risk of inclusion in the travel ban, largely due to security and vetting concerns linked to militancy issues. Government officials and diplomats have expressed hope that the Trump administration will share further details before finalising the restrictions.\n\nThe Foreign Office statement did not say whether the US diplomat had given any clarity about the expected ban or Mr Dar had conveyed the government’s concerns on the issue.\n\nDespite frostiness in ties, a notable progress in US-Pak­istan relations came last week with the capture and extradition of Islamic State-Khorasan operative and Afghan national Sharifullah to the United States. The handover was met with words of appreciation from Washington, and with a telephone conversation between Mr Dar and US National Security Adviser Mike Waltz.\n\nEntry refusal\n\nIn a separate statement, the Foreign Office confirmed the embarrassing incident of Pakistan’s Ambassador to Turkmenistan K.K. Ahsan Wagan being refused entry into the United States and deported from Los Angeles.\n\n“The officer had been travelling for a private visit. The matter is being investigated by the Foreign Ministry,” a statement attributed to spokesman Shafqat Ali Khan said.\n\nAlthough no explanation has been given by either side about the circumstances leading to Mr Wagan’s deportation, some officials at the Foreign Office speculated that it could be linked to his previous tenure in Los Angeles, where he had served as deputy consul general.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/121124413624eeb.jpg",
  "retrievedAt": "2025-08-25T15:08:08.628Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897297/pakistan-us-reaffirm-trade-and-security-ties",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:53:03.000Z"
}
