{
  "title": "Baby elephant rescued after it became separated from mother in Indonesia - World - DAWN.COM",
  "author": null,
  "content": "JAKARTA: Indonesian authorities rescued a critically endangered baby Sumatran elephant after it became separated from its mother at a palm oil plantation, a local official said on Tuesday.\n\nSumatran elephants are on the brink of extinction with only about 2,400-2,800 left in the world, according to the World Wide Fund for Nature. The two-month-old male calf was found at an oil palm plantation in Riau province on the western island of Sumatra on Monday after residents alerted authorities, local conservation agency official Ujang Holisudin said.\n\n“We suspect this elephant was left behind by his group or his mother,” Ujang said, adding that the calf was alone when authorities found him.\n\nThe baby elephant is in good health after medical checks and was brought to the conservation agency’s elephant training centre near the provincial capital Pekanbaru, he said.\n\nAuthorities were monitoring for elephant herds near the area to see if the calf could be reunited with its family. “It is our hope that the group can be found and we can reunite (the calf). That is our hope,” Ujang said.\n\nElephant populations are threatened by rampant poaching for their tusks, which are prized in the illegal wildlife trade. The Southeast Asian nation is battling wildlife crime and several cases of elephant poisoning have been reported in recent years.\n\nDeforestation has also reduced their natural habitat and brought them into increasing conflict with humans.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d0e3ae1e66e.gif",
  "retrievedAt": "2025-08-25T15:07:53.825Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897375/baby-elephant-rescued-after-it-became-separated-from-mother-in-indonesia",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:53:30.000Z"
}
