{
  "title": "Nasa fires chief scientist, more Trump cuts to come - World - DAWN.COM",
  "author": null,
  "content": "Nasa announced on Tuesday the dismissal of its chief scientist and others to comply with orders from President Donald Trump, marking the latest in a series of administration actions undermining climate change research.\n\nWhile the move affects only 23 people, a spokeswoman indicated more cuts are coming.\n\nThe first round notably eliminates the Office of the Chief Scientist, led by Katherine Calvin, a renowned climatologist who contributed to key UN climate reports. She and other US delegates were also barred from attending a major climate science meeting in China last month.\n\n“To optimise our workforce, and in compliance with an Executive Order, Nasa is beginning its phased approach to a reduction in force, known as a RIF,” agency spokeswoman Cheryl Warner said.\n\n“A small number of individuals received notification March 10 they are a part of Nasa’s RIF. If they’re eligible, those employees may opt to participate in the Voluntary Early Retirement Authority, or VERA, or complete the RIF process.”\n\nAlso eliminated are the Office of Technology, Policy, and Strategy and the Diversity, Equity, Inclusion, and Accessibility Branch of the Office of Diversity, Equity, and Inclusion.\n\nNasa has so far avoided the deep cuts affecting other agencies, reportedly due to last minute intervention by Jared Isaacman, Trump’s nominee for Nasa chief. Isaacman, an e-payments billionaire and SpaceX customer, is seen as close to Elon Musk — Trump’s key advisor and architect of federal cost-cutting efforts.\n\nIn February, Nasa had been preparing to lay off around a thousand probationary employees. However, Isaacman reportedly asked for the cuts to be put on hold, according to Ars Technica. Nasa has not explained the reversal.\n\nThe new layoffs, first reported by Nasa Watch citing an internal memo, could signal a shift away from research and toward exploration.\n\nTrump and Musk both support a human mission to Mars. In his State of the Union address last week, Trump declared the US would “plant the American flag on the planet Mars and even far beyond.”\n\nNasa plays a crucial role in climate research, operating a fleet of Earth-monitoring satellites, conducting airborne and ground-based studies, developing sophisticated climate models, and providing open-source data to researchers and the public.\n\nTrump, who has called climate change a “scam” and expressed disdain for the UN and climate science, has already pulled the US out of the Paris Agreement for a second time.\n\nMeanwhile, his administration has dismissed hundreds of employees at the National Oceanic and Atmospheric Administration (NOAA), the nation’s other key climate agency, with more cuts expected.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/12120011c0c3bd4.jpg",
  "retrievedAt": "2025-08-25T15:07:40.225Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897430/nasa-fires-chief-scientist-more-trump-cuts-to-come",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T07:20:02.000Z"
}
