{
  "title": "Hopes revived for Torkham reopening - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: The Torkham border crossing, which has been closed since Feb 21, is expected to reopen soon as Pakistani security officials held a meeting with tribal elders on Tuesday after the Afghan side gave some “positive signals”.\n\nSources told Dawn that the jirga met in the late evening “to take stock of the situation”.\n\nThe development came following meetings of the Afghan jirga with authorities in Kabul and Jalalabad.\n\nSources privy to the negotiations told Dawn they were in constant touch with the Afghan jirga, comprising tribal elders and traders.\n\nThey “expressed optimism that the issue would be resolved anytime during the current week”.\n\nPakistani jirga members meet security officials to assess situation\n\nThe cross-border movement of people via the Torkham border crossing was abruptly suspended on Feb 21 after Pakistani and Afghan security forces developed differences over construction activities on both sides of the border.\n\nThe situation worsened this month when eight people, including six tro­ops, were injured after Pakistan and Afghan Tali­ban forces traded fire at the border.\n\nA number of houses, a mosque and some offices of clearing agents were hit by artillery shells, and cross-border firing continued for three days.\n\nSince then, tribal elders on both sides of the border have been engaged in talks to end the stalemate.\n\nAccording to sources, both sides were in contact to fix a date and time for their next meeting, which they believed would be decisive.\n\nPakistani and Afghan delegates met on Sunday for the first time after the border was closed on February 21.\n\nThe Pakistani jirga members told their Afghan counterparts that the border would only be reopened if they “fully abide by the previously agreed protocols and agreements about apprising each other about any change in the existing structure of the border on either side”.\n\n“Pakistan would not tolerate any construction or renovation activity across the border”, as it was already decided and agreed between the two countries in the past that no additional structure would be raised close to the border zero point, the Afghan side was told.\n\nSources told Dawn that the response and attitude of the Afghan side during the meeting and later telephone conversations was “positive”.\n\nThey had since refrained the Afghan border forces from renovating or reconstructing the controversial check post, which the Afghan side referred to as Zangali Posta, close the zero point.\n\nCustoms officials at Torkhum have said that the border closure was causing a loss of around $1.5m daily as exports to Afghanistan have stopped. Additionally, a revenue of Rs545m has been lost due to the suspension of imports from Afghanistan.\n\nMeanwhile, sources at the Dosti Hospital in Torkhum said they would receive 70 to 80 patients daily from Afghanistan who arrive in Pakistan on valid visas for medical checkups.Sources have said that bilateral trade and cross-border pedestrian movement are expected to resume soon.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:55:16.120Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897302/hopes-revived-for-torkham-reopening",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:52:57.000Z"
}
