{
  "title": "Jaffar Express operation complete, 33 terrorists killed: DG ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Inter-Services Public Relations (ISPR) Director General Lt Gen Ahmed Sharif Chaudhry said on Wednesday that the Jaffar Express clearance operation, launched a day earlier after the train’s unprecedented hijacking in Balochistan, was complete. He added that all terrorists, 33 in total, at the site of the attack had been killed.\n\n“On March 11 in Bolan, terrorists targeted a railroad track around 1pm and blew it up and stopped the Jaffar Express. According to railway officials, the train had 440 passengers,” he said while speaking in an interview on Dunya News show ‘On the Front’.\n\nThe banned Baloch Liberation Army (BLA) claimed responsibility for the attack, but this was not mentioned by Lt Gen Chaudhry.\n\nHe said the area where the incident took place was difficult to approach as it was far away from civilisation and road networks.\n\n“The terrorists used hostages, including women and children, as human shields. The recovery operation was immediately started,” he added.\n\nChaudhry said the army, air force, Frontier Corps (FC) and the Special Services Group had taken part and recovered the hostages.\n\n“These terrorists were in contact with their supporters and masterminds in Afghanistan during the operation via satellite phone. You saw that around 100 passengers were safely rescued yesterday evening from the terrorists, and today as well, a large number of passengers have been recovered,” he said, adding that the process continued intermittently.\n\nIn a statement released shortly after Chaudhry’s talk, the ISPR doubled down on the use of Afghanistan in the attack, saying: “Intelligence reports have unequivocally confirmed that the attack was orchestrated and directed by terrorist ring leaders operating from Afghanistan, who were in direct communication with the terrorists throughout the incident. Pakistan expects the Interim Afghan Government to uphold its responsibilities and deny use of its soil for terrorist activities against Pakistan.”\n\nKey developments\n\nElaborating on the details of the “final clearance operation” today, he said: “All hostage passengers were recovered. This operation was conducted with great skill and care since terrorists were using them as human shields.”\n\nQuestioned whether he was confirming the operation’s end with all terrorists killed, the DG ISPR said: “Yes, all present terrorists there have been sent to hell and their total number was 33.”\n\nHe added that no passenger was hurt in the final clearance operation, but before that, “the number of passengers who fell victim to the barbarism of the terrorists is 21.”\n\nLt Gen Chaudhry further said that three FC personnel stationed on the railway picket were martyred, while one FC soldier was martyred during yesterday’s operation. The ISPR later said in a statement that their “selfless actions saved countless lives and prevented further catastrophe”.\n\nThe chief of the military’s media wing added that the bomb disposal squad was conducting further clearance and inspecting the train and the surrounding area as per standard operating procedures. The ISPR statement said a sanitisation operation was also being conducted in the area and “abettors of this cowardly and heinous act will be brought to justice”.\n\nThe DG ISPR said the passengers held hostage, who had fled to the surrounding area during the operation, were also being gathered.\n\n“No one can be permitted to make innocent people of Pakistan the victim of their barbarism in the streets, trains, buses or markets because of their misleading ideas and instructions and facilitation of foreign masters.\n\n“Whoever does this, let me say it very clearly, will be hunted down and brought to justice. Let me also say that this incident of Jaffar Express changes the rules of the game.”\n\nHe said the terrorists had nothing to do with Islam, Pakistan and Balochistan.\n\nPresenting a monochromatic drone footage of the incident, he pointed to three black blots or blobs on the screen and said they were the groups of passengers the terrorists had gathered.\n\n“Suicide bombers were sitting amid the passengers’ groups, as well as next to them,” he said, adding that it was the reason for the “slow and careful” progress of the military.\n\nHe said the operation commanders had first taken out these suicide bombers in today’s exercise, following which the passengers fled to nearby areas.\n\nAfter this, Lt Gen Chaudhry said the operation party entered the train and proceeded to take out the suicide bombers aboard and began clearing it out bogey by bogey.\n\nThe DG ISPR criticised the flow of misinformation online and on social media amid the incident, particularly from India, saying that this openly displayed the “nexus between the terrorists and their masters to the whole world.”\n\n“Interestingly, some specific political elements in Pakistan also partake in such activities enthusiastically and activate their social media [teams], and instead of standing with the state, they can be seen creating baseless justifications and reasons for this horrible terrorist act,” he said.\n\n“Sadly, some elements are sacrificing the national interest due to their lust for political power,” he said.\n\nHowever, Chaudhry asserted that the discerning nation was not only observing and understanding the unfolding events but also recognising the forces driving “this anarchic politics”.\n\nQuestioned about criticism of security agencies for misfocused priorities, the DG ISPR said law enforcement and intelligence agencies were carrying out over 160 operations daily against terrorism.\n\nPresident Asif Ali Zardari, in a statement, paid tribute to the security forces for completing the operation on the Jaffar Express and expressed deep sorrow and regret over the martyrdom of 21 passengers and four FC personnel.\n\n“The president praises the bravery of the security forces for killing 33 terrorists in an effective operation and appreciates the professionalism of the security forces for rescuing civilians and passengers,” the statement read.\n\nPresident Zardari conveyed his prayers for the martyrs and expressed his determination to establish peace in Balochistan and eradicate terrorism from the country.\n\nInterior Minister Mohsin Naqvi also paid tribute to security forces for successfully rescuing all of the hostages on the Jaffar Express, according to a statement posted by the interior ministry on X.\n\n“[The] interior minister lauds security forces’ professionalism in eliminating all 33 terrorists,” the statement read. “Security forces took extreme precautions to save the lives of women and children.”\n\nNaqvi expressed deep sorrow over the martyrdom of 21 passengers and four FC personnel.\n\n“All our sympathies are with the families of the martyrs and the injured. This incident of terrorism is extremely heartbreaking,” the post said. “Using innocent children and women as human shields is an extremely inhumane act.”\n\nThe statement quoted Naqvi as saying, “Terrorists are a burden on this land, and with the support of the nation, it is time to eradicate this scourge once and for all.\n\n“Along with terrorists, facilitators will also be dealt with an iron fist,” he said.\n\nEarlier today, state media — citing security officials — had said that at least 190 passengers had been freed after terrorists hijacked the Jaffar Express.\n\nThe hostage situation began on Tuesday near the Mashkaf Tunnel, about 157 kilometres from Quetta, when terrorists attacked the Jaffar Express and took more than 400 passengers hostage, including numerous security personnel.\n\nAccording to Radio Pakistan, of the rescued passengers, 37 were injured and had been sent for medical treatment.\n\nThere was no confirmation of the total number of casualties, but officials said that at least 30 people — including the driver of the locomotive and eight security personnel — had lost their lives as the forces engaged in a gun battle.\n\nIt was not immediately clear whether these people had been freed as the result of kinetic military action or were among those allegedly freed by the armed assailants.\n\nThe hijacking was a first-of-its-kind event, as terrorists had never attempted to attack or take an entire train and its occupants hostage earlier.\n\nPrime Minister Shehbaz Sharif said in a post on X that he had spoken to the Balochistan chief minister and been briefed on the operation.\n\n“The entire nation is deeply shocked by this dastardly act and saddened by the loss of innocent lives — such cowardly acts will not shake Pakistan’s resolve for peace,” the PM wrote.\n\n“I offer my heartfelt condolences to the families of the martyrs … and [may God] and bless those injured with a swift recovery. Dozens of the terrorists have been sent to hell,” he added in his post.\n\nSpeaking to Geo News, Minister of State for Interior Talal Chaudhry had earlier claimed that about 70 to 80 terrorists were involved in the incident.\n\n“The handlers of these terrorists are in a neighbouring country; those giving them dollars are in another country. Our enemy India will definitely support this,” he said.\n\n“But what is unfortunate is that even in Pakistan, there were social media statements and tweets that made it seem like they were supporting terrorism and discouraging the security forces.\n\n“The government will handle these social media statements the way it is handling the terrorists,” he warned.\n\nChaudhry acknowledged the need for strict action. “We have previously tried to take local stakeholders into confidence, and we will try again.\n\n“But you cannot say, ‘the government does not communicate with us, they don’t take us into confidence.’”\n\nResponding to a question, he said: “I agree with you, that this insurgency, this terrorism, it cannot be wiped out until the political forces behind the security forces stand together with one voice.”\n\nHe claimed that between 2013 and 2018 — when the PML-N was in power — “terrorism had been eliminated” because political forces took note and stood behind their security forces. He also said that the successive government had policies that allowed many people from neighbouring countries to come to Pakistan.\n\n“This BLA and TTP (Tehreek-i-Taliban Pakistan) … they are a result of collaboration between people who don’t want to see Pakistan stable. The Pakistan Stock Exchange goes up, the rupee becomes stable, and terrorism increases. Why? To destabilise [the country],” he said.\n\n“Keeping civilians safe and eliminating terrorists is what’s taking time with the operation,” Chaudhry reiterated. “I cannot give a timeframe, but it is hoped that this operation is completed quickly, and after that, more details can be shared.”\n\nHe also requested that “fake news and videos” not be spread on social media.\n\n“Tell me, in a mountainous area with no signals, where nothing else is present, information cannot come from there. All this was pre-planned. We should not pay heed to these statements and videos discouraging our security forces.”\n\nIn an address to the Balochistan Assembly, Chief Minister Sarfraz Bugti talked about the train attack and separatism in the province, lamenting that there was nobody to advocate for the victims.\n\n“Why don’t they (separatists and their advocates) talk about the realities?” Bugti asked. “Parliament has given them rights. The problem is that there’s nobody to talk about victims of violence and terrorism.\n\n“If the BLA is running a jirga, will we take part?” he asked the provincial assembly. “They want to impose their ideology with a gun and violence. Should we allow them to take people off buses and kill them?\n\nThe CM further emphasised that the train was carrying soldiers headed home while on leave; thus, they were unarmed. “There are rules in war, and there are laws,” Bugti added. “What will history say, that innocent teachers, barbers and doctors were murdered?”\n\nBugti continued: “Whoever commits acts of violence against the state, whoever tries to partake in it, whoever takes up arms, the state will punish them unequivocally.”\n\n“By attacking soft targets, they have created this environment,” he said. “If they want to fight, we have cantonments and other hard targets. But they attack passengers on buses and target them on ethnic grounds.”\n\nReferring to dialogue, the chief minister said that nobody was heading efforts to establish talks with separatist groups because “they are not ready” to sit at the table.\n\n“There are two kinds of people: murderers with guns and those who advocate for them and glorify them on TV and social media,” Bugti stressed. “No country allows this except for ours. They talk about breaking apart our state and call it solidarity.”\n\nBugti earlier chaired a meeting on law and order and was briefed on the Jaffar Express attack by the additional home chief secretary.\n\n“The attack is intolerable, and strict action should be taken,” CM Bugti said.\n\n“Terrorists can’t occupy even an inch. The terrorist attack aims to create an impression of a violent environment,” he told the participants of the meeting.\n\n“The dream of anti-national elements to cut Pakistan like a cake can never be realised. We must rid ourselves of any confusion and fight the war against terrorism,” he said.\n\nCM Bugti said that the enemies of Balochistan would not be allowed to succeed at any cost. He directed that all resources be provided to security institutions to protect the people.\n\n“There will be strong action against the facilitators of terrorists,” he said. “There will be no compromise on the law and order situation in Balochistan, and tough decisions must be made.”\n\nHe directed the law enforcement agencies to bring the perpetrators of the hijacking to justice soon.\n\nBalochistan Chief Secretary Shakeel Qadir Khan, Inspector General of Police (IG) Moazzam Jah Ansari, and Railways IG Rai Tahir, among other officials, attended the meeting.\n\nAlthough hampered by the remoteness of the area, security forces said they had launched a massive operation in the Dhadar area of Bolan Pass to rescue the hostages.\n\nFollowing the attack, Pakistan Railways temporarily suspended its entire operations from Punjab and Sindh to Balochistan and vice versa.\n\nAmid the ongoing operation, Pakistan Railways announced setting up a “Help Desk” at Rawalpindi Railway Station for families to seek information about their loved ones onboard the train.\n\nThe help desk, which the Pakistan Railways said was in constant contact with the control rooms in Quetta and Peshawar, can be contacted on 051-9270831, 051-9270834 and 051-9270835.\n\nAn “Emergency Cell” was also set up at Quetta Railway Station for information on the passengers and can be reached at 081-9201210, 081-9201211, and 117.\n\nThe train operation to Quetta has been temporarily suspended and will be restored after security clearance, Pakistan Railways reiterated.\n\nQuetta Railways Hospital’s Dr Hasan Naqil told reporters at the city’s railway station earlier today that 57 passengers had been shifted to the provincial capital after being rescued.\n\nHe added that 23 of them were residents of Balochistan’s Mach and Sibi districts and that a relief train was to depart for Mach after getting security clearance.\n\n“We do not have any information about the dead and the injured,” the doctor told reporters. He highlighted that the route where the train was stopped was a harsh terrain and “accessing it was difficult”.\n\nImran Hayat, the Railways Divisional Superintendent (DS) in Quetta, said 10 people — including the driver of the locomotive and eight security personnel — had lost their lives.\n\n“God saved us,” one elderly rescued man told media earlier today at the Quetta railway station, where passengers were brought from Mach after being recovered.\n\n“God will help, but [right now] the situation is not good,” the distraught man added.\n\nRecounting the attack, he said a “[rocket] launcher” hit the train’s engine, after which gunfire began. “There were launchers and such [huge] explosions,” the man said, tilting his face upwards to describe the scale of the attack.\n\nAn elderly woman accompanying him echoed the same sentiments, saying: “God has saved us […] May God destroy them (terrorists).”\n\n“We were anxious, we started sweating […] I told my husband ‘let’s leave quickly’,” the woman added.\n\nShe recalled that the couple walked to a nearby railway station, from where a cargo train took them to Mach. “It was very unlikely that we would have been saved,” the elderly woman added.\n\nMohammad Ashraf, another rescued passenger who was going from Quetta to Lahore, when asked if he saw any people dying during the attack, said he saw “at least six or seven” travellers losing their lives.\n\n“[…] no one was looking anywhere or speaking to each other. Everyone was quiet because of fear,” the elderly man told reporters.\n\n“There was gunfire [but] God protected us,” said another rescued man, according to a video making rounds on social media. He thanked the soldiers and Frontier Constabulary personnel for bringing them back to a railway station.\n\nThe developments prompted worldwide condemnations and calls for the release of the travellers taken hostage by the terrorists.\n\nSeveral countries, including China, the US, and Iran, condemned the attack.\n\n“We strongly condemn the attack on the Jaffar Express train, and the hostage-taking of passengers in Kacchi, Balochistan, claimed by the Baloch Liberation Army, a US-Specially Designated Global Terrorist group,” the US Embassy in Islamabad posted on X.\n\n“We extend our deepest sympathies and condolences to the victims, their families, and all those affected by this horrific act. The Pakistani people deserve to live free from violence and fear. The United States will remain a steadfast partner of Pakistan in its efforts to ensure the safety and security of all its citizens. We stand in solidarity with Pakistan during this difficult time.”\n\nChina also denounced the attack and vowed to continue its firm support to Pakistan in combating terrorism, maintaining solidarity and social stability and protecting the safety of civilians.\n\n“We noted the reports and strongly condemn this terrorist attack,” Chinese Foreign Ministry Spokesperson Mao Ning said during her regular briefing in response to a question regarding a terrorist attack on the train.\n\nShe said that China firmly opposes terrorism in any form and added, “We will continue to firmly support Pakistan in combating terrorism, maintaining solidarity and social stability and protecting the safety of civilians.”\n\nChina stands ready to strengthen counter terrorism and security cooperation with Pakistan and jointly keep the region peaceful, secure and stable, she added.\n\nGerman Ambassador to Pakistan Alfred Grannas also strongly condemned the incident and extended his solidarity.\n\n“The use of violence for political purposes by anyone is unacceptable, even more so when innocent civilians are targeted,” Grannas said in a post on X today.\n\nThe United Nations also condemned the incident and demanded the release of the hostages.\n\n“We’ve just seen the reports. We, of course, condemn any hostage taking, and we call on those who’ve taken people hostage to release them at once,” Stéphane Dujarric, spokesperson for UN Secretary-General Antonio Guterres, told a press briefing yesterday.\n\n“We’re going to keep following the situation as it evolves,” Dujarric added.\n\nIranian Foreign Ministry Spokesperson Ismail Baghaei also condemned the “terrorist act” and expressed deep concern over the endangerment of innocent civilians.\n\nIn a statement, Baghaei recalled Iran’s “principled stance […] in condemning all forms and manifestations of terrorism and violent extremism”.\n\nHe added that Iran was ready to “provide any assistance necessary to bring an end to this terrorist incident”.\n\nThe Iranian embassy in Islamabad also denounced the assault, stating that the “violent measures against civilians and disturbing vital transportation system is a cowardly crime against humanity”.\n\nThe Human Rights Commission of Pakistan (HRCP) expressed “grave concern” on the attack in a statement today and demanded that all hostages be released immediately.\n\nIt said the terrorists “hijacked the train after blowing up the rail track and several hundred passengers taken hostage”.\n\n“We strongly urge all relevant stakeholders to forge an urgent rights-based, pro-people consensus on the issues faced by citizens in Balochistan and to find a peaceful, political solution,” the HRCP added.\n\nIt asserted that the commission condemned “violence against unarmed civilians and noncombatants by the state as well as non-state actors”.\n\nIn a statement carried by PTV News today, Interior Minister Mohsin Naqvi said he was in constant contact with Balochistan Chief Minister Sarfraz Bugti regarding the attack and reaffirmed “every kind of support” from the government to the province.\n\nNaqvi and CM Bugti reiterated their pledge to bring the assailants to an “exemplary end”, PTV News reported.\n\nThe incident was widely condemned by leaders, including President Asif Ali Zardari, Prime Minister Shehbaz Sharif, and the chief ministers, among others.\n\nPresident Zardari earlier said the “Baloch nation rejects those who attack and take hostages innocent passengers”, while PM Shehbaz asserted that the “beast terrorists” did not deserve any concession.\n\nRailway officials said the train left Quetta for Peshawar around 9am, with 450 passengers in nine bogies. Around 1pm, they received information that the train had come under attack between the Paneer and Peshi railway stations, near Railway Tunnel No 8, located near Mashkaf.\n\nThe Mashkaf Tunnel is located around 157km from Quetta and approximately 21km from Sibi.\n\nAlthough the Quetta-Jacobabad N65 highway and the railway line run mostly side-by-side through the Bolan region, they diverge near the town of Mashkaf.\n\nFrom here, the railway line takes a more direct path, cutting through the mountains and running along the Bolan River, rejoining the main road near Mach.\n\nThe Mashkaf Tunnel is located in a very isolated part of the area, with the nearest station located at Pehro Kunri. The next stop on the line towards Quetta is the stop at Paneer, just short of the Paneer Tunnel.\n\n“Armed men fired rockets at the locomotive and opened fire, which caused the train to stop. The driver of the locomotive was seriously injured,” officials had said, adding that a heavy exchange of fire took place between security personnel and the attackers.\n\nIn 2024, the banned BLA emerged as a key perpetrator of terrorist violence in Pakistan, according to a report by Islamabad-based think tank Pak Institute for Peace Studies (PIPS).\n\nIn August last year, dozens of militants affiliated with BLA launched numerous attacks across the province, in which at least 50 people, including 14 security men, lost their lives. In response, security forces had neutralised 21 militants.\n\nEarlier that month, then-Panjgur deputy commissioner Zakir Baloch was shot dead on the Quetta-Karachi National Highway, with CM Bugti stating BLA as the group behind it.\n\nIn October 2024, a suicide bombing near Karachi airport killed two Chinese nationals and a Pakistani citizen, for which two BLA suspects were sent to jail on judicial remand while a probe body was formed as well.\n\nThe group also claimed responsibility for the Quetta railway suicide bombing in November last year, in which at least 26 people, including 16 security personnel, lost their lives and 61 others were injured.\n\nPakistan designated the BLA as a terrorist organisation in April 2006 after the group repeatedly attacked security personnel.\n\nIn January this year, a former BLA member said during a press conference that the banned group “brainwashed average citizens into thinking a certain way about Balochistan and resorting to terrorist activities.”\n\nLast month, the BLA claimed responsibility for an attack in Balochistan’s Barkhan, where seven Punjab-bound passengers were offloaded from a bus and shot dead.\n\nIn earlier grand-scale hijackings in the country, one that particularly comes to mind is that in 1994 when three armed militants from Afghanistan took control of a school bus near Peshawar and took around 70 children hostage. The bus was driven to the Embassy of Afghanistan in Islamabad, where units of elite commandoes gunned them down the next day.\n\nHeader Image: A soldier stands guard at a railway station in the Sibi district of Balochistan on March 12, during a security operation against terrorists a day after they hijacked a passenger train. — AFP\n\nAdditional input from Amin Ahmed and Nadir Guramani.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/12203355c635d64.jpg",
  "retrievedAt": "2025-08-25T15:07:38.942Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897419/jaffar-express-operation-complete-33-terrorists-killed-dg-ispr",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T05:36:14.000Z"
}
