{
  "title": "Govt hikes tariff for captive plants on IMF prodding - Pakistan - DAWN.COM",
  "author": null,
  "content": "• ‘Grid levy’ to witness multiple hikes till Aug 2026 amid bid to discourage use of natural gas\n• Insiders say Fund unhappy with Discos’ privatisation timeline; agri tax also on its agenda\n\nISLAMABAD: In a major retreat, the government had to immediately notify an increase in gas rates for industrial captive power plants (CPPs) by about 23pc and scale down temptation for a substantial cut in power rates to get the policy negotiations going with a visiting staff mission of the International Monet­ary Fund (IMF) for disbursement about $1.1bn in a couple of weeks.\n\nA top official engaged in the ongoing talks told Dawn that the fund mission led by Nathan Porter had taken a tough stance on ‘grid levy’ on the supply of natural gas or liquefied natural gas, or both, to industrial CPPs despite commitments. Therefore, the government completed all formalities in a speedy manner to impose Rs791 per million British thermal unit (mmBtu) grid levy with effect from March 7, 2025, and provided its copies to the fund staff.\n\n“In exercise of the powers conferred by sub-section (1) of section 3 of the Off Grid (Captive Power Plants) Levy Ordinance, 2025 (I of 2025), the federal government is pleased to notify that the rate for the purpose of sub-section (1) of the said section 3 shall be 791 rupees per million British thermal units,” said a notification issued by Petroleum Secretary Momin Agha. This would now take the total price to Rs4,291/- per mmBtu as the government had increased gas rates for the said category by Rs500.\n\nBut this will not stop here. Under the said ordinance, the government will increase the grid levy by 10pc in July 2025, followed by 15pc in February 2026 and another 20pc by August 2026, taking the end-price close to Rs6,000 to make gas supply punitive for the industry to shift to national power grid.\n\nOfficials said the fund did not buy suggestions about Rs8-10 per unit reduction in power rates through the elimination or cut in sales tax rates, as this had a huge financial impact on the budget and declared it unviable until reforms expand the tax net. However, a Rs2-2.5 per unit cut in the base rate, including associated lower tax may be available to consumers because of a combination of additional revenue from the grid levy, revisions or terminations of power purchase agreements with IPPs, lower interest payments, and a stable exchange rate. This may be in place by next month and July.\n\nThe sources said the authorities tried their best to evade imposition of the grid levy on industrial plants despite an agreement signed with the fund last year as part of the $7bn Extended Fund Facility (EFF). For many months, the government ministers and senior officials have also been indicating Rs8-10 per unit cut in electricity prices and the continuation of a cheaper winter package for industries in the future.\n\nMeanwhile, a brief official statement said Deputy Prime Minister Ishaq Dar will review the IMF’s Resilience & Sustainability Facility (RSF) and “reiterated the government’s commitment to climate adaptation and mitigation, as well as stressed sustained efforts to secure this facility”.\n\nPakistan has already made a formal request for more than $1.2bn RSF — a cheaper and longer facility offered to climate-vulnerable countries. A technical fund mission had recently completed discussions with authorities.\n\nThe sources said the fund staff was not comfortable with privatisation timelines for power companies and expressed dissatisfaction over their losses. The government intends to divest Islamabad, Faisalabad, and Gujranwala-based Discos in the first phase to be followed by Multan, Lahore, and Hyderabad Discos.\n\nThe government had promulgated the Off Grid Levy Ordinance with effect from Jan 30, as required by the IMF, but did not notify the levy rate. The delay resulted in an increased rate to account for the lapse, official sources said. Under the ordinance, the collection from the levy will be used to reduce the power tariff for other consumers. This levy is applicable over and above the notified rates of natural gas or RLNG. The authorities are required by the law to “calculate levy rate taking into account the difference of power tariff of industrial B3 category notified by Nepra and the self-power generation cost of CPPs at the gas tariff notified by Ogra”.\n\nIf the amount of levy is not paid within time by the CPP, it would be recoverable under sub-section (2) and in case of persistent default, the agent shall terminate the gas supplies to the defaulted captive power plant.\n\nThe source said the mission was more interested now in the way forward on the collection of agricultural income tax with effect from July 1, 2025, and was engaging with provinces individually and jointly for clarity, besides the retail and real estate sectors.\n\nOfficials claim Pakistan had generally met most of the targets for end-December 2024 period, albeit some of them will be delayed, but given the timing of the first biannual review, forward-looking discussions were also taking a sizable part of policy talks for the next year’s budget due in the first week of June. The budget proposals would pass through the IMF’s scrutiny before finalisation, not only during ongoing talks but also subsequent virtual interactions.\n\nThe policy-level talks also cover governance reforms, including the creation of a new portal for the uploading of tax returns and asset declarations of the government officers. A wrap-up meeting with finance minister Muhammad Aurangzeb is expected on Friday.\n\nPublished in Dawn, March 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:08:09.296Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897305/govt-hikes-tariff-for-captive-plants-on-imf-prodding",
  "dateList": "2025-03-12",
  "date_published": "2025-03-12T01:52:57.000Z"
}
