{
  "title": "Kashmir Day – Ulema to highlight Indian atrocities in Friday sermons: Ashrafi",
  "link": "https://www.app.com.pk/national/kashmir-day-ashrafi-to-highlight-indian-atrocities-in-fridays-sermon/",
  "date_published": "2022-02-01T12:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 01 (APP):Prime Minister’s Aide on Interfaith Harmony Hafiz Tahir Mehmood Ashrafi Tuesday said Ulema and Mashaikh from all schools of thought would mark the ‘Kashmir Solidarity Day’ by highlighting the issue in Friday sermons across the country.\nAddressing a press conference here, he said they would bring in the notice of general public the inhuman and degrading treatment with the Kashmiri brethren meted out by the occupation forces in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAshrafi said on February 5, all religious and political leadership of the country would observe the day with national fervour to express solidarity with their Kashmiri brothers in IIOJK.\nIt was the united stance of the whole nation that Kashmir was a jugular vein of Pakistan, he added.He said on the issue of Kashmir, the government was raising its voice at every world fora.\nCiting the recent meeting of the Organization of Islamic Cooperation’s foreign ministers which was supposed to discuss the one-point agenda of Afghanistan, he said Prime Minister Imran Khan vehemently spoke on Kashmir and Palestine at that forum to apprise the Muslim Ummah’s leadership of the lingering issues.\nPointing out the deceptive practices of Israel in Palestine and India in the IIOJK, he said India was following the footsteps of Israel, which was trying to grab the land of Palestinians and depriving the locals of their legal rights.\nAshrafi said the world should break the ice on Kashmir issue as the Kashmiri people were being killed mercilessly by the Indian occupation forces.\nHe expressed the hope that the day was not far when the people of Palestine and Kashmir would witness the dawn of independence.\nHe pointed out some recent incidents of sectarian violence in the country, saying there were certain elements who were trying to spread sectarianism.\nHe categorically said the Paigham-e-Pakistan was a joint doctrine and nobody would be allowed to play with the peace, security and interfaith harmony in the country at all costs.\nHe urged the followers of all the schools of thought to respect one another’s sacred places as discussed in the Paigham-e-Pakistan.\nTerming the uniform education curriculum a big achievement of the incumbent Pakistan Tehreek-e-Insaf government, he said those who had any reservation about the curriculum should take up the issue in the committee formed at the federal level as there was representation of all the schools of thought in it.\nHe said there were no lacunas in the uniform curriculum as the towering figures hailing from the family of the Holy Prophet (Peace Be Upon Him) were given exclusive spaces at all grades.\nHe made it clear that without acknowledging and shedding light on the lives of those sacred personalities, none’s faith was complete.\nHe said with combined efforts, “we all have to thwart the nefarious designs of the enemy”.Earlier, he condemned the coward attacks on a Muslim scholar and a priest in which they had lost their lives in Peshawar.",
  "retrievedAt": "2025-08-11T14:13:53.409Z"
}
