{
  "title": "PM Imran Khan initiates work on mega dam’s projects: Senate told",
  "link": "https://www.app.com.pk/national/pm-imran-khan-initiates-work-on-mega-dams-projects-senate-told/",
  "date_published": "2022-02-01T11:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 1 (APP):Minister of State for Parliamentary Affairs Ali Muhammad Khan on Tuesday said that Prime Minister Imran Khan has initiated work on mega-dam projects soon after coming into power.\nResponding to various questions during the Question Hour in the Senate, the minister said that after the construction of large reservoirs in the country, the storage capacity of water will increase to several million-acre feet.He said that funds were being allocated in PSDP for any project keeping in view the availability of financial resources.\nHe said that work was underway on various projects in Balochistan, Khyber Pakhtunkhwa and Sindh.In a written reply, the Ministry of Water Resource said that the federal government was providing funds for construction of various small, medium, large, and delay action/recharge dam projects in the country through Federal Public Sector Development Program (PSDP).\nThese projects aimed at providing water for irrigation /agriculture, and drinking purposes. These projects are being implemented by WAPDA and Irrigation Departments of four provinces besides the Public Health Engineering Department, Balochistan.\nAs many as 27 dams have been completed /laid off from PSDP in the last two years, with storage capacity of 68,939 acre feet in various districts of Balochistan, adding that the ongoing small, medium, large and delay action dams at various stages of implementation and will further add storage of 9.016 MAF.\nAt present combined storage capacity of Mangla, Tarbela, and Chashma reservoirs is about 14.349 MAF. After the completion of ongoing projects i.e. Mohmand, Diamer Basha, and Nai Gaj Dams, the gross storage capacity will be increased to 23.988 MAF.\nWAPDA is working on a comprehensive plan to construct new dams to store water during high flow season and utilize the same during dry season.",
  "retrievedAt": "2025-08-11T14:14:02.331Z"
}
