{
  "title": "Exhibition ‘Retracing the Urban Fabric’ opens",
  "link": "https://www.app.com.pk/national/exhibition-retracing-the-urban-fabric-opens/",
  "date_published": "2022-02-01T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 01 (APP):Satrang Art Gallery Tuesday arranged an exhibition titled’  Retracing the Urban Fabric’ by two artists Farrukh Adnan and Mamoona Riaz. The exhibition explores the impact of spaces and urban environments.\nIt distills an individual’s life into a well stepped pattern or map of regularly visited places, and repeatedly performed activities within these spaces, said a press release issued here on Tuesday. The exhibition encourages viewers to thoughtfully consider the impact of their daily encounters, routes, routines, and the places they frequent upon themselves and upon those sites.\nMamoona and Farrukh’s delicate artworks are painstakingly created and are deeply layered. Both artists base their art on carefully researched subjects – in Farrukh’s case old ruins and in Mamoona’s, living breathing cities, the results are similar, their versions of these cities are imprinted and immortalized in their work.\nFarrukh Adnan said my current work encapsulates the emotions associated with spaces and their transformation in time. I have been investigating history and historic places, especially in my hometown Tulamba, an ancient archaeological site located in Southern Punjab.\nHe said, my artistic process begins with the documentation of the features at this site that lead to contemplation of collective meaning informed by history. These series are also an effort to document history and the process of the making of the urban fabric that brings the deterioration of the place with time.\nThe work comments on the expansion of cities, on aspects of migration and the profound impact on the form of the changing landscape. Mamoona Riaz said my comment is on how the divergence from one space to another works, and how, within us, fragments of each encounter manifest in changes. These encounters are with the patterns we most interact with, the maps of the places we live in.\nWith time the patterns of these maps become one with us as and are etched within our memory. She said the parallels between the delicacy and detail of 2d traditional miniature technique of pigment application in layers are transformed into 3d overlapping of paper and drawings.\nTraditional miniature art patterns are converted into a patterns made from cogs and gears, depicting the forever ongoing machine which a city is, the map of Islamabad is the pattern which I live in , which keeps moving and changing through the continous walk around this shamsa of cogs and the play of shadows and light changing the patterns of this map, she added. Mamoona said the maps of the city are woven together to form a new map.\nThese new patterns at some place look like mark-making, symbolizing the erasure of moments which are then forever etched into the memory.\nShe said the weaving and layering of the extremely thin and delicate paper strips with ink and drawings on them through a painstaking process resonates of the Tapai and Pardakht of Miniature Painting.\nThis woven manuscript is a new map reminiscent of not only my memory but also of all the people living in this city because this map is the single commonality we all share on the ground and seeing it grow into a different being everyday is what we share in its intangible form and spirits, she added.",
  "retrievedAt": "2025-08-11T14:13:46.058Z"
}
