{
  "title": "CJP Gulzar Ahmed bade farewell at full court reference",
  "link": "https://www.app.com.pk/national/cjp-gulzar-ahmed-bade-farewell-at-full-court-reference/",
  "date_published": "2022-02-01T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 01 (APP):Chief Justice of Pakistan (CJP) Gulzar Ahmed was bade farewell at a full court reference held at the Supreme Court, attended by all the judges of the apex court.\nAttorney General of Pakistan Khalid Jawed Khan, Pakistan Bar Council Vice Chairman Hafeez-ur-Rehman Chaudhry, retired senior judges, lawyers, journalists as well as the CJP’s family members were also in attendance.\nJustice Gulzar Ahmed took oath as 27th Chief Justice of Pakistan on December 21, 2019, and today was his last day in office.\nAddressing the reference, Justice Gulzar Ahmed said no sooner he took the office of CJP, the COVID-19 pandemic started showing its full face with scores of people got affected by it. At all levels shut-downs were being made.\nIn consultation with colleagues, he said, standard operating procedures (SOPs) were devised for litigants, lawyers, officers, and staff of the court. The court, however, continued to function and not for a single day it was closed. For the benefit of lawyers and litigants, special dispensation was introduced where limitation period for filing of proceedings before the apex court was extended, he added.\nHe said there had always been difference in institution and disposal of cases, and invariably the institution had always been on the higher side.\nThe chief justice said he had a sigh of relief as he noted that against institution of 38,680 cases during his tenure as CJP, the SC had decided 27,426 cases. “I have heard and decided 4,392 cases. The SC judges, despite all odds and risk to their health, ensured that dispensation of justice was continued and disputes of the people were resolved.\nHe said there must be harmony between the three state organs, and they were expected to work for achieving the goals set out in the Constitution. “The most important attributes of judiciary and judges are independence, fearlessness and integrity. Similar is the onerous and arduous task to be followed by the members of the Bar.”\nHe said the issues relating to Gender Based Violence, Juvenile Justice and Child Courts were also addressed and performance of the Model Courts established by his predecessor was discussed and decisions on them were taken.\nIssues relating to pendency and vacancy in the superior courts and district judiciary, he added, were extensively deliberated and decisions were made. The issues relating to disposal of cases in administrative tribunals/special courts, both federal and provincial, were discussed, and measures were adopted to ensure their early disposal, he added.\nSpeaking on the occasion, Justice Umar Ata Bandial said the Supreme Court hastened its efforts to make itself digitally/virtually more accessible to advocates and litigants alike by doubling the capacity of its Video Link System. A total of 4,143 cases had been taken up/heard via Video Link during Justice Gulzar’s tenure.\nA challenge that confronted the court when Justice Gulzar assumed the office of CJP, he said, was the pending constitutional petition filed by one of the brother judges against Presidential Reference No.1 of 2019. That matter was heard over 17 months by a larger bench of 10 judges and finally ended on 26th April, 2021. It was spread over approximately 60 dates of hearing. On those dates the regular cause-list of the Benches would have to be curtailed for the larger bench to proceed.\nThe obvious setback to the court, he noted, was the accumulation in its caseload. During the period, the backlog of around 42,000 cases in December, 2019 rose to around 50,000 cases in April, 2021. Clearly, the remaining 6-7 judges on the court had a herculean task to perform.\nBy the grace of Almighty Allah, Justice Bandial said, the court toiled hard, sometimes by working long hours for months and other times by disregarding health concerns to arrest the accretion in the backlog of cases. Unlike the common perception, almost every judge worked during the vacations, whether in summer or winter, to hear and decide cases in accordance with law and “Insha’Allah we will continue to do so to clear the backlog”.\nHe said the Bar must lend its support for adding capacity to the court for the elevation of judges to the Supreme Court whose seniority, honesty, competency, judicial temperament were accompanied with the diversity of experience suited to the nature of work that needed disposal.\nHe said, “Of the many landmark judgments delivered by his lordship during his tenure as Chief Justice of Pakistan, one that is constitutionally significant is Presidential Reference No.1 of 2020 framed under Article 186 of the Constitution.\nThe Reference asked whether the elections for the members of Senate of Pakistan held under the Elections Act, 2017 were governed by the condition of “secret ballot” imposed in Article 226 of the Constitution for elections held under the Constitution? His lordship (speaking for the majority) held that an election to the Senate is an election under the Constitution that must be held by secret ballot as provided in Article 226.\nHowever, he observed that by its obligation under Article 218(3) of the Constitution, the Election Commission of Pakistan was bound to utilise all available measures, including technology, to ensure that corrupt practices are guarded against in the conduct of elections.\nThis ruling has preserved the confidentiality of the Senate elections and placed them on a constitutional plane yet allowed the Election Commission to take measures to protect the integrity of the election process from corrupt practices.”",
  "retrievedAt": "2025-08-11T14:13:53.160Z"
}
