{
  "title": "Mixed emotions as Hajj pilgrims depart Makkah, leaving behind cherished memories",
  "link": "https://www.app.com.pk/national/mixed-emotions-as-hajj-pilgrims-depart-makkah-leaving-behind-cherished-memories/",
  "date_published": "2023-07-04T10:47:00.000Z",
  "source": "APP",
  "content": "MAKKAH MUKARMA , Jul 04 (APP): Hajj pilgrims, filled with both tears and smiles, leaving Makkah Mukarma for their respective homes, bid farewell to the sacred Kaaba after completing the final ritual of the Hajj pilgrimage, Tawaf-e-Wida, leaving behind cherished memories and a strengthened faith.\nContinuously, pilgrims kept arriving at the Grand Mosque to participate in the Tawaf Al-Wida, the farewell circumambulation.\nAfter completing this year’s Hajj pilgrimage, a group of pilgrims embarked on their journey back from Makkah on the evening of Thursday, the second day of Tashreeq (Ayyam Al-Tashreeq).\nWith the stoning ritual already accomplished, they bid farewell to the tent city of Mina and headed towards Makkah to partake in Tawaf Al-Wida, the mandatory circumambulation that marks the culmination of their pilgrimage.\nObservers were captivated by the pilgrims’ heightened spiritual state and overwhelming sense of joy, emanating from the profound fulfillment, they experienced throughout their lifelong spiritual quest.\nHowever, amidst the elation, some pilgrims also displayed a tinge of sadness as they bid farewell to the sacred sites and the extraordinary atmosphere that had embraced them during their transformative journey.\nArmina, a 60-year-old woman pilgrim from Karachi, confided in an interview with APP, sharing her bittersweet sentiments about the farewell.\nWith tears streaming down her face, she expressed the intense pain in her heart upon leaving Makkah after the Hajj pilgrimage.\nDespite the sorrow, she acknowledged the necessity of returning home.\nAkhtar Hussain, a hajj pilgrim from Kabir Wala, described the overwhelming emotions he experienced as he prepared to leave Makkah.\nHe expressed a profound sense of loss, likening it to a piece of his soul being ripped away from his body.\nReflecting on his departure, he expressed that returning home marked a transition from the realm of spirituality to the material world.\nSeveral Pakistani pilgrims echoed similar sentiments, expressing both sadness at departing from the holy city and joy in having completed the Hajj pilgrimage.\nMeanwhile, Saudi media reports indicate that a staggering quantity of over 751 million food products was supplied to the pilgrims in the holy sites during Hajj 2023.\nThese provisions, meticulously supervised by the Commerce Ministry, amounted to a total of 751,655,000 food items.\nAmong the various commodities provided, beverages emerged as the most consumed, with a staggering quantity of 406 million bottles of dairy products and juices, closely followed by over 207 million bottles of water.\nAdditionally, the volume of baked bread reached an impressive count of more than 128 million loaves, while the number of ready-to-eat meals served surpassed 7 million.\nFurthermore, the provision of more than 3 million ice cube molds further contributed to the comprehensive supply of necessities during the Hajj pilgrimage.\nTo effectively meet the needs of the pilgrims, the Saudi ministry granted authorization to more than 700 transportation trucks, responsible for delivering essential commodities and food products to the sales outlets located in the holy sites.\nThis meticulous arrangement ensured that the pilgrims’ requirements were successfully fulfilled.\nThis year, the National Association of the Blind (Kafeef) in Riyadh sponsored 42 visually impaired men and women, along with their companions, to undertake the Hajj pilgrimage.\nThese blind pilgrims, supported by an integrated system of facilitated services, successfully completed all Hajj rituals, including the stoning of the Jamarat and the Tawaf Al-Widaa (Farewell Circumambulation).\nThe 42 blind pilgrims and their companions who benefited from the program were divided into three campaigns.",
  "retrievedAt": "2025-08-11T08:50:34.242Z"
}
