{
  "title": "SCO has potential to shape a promising future for region’s people: PM",
  "link": "https://www.app.com.pk/national/sco-has-potential-to-shape-a-promising-future-for-regions-people-pm/",
  "date_published": "2023-07-04T17:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 4 (APP): Prime Minister Shehbaz Sharif on Tuesday said that the Shanghai Cooperation Organisation (SCO) had undoubtedly the potential to shape a promising future for the peoples living within its borders.\nThe prime minister, who earlier addressed the virtual summit of the SCO Council of Heads of State, reiterated that Pakistan would continue to work with the member countries to realise the shared dream of prosperity, peace and connectivity.\nOn Twitter, the prime minister shared a gist of his address at CHS saying that he underlined the need for concerted response at the SCO forum to the global geo-political flux by prioritizing shared vision of an economically integrated region.\n“I threw light on Pakistan’s attractive geographical location as a natural bridge between Asia & Europe within the framework of Belt & Road Initiative,” he remarked.\nHe particularly urged the member countries to condemn terrorism in all its forms and manifestations including state terrorism and cautioned against the dangers of violent ultra-nationalism and demonisation of religious minorities in pursuit of domestic political agendas.\nIt is by granting fundamental rights and freedoms to all people that sustainable peace can be established, he added.\nWhile building a case for enhanced international engagement with the Afghan Interim Government as a necessary condition to unlock the potential of the SCO, he also urged Afghan authorities to deliver on their global commitments.\nMentioning the destruction caused by unprecedented floods last year, the prime minister asked the international community to act upon their assurances by providing support to developing countries in mitigating and adapting to the ill-effects of climate change.",
  "retrievedAt": "2025-08-11T08:50:29.159Z"
}
