{
  "title": "DC pays surprise visits as zero waste operation continues on 2nd Eid day",
  "author": null,
  "content": "ISLAMABAD, Jun 08 (APP): The zero waste operation in Islamabad remained active on the second day of Eid, with teams working continuously to clear animal remains and garbage from across the Federal Capital.\nIn this regard, Deputy Commissioner Islamabad, Irfan Nawaz Memon, made surprise visits to several sectors and rural parts of the capital to inspect the cleanliness drive, according to spokesman of Islamabad Capital Territory (ICT) administration.\nHis inspection included both residential neighborhoods and marketplaces, where waste collection efforts were underway.\nDuring his visits, the DC expressed dissatisfaction after witnessing animal waste dumped in open areas. He appealed to residents to dispose of sacrificial remains in biodegradable bags and avoid throwing them in public spaces.\n“Residents should not leave waste in open fields. Use designated biodegradable bags and cooperate with sanitation teams,” he said during the visit.\nHe also reviewed the condition of the temporary dumping points set up by the Capital Development Authority (CDA) and Metropolitan Corporation Islamabad (MCI) for Eid-specific waste.\nAccording to the DC, the cleaning campaign began early on Eid day and has continued without any breaks. Special teams are deployed across urban and rural zones to manage the increased waste following Eid sacrifices.\n“We are working non-stop to ensure the city stays clean. If any area is left unattended, please inform our control room immediately,” Irfan Memon stated.\nThe campaign is part of Islamabad’s effort to manage waste more efficiently during Eid, a time when large volumes of animal remains are generated in almost every locality. Officials aim to clear all waste swiftly to prevent health risks and maintain hygiene standards.\nResidents were reminded through various platforms to cooperate by packing animal waste properly and placing it at assigned collection spots. The administration said prompt reporting of unattended waste can help sanitation staff respond quickly.\nThe Deputy Commissioner’s visit included stops at rural areas that often receive less attention compared to city sectors. His inspection focused on ensuring equal attention is given to all parts of Islamabad, regardless of location.\nOfficials said the goal is to complete waste removal operations across the city within the first three days of Eid. Teams from the CDA and MCI are equipped with machinery, vehicles, and manpower to handle the workload.\nThe control room set up for Eid operations remains active and can be contacted directly in case of any delays in waste collection. The DC assured citizens that all complaints are being addressed on a priority basis.\nCity authorities are also spreading awareness through announcements and local outreach to prevent the dumping of waste in public areas, drains, or green belts. Clear instructions have been issued to ensure the safe collection and disposal of animal remains to avoid environmental pollution.\nThe administration has placed waste containers at specific points to help residents discard remains easily. These containers are being emptied regularly by the sanitation teams.\nThe DC emphasized that civic responsibility lies with both the administration and the residents. “The city can only stay clean if we all do our part,” he said.\nSo far, the city’s control room has responded to several public reports and deployed teams accordingly. Citizens are encouraged to call the helpline if they notice any unattended waste in their area.\nThe success of the zero waste campaign depends heavily on public cooperation. With prompt action from authorities and responsible behavior by residents, the capital can maintain a clean environment during and after Eid.\nThe operation will continue over the coming days, with more field visits expected from city officials to ensure compliance with the sanitation plan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:54:38.052Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/dc-pays-surprise-visits-as-zero-waste-operation-continues-on-2nd-eid-day/",
  "dateList": "2025-06-08",
  "date_published": "2025-06-08T16:11:00.000Z"
}
