{
  "title": "Naval Chief reaffirms Pakistan Navy’s commitment to marine ecosystem protection",
  "author": null,
  "content": "ISLAMABAD, Jun 08 (APP): Chief of the Naval Staff Admiral Naveed Ashraf has reaffirmed the Pakistan Navy’s commitment to protecting marine ecosystems through various sustainable initiatives, including efforts to curb oil spills, enforce pollution control measures, and ban destructive fishing practices.\nIn his message on World Oceans Day, observed annually on June 8, Admiral Ashraf highlighted the significance of this year’s theme, “Wonder: Sustaining What Sustains Us,” which he said aptly underscores the critical role oceans play in sustaining life on Earth.\n“We are committed to and undertaking substantive initiatives like implementing remedial measures for preventing oil spills at sea, enforcing pollution control measures and banning destructive fishing nets to encourage healthy practices and sustainable use of ocean resources.\nHe said that covering over 70% of our planet, oceans are a key source of Oxygen, a regulator of climate, and an immeasurably supportive of biodiversity, all of which are essential to global livelihoods.\n“Today, our oceans face severe threats from pollution, over-fishing, and climate change; a reality that is being highlighted by the UN Ocean Conference to be held in Nice, France from 9-13 June 25”, he said.\nHe said that it will not only focus on accelerating actions for conservation and sustainable use of oceans but also identify ways and means to support implementation of Sustainable Development Goal 14, i.e. conserve and sustainably use the oceans, seas and marine resources by building partnerships towards its effective implementation.\nHe said, “For Pakistan, our long coastline and rich marine resources constitute a national trust. This vital treasure trove of biodiversity is facing rapid deterioration and demands immediate and robust intervention by all stakeholders.”\nHe said that as the principal custodian of the country’s maritime domain, the Pakistan Navy is well aware of this critical responsibility.\n“Our extensive mangrove regeneration, with over eight million saplings planted, underscores our commitment to strengthening coastal resilience and enhancing biodiversity. Furthermore, we are maintaining readiness to combat marine pollution through focused operations and synergistic exercises, thereby shielding our seas from ecological harm”.\nRecognising the obligation to the environment, he said the Pakistan Navy is also instilling an ecological ethos through awareness drives and crucial partnerships. To mark the occasion, the National Institute of Maritime Affairs (NIMA) has organised a day international seminar to create awareness about the issue and highlight ways and means to protect our oceans, said a news release issued by the Director General of Public Relations (Navy).\n“World Oceans Day calls upon us to move beyond the reflexive acknowledgment and take result-oriented collective actions”, he said.\nThe Navy chief said, “I call upon all the stakeholders to join hands with the Pakistan Navy and adopt safe and sustainable practices to secure our oceans’ vitality. Collectively, we can avail this immense endowment in the shape of our rich oceans, preserve their enduring majesty and secure the lifeblood they provide, for our future generations.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:55:28.755Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/naval-chief-reaffirms-pakistan-navys-commitment-to-marine-ecosystem-protection/",
  "dateList": "2025-06-08",
  "date_published": "2025-06-08T10:35:00.000Z"
}
