{
  "title": "ANF conducts raids against drug traffickers, seizes narcotics worth over Rs. 21.5 million",
  "link": "https://www.app.com.pk/domestic/anf-conducts-raids-against-drug-traffickers-seizes-narcotics-worth-over-rs-21-5-million/",
  "date_published": "2025-08-03T14:59:39+05:00",
  "source": "APP",
  "content": "RAWALPINDI, Aug 02 (APP): Anti-Narcotics Force (ANF) have conducted series of successful operations against drug traffickers across the country.\n\nIn nine different raids, ANF arrested 11 drug smugglers and the recovery of more than 107 kilograms of various narcotics, valued at over Rs. 21.5 million.\n\nDuring the operations, ANF recovered 84 grams of liquid cannabis from a parcel at a courier office located in Chaklala garrison, Rawalpindi. The package had arrived from the United Kingdom and was intercepted before delivery.\n\nNear Harappa Toll Plaza in Sahiwal, ANF officials seized 4 kilograms of opium, 2 kilograms of hashish, and 500 grams of ice from a vehicle, arresting three suspects.\n\nNear Saranan Road in the Pishin area, 45 kilograms of opium were recovered from a car, and the accused was arrested on the spot.\n\nIn Tarnol, Islamabad, ANF officials seized 25 kilograms of opium and 22.8 kilograms of hashish from a truck and arrested a smuggler.\n\nNear the Indus Highway in Kohat, 2 kilograms of opium were recovered from a motorcyclist.\n\nAt Islamabad Motorway Toll Plaza, two separate operations were carried out one leading to the recovery of 2 kilograms of ice from a bus passenger, and another where 1.8 kilograms of heroin were found in a suspect’s bag.\n\nIn another operation near Ring Road in Peshawar, 1.3 kilograms of heroin were seized from a vehicle and the accused was taken into custody.\n\nIn a similar action near Burhan Toll Plaza in Attock, 710 grams of opium were recovered from a passenger in public transport.\n\nAll cases have been registered under the Control of Narcotic Substances (CNS) Act, and investigations are ongoing.\n\nThe ANF reaffirmed its resolve to continue operations across the country to eliminate drug trafficking and ensure public safety.",
  "retrievedAt": "2025-08-03T10:25:24.968Z"
}
