{
  "title": "President reprimands NHA for denying employment to a widow",
  "link": "https://www.app.com.pk/national/president-reprimands-nha-for-denying-employment-to-a-widow/",
  "date_published": "2022-07-03T08:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 3 (APP): President Dr Arif Alvi has directed the National Highway Authority (NHA) to appoint the widow of a deceased employee under the Prime Minister’s Assistance Package without further delay and to report compliance to the Wafaqi Mohtasib within 30-days.\nWhile expressing displeasure, the president noted that the widow, having five minor children to support, had been denied her right for employment on the flimsy ground that she had applied for the job after the stipulated time of one year after her husband’s death.\nThe president gave these orders while rejecting a representation of NHA against the orders of the Wafaqi Mohtasib directing NHA to grant employment to Ishrat Bibi (the complainant) whose husband was a driver in NHA and had died during service, President Secretariat Press Wing said in a press release on Sunday.\nHe also observed that even though the widow had applied after a passage of more than two years and eight months after her husband’s death, but she had produced an Office Memorandum (O.M) of the Establishment Division during the hearing which took care of this aspect.\nThe president noted that NHA appeared to have overlooked this important fact and termed the stance of NHA on her employment as ill-founded and directed it to process her appointment.\nAccording to the details, the widow had applied for her appointment with supporting documents required by NHA, but she was denied employment.\nFeeling aggrieved, she approached the Wafaqi Mohtasib who passed the orders for her employment. NHA, however, instead of implementing the decision filed a representation with the president.\nThe president upheld the order of Wafaqi Mohtasib and directed NHA to make compliance within 30 days.",
  "retrievedAt": "2025-08-11T15:11:45.208Z"
}
