{
  "title": "Govt not to allow anyone to disgrace institutions: Advisor",
  "link": "https://www.app.com.pk/national/govt-not-to-allow-anyone-to-disgrace-institutions-advisor/",
  "date_published": "2020-12-23T13:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP): Adviser to the Prime Minister on Accountability and Interior Barrister Mirza Shahzad Akbar Wednesday said the Pakistan Tehreek-e-Insaf (PTI) government would not allow anyone to disgrace the institutions.\nSenate Deputy Chairman Saleem Mandviwala should challenge the court’s order for forfeiture of his stock market shares at the relevant high court instead of targeting NAB, he said while talking to media.\nHe said a member of parliament was not a sacred cow, adding that any parliamentarian could not use his official position for personal benefits.\nThere is no immunity to any parliamentarian and Mandviwala should not had to misuse his official position for personal gains, the adviser said.\nHe lamented that the opposition wanted to make the country banana republic.\nHe said Senate Deputy Chairman Saleem Mandviwala had started targeting National Accountability Bureau (NAB) after instituting cases against him (Mandviwala), adding, the government would defend the anti-graft body in Senate during the ensuing session scheduled to be held on December 30.\nHe said the PDM was formed after failure of opposition to get (NRO) National Reconciliation Ordinance. The main objective of the opposition was to seek NRO. The opposition wanted to get immunity from its corruption cases, he observed. The proposed amendments in the National Accountability Bureau ordinance by opposition were aimed at getting the immunity from their crimes which were not acceptable to the government.\nResponding to a question, he said as per agreement with United Kingdom, the transfer of convicted prisoners was possible among two countries.\nThe UK government has assured considering the application of Pakistan to extradite Nawaz Sharif, whose visit visa application has already been expired. The visa of Nawaz who is convicted should be cancelled, the adviser opined.\nResponding to another question, he said the amount recovered by NAB was deposited straight in the national exchequer.\nSome 25 new accountability courts were being established to expedite NAB cases, he said and added that the government will take NAB cases to logical conclusion.\nThe government was satisfied with the performance of National Accountability Bureau (NAB), the adviser mentioned.",
  "retrievedAt": "2025-08-11T20:10:42.483Z"
}
