{
  "title": "CM Balochistan reviews development projects, copping spread of COVID-19",
  "link": "https://www.app.com.pk/national/cm-balochistan-reviews-development-projects-copping-spread-of-covid-19/",
  "date_published": "2020-12-23T09:05:00.000Z",
  "source": "APP",
  "content": "QUETTA, Dec 23 (APP): Chief Minister Balochistan Jam Kamal Khan chaired a meeting to review ongoing, new development projects, mechanism of copping the spread of COVID-19 and other natural disaster control programs in the province.\nThe meeting was attended by Provincial Minister Mir Arif Jan Mohammad Hassani, Parliamentary Secretary for Information Bushra Rind, Parliamentary Secretary Minority Affairs Danish Kumar, Chief Secretary Balochistan Capt. (retd) Fazil Asghar, Additional Chief Secretary, Planning and Development Abdul Saboor Kakar, Secretary, Finance Noorul Haq Baloch, Secretary PHE Saleh Muhammad Nasar, Secretary, Irrigation Ali Akbar Baloch, Information Secretary Shah Irfan Gharshin and other officials on the other day.\nThe meeting was informed about collaboration with the federation and the province regarding COVID-19 responsive and other natural disaster control programs and joint measures taken to control the virus and natural disasters.\nMeeting was also apprised regarding collaboration with province under national programs to improve health facilities at headquarters, water, sanitation, and high Gene, promotion of local infrastructure, prevention of Congo virus, other animal diseases related to Veterinary Clinics, water supply, sewerage, livelihood improvement and Agriculture.\nIt was also briefed on the promotion of tunnel farming in the sector, ongoing and new development schemes under the annual development program that out of 1597 new projects, 1429 developmental projects have been approved and so far Rs, 42 billion for constant and fresh schemes funds were released for completion of the projects in the area by the concerned authorities.\nAddressing the meeting, the Chief Minister said effective measures are being taken to improve health facilities including water, sanitation, sewerage systems at district along with Tehsil Headquarter as well as locally improve infrastructure and livelihood.\nHe directed the COVID-19 Response under the program, Congo virus prevention centers would further improve livestock and spray should also be arranged in the districts of the province where the number of animals is high, Veterinary clinics should be activated there.\nHe also instructed that measures should be taken for the promotion of olive cultivation and horticulture in the province including Quetta, Ziarat, and Kalat.\nHe ordered that all necessary development projects of PC-1 should be prepared in detail in order to maintain smooth progress in the province.",
  "retrievedAt": "2025-08-11T20:10:45.439Z"
}
