{
  "title": "More than 2,100 new Coronavirus cases reported, 84 deaths in past 24 hours",
  "link": "https://www.app.com.pk/national/more-than-2100-new-coronavirus-cases-reported-84-deaths-in-past-24-hours/",
  "date_published": "2020-12-23T07:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 23 (APP): The national tally of total active COVID-19 cases in Pakistan on Wednesday reached 37,905 with 2,142 more people tested positive for the deadly virus and 6,267 people recovered from Coronavirus during the last 24 hours.\nEighty Four corona patients, 73 of whom were under treatment in hospital and 11 in their respective homes or quarantines died on Tuesday, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in Punjab followed by the Sindh. It added that during last 24 hours that out of the total 84 deaths 47 patients died on ventilators.\nNo COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Balochistan and Gilgit Baltistan (GB) while 319 ventilators were occupied elsewhere in Pakistan.\nThe maximum ventilators were occupied in four major areas including Multan 55 percent, ICT 33 percent, Peshawar 25 percent and Lahore 34 percent.\nThe Oxygen beds (oxygen providing facility other than ventilator as per patient’s medical requirement) were also occupied in four major areas as in Rawalpindi 41 percent, Abbottabad 35 percent, Peshawar60 percent and Multan 39 percent.\nSome 35,621 tests were conducted across the country on Tuesday, including 10,914 in Sindh, 15,214 in Punjab, 4,480 in Khyber Pakhtunkhwa (KP), 3,770 in Islamabad Capital Territory (ICT), 380 in Balochistan, 396 in GB, and 467 in AJK.\nAround 415,352 people have recovered from the disease so far across Pakistan making it a significant count with over 86 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 462,814 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 8,040, Balochistan 17,980, GB 4,832, ICT 36,483, KP 55,811, Punjab 133,179 and Sindh 206,489.\nAbout 9,557 deaths were recorded in country since the eruption of the contagion, including 3,379 Sindh among 21 of them died in hospital and Six out of hospital on Tuesday, 3,732 in Punjab 39 of them died in hospital and Five out of hospital on Tuesday, 1,563 in KP 10 of them died in hospital on Tuesday, 394 in ICT Two of them died in hospital on Tuesday, 179 in Balochistan, 99 in GB and 211 in AJK where One of them died in hospital on Tuesday.\nA total of 6,406,281 corona tests have been conducted so far, while 615 hospitals are equipped with COVID facilities. Some 2,931 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:10:45.113Z"
}
