{
  "title": "Meta’s WhatsApp says Israeli spyware company Paragon targeted users - World - DAWN.COM",
  "author": null,
  "content": "An official with Meta’s popular WhatsApp chat service said Israeli spyware company Paragon Solutions had targeted scores of its users, including journalists and members of civil society.\n\nThe official said on Friday that WhatsApp had sent Paragon a cease-and-desist letter following the hack.\n\nIn a statement, WhatsApp said the company “will continue to protect people’s ability to communicate privately”.\n\nParagon declined to comment.\n\nThe WhatsApp official told Reuters it had detected an effort to hack approximately 90 users of its platform.\n\nThe official declined to say who, specifically, was targeted or where they were geographically, saying only that targets included an unspecified number of people in civil society and media.\n\nHe said WhatsApp had since disrupted the hacking effort and was referring targets to Canadian internet watchdog group Citizen Lab.\n\nThe official declined to discuss how it ascertained that Paragon was responsible for the hack. He said law enforcement and industry partners had been informed, but declined to go into detail.\n\nThe United States’ Federal Bureau of Investigation did not immediately return a message seeking comment.\n\nCitizen Lab researcher John Scott-Railton said the discovery of Paragon spyware targeting WhatsApp users “is a reminder that mercenary spyware continues to proliferate and as it does, so we continue to see familiar patterns of problematic use”.\n\nSpyware merchants such as Paragon sell high-end surveillance software to government clients and typically pitch their services as critical to fighting crime and protecting national security.\n\nBut such spy tools have repeatedly been discovered on the phones of journalists, activists, opposition politicians, and at least 50 US officials, raising concerns over the unchecked proliferation of the technology.\n\nParagon — which was reportedly acquired by Florida-based investment group AE Industrial Partners last month — has tried to position itself publicly as one of the industry’s more responsible players.\n\nThe company’s website advertises “ethically based tools, teams, and insights to disrupt intractable threats”, and media reports citing people familiar with the company say Paragon only sells to governments in stable democratic countries.\n\nNatalia Krapiva, senior tech-legal counsel at the advocacy group Access Now, said Paragon had the reputation of being a better spyware company, “but WhatsApp’s recent revelations suggest otherwise.\n\n“This is not just a question of some bad apples these types of abuses [are] a feature of the commercial spyware industry.”\n\nAE did not immediately return a message seeking comment.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:03:02.799Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888892/metas-whatsapp-says-israeli-spyware-company-paragon-targeted-users",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T16:44:15.000Z"
}
