{
  "title": "IHC summons AGP in missing persons case on March 6 - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islama­bad High Court (IHC) has summoned the Attorney General of Pakistan to appear in person in the court at the next hearing of the missing persons’ case. The hearing will be held on March 6.\n\nA three-member larger ben­ch, headed by Justice Mohsin Akhtar Kayani and comprising Justice Tariq Mehmood Jahangiri and Justice Arbab Muhammad Tahir, heard the case on Thursday.\n\nJustice Kayani expressed concern over the lack of progress, stating that the federal government had failed to take effective measures.\n\nHe emphasised that the Co­m­­mission of Inquiry on En­­f­orced Disappearances, which was supposed to handle such cases, is non-functional. “If the commission is not working, it should be shut down,” he remarked.\n\nJustice Kayani decries lack of progress in the matter\n\nThe court also noted that the cabinet sub-committee on enfo­r­­ced disappearances did not include intelligence agencies’ officials.\n\nJustice Kayani suggested that the federal government should directly question officials of intelligence agencies about the missing persons, a point supported by his fellow judges.\n\nAdditional Attorney General Barrister Munawar Iqbal Duggal informed the court that a meeting of the sub-committee had been held, with another scheduled to be held soon.\n\nHe said that the committee had received reports from 13 different representatives, including Voice of Balochistan and other government officials on the issue. However, Justice Kayani was unconvinced, and said: “We are still standing where we started. The state has failed to recover missing persons.”\n\nAdvocate Mazari argued that the attorney general had previously given assurances to the court, but these assurances were not fulfilled. She cited a recent case of a 15-year-old boy who was allegedly abducted from Khuzdar, emphasising that disappearances continue despite the government’s promises.\n\nJustice Kayani criticised authorities for their lack of results, noting that such cases damage Pakistan’s international reputation.\n\nHe also called for intelligence agencies to be granted legal authority similar to the Counter-Terrorism Department (CTD) to regulate their operations transparently.\n\nThe court directed the federal government to submit a report on the progress of missing persons’ recovery case every 15 days and summoned the Attorney General of Pakistan to appear in person at the next hearing of the case which will be held on March 6.\n\nPublished in Dawn, January 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:04:41.607Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888791/ihc-summons-agp-in-missing-persons-case-on-march-6",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T05:06:18.000Z"
}
