{
  "title": "GSP+ benefits depend on progress in addressing ‘list of issues’, EU reminds Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "The European Union (EU) on Friday reminded Pakistan that trade benefits enjoyed by the country under the Generalised Scheme of Preferences Plus (GSP+) depend on the progress made in addressing a list of issues, including human rights, and tangible reforms remain essential, a statement by the mission said.\n\nThe EU is Pakistan’s sec­ond-largest trading partner, with the GSP+ status allowing the country to enjoy duty-free or minimum duty on European exports.\n\nThe scheme, however, is conditional on the beneficiary countries demonstrating tangible progress in implementing 27 international conventions on human and labour rights, environmental protection, climate change and good governance.\n\nOlof Skoog, the EU Special Rep­resentative for Human Rights who is currently on a week-long visit to Pakistan, on Wednesday, warned Pakistan not to take its GSP+ status for granted. He also urged the government not to use military courts to pursue cases against citizens, and opposed recent moves to restrict freedom of expression.\n\nAccording to Friday’s statement, the EU mission aimed to engage Pakistan on the most pressing human rights and labour rights issues and discuss Pakistan’s plans to address them, including the ongoing assessment under the GSP+ trade scheme.\n\n“As we approach the midterm of the current monitoring cycle, we encourage Pakistan to continue on its reform path as it prepares for reapplication under the upcoming new GSP+ regulation,” the statement said.\n\n“The trade benefits under GSP+ depend on the progress made on addressing a list of issues, including on human rights, and tangible reforms remain essential.”\n\nIt added that Pakistan remained a key partner for the EU in South Asia, and its relations with the bloc was built on shared values of democracy, human rights, and the rule of law, guided by the principles of the UN Charter and international norms.\n\n“The EU welcomes the fact that Pakistan has become the largest beneficiary of GSP+, with Pakistani businesses increasing their exports to the EU market by 108 per cent since the launch of the trade scheme in 2014,” the EU said.\n\nIt added that during meetings with Pakistan’s senior interlocutors, including the Deputy Prime Minister and Foreign Minister Ishaq Dar, Skoog highlighted areas of concern such as the application of blasphemy laws, women’s rights, forced marriages and conversions, enforced disappearances, freedoms of expression, religion or belief, independence of the media, impunity for rights violations, due process and the right to a fair trial, civic space, and the death penalty.\n\nIn his meeting with Chief Justice of Pakistan Justice Yahya Afridi, the focus was on judicial backlog as well as the integrity and independence of the judiciary.\n\nThroughout his visit, the special envoy acknowledged the important role of the National Commission of Human Rights and underlined the need to preserve its independence, the statement added.\n\n“In the context of the upcoming GSP+ monitoring mission, the special envoy encouraged Pakistani authorities to ensure the implementation of all relevant international conventions.\n\nAs part of his itinerary, Ambassador Skoog also visited Lahore to meet with key stakeholders, including Punjab Chief Minister Maryam Nawaz Sharif and Minister for Minorities Affairs in Punjab, Sardar Ramesh Singh Arora, as well as representatives of the Christian and Ahmadi communities,“ the EU said.\n\nThe discussions centred on freedom of religion or belief, the protection of minority rights, and accountability for violations and abuses of human rights.\n\nMeanwhile, during a weekly press briefing on Thursday, Foreign Office spokesperson Shafqat Ali Khan had acknowledged the EU’s warning, saying: “The GSP+ status is just one aspect of the Pak-EU partnership. The visit of the EU’s special envoy is also part of the routine.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/31130746ed2a4f0.png",
  "retrievedAt": "2025-08-26T08:03:05.246Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888846/gsp-benefits-depend-on-progress-in-addressing-list-of-issues-eu-reminds-pakistan",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T09:06:02.000Z"
}
