{
  "title": "Katchi abadi case - Newspaper - DAWN.COM",
  "author": null,
  "content": "IN early January, the Supreme Court opened up a case relating to katchi abadis that had been dormant for almost a decade, triggering panic amongst millions of working people across the country.\n\nThe case revolves around a mass eviction in 2015 in Islamabad when the then PML-N government and the Capital Development Authority (CDA) ruthlessly ran bulldozers through the capital’s biggest katchi abadi, rendering more than 20,000 working people homeless.\n\nSituated in Sector I-11 of the federal capital, right next to the city’s main sabzi mandi, the settlement was over 30 years old. It had come into existence in the mid-1980s due to the influx of Pakhtun migrant workers from Mohmand and other tribal areas.\n\nLike the Punjabi, Kashmiri, Seraiki and other migrant workers before and after, the former residents of the katchi abadi have literally built Islamabad’s cityscape with their hands. They wake up at 3am every morning to deliver fruit and vegetables to the capital’s bazaars. They are the cooks, drivers and cleaners that keep the homes and offices of the chattering classes afloat.\n\nThe state doesn’t give them anything in return. There are no cheap loans on offer from the House Building Finance Corporation to fund the mud houses built in settlements like the one in I-11. Residents of katchi abadis struggle to get their children admitted to public schools. Basic health facilities, where they exist at all, are provided by private philanthropists rather than the government.\n\nThe law is far from emancipatory for the working class.\n\nAnd then there is the alleged extortion by police and other government officials. Not a day would go by without I-11’s residents being forced to pay small bribes to those who claim to act in the public interest. Refuse and get locked up in trumped-up cases. It was ultimately in the name of an ‘anti-encroachment drive’ that the entire settlement was razed to the ground.\n\nThe law is far from an emancipatory instrument for the working class. No one knows this better than katchi abadi residents. As settlements that have developed informally over the decades on government — and sometimes private — land, katchi abadis perpetually face the threat of eviction. In Sindh and Punjab, legislation has been passed that acknowledges the basic right to shelter of most katchi abadis. But in the so-called ‘Islamabad the beautiful’, katchi abadis remain subject to the arbitrary ‘law enforcement’ of local authorities.\n\nIn 2015, armed with an order of the Islamabad High Court to act against ‘illegal’ settlements, the CDA announced a list of katchi abadis to be torn down, with I-11 at the top of the list. Then interior minister Chaudhry Nisar Ali Khan started raising alarm against ‘miscreants’, while the corporate media beamed out propaganda about I-11 being an ‘Afghan basti’ and a hub of terrorist activity. Such scapegoating is not new.\n\nIn the I-11 case, the full coercive power of the state was ultimately deployed in the name of the law. A full-fledged military-style operation was conducted on July 31, 2015, replete with tear gas shelling, baton charges and mass arrests.\n\nYet the principled resistance of katchi abadi dwellers and progressive political workers forced the Supreme Court to take notice of the brutal demolition. It was too late to save the residents from homelessness, but the apex court imposed a stay order on all summary evictions, whilst at least temporarily bringing the entire elitist urban planning paradigm into the public spotlight.\n\nIn the decade since that traumatic event, Islamabad, like all other metropolitan centres, has been transformed further by khaki and other real estate mog­uls that have wa­­ged a class war against working people and in fa­­vour of rich inv­estors home and abroad, assisted ably by government bureaucracies such as the CDA. Who calls out their alleged illegal land grabs and encroachments?\n\nMeanwhile, millions of workers continue to migrate into the city in search of livelihoods. Katchi abadis sprout up in all sorts of liminal spaces because the state and formal private sector simply don’t provide affordable housing to working people.\n\nThe residents of Islamabad’s katchi abadis are now living in mortal fear that the court will vacate the decade-old stay order without any change in the way the CDA and governmental authorities in general are planning the cityscape.\n\nMalik Riaz may be facing some heat due to palace intrigues but this should not distract us from the fact that real estate binges and the dominant paradigm of ‘development’ remain unchecked, leading to relentless dispossession of katchi abadi dwellers and working-class populations in general.\n\nThe law has historically enabled the rich and powerful to run roughshod over working masses. In this class war, where will the Supreme Court stand?\n\nThe writer teaches at Quaid-i-Azam University, Islamabad.\n\nPublished in Dawn, January 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/679c4c918d009.jpg",
  "retrievedAt": "2025-08-26T08:03:06.727Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888785",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T04:49:57.000Z"
}
