{
  "title": "Joint ventures for local assembly of Belarusian tractors soon - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan and Belarus have decided to start assembling Belarusian tractors locally through joint ventures to promote trade and industrial cooperation.\n\nOn Thursday, the 5th session of the Pakistan-Belarus Joint Working Group on Industrial Cooperation held at the Engineering Development Board (EDB) noted that local companies were interested in JVs, mainly in the auto and heavy machinery sector.\n\nThe meeting focused on possibilities to enhance industrial cooperation for assembling and manufacturing Belarus tractors, 12 to 18-meter electric buses, agricultural machinery and oil transformers.\n\nThe other areas of cooperation include coal mining, gold and silver mining, concrete production, and iron ore extraction machinery in Pakistan.\n\nThe EDB, an attached Ministry of Industries and Production department, informed the Belarusian officials about the potential industrial engineering goods areas for joint ventures.\n\nAdditional Secretary Industries Muhammad Asad Islam Mahni and Bela­rus Deputy Industry Minister Andrey Kuznetsov co-chaired the session.\n\nIt was also decided that a business delegation will visit Belarus next month to determine the possibility of increasing exports of textiles, rice, citrus fruits, leather apparel, leather footwear, and medical instruments.\n\nWhile it has been acknowledged that the value addition of rice and citrus in Pakistan will enhance the value of exports to Belarus, and adding modern technology to the farm sector of Pakistan will support the value addition drive.\n\nThe cooperation between the business communities of both countries will help the agriculture sector of Pakistan to benefit from the highly developed research works in this sector in Belarus.\n\nMeanwhile, the Minsk Tractor Plant (MTZ) will supply 2,700 Belarus tractors to Pakistan this year. This agreement was formalised during Belarusian President Aleksandr Lukashenko’s visit in December 2024.\n\nThe meeting also discussed the current status of assembling these tractors in Pakistan.\n\nThese tractors are used chiefly for haulage for loading sugarcane, fertiliser bags, and heavy implements used in the field, mainly in hard soil areas.\n\nPublished in Dawn, January 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:04:23.546Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888801/joint-ventures-for-local-assembly-of-belarusian-tractors-soon",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T05:21:50.000Z"
}
