{
  "title": "Ramzan Sugar Mills case: Defence concludes arguments on acquittal pleas of PM, son - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The defence on Thursday concluded its arguments before an anti-corruption court in support of acquittal applications of Prime Minister Shehbaz Sharif and his son Hamza in Ramzan Sugar Mills case.\n\nIn his concluding arguments, defence counsel Amjad Pervez stated that the prosecution charge was that the wastewater drain was constructed on the order of the then chief minister for the benefit of his sons’ mills in Chiniot.\n\nHe said the charge was baseless as the drain was not constructed for the benefit of the sugar mills.\n\nHe said the drain was a development scheme approved by the Punjab cabinet and the assembly for the area.\n\nThe counsel argued that the drain was constructed for the benefit of ten villages in Chiniot and even the complainant had acknowledged this point.\n\nHe said the complainant confirmed that not just ten but 15 more settlements were benefiting from the drain.\n\nHe stated that the prosecution’s allegations were baseless and the corruption claims were mere stories.\n\nHe pointed out that this was a government-funded drain and the Ramzan Sugar Mills pays charges for disposing of its waste into it.\n\nHe said the NAB’s case was nothing but political victimisation.\n\nAdvocate Pervez said it was shocking that it took a prime minister seven years to prove his innocence in a false case. Even the prime minister was helpless like an ordinary citizen in the country’s system, he concluded.\n\nJudge Sardar Mehmood Iqbal Dogar adjourned the hearing till Feb 3 and directed the prosecution to present its arguments on the acquittal applications of the accused persons.\n\nAt the previous hearing, complainant Zulfiqar Ali in the sugar mills case had resiled from his statement during a cross-examination. He stated that he had no knowledge of the case.\n\nHe also submitted an affidavit to the court, admitting that the construction of the wastewater drain in Chiniot did not cause any loss to the national exchequer.\n\nZulfiqar clarified that he was unaware of the details of the petition, therefore, wished to withdraw it.\n\nOn Oct 17, an accountability court had transferred the Ramzan Sugar Mills reference to the anti-corruption court for lack of jurisdiction following amendments to the National Accountability Ordinance 1999.\n\nNAB, after the amendment, cannot prosecute an alleged offence involving money less than Rs500m and the offence amount in the mills reference was below the minimum value.\n\nThe accountability court was informed that NAB, in its reference, had made a case of alleged corruption of Rs213 million.\n\nNAB reference filed in 2018 alleged that PM Shehbaz, being the chief minister, and his son Hamza, with the abetment of each other, had caused a loss of Rs213 million to the national exchequer by committing the offence of misuse of authority.\n\nIt said Mr Shehbaz had issued a directive for construction of a drain in Chiniot district primarily for the use of Ramzan Sugar Mills owned by his sons, Hamza and Suleman.\n\nPublished in Dawn, January 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:03:35.088Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888711/ramzan-sugar-mills-case-defence-concludes-arguments-on-acquittal-pleas-of-pm-son",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T02:12:41.000Z"
}
