{
  "title": "Malik Riaz's passport blocked in £190m case - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Days after it began the process to extradite Bahria Town owner Malik Riaz from the United Arab Emirates, the government on Thursday blocked the passports of the property tycoon and other accused who have been declared absconders in the £190 million corruption case.\n\nEarlier this month, former prime minister Imran Khan and his spouse Bushra Bibi were sentenced in the matter of the Al-Qadir Trust by an accountability court in Islamabad, after a lengthy trial.\n\nBesides Malik Riaz, his son Ali Riaz, former accountability adviser Barrister Shahzad Akbar, and Farhat Shahzadi — a close friend of Bushra Bibi — have had their passports blocked.\n\nAn official of the interior ministry told Dawn that the step against the four key characters was taken at the request of the National Accountability Bureau.\n\nAll these individuals are not in Pakistan at the moment.\n\nMalik Riaz, no stranger to Pakistan’s power corridors before his fall from grace, is currently in the UAE, where he plans to develop ‘Bahria Town Dubai’, a luxury housing project.\n\nNAB has already warned citizens against investing in this project, saying it may be considered ‘money laundering’ by the government.\n\nFarhat Shahzadi reportedly left for Dubai on April 5, 2022, days before Imran Khan was removed as the prime minister through a no-trust motion. Mirza Shahzad Akbar resigned in January 2022 as the former PM adviser and left for the United Kingdom before his name was placed on the Exit Control List.\n\n‘Extortion’ case\n\nMeanwhile, Islamabad police have registered a case regarding an attempt to extort 50 Bitcoin — worth around $5 million — from Malik Riaz, and threatening his family with dire consequences.\n\nThe case, registered under sections 506 ii of the Pakistan Penal Code and 25-D of the Telegraph Act, was lodged on the complaint of Bahria Town Vice Executive retired Col Khalil ur Rehman, who is responsible for security of the housing society and Malik Riaz’s family.\n\nThe complainant claimed that an email containing the extortion demands was received by Malik Riaz on Jan 12, while an unidentified individual conducted recce of his daughter’s residence in Sector G-6 on Jan 27.\n\nMunawer Azeem also contributed to this report\n\nPublished in Dawn, January 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T08:03:23.674Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888776/malik-riazs-passport-blocked-in-190m-case",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T03:37:40.000Z"
}
