{
  "title": "MCC announces fund for Afghan women refugee cricket team - World - DAWN.COM",
  "author": null,
  "content": "Afghanistan’s exiled women cricketers will be the first beneficiaries of a new refugee fund started by the Marylebone Cricket Club (MCC), the club said on Friday.\n\nHundreds of athletes fled Afghanistan after the Taliban reclaimed power in 2021 and effected sweeping restrictions on women in the country.\n\nOf the 25 Afghan women contracted by the country’s cricket board in 2020, most have settled in Australia and played their first match on Thursday.\n\nThe MCC’s global refugee cricket fund, which aims to initially raise one million pounds ($1.24m), is intended for displaced communities such as the Afghan players.\n\n“Cricket has the power to inspire, unite and empower, and through this initiative, we aim to bring hope and opportunity to those who need it most,” MCC secretary Rob Lynch said in a statement.\n\nWhile Afghanistan has an established men’s team and enjoys funding from the International Cricket Council, the women are unfunded and unsanctioned by the global body despite pleas for support from the players.\n\nThe Taliban say they respect women’s rights in accordance with their interpretation of Islamic law and local customs and that they are internal matters that should be addressed locally.\n\nThe early focus of the refugee fund will be to raise money to provide safe training facilities, educational opportunities and growth pathways, the MCC, which is responsible for the laws of cricket, said in a statement.\n\nThe England and Wales Cricket Board has also lent a helping hand.\n\n“The cricket community must take action, to support the brave Afghan women, and to give hope that cricket can be a sport for any woman or girl,” ECB deputy chief executive Clare Connor said.\n\n“We hope the launch of the fund will inspire other cricketing organisations to support this cause and to unlock cricket’s power to unite communities around the globe.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/31160013d489e28.jpg",
  "retrievedAt": "2025-08-26T08:03:02.800Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888860/mcc-announces-fund-for-afghan-women-refugee-cricket-team",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T11:48:51.000Z"
}
