{
  "title": "2,500 acres planned for new graveyards in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Local govt asked to ensure all housing societies also reserve spaces for cemeteries\n• Shortage of burial space has been causing significant distress to citizens\n\nKARACHI: The provincial government has finally decided to allocate 2,500 acres for graveyards as there is no more land available for burial in almost all major cemeteries in the city.\n\nThe decision was made by chief secretary Syed Asif Hyder Shah during a meeting on Thursday.\n\nThe shortage of burial space in the metropolis has been causing significant distress to the citizens, with six of the total 39 cemeteries managed by the Karachi Metropolitan Corporation (KMC) already closed to new burials.\n\nBesides, the repurposing of the graves has become widespread in the graveyards, including those that have been closed in the city where the death rate is stated to be around 0.33 per cent of the total population per annum.\n\nSources in the KMC said that over 10,000 graves were needed every year in the city in view of the death rate as around 20-25 bodies were buried in different cemeteries of the city daily.\n\nThey said that shortage of burial space has also led to surge in price of graves that could go up to Rs200,000, depending on the location of the graveyard as some people prefer to bury their near and dear ones beside their relatives.\n\nMoreover, they said, the number of bodies taken to other parts of the country had also declined considerably in the recent years mainly due to remarkable increase in the prices of the burial ground, further deepening the shortage.\n\nThe sources said that around 10,000 graves were needed every year in the city in view of the death rate.\n\nA press statement said that Chief Secretary Syed Asif Hyder Shah while chairing a meeting on Thursday directed the commissioner to formally refer the matter to the revenue department for suitable land allocation for graveyards.\n\nThe meeting was attended among others by Senior Member Board of Revenue Baqaullah Unar, Additional Chief Secretary Home Muhammad Iqbal Memon and Commissioner Syed Hassan Naqvi.\n\nThe chief secretary also directed the city administration to ensure that all housing societies reserve spaces for graveyards in their master plans to accommodate future requirements.\n\nHighlighting the challenges posed by rapid urbanisation and population growth, he noted that existing burial grounds in the city were no longer sufficient, making this initiative crucial for the city’s long-term planning.\n\nThe chief secretary of Sindh also ordered all divisional commissioners to identify land for graveyards in other cities of the province. He reiterated the government’s commitment to urban planning that prioritises essential public services, ensuring that future infrastructure development meets the needs of citizens.\n\nIn addition, the meeting also addressed other key issues, including strengthening anti-smuggling efforts across the province.\n\nIt was decided that 13 anti-smuggling digital enforcement stations and 10 joint check posts would be established at strategic locations to curb smuggling activities.\n\nChief Secretary Sindh instructed the concerned authorities to swiftly identify and allocate land for these facilities. Furthermore, he directed authorities to take strict action against illegal encroachments on government land.\n\nHe also emphasised the need to reclaim state-owned properties and instructed relevant departments to accelerate anti-encroachment operations.\n\nPublished in Dawn, January 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:04:22.788Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888733/2500-acres-planned-for-new-graveyards-in-karachi",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T02:11:58.000Z"
}
