{
  "title": "Investigators seek to salvage aircraft after deadly Washington crash - World - DAWN.COM",
  "author": null,
  "content": "Investigators plan to push forward on Friday with efforts to retrieve the two aircraft involved in a crash in Washington that killed 67 people and raised questions about air safety in the US capital.\n\nFresh from recovering the so-called black boxes from the American Airlines plane that crashed into the Potomac River after colliding with an Army Black Hawk helicopter on Wednesday, divers aim to “salvage the aircraft” and find additional components on Friday, Washington’s fire department said.\n\n“Overnight, boats will remain on scene for security and surface searches from local, state, and federal regional partners,” it said.\n\nThe National Transportation Safety Board is studying the cockpit voice recorder and flight data recorder from the CRJ700 airplane, which carried 60 passengers and four crew members, all of whom perished in the crash. The three members of the helicopter crew also died.\n\nAuthorities have not pinpointed a reason for the collision, which happened as the regional jet was trying to land at Ronald Reagan Washington National Airport.\n\nThe military said the maximum altitude for the route the helicopter was taking was 200 feet (61 metres) but it may have been flying higher. The collision occurred at an altitude of around 300 feet, according to flight tracking website FlightRadar24.\n\nSenator Maria Cantwell, the top Democrat on the Senate Commerce Committee, questioned the safety of military and commercial flights separated by as little as 350ft (107m) vertically and horizontally. She also urged the government to reconsider allowing so many helicopter flights next to such a busy airport.\n\nRadio communications showed that air traffic controllers alerted the helicopter about the approaching jet and ordered it to change course.\n\nOne controller rather than two was handling local plane and helicopter traffic on Wednesday night at the airport, a situation deemed “not normal” but considered adequate for lower volumes of traffic, according to a person briefed on the matter.\n\nAmerican Airlines CEO Robert Isom said the pilot of the American Eagle Flight 5342 had about six years of flying experience. The Bombardier jet was operated by PSA Airlines, a regional subsidiary.\n\nDefence Secretary Pete Hegseth said the helicopter was flown by a “fairly experienced crew” of three soldiers who were wearing night-vision goggles on an annual training flight. Officials said they were grounding other flights from the Army unit involved in the crash and would reevaluate training exercises in the region.\n\nUS President Donald Trump suggested without evidence that diversity efforts championed by Democrats could have played a role. Trump, a Republican, has sought to do away with diversity, equity and inclusion (DEI) programmes since coming into office on Jan 20.\n\nHis comments drew criticism from Democrats.\n\nHow can he make these brash statements when an investigation is barely underway?“ said Rev Al Sharpton, president of the National Action Network civil rights group.\n\n“It doesn’t matter if these were DEI hires or Ivy League hires. What matters is the families who are grieving, who do not want to see this moment politicised by a president bent on peeling back DEI policies.”\n\nAmong the crash victims were people from Russia, China, Germany and the Philippines, including young figure skaters and people from Kansas, the state from which the passenger flight took off.\n\nVirginia Governor Glenn Youngkin told Reuters that more than half of the victims’ bodies had been recovered by Thursday. The airport is just across the river from Washington in Virginia.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/311847071abf756.jpg",
  "retrievedAt": "2025-08-26T08:03:06.479Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888835/investigators-seek-to-salvage-aircraft-after-deadly-washington-crash",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T09:23:42.000Z"
}
