{
  "title": "Dilemma of spin wickets - Newspaper - DAWN.COM",
  "author": null,
  "content": "A TEST match finishing in two-and-a-half to three days is not a good one to watch irrespective of whether or not your favourite wins. If we want 15 or 20 wickets falling every day, we have plenty of T20 and one-day cricket to watch.\n\nTest matches are about grit and craft in bowling, fielding and batting. They are about strategies and game plans. Draws might not be as much fun, but Test matches that stretch to the last afternoon, moving from one side to the other session to session, testing the skill, resilience and grit of all the players, are the ones that give the most satisfaction. It’s nice if your side wins, but the quality of the game matters too — in some cases, more.\n\nIn the recent Test series against the West Indies, Pakistan consistently prepared spin-friendly wickets, a trend that has sparked widespread debate among cricket enthusiasts and experts. While there may be strategic thinking behind these pitches, the costs often seem to outweigh the benefits. The question arises: what is the true purpose of preparing these spin-heavy tracks? We are not experts, but we watch Test cricket and it is as enthusiasts of the game that we are speaking here.\n\nWins are important. Rankings, too, are important. But at the cost of the game itself? That is hard to believe. Home series always give an advantage to the hosts. The players are used to the conditions and know the local pitches and grounds well.\n\nThe hosts can also build pitches that favour their strengths. But this last one should be dealt with carefully. We want our players to be able to play in all sorts of conditions, domestic and foreign, and to win in other countries and at tournaments held abroad too. If we push the home advantage beyond a point, we might win the local series but, at the same time, undermine development of local batting and bowling talent.\n\nPakistan’s cricket future is compromised when the focus remains on short-term success.\n\nOne of the major drawbacks of these spin-heavy tracks is the lack of practice they offer to Pakistan’s batters. The conditions rarely allow for the long, gruelling innings that are vital for developing resilience and technique. Batters often fail to experience the challenge posed by a variety of conditions, something that would better prepare them for tours to countries with more balanced or pace-friendly pitches.\n\nSimilarly, the focus on spin bowling on these pitches leaves fast bowlers sidelined and underutilised. Fast bowlers, who are crucial in international cricket, lose valuable match practice and rhythm in such conditions. Without preparation on pitches that demand skill across the full spectrum of bowling styles, our fast bowlers may struggle in international competitions where conditions are drastically different.\n\nAnother big issue with these spin-heavy pitches is the lack of engagement for cricket spectators. Fans of the game eagerly anticipate thrilling, hard-fought contests that last for days, but when a Test match ends prematurely without much resistance or competition, the excitement quickly fades. Test cricket’s drama and allure lie in the long battles, where patience, strategy, and skill come to the forefront. On extremely spin-friendly pitches, however, these elements are often lost, as matches end too quickly to build any real tension.\n\nFor fans, this quick turnaround does not just reduce the excitement but also undermines the spirit of Test cricket. Cricket is supposed to be a test of skill and adaptability, but when the matches end abruptly, it feels more like a scramble for short-term success rather than an opportunity to truly test and grow the players.\n\nIf you follow Test cricket, think about what moments have been memorable for you. For us, it was the Bishan Singh Bedi-led trip of the Indian team to Pakistan in the late 1970s and the opportunity to see Imran Khan, Zaheer Abbas, Kapil Dev, Sunil Gavaskar, and Gundappa Vishwanath in action.\n\nPakistan won the series 2-1, but it was the performances (we saw some live action at Gaddafi Stadium) that forms the fondest memories and not the series win. The same is true of a lot of Test cricket we have watched on television: Pakistan’s trips to the West Indies or England and the performances of Saeed Anwar, Javed Miandad, Wasim Raja, Wasim Akram and Waqar Younis, and so on.\n\nWhat is the long-term objective of preparing these spin-heavy wickets? Is it merely to secure short-term victories? The argument is also weak in that regard, especially when one considers Pakistan’s recent loss to West Indies on home soil in a Test match. If the ultimate aim is to win, these pitches do not seem to provide sustainable results. Without meaningful wins that push the team forward in ICC rankings, these victories are hollow.\n\nWhat’s worse is that Pakistan’s cricket future is compromised when the focus remains on short-term success rather than long-term development. By failing to prepare players for the challenges posed by various playing conditions around the world, we risk stunting their growth. It is not just the players who suffer; the wider cricket ecosystem — fans, coaching staff, and the broader development of the game — loses out too.\n\nIt is time for the Pakistan Cricket Board to reassess its strategy regarding pitch preparation. While preparing spin-friendly wickets has its place in certain contexts, it should not be the default approach. Balanced pitches that offer opportunities for both batters and bowlers (spinners and fast bowlers alike) should be the goal.\n\nThis balance would provide a more realistic challenge to players, help them hone their skills across a range of conditions, and ultimately prepare them for international tours where pitches are more varied. It would also lead to longer, more engaging matches, bringing back the thrill and drama that is central to Test cricket.\n\nEconomic interests as well as the spirit and reality of the game deserve better. Cricket fans deserve better. Players deserve better. And the future of Pakistan cricket deserves better. The time to change course is now.\n\nFaisal Bari is a senior research fellow at the Institute of Development and Economic Alternatives, and an associate professor of economics at Lums.\n\nSajid Maruf Khan is CFO and company secretary at IDEAS.\n\nPublished in Dawn, January 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:04:38.297Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888788/dilemma-of-spin-wickets",
  "dateList": "2025-01-31",
  "date_published": "2025-01-31T05:01:51.000Z"
}
