{
  "title": "6th int’l PATS Competition concludes at NCTC Pabbi",
  "link": "https://www.app.com.pk/national/6th-intl-pats-competition-concludes-at-nctc-pabbi/",
  "date_published": "2023-03-11T14:27:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 11 (APP): The 60 hours long arduous and rigorous 6th International Pakistan Army Team Spirit (PATS) Competition was concluded at the National Counter Terrorism Centre (NCTC), Pabbi with an impressive closing ceremony here on Saturday.\nChief of Army Staff (COAS) General Syed Asim Munir graced the occasion as the chief guest, Inter-Services Public Relations (ISPR) said.\nSome seven Pakistan Army teams, Pakistan Navy, and 10 international teams including Bahrain, Kingdom of Saudi Arabia (KSA), Morocco, Uzbekistan, Thailand, Jordan, United States of America (USA), Iraq, Kazakhstan and Qatar participated in the competition, while, teams of Azerbaijan, Canada, Gambia, Indonesia, Myanmar, Maldives, Senegal, Sudan, United Arab Emirates (UAE) and the United Kingdom (UK) participated as observers.\nThe competition continued day and night from 7-9 March in the mountainous and rugged terrain of Pabbi.\nOver the years, the competition has gained much popularity and has become an international team spirit evaluation event.\nWhile addressing the ceremony, the COAS appreciated the participating teams for their professionalism, endurance and high morale displayed during various stages of the exercise.\nThe COAS reiterated, “as a training exercise, PATS appropriately replicates the degree of emphasis given by all armies on physical fitness, combat skills and teamwork of their troops in the face of evolving character of warfare.\n“To this end, Pakistan Army upholds soldierly attributes of courage, mutual cooperation, resilience and competence which have been displayed during our ongoing fight against terrorism”.\nThe COAS also gave away prizes and medals to the participants of the competition. International observers and Defence Attaches of participating countries also attended the ceremony.",
  "retrievedAt": "2025-08-11T06:20:41.586Z"
}
