{
  "title": "NDMA sailed off another ship for Quake-hit Turkiye, Syria",
  "link": "https://www.app.com.pk/national/ndma-sailed-off-another-ship-for-quake-hit-turkiye-syria/",
  "date_published": "2023-03-11T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP): As part of continuous relief assistance on the Prime Minister’s directions, to Quake-affected people of Turkiye and Syria, the NDMA has sailed off another ship PNS Moawin with 550 tons of relief goods from Karachi on Saturday.\nChairman, National Disaster Management Authority (NDMA) Lt Gen Inam Haider Malik and Turkish Consul General Jamal Sangu and Commander Pakistan Fleet Rear Admiral Faisal Abbasi graced the departure ceremony of the Ship, a news release said.\nThe Turkish Consul General Jamal Sangu conveyed gratitude to Govt and people of Pakistan for extending humanitarian support in the aftermath of the deadly earthquake in his country.\nThe ship carrying 2625 family-sized fire resistant winterized tents & 38370 blankets making a total of 367 tons for quake-affected Turkiye, whereas 179 tons aid consisting of 22000 blankets, 144 tons of donations including essential items of daily use for Syria.\nNDMA coordinated Ship carrying aid for the two countries has departed today and would reach Mersin port Türkiye on 23 & Lattakia port Syria on 31 Mar 23. Earlier on 28 Feb NDMA sailed off 1st sea cargo of 1000 tons for both countries through PNS Nasr that will be received at destination in Syria on 13 Mar and 19/20 Mar in Turkiye.\nSo far NDMA has dispatched 2812 tons of relief assistance to both countries containing Winterized family tents, blankets, ration packs and other essential items.\nThe relief aid was sent off through all possible means of transportation which includes three C130 PAF aircrafts, one PAF IL 78, three Turkish Aircrafts, three PIA chartered flights in addition to 29 free belly space on regular flights, one NDMA chartered cargo, 21 NDMA hired NLC trucks, two Naval ships and containers on a civil ship.\nNDMA being the lead agency of Pakistan, is spearheading massive relief operations by using every possible available mean of transportation to maximize the assistance for brothers & sisters of affected countries.",
  "retrievedAt": "2025-08-11T06:20:38.768Z"
}
