{
  "title": "PM for enhanced agri production to attain food autarky",
  "link": "https://www.app.com.pk/national/pm-for-enhanced-agri-production-to-attain-food-autarky/",
  "date_published": "2023-03-11T11:21:00.000Z",
  "source": "APP",
  "content": "LAHORE, March 11 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday underlined the need for enhancing agriculture production for attaining the food autarky and thus saving the country from different economic issues.\nHe also directed for effective resolution of the issues by improving the supply of food grains and food chain to the public through a comprehensive mechanism.\nThe prime minister chaired a meeting to review progress on the ongoing reforms of the Agriculture Task Force and the upcoming cultivation of cotton, PM Office Media Wing said in a press release.\nDuring the meeting, the prime minister stressed upon early implementation of the agriculture reforms for increasing the agri-yield, besides making the federal and provincial agriculture research institutions more efficient.\nHe regretted that being an agricultural country, Pakistan had been importing agricultural commodities.\nThe meeting was attended by Minister for National Food Security Tariq Bashir Cheema, Minister for Trade Syed Naveed Qamar, PM’s advisor Ahad Cheema, PM’s Special Assistant Jehanzaib Khan, Punjab Chief Minister Syed Mohsin Naqvi and other relevant federal and provincial authorities.\nFor the production of cotton, the prime minister assigned the task of making it a profit earning produce by ensuring profit-based income to the cotton growers.\nHe also directed for a crackdown against sellers of fake pesticides with iron hands, besides initiating strict legal proceedings against the people involved in its sale.\nHe also asked for ensuring the provision of quality seeds to the farmers through a transparent and effective seed certification process.\nThe meeting was briefed about the projected overall production of cotton and the proposals about the support price.\nThe prime minister directed for implementation of immediate and long terms measures for increasing cotton production per acre.\nThe support price should be devised by keeping in view ratio, per acre cost and maximum profit to the farmers, he added.\nThe prime minister was also briefed about the functioning of the research entities and the seed certification mechanism.\nThe prime minister directed for a transparent and effective certification process and urged the provinces to play their role in this regard.",
  "retrievedAt": "2025-08-11T06:20:51.708Z"
}
