{
  "article_id": "2025-01-28_93d727f2e2124f778b8515f271f3ed3c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/hosting-icc-champions-trophy-an-honor-for-pakistan-tarar/",
    "retrieved_at": "2025-08-27T12:08:18.864Z"
  },
  "metadata": {
    "title": "Hosting ICC Champions Trophy an honor for Pakistan: Tarar",
    "author": null,
    "date_published": "2025-01-28T10:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 297,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 28 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar said on Tuesday that it was an honor for Pakistan that mega event of International Cricket Council's, Champion Trophy was being played in Pakistan. He said that it was good omen that after several years, mega events were being held in Pakistan. A mega sports event will be played in Pakistan after the Shanghai Cooperation Organization summit that held last year. The minister said that unfortunately in the past, sports fields in Pakistan presented a deserted look. He said that Pakistan Television was a national broadcaster, and ratings of PTV Sports have also increased in the recent past. To a question, he said the PTV made payments on time to acquire ICC telecast rights, all their conditions have been fulfilled and PTV will telecast all ICC matches. A good cricket experts panel including Shoaib Akhtar, Shoaib Malik and other stars will be brought on the PTV screen. He said that in the past, things were not right in the PTV Sports but now steps were taken to make it an up-to-date sports channel. The minister lamented that in the past, reforms were not carried out within PTV and there was no plan regarding ICC payments. \"Our efforts are to revive the PTV sports channel under a transparent system\", he maintained. He said a good online pension system has been introduced in Radio Pakistan to streamline its affairs. He said that the officers who identified ghost employees deserved appreciation as the public sector money has been saved by expelling ghost employees. He remarked that other institutions should also follow suit and work in an efficient manner. He promised that positive changes would be seen in both PTV and Radio Pakistan in coming days.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}