{
  "article_id": "2025-01-28_6a7aca7c15868ba978db7b9f506d9b00",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dg-pak-epa-calls-youth-for-taking-collective-action-at-caya-summit/",
    "retrieved_at": "2025-08-27T12:08:04.523Z"
  },
  "metadata": {
    "title": "DG Pak-EPA calls youth for taking collective action at CAYA Summit",
    "author": null,
    "date_published": "2025-01-28T11:31:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 285,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 28 (APP): Farzana Altaf Shah, Director General of the Pakistan Environmental Protection Agency (Pak-EPA), has called on the youth to take collective action to protect the environment and mitigate the escalating impacts of climate change. Speaking at the Commonwealth Asia Youth Alliance (CAYA) Summit 2025 on Tuesday, she emphasized the critical role of young people in driving sustainable change. \"We have high hopes from the younger generation. They show a genuine interest in safeguarding the environment,\" she said. Highlighting the pressing climate concerns, she revealed that Islamabad has not experienced rainfall in three months, which she attributed to the adverse effects of climate change. Reflecting on Islamabad's changing climate, Shah lamented the loss of the city's natural beauty. \"When I first came to Islamabad in 1991, it rained every week, and carrying an umbrella was essential. Today, we face an unprecedented situation where we are compelled to use air conditioners even in January,\" she said. She expressed concern over the deforestation in the capital, stating, \"By cutting down trees, we have turned Islamabad into a concrete jungle.\" Shah also warned of extreme heatwaves in the coming summer months and urged immediate and collective action to address the looming crisis. Despite the grim reality, Shah praised the youth for their enthusiasm and commitment to environmental protection, expressing hope that their efforts could reverse the damage. As part of its initiatives, Pak-EPA plans to collaborate with the Capital Development Authority (CDA) on a city-wide cleanliness campaign, which she announced during her address. The CAYA Summit 2025 served as a platform to engage youth in meaningful discussions about climate change, inspiring them to propose sustainable and actionable solutions to combat environmental challenges in Islamabad and beyond.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}