{
  "article_id": "2025-01-28_77384480c365f63067c6b245510ff70d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/workshop-on-positive-psychology-and-character-strengths-held-at-imcg-f-7-4-islamabad/",
    "retrieved_at": "2025-08-27T12:09:09.476Z"
  },
  "metadata": {
    "title": "Workshop on “Positive Psychology and Character Strengths” held at IMCG F-7/4 Islamabad",
    "author": null,
    "date_published": "2025-01-27T21:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 210,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 28 (APP):A workshop on the principles of \"Positive Psychology and Character Strengths\" was held at IMCG (PG-Margalla), F-7/4, on Monday. Dr. Fizza Sabir, an adjunct fellow at the University of Adelaide's School of Education, Australia, and an expert in teaching and research, led the session. The event spanning 2.5-hour began with a recitation of verses from the Quran, followed by a Naat and the National Anthem. Dr. Fizza Sabir introduced the principles of positive psychology and character strengths, focusing on their role in improving well-being and daily life. The participants engaged in interactive activities that helped them identify and reflect on their character strengths. The activities aimed to increase self-awareness and encourage practical applications of these strengths. The session included a question-and-answer segment, where attendees discussed concepts and clarified their understanding. Dr. Sabir responded to queries and shared insights from her academic and professional experiences. At the end of the workshop, the college principal, Ms. Ayesha Kayani, presented the college crest to Dr. Fizza Sabir as a gesture of appreciation. The event concluded with a note of thanks, acknowledging the effort and participation of everyone involved. The workshop saw active involvement from attendees and motivated them to explore ways to enhance their well-being by focusing on personal strengths.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}