{
  "article_id": "2025-01-28_5d1a6e6d21a0bfef9ea63965d776ceaf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kashmir-committee-urges-enthusiastic-observance-of-kashmir-solidarity-day/",
    "retrieved_at": "2025-08-27T12:09:11.330Z"
  },
  "metadata": {
    "title": "Kashmir Committee urges enthusiastic observance of Kashmir Solidarity Day",
    "author": null,
    "date_published": "2025-01-28T18:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 207,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 28 (APP):Chairman of the Parliamentary Committee on Kashmir, Rana Muhammad Qasim Noon, has called on media organizations, civil society, and relevant departments to celebrate Kashmir Solidarity Day on February 5 with full fervor to show unwavering support for the oppressed people of Indian-occupied Jammu and Kashmir. Presiding over a meeting of the Kashmir Committee on Tuesday to review preparations for the day, Noon announced that he would lead a Kashmir rally from Parliament House.. He said rally would include parliamentarians, members of the Azad Jammu and Kashmir Assembly, the Gilgit-Baltistan Assembly, and the Kashmir Council, along with representatives from all provinces, students, and media personnel. To engage youth and raise awareness about the Kashmir dispute, the committee urged educational institutions, including schools, colleges, and universities, to organize seminars and sessions highlighting the grave human rights violations and oppression inflicted by the Indian government. Reiterating the national stance on the issue, the committee declared, \"Kashmir is the jugular vein of Pakistan, and the country remains committed to highlighting the dispute on every global forum.\" The committee also announced plans to organize an international conference to comprehensively inform the global community about the atrocities, oppression, and excessive use of military force by Indian troops in the region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}