{
  "article_id": "2025-01-28_f4ba8b1cd0d654c861e7eee020d3ac24",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/caya-youth-summit-2025-kicks-off-youth-leaders-gather-in-islamabad/",
    "retrieved_at": "2025-08-27T12:08:35.832Z"
  },
  "metadata": {
    "title": "CAYA Youth Summit 2025 kicks off; Youth leaders gather in Islamabad",
    "author": null,
    "date_published": "2025-01-28T10:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 219,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 28 (APP):The Commonwealth Asia Youth Alliance (CAYA) 2025 Summit kicked off on Tuesday here at the Jinnah Convention Centre, focusing on youth empowerment, education, and skills development. The Prime Minister Muhammad Shehbaz Sharif was the chief guest of the inaugural session of the summit. The event commenced with the recitation from the Holy Quran, followed by the National Anthem of Pakistan. Speaking at the event, Chairman Prime Ministeras Youth Program (PMYP),A Rana Mashhood Ahmad Khan welcome the distinguished guests from 12 countries and also congratulated the 113 new members of the third batch of the Prime Minister National Youth Council (NYC). He shared that 49 boys, 49 girls, 02 transgenders and 13 candidates from overseas diaspora were selected through interviews conducted by a panel of professionals and leaders. To promote the rich heritage and scenic beauty of the country, a video on Pakistanas tourism potential was showcased in the event, captivating the audience with stunning visuals of the nationas diverse landscapes. A video message from the Commonwealth Secretary-General Patricia Scotland was also played, who acknowledged the government of Pakistanas strides in youth development and its significant contributions to the Commonwealth community. Earlier, the prime minister also administered the oath to the members of 3rd batch of National Youth Council and gave away awards to the high achievers.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}