{
  "title": "Pakistan’s journey of progress has resumed after PTI’s 4 years of halted development: PM",
  "link": "https://www.app.com.pk/national/pakistans-journey-of-progress-has-resumed-after-ptis-4-year-halt-of-development-pm/",
  "date_published": "2022-04-18T06:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP): Prime Minister Shehbaz Sharif on Monday said the journey of the progress of Pakistan had resumed after the four years of halted development during the tenure of Pakistan Tehreek-e-Insaf.\nAddressing here at the inauguration of the mass transit bus project on Peshawar More to Islamabad International Airport route, he said being the representative of the coalition government, he would ensure fast implementation of the delayed or suspended projects of public importance.\nThe Islamabad Metro Bus Service project, which was due to become operational by 2018, faced a massive delay by the previous government and was launched within five days after PM Shehbaz Sharif assumed his office.\nThe 25.6-kilometer bus route will benefit an estimated 50,000 commuters on daily basis.\nPM Shehbaz said the project was a gift from the then prime minister Nawaz Sharif to the people of Islamabad aimed at facilitating them through a decent transport service.\nHe regretted that the route plan of Islamabad was reduced abruptly to cut the cost from Rs 16 billion to Rs 12 billion, which he said, caused immense loss to the materialization of the project.\nHe said though the development funds were available to complete the public welfare projects during the tenure of Pakistan Tehreek-e-Insaf government, however, the will to serve the masses was lacking.\nPM Sharif mentioned that the Pakistan Muslim League government during the previous tenure had launched the mass transit projects in Lahore, Rawalpindi, and Multan.\nHe pointed out that the PTI government regrettably took stay orders from the courts to suspend the projects of public importance.\nHe said the Orange Line mass transit train, which was a gift from China, faced litigation by the PTI that caused its delay by over two years.\nHe said other than a few technical points regarding the survey of the Orange Line project, no trace of corruption was found by the courts.\nPM Shehbaz Sharif said during the PTI government, the national economy suffered immensely and even the defence expenditure was borne by the debt money.\nThe prime minister expressed gratitude to China and Turkey for contributing to the launch of public transport system in Pakistan.\nHe termed China a great friend that stood by Pakistan throughout history, adding that the Chinese leadership always supported Pakistan at all international forums.\nHe mentioned that China greatly contributed to strengthening Pakistan’s economy and expressed gratitude to Chinese President Xi Jinping for China Pakistan Economic Corridor (CPEC) as a game-changer for the country.\nHe urged China to also support Pakistan in the launch of Karachi Circular Railway for the benefit of the people of the metropolitan.\nPM Sharif thanked Turkey for supporting Pakistan since its establishment and recalled that the Muslims of the sub-continent had also supported the cause of freedom of Turkey.\nHe said Turkish President Recep Tayyip Erdogan was a leader with a vision and stood by Pakistan during various challenges.\nShehbaz Sharif said 15 buses would be taken from Punjab Mass Transit Authority, Rawalpindi for an interim period till the new fleet was added to Islamabad metro service.\nHe announced a free-of-cost metro bus service for passengers during the holy month of Ramazan.\nChairman Capital Development Authority Engineer Farkhand Iqbal said on instructions of PM Shehbaz Sharif, the CDA and National Highway had made possible the launch of the project within five days.\nHe said 15 buses with orange skin would be run on the route in collaboration with a Turkish company, besides the four buses as the airport shuttle.\nHe said the ticketing system of the metro bus had been completed, however, would be opened with the approval of the prime minister.\nHe said a mobile application was being launched for easy access to the buses coming after every five minutes and the shuttle by every 25 minutes. The blue line bus will be initiated in near future on the Rawat-Islamabad Airport route.\nLater, PM Shehbaz Sharif took a ride of the bus on the inaugurated route flanked by Turkish ambassador Mustafa Yardakul, Chinese Charge d’Affaires Pang Chunxue, and parliamentarians including Mohsin Dawar, Ali Wazir, Marriyum Aurangzeb, Hanif Abbasi, and others.\nThe Islamabad metro bus will be covered in orange skin for route coding. The NHA to N5 station will take 6-8 minutes and from N5 to the airport around 25-30 minutes. The shuttle service will be run on a stretch of 11 kilometres.",
  "retrievedAt": "2025-08-11T14:43:16.897Z"
}
