{
  "title": "Pakistan strongly condemns recent Islamophobic incidents in Sweden, Netherlands",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-recent-islamophobic-incidents-in-sweden-netherlands/",
  "date_published": "2022-04-18T17:24:00.000Z",
  "source": "APP",
  "content": "Pakistan also strongly condemned the offensive remarks made by a Dutch politician, attacking Islam and the Muslim holy month of Ramadan.\nA Foreign Office spokesperson in a statement, he said, “these mindless provocative Islamophobic incidents serve no purpose other than hurting the sensitivities of over 1.5 billion Muslims living all over the world. Such actions are not covered under legitimate expressions of the right to freedom of expression or opinion, which carry responsibilities under international human rights law, such as the obligation not to carry out hate speech and incite people to violence.”\nMuslims, including in Pakistan, unequivocally condemn the practice of insulting Islam, Christianity and Judaism alike, and stand against all acts of violence on the basis of religion or belief. These principles must be equally respected and supported by all, he added.\n“The international community needs to show a common resolve against xenophobia, intolerance and incitement to violence on the basis of religion or belief, and work together for promoting inter-faith harmony and peaceful co-existence.That has been the spirit behind the OIC’s recent initiative led by Pakistan at the UN General Assembly to designate 15 March as the International Day to Combat Islamophobia.”\n“Pakistan’s concerns have been conveyed to the authorities in Sweden and The Netherlands. They have been urged to take cognizance of the sentiments of the people of Pakistan and the Muslims worldwide and take steps to prevent Islamophobic incidents,” he said adding, “We call on the international community to demonstrate solidarity and commitment to the ideals of building peaceful and harmonious societies for the betterment of humanity.”",
  "retrievedAt": "2025-08-11T14:43:07.864Z"
}
