{
  "title": "People prudent enough to opt for Pakistan’s well-wishers: Marriyum",
  "link": "https://www.app.com.pk/national/people-prudent-enough-to-opt-for-pakistans-well-wishers-marriyum/",
  "date_published": "2022-04-18T16:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP): Pakistan Muslim League-Nawaz (PML-N) Spokesperson Marriyum Aurangzeb Monday said the nation had to decide whether they wanted to stand by those who were meticulously pursuing the agenda of development and prosperity, or to be misled by the propaganda of Pakistan Tehreek-e-Insaf Chairman Imran Khan.\nShe expressed the optimism that the people were prudent enough to finally opt for the well-wishers of Pakistan.\nAddressing a press conference, she said for the last four years, the people were made to believe fake development and progress at the cost of public money. “Fake papers were waved in the Press Information Department (PID), whereas the former prime minister kept on leveling allegations against political opponents on daily basis,” she added.\nThe nation, she said, would soon know about the flawed policies of PTI government that did great harm to the country. High inflation, unemployment, ruined economy, mishandling of the Kashmir issue, and foreign policy misadventure were the hallmarks of the last four years, she lamented.\nMarriyum said Imran Khan started to target state institutions in a bid to cover up his sheer incompetence and lackluster performance. He even did not spare the judges who had exposed his unconstitutional moves.\nThe PTI, she said, would soon start crying foul about yet another ‘conspiracy’ as the Election Commission of Pakistan (ECP) had been directed by the Islamabad High Court (IHC) to conclude the foreign funding case against the PTI chairman within 30 days.\nFor the specific reason, Imran Khan told journalists that a reference would be filed against the Chief Election Commissioner, she added.\nThe PML-N leader said for eight years, ugly tactics were employed to hamper the foreign funding case proceedings. The PTI did receive funding from 16 foreign accounts of companies and individuals from Dubai, the United Kingdom, Canada, Finland, Norway, Australia, and other European and Middle Eastern countries. An Indian citizen Romita Shetty was also among the PTI’s financiers, Marriyum said.\nThe State Bank of Pakistan (SBP) had already pinpointed all the details even during Imran Khan’s tenure, she added.\nShe said PTI leader Asad Umar had also filed a petition in the Islamabad High Court that the foreign funding details should not be made public and the main petitioner in the case, Akbar S. Babar, should not be given access to the record. However, the court dismissed the plea and directed the Election Commission to decide the case within 30 days, which had been pending for eight years.\nShe said a party and its leadership would have to be made accountable for any foreign funding. The PTI was already creating hype over a ‘conspiracy’ launched against its government by the United States, and it would jump on another ‘conspiracy’ against Imran Khan through the ECP, she added.\nThe PTI, however, never declared the funds it had received either from foreigners or Pakistani nationals, Marriyum said.\nThe PML-N leader said Imran Khan had deceived the overseas Pakistanis in the name of charity as their donations were used for party politics. He even did not spare the donations received for his cancer hospital. He even received funding from Canada and New Zealand as well, but did not declare the funding from 88 people in the 349 Canadian and New Zealander companies, she further said.\nFrom all these accounts, USD 73.23 million, and PKR 852 million were deposited to Imran Khan’s personal accounts and were never declared, Marriyum said.\nAccording to the SBP data, seven accounts were not declared in 2008 and 2009 whereas only two accounts were declared in 2009 and 2010, she added.\nIn 2010-11, she said, 13 accounts were not declared; in 2011-12, 14 accounts were hidden and only two were declared; and in 2012-13, 14 accounts were undeclared and only four were declared. All the foreign funding came into those accounts whichamounted to 7 million dollars, which was never declared, said Marriyum.\nSimilarly, she said, Imran Khan retained Toshakhana gifts worth Rs 140 million by paying only Rs 30 million. In 2018, one had to submit 50% of the total value of the gifts, but Imran Khan formed a committee by himself to cut the share from 50% to 20%, Marriyum remarked.\nThe PML-N spokesperson concluded by saying that Imran Khan deemed that the people were too simplistic to figure out his corruption. “Solid evidence against Imran Khan is available and he will face the music for misdeeds and corrupt practices,” conduct.”",
  "retrievedAt": "2025-08-11T14:43:07.904Z"
}
