{
  "article_id": "2025-07-02_74f3c6c3fd52e39311f18a8af2d19276",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/qalam-karwan-holds-literary-session-on-topic-deen-panah-ast-hussain/",
    "retrieved_at": "2025-08-27T09:11:36.747Z"
  },
  "metadata": {
    "title": "Qalam Karwan holds literary session on topic “Deen Panah Ast Hussain”",
    "author": null,
    "date_published": "2025-07-02T18:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 225,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 02 (APP): Qalam Karwan, a literary organization, conducted a literary session on the topic \"Deen Panah Ast Hussain\" (Hussain is the refugee of religion) on Wednesday. The session was presided over by renowned historian Professor Aftab Hayat. Senior jurist, author, researcher, and poet Sajid Hussain Malik delivered the keynote address. He focused on the practical aspects of the Tragedy of Karbala. The distinguished speaker began by briefly narrating the incident of Karbala, highlighting the virtues of the Ahl-e-Bait (the family of the Prophet), reciting praises for Imam Hussain, and discussing the importance and greatness of martyrdom. He emphasized that Imam Hussain, along with his family, made a supreme sacrifice to ensure that the true and pure message of Islam remained alive and radiant. Speaking about the women of the Ahl-e-Bait, he remarked that despite the enormity of the tragedy, their voices were never heard outside their tents, and even the sacred hair on their blessed heads remained unseen. Toward the end of his presentation, Mr. Malik drew a parallel between the events of Karbala and the current situation in Gaza, stating: \"Today's Gaza is also a Karbala, and Islam is revived after every Karbala.\" Prominent writers from Islamabad and Rawalpindi participated in the session. A question-and-answer segment followed, during which participants shared their thoughts and reflections. The session concluded with the presidential address.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}