{
  "article_id": "2025-07-02_1360ba400e0e86fda0974dc7bbe4e55b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-applauds-record-42-tax-revenue-surge-directs-swift-implementation-of-economic-reforms/",
    "retrieved_at": "2025-08-27T09:11:12.392Z"
  },
  "metadata": {
    "title": "PM Shehbaz applauds record 42% tax revenue surge, directs swift implementation of economic reforms",
    "author": null,
    "date_published": "2025-07-02T08:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 374,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 02 (APP):Prime Minister Muhammad Shehbaz Sharif on Wednesday applauded the Ministry of Finance and the Federal Board of Revenue (FBR) for achieving a historic 42% increase in federal tax revenues during the fiscal year 2024-25 a the highest surge in the past decade. The prime minister chaired a high-level weekly review meeting on the digitization and reform agenda of the Federal Board of Revenue (FBR), whereas during the briefing, it was revealed that reforms and enforcement of new tax laws enabled the government to collect an additional Rs 865 billion in revenues compared to the previous year, an eightfold increase. The federal revenue-to-GDP ratio also improved significantly, reaching 11.3 per cent, a 1.5 per cent rise over last year. Prime Minister Shehbaz Sharif emphasized that no institutional complacency will be tolerated in achieving revenue targets and other economic goals for the new fiscal year. aAll departments must work with complete dedication,a he said, reaffirming his personal oversight of all stages of revenue collection and economic target implementation. He instructed FBR to treat taxpayers with dignity and respect and called upon all public sector institutions to extend full cooperation with the revenue authority. The prime minister also stressed the need to broaden the tax net through digitalization and enforcement. PM Sharif also issued key directives including expansion of the Track and Trace Digital Production System to cover all stages of production and distribution in order to bring untaxed production into the tax net, mandatory digitization of production processes for tax non-compliant businesses and industries, widening the Point of Sale (POS) system in the retail sector to strengthen documentation and transparency and ensuring business facilitation by keeping FBR accessible to the business community and taxpayers. The Prime Minister congratulated the meeting participants on the successful passage of the upcoming fiscal yearas budget and reiterated the governmentas unwavering commitment to ensuring Pakistanas bright economic future. It was informed during the briefing that the Track and Trace system has already been fully implemented in sugar, tobacco, and fertilizer sectors, and will soon be expanded to cement and other industries. The meeting was attended by Federal Minister for Information and Broadcasting Attaullah Tarar, Federal Minister for Law Azam Nazeer Tarar, FBR Chairman, and other senior government officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}