{
  "article_id": "2025-07-02_d7df09ddb3ef213dcf0cb85b5cb5c065",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ipri-holds-conference-on-pakistan-a-bulwark-against-terrorism/",
    "retrieved_at": "2025-08-27T09:11:32.750Z"
  },
  "metadata": {
    "title": "IPRI holds conference on Pakistan: A bulwark against terrorism",
    "author": null,
    "date_published": "2025-07-02T18:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 795,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 2 (APP): Islamabad Policy Research Institute (IPRI) on Wednesday hosted an International Conference titled, 'Pakistan: A Bulwark against Terrorism', and was addressed by former foreign minister and PPP chairman Bilawal Bhutto Zardari, who offered an olive branch to India, calling upon it to exhibit sagacity and talk it out with Pakistan. He said that Pakistan has come a long way, and has defeated terrorism at home, apart from being a genuine and instrumental partner in fighting the war on terrorism in the region. Bilawal said that with more than 90,000 civil and military casualties in the last two decades, and a collateral economic damage of more than $100 billion, it's time for the world to recognize Pakistan's sacrifices, and not to shun its utility. The conference was opened by President IPRI Lt Gen (retd) Majid Ehsan who outlined the need and necessity of flagging Pakistan's meticulous role in fighting terrorism, and outlined the way to go by working on a host of realms that come to integrate policymakers and those fighting this faceless war for a comprehensive success. The conference had two exclusive sessions, and was participated by policymakers, civil-military experts, foreign envoys and academics. Those who spoke on the occasion included: Lt Gen Nasir Khan Janjua (Retd), former National Security Advisor; Dr Khalid Chauhan, PEV NACTA; Brig Dr Raashid Wali Janjua (Retd), Director Research & Analysis, IPRI; Dr Aneel Salman, Chair Economy IPRI and OGDCL; Dr Syed Kaleem Imam, former IGP Sindh and Islamabad; Dr Huma Baqai, Rector, MiTE Karachi; Amb. Nabeel Munir of MOFA and former envoy to UN; Cheng Xizhong, Executive Adviser of Charhar Institute, China; Steve Breyman, Professor Emeritus, Rensselaer University, USA; and Matt Cannell, UK Deputy High Commissioner to Pakistan. Earlier, Bilawal called upon New Delhi to forge a partnership to pursue peace, so that both the countries can jointly combat terrorism. He stressed that as neighbours there is a shared moral and civilisational obligation to save a billion souls from the plague of extremism. \"All it requires from India's leadership is to step down from the high horse heading in the abyss and pursue peace with Pakistan.\" He stressed the need for resolving the Kashmir dispute, and was categorical in saying that it's time for India to end this new strategy of weaponizing water, and instead build peace as mighty as the Himalayas. He also deliberated over the threat of \"digital propaganda\" in counter extremism, and said that no stone will be left unturned in prosecuting those who use religion as a means to further terrorism, and opt for cybercrimes. He enthralled by saying that there is there is not a word as 'surrender' in Pakistan's dictionary,\" as the armed forces backed by iron willed citizens have broken the backs of Al Qaeda networks, dismantled so-called caliphates such as Daesh, and driven the TTP from the fortress to the fox hills. He said Operation Zarb-e-Azab drained the northern swamp, Raddul Fassad uprooted the sleeper cells in our cities and elsewhere. Today operations in Balochistan sever the connection between separatism and foreign funded terror. The PPP chairman said, \"It is time India recognize this transformation, not as a concession but as an opportunity. Terrorism is a collective menace. No border fence, no nationalist rhetoric, no regional hegemony can shield one nation from a fire it may have helped light on the other side.\" He urged the Taliban dispensation to fulfil its commitments under the Doha Agreement to undo regional instability. In the two following sessions, the discourse was a lively discussion by the audience on Pakistan's fight against the terrorism issue since the late seventies when Afghan irredentism and later the political destabilization resulted in acts of terror in Pakistan. After the US invasion of Afghanistan in 2001, when Pakistan offered support to the US led international coalition in accordance with the UN resolutions, another torrid phase in Pakistan's encounter with terrorism commenced. The discourse highlighted that Pakistan suffered over 90,000 civil and military casualties between 2001 and 2024 while its armed forces killed around 36,000 terrorists in the same timeframe. Notable counter terrorism operations between 2002 to 2024 include Operation Al-Mizan, Operation Rah-e-Haq, Operation Rah-e-Rast, Operation Zarb-e-Azb, Operation Radd-ul-Fasaad, and Operation Azm-e-Istehkam. Pakistan is also grappling with an externally abetted variant of terrorism by ethno-racial entities like BLA and BLF in Balochistan. The launch of CPEC gave impetus to entities like TTP and BLA that have a common agenda that takes inspiration from selfish pecuniary motives sometimes exploiting religious sentiments and sometimes socio-economic grievances. The US withdrawal and the induction of Afghan Interim Government, which has not been able to rein in the terrorist entities and transnational terrorist groups like Al Qaeda, ISKP, and ETIM operating from Afghan soil, was flagged as the main source of instability.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}