{
  "title": "Gender gap in start-up funding quiet prominent in Pakistani ecosystem: Amin-Ul-Haque",
  "link": "https://www.app.com.pk/national/gender-gap-in-start-up-funding-quiet-prominent-in-pakistani-ecosystem-amin-ul-haque/",
  "date_published": "2022-05-09T15:30:00.000Z",
  "source": "APP",
  "content": "The MOITT and its Tech Innovation Arm Ignite has recently launched Pakistan’s First National Investment Platform called PakImpactinvest, the minister said this while speaking in an event titled Accelerator Program for Women Entrepreneurs.\nAccording to this Program the 9 women entrepreneurs are set to leave for the USA on May 10, 2022 for eight weeks.\nThe Program was launched by The Indus Entrepreneurs Islamabad office (TiE Islamabad) in partnership with the US Embassy for Women Entrepreneurs which not only provides growth stage start-ups with necessary tools, coaching and mentoring, but it also provides its women entrepreneurs with access to global investors and venture capitalists.\nThe core program revolves around networking, mentoring and investor engagements in leading US ecosystems like San Francisco, Austin, Seattle, Boston, Washington DC and New York.\nHe said COVID-19 was a catalyst for the start-up landscape in Pakistan, which saw Investments rise from $65 million in 2020 to $350 million in 2021. Extended lockdown and quarantines provided entrepreneurs the opportunity to create digital products with human impacts.\nSyed Amin-Ul-Haque said that the Government has allowed holding shares for start-ups to be outside Pakistan, thus helping to push foreign investments.\nHe said the gender gap in start-up funding is quiet prominent in the Pakistani ecosystem.According to 2018-19 deal flow figures, of the funding raised by female-led companies, 63% was via angel investment and 25% was from development programs (donors/Grants).\n“I am sure that this initiative will bridge the gap in an efficient manner. Furthermore, there is a dire need to increase the overall funnel of women-led companies, whether by encouraging Incubators and accelerators to actively seek more female founders for their programs or providing more hands-on support to women-led companies at the early stages and improving their access to investors operating post-seed stage”, the minister said.\nSyed Amin-Ul-Haque apprised the TiE Islamabad about the Accelerator Program for Women Entrepreneurs funded by the US State Department to address this gap through its innovative design and experimental learning platform which will provide this group of women entrepreneurs with access to international incubators and foreign investors.“I am particularly excited about the role the Pakistani diaspora in the US will play in supporting our women-led enterprises”, he added.\nIt’s worth mentioning here that TiE having its roots in Silicon Valley with extensive network of partners in US and Pakistan is ideally placed to provide the much needed international exposure and linkages to this group of women entrepreneurs.\nOn this occasion the Minister Counselor for Public Affairs at the U.S. Embassy, Raymond Castillo said: “We at the United States Embassy have been impressed by the commitment to excellence that all of the original 500 applicants showed throughout the virtual program. These efforts will lead to a brighter future for Pakistan and the world. As the finalists here today, you should be extremely proud. Your persistence has paid off, and you will now represent Pakistan in the United States. You are the future women entrepreneurs of Pakistan.”\nThe Accelerator Program for Women Entrepreneurs, a TiE training program and competition for women entrepreneurs that is funded by the U.S. Embassy Islamabad, is an innovative program to connect women-owned Pakistani start-ups with American business tools, coaching and mentoring.\nThe program received an overwhelming response from 450 women led businesses. Later, 75 shortlisted start-ups went through a rigorous process of mentoring workshops and pitching competitions from which the top 12 start-ups were selected for a 15-week Founders Institute Acceleration Program.\nDuring the trip, the women entrepreneurs will be given an opportunity to attend major conferences and participate in exposure visits to Microsoft, Amazon, Facebook, Twitter and PayPal’s offices. Learning visits to local US based incubators such as, 9 Mile Labs, Kiwi Tech, Angel Pad and Alchemist will also be carried out.\nThe participants will be provided with multiple networking opportunities throughout the eight-week period and will be pitching to selected US based investors present in both the east and the west coast.\nLaunched in 2008, TiE Islamabad is a leading driver of the entrepreneurial ecosystem in Pakistan.\nTiE was founded in Silicon Valley by a group of successful entrepreneurs, corporate executives, and senior professionals and has since evolved into one of the largest global organizations with the mission of fostering entrepreneurship.\nThere are currently nearly 11,200 members, including over 2,860 charter members in 57 affiliate chapters across 14 countries. TiE Islamabad operates Pakistan’s only self-sustainable co-working space for women.\nThe ceremony was attended by senior officials from Ministry of IT and Telecom, Raymond Castillo, Minister Counsellor for Public Affairs, Paul Giblin, Public Diplomacy Officer and other officials from the US Embassy and TiE Islamabad.",
  "retrievedAt": "2025-08-11T14:50:50.076Z"
}
