{
  "title": "ECC direct USC to sell commodities at Ramzan relief package",
  "link": "https://www.app.com.pk/national/ecc-direct-usc-to-sell-commodities-at-ramzan-relief-package/",
  "date_published": "2022-05-09T18:36:00.000Z",
  "source": "APP",
  "content": "On a summary submitted by Ministry of Industries and Production on continuation of Prime Minister’s Relief Package 2020 for the months of May and June, 2022 it was decided that because there is already stock available at the USC for selling the commodities at cheaper rate of Ramzan relief package, said a press release issed here.\nFederal Minister for Finance and Revenue Mr. Miftah Ismail presided over the meeting of Economic Coordination Committee (ECC) of the Cabinet.\nFederal Minister for Commerce Syed Naveed Qamar, Federal Minister for Planning, Development and Special Initiatives ?Ahsan Iqbal Chaudhary, Federal Minister for Industries and Production Syed Murtaza Mahmud, Minister of State for Finance and Revenue Dr. Aisha Ghous Pasha, Minister of State for Petroleum Mr. Musadik Masood Malik, Federal secretaries and senior officers attended the meeting.\nMinistry of Industries and Production submitted a summary on revision of the prices of Atta and Sugar under the Ramzan Relief Package-2022.\nIn order to provide continuous relief to the lower strata of the society from global inflationary pressure, the ECC granted approval to revision of prices of Atta and Sugar from Rs. 950/20 kg to Rs. 800/20 Kg, Rs. 85/kg to Rs. 70/kg respectively and also ordered that discount of Rs 190/kg on vegetable ghee will be continued.\nGovernment will continue to absorb the cost of subsidy for the benefit of common man.Ministry of National Food Security and Research tabled a summary for procurement of additional quantity of Wheat for PASSCO and Punjab Food Department with cash credit limits to build up strategic reserves and to stabilize local wheat market.\nPASSCO and Punjab have met their wheat procurement targets of 1.20 MMT and 3.5 MMT respectively on 30-04-2022.\nThe Chair allowed PASSCO to procure an additional quantity of 0.50 MMT with the CCL of Rs. 28.50 billion and permitted Punjab Food Department to procure additional quantity of 1.00 MMT with the CCL of Rs. 145.50 billion in the wake of low production of wheat in the country due to previous government’s failure to provide fertilizers to the growers on time.\nFurther, the Chair said that Sindh government will be allowed to procure additional quantity of Wheat, once it meets the current procurement target.\nOn another summary submitted by Ministry of National Food Security and Research, the ECC considering the current world scenario, its effects on the world economy and demand-supply situation of wheat in the country, approved 3.00 MMT of wheat import on need basis, depending upon the demand of the PASSCO and provincial governments to build up strategic reserves and to stabilize wheat prices in the country.\nThe Finance Minister further directed the concerned authorities to frame modalities for financing and procurement.\nThe ECC deferred a summary for Supplementary Grant for Wafaqi Mohtasib Secretariat.",
  "retrievedAt": "2025-08-11T14:50:33.920Z"
}
