{
  "title": "PMLN parliamentary party appreciates PM for providing relief to people from price hikes",
  "link": "https://www.app.com.pk/national/pmln-parliamentary-party-appreciates-pm-for-providing-relief-to-people-from-price-hikes/",
  "date_published": "2022-05-09T16:51:00.000Z",
  "source": "APP",
  "content": "Prime Minister Shehbaz Sharif here on Monday chaired the meeting of the parliamentary party which endorsed the agenda and measures of the government formed after his election on April 11.\nIt was declared in the meeting that the democratic and people-friendly government gave relief to the people affected by the worst inflation and effectively brought down prices of flour, sugar, and ghee. The party appreciated Khadim e Pakistan and his team for their efforts.\nThe legislators said the people for four years faced a dark period during which they suffered from price hikes.\nIt was a challenge to give economic relief in the current difficult economic environment. The participants lauded the courageous step of the Prime Minister for not putting an additional burden on people despite the increase in the prices of petroleum products in the international market.\nThe parliamentarians stressed on the coalition government to make further efforts to provide relief and facilitate the people.\nThe meeting condemned in strong words the conspiracy by the previous government against the revival of the economy, constitution, judiciary and national institutions and stressed on Prime Minister Pakistan to tackle with force those who were violating the constitution.\nThey demanded of the Prime Minister to take immediate legal measures and show zero tolerance against the former undemocratic prime minister for his attacks on the constitution and judiciary and other national institutions.\nThe parliamentary party vowed to fully back the steps taken to support the constitution, judiciary, and national institutions as it was demand of the constitution that the constitution should be implemented, and punishment for any transgression was also proposed in the constitution.\nIt was the responsibility of the government formed under the constitution that enforcement and protection of the constitution should be ensured and those who were hatching conspiracy should be brought to justice under the constitution, they added.\nThe meeting declared that the former undemocratic and violator of the constitution prime minister was only targeting the institutions including the judiciary and Election Commission because these were following the constitution.\nA condemnable and nefarious attempt was made to divide the institution which was an anti-country thought to endanger the national interests of a nuclear state. The economy and national interests of Pakistan could not afford chaos, disorder and bloodshed in the country.",
  "retrievedAt": "2025-08-11T14:50:39.829Z"
}
