{
  "title": "PKIC, Enertech Kuwait sign agreement worth US$ 750 mln",
  "link": "https://www.app.com.pk/national/pkic-enertech-kuwait-sign-agreement-worth-us-750-mln/",
  "date_published": "2022-05-09T17:05:00.000Z",
  "source": "APP",
  "content": "Embarking on this journey of alliance with this agreement, both PKIC and Enertech have paved the way for future projects to support infrastructure development in Pakistan, said a news release issued here on Monday.\nIn addition, this shall enable advancement in the digital and technology space in tandem with supporting financial inclusion and gender diversity. This alliance would not only bring foreign investment in Pakistan, but shall also support technology and knowledge spill over.\nThe agreement was inked by Mohammad Al Fares, Chairman PKIC and Abdullah Al Mutairi, CEO Enertech.\nAddressing the signing ceremony, Mohammad Al Fares, Chairman PKIC said: “PKIC has a firm desire to support all important sectors of the economy. The strategic alliance with Enertech, will help identify, invest and materialize viable investment opportunities in Pakistan where both PKIC and Enertech would benefit from individual capabilities and knowledge structure of each other.”\nSpeaking on the landmark initiative, MD PKIC Mubashar Maqbool expressed his elation: “We have cemented this collaboration to support priority sectors of the economy including infrastructure, power, technology, housing and tourism with an objective to socially uplift the poor. This strategic alliance would also bring in much needed foreign investment into Pakistan”.\nYasser Malik, CEO Enertech Pakistan, emphasized that these projects would be critical to energy security and sustainability in Pakistan.\nPreviously, PKIC also collaborated with Meezan Bank Limited to design a Sukuk as a quasi-equity instrument to finance the local equity requirement of a 61-kilometer water pipeline to deliver water to coal plants, being developed by Enertech in Thar, Sindh. This transaction, structured for Enertech, received two prestigious awards including ‘Pakistan Deal of the Year’ and ‘Most innovative Deal of the Year’ by Islamic Finance News (IFN) based in Malaysia.",
  "retrievedAt": "2025-08-11T14:50:37.367Z"
}
