{
  "title": "NA unanimously condemns Imran’s malicious campaign against state institutions",
  "link": "https://www.app.com.pk/national/na-condemns-imran-for-maligning-state-institutions-in-abbottabad/",
  "date_published": "2022-05-09T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 09 (APP):The National Assembly on Monday unanimously passed a resolution condemning malicious campaign against the state institutions by Pakistan Tehreek-e-Insaf Chairman Imran Khan.\nThe resolution, moved by Minister for Parliamentary Affairs Murtaza Javed Abbasi, said the national institutions were the guarantor of country’s security and sovereignty.\nThe House strongly condemned the recent statement by PTI Chairman and former Prime Minister of Pakistan in which he twisted historical facts giving an impression that the armed forces were conspiring against the country.\n“Pakistan’s security forces are defending our borders fearlessly and have given countless sacrifices while defending the country against the scourge of terrorism. Any attempt to malign the state institutions for political gains as a dis-service to Pakistan,” the resolution added.\nEarlier, the members of National Assembly strongly condemned Imran Khan for maligning state institutions while addressing a public meeting in Abbottabad the other day. They resolved that no one would be allowed to malign state institutions for political gains.\nSoon after the speech of Prime Minister Shehbaz Sharif, Speaker Raja Pervaiz Ashraf observed that any such attack on the state and security institutions launched with the purpose to weaken them was against the national interests.\n“Whosoever utters such words, he/she negates the national interest. Our Constitution does allow anyone to launch such attacks on the armed forces or the judiciary.”\nMinister for Defence Khawaja Muhammad Asif said the words uttered by the Pakistan Tehreek-e-Insaf chairman at the public meetings against the armed forces were extremely regrettable.\nHe said the armed forces of Pakistan are the guarantors of country’s security, while Imran Khan is trying to create differences among the state institutions.\nThe defence minister said Imran Khan had nothing good on his credit to convince the people to support him. He said the former prime minister was making a futile effort to save his politics by using religious and anti-American cards.\nTerming Imran Khan in the present scenario “Mir Jaffar and Mir Sadiq”, he said the PTI chairman was in the pain as all the state institutions were working within their constitution ambit.\nRecently, Khawaja Asif said, political parties in the National Assembly brought an in-house change through a constitutional way, passing a no-confidence motion against Imran Khan.\nHe said there should be a national consensus to defend the state institutions so that no one could dare to malign them. “Abuse of national institutions will not be tolerated,” he added.\nThe defence minister declared Imran Khan a security risk for the country. Former ministers and close aides of the former prime minister committed massive corruption, he added.\nHe said the Parliament was the mother of democracy and it was a constitutional obligation of the whole nation to defend the state institutions.\nKhawaja Asif said the past regime of PTI had ruined the national economy that caused unprecedented price hike of edible items, and now it was a collective responsibility of the coalition government to take required steps for providing instant relief to the common people and giving boost to economic activities in the country.\nThe House also passed another resolution to establish a task force under Dr Ramesh Kumar about implementation of the Supreme Court’s decisions regarding minorities’ rights.",
  "retrievedAt": "2025-08-11T14:50:23.032Z"
}
