{
  "title": "Pakistan committed to further strengthen its all-weather strategic ties with China: Bilawal",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-further-strengthen-its-all-weather-ties-with-china-bilawal/",
  "date_published": "2022-05-09T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 9 (APP): Foreign Minister Bilawal Bhutto Zardari on Monday reaffirmed Pakistan’s resolve to further strengthen its All-Weather Strategic Cooperative Partnership with China, including through the rapid implementation of China-Pakistan Economic Corridor (CPEC), a flagship project of the Belt and Road Initiative (BRI).\nPakistan will continue its efforts to enhance cooperation with China through CPEC, to advance its national implementation of Sustainable Development Goals (SDGs), in addition to participating actively in the work of the Global Development Initiative (GDI) Group of Friends to promote the common aspiration of a peaceful, prosperous and shared future for all mankind, he added.\nThe Foreign Minister was addressing the High-Level Meeting of the Group of Friends of GDI, held in virtual format in New York.\nIn his video address, Bilawal Bhutto Zardari appreciated China’s initiative to launch GDI and termed it a useful platform to accelerate and coordinate efforts for implementing the globally agreed SDGs, a press release by the Ministry of Foreign Affairs here said.\nRecalling the multiple crises posed by the COVID-19 pandemic, climate change and geo-political developments, with disproportionate and devastating impacts on the Global South, he expressed deep concern over the reversal of progress in the implementation of SDGs.\nHe urged the GDI Group of Friends to address the challenges faced by the developing world and support emergency actions to increase cooperation in public health and vaccine equity, ensure food security, enhance energy production, promote global green economy, stimulate trade and industrialization, and eliminate the digital divide.\nThe Foreign Minister, noting that the multiple crises have enlarged the gap in financing for development, called upon the international community to mobilize adequate resources for SDGs and fulfill the commitment of providing at least $100 billion annually in climate finance.\nPresident Xi Jinping of China put forward the Global Development Initiative during his address to the 76th session of the UN General Assembly in September 2021.\nIn January 2022, China launched a Group of Friends of GDI in New York – which was joined by Pakistan and more than 50 other countries – as an informal cooperation and coordination mechanism for strengthening policy dialogue, sharing best practices, and promoting practical cooperation on realizing the SDGs to advance the objectives of GDI.",
  "retrievedAt": "2025-08-11T14:50:39.094Z"
}
