{
  "article_id": "2025-04-04_e9fd9bd30c0603be388820d080456041",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-chairman-gilani-uzbek-counterpart-discuss-strengthening-inter-parliamentary-cooperation/",
    "retrieved_at": "2025-08-27T14:12:41.489Z"
  },
  "metadata": {
    "title": "Senate Chairman Gilani, Uzbek counterpart discuss strengthening inter-parliamentary cooperation",
    "author": null,
    "date_published": "2025-04-04T14:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 255,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 04 (APP): A parliamentary delegation led by Chairman Senate, Syed Yousaf Raza Gilani is on an official visit to Tashkent, Uzbekistan, to participate in the 150th Anniversary Assembly of the Inter-Parliamentary Union (IPU), scheduled to be held from April 5 to 9. According to the Uzbek embassy in Islamabad, Senate Chairman Syed Yousaf Raza Gilani met with Chairperson of the Senate of the Oliy Majlis of Uzbekistan, Tanzila Narbayeva, on Friday. During the meeting, both sides discussed enhancing inter-parliamentary cooperation, strengthening the legal framework of bilateral relations, and expanding collaboration in mutually beneficial sectors. They reaffirmed their commitment to fostering strategic partnerships and acknowledged the steady development of friendly and brotherly ties between the two nations. Particular emphasis was placed on deepening cooperation in trade, investment, transport, logistics, communications, and information technology. Both leaders underscored the importance of increasing bilateral trade turnover to $2 billion and advancing joint projects in pharmaceuticals, agriculture, agricultural machinery, and geology. The discussion also covered strengthening inter-parliamentary relations, enhancing cooperation within the Asian Parliamentary Assembly, and activating parliamentary friendship groups. Both sides agreed to establish joint parliamentary oversight mechanisms to ensure the timely and effective implementation of high-level agreements. Chairman Senate Gilani and Chairperson Narbayeva also agreed to develop and implement a Joint Action Plan to enhance cooperation between the upper chambers of both parliaments, aiming to reinforce institutional collaboration and legislative exchanges. The 150th Anniversary Assembly of the IPU will bring together parliamentary representatives from around the world to deliberate on pressing global issues and legislative cooperation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}