{
  "article_id": "2025-04-04_ac185838ca6153e0a07af0cc0fa1bf80",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-us-discuss-energy-cooperation-and-sustainable-development/",
    "retrieved_at": "2025-08-27T14:12:39.122Z"
  },
  "metadata": {
    "title": "Pakistan, US discuss energy cooperation and sustainable development",
    "author": null,
    "date_published": "2025-04-04T17:09:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 289,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 04 (APP):Federal Minister for Petroleum Ali Pervaiz Malik and the Charge d'Affaires of the US Embassy, Natalie Baker, held a meeting on Friday to discuss bilateral cooperation in the energy sector, sustainable development, and ways to strengthen Pakistan-US relations. The meeting focused on deepening partnerships in areas such as renewable energy, minerals, hydrocarbons, and energy infrastructure. Both sides exchanged views on Pakistan's energy challenges, the role of technology, and policy measures needed to meet the country's growing energy demands, said a news release. Minister Malik welcomed the United States' continued support and said Pakistan values its strategic relationship with the US. \"We want to see the US as a long-term partner in progress,\" he said. \"We are open to joint ventures in oil, gas, and renewable energy to ensure sustainable development and affordable energy for our people.\" The Minister also thanked Natalie Baker for assuring the participation of a high-level US delegation in the upcoming Pakistan Minerals Investment Forum. He highlighted the significance of the visit by Mr. Eric Meyer, Acting Assistant Secretary for South and Central Asia, who will attend the forum, marking an important engagement at this level after a long time. Natalie Baker praised Pakistan's economic recovery and the implementation of key reforms. She congratulated Prime Minister Shehbaz Sharif and his cabinet for their efforts. She noted the positive security cooperation between the two countries and recalled that former President Trump had acknowledged Pakistan's contributions under Prime Minister Sharif.She added that it is now time to expand and strengthen the partnership further and assured full US support for Pakistan's ongoing reforms. The meeting ended with both sides reaffirming their commitment to shared energy goals and exploring new areas for collaboration in the energy sector.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}