{
  "article_id": "2025-04-04_8ee2df38f1938a92c7339a1b3f6fa344",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gilani-pays-tribute-to-shaheed-zulfiqar-ali-bhutto-on-death-anniversary/",
    "retrieved_at": "2025-08-27T14:13:01.528Z"
  },
  "metadata": {
    "title": "Gilani pays tribute to Shaheed Zulfiqar Ali Bhutto on death anniversary",
    "author": null,
    "date_published": "2025-04-04T16:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 241,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 04 (APP):Chairman Senate Syed Yousaf Raza Gilani on Friday paid tribute to Shaheed Zulfiqar Ali Bhutto on his death anniversary, calling him a great leader, the founder of democracy in Pakistan, and a true guardian of people's rights. In his message, Gilani said that Bhutto was a revolutionary leader who strengthened democracy and empowered the people of Pakistan. He said that under Bhutto's leadership, Pakistan received the unanimously passed Constitution of 1973. This Constitution remains the foundation of the country's democratic system and ensures its survival. Gilani said that Bhutto always stood for democratic values and the rights of the people. He never gave up on his principles, even while resisting dictatorship and injustice. He added that Bhutto's political wisdom, revolutionary thinking, and people-focused policies gave Pakistan a new direction. His contributions are not only recognized in Pakistan but also around the world. He was a leader who gave a voice to the poor, empowered ordinary citizens, and led the country towards industrial and economic progress. The Chairman Senate said the nation remembers and honors Bhutto's legacy today. He added that the people of Pakistan are committed to continuing his mission. He described the 1973 Constitution as a symbol of Bhutto's democratic vision, which still plays a key role in maintaining the country's stability and protecting public rights. Gilani concluded by saying that Bhutto's name will always shine in Pakistan's political history, and his sacrifices will never be forgotten.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}