{
  "title": "Scope of adaptive social protection strategies to be enhanced: Shazia Marri",
  "link": "https://www.app.com.pk/national/scope-of-adaptive-social-protection-strategies-to-be-enhanced-shazia-marri/",
  "date_published": "2023-02-04T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 04 (APP): Federal Minister for Poverty Alleviation and Social Security Shazia Marri Saturday said that the scope of the adaptive social protection strategies would be further enhanced in Pakistan giving top priority to education, healthcare and nutrition.\nShe was speaking during a meeting with Michal Rutkowski, Global Director for Social Protection and Jobs at the World Bank in Washington DC, USA, said a message received here.\nThe minister is visiting the United States at the invitation of the World Bank to share Pakistan’s experiences on adaptive social protection as well as the post flood issues.\nSpeaking on the occasion, Shazia Marri stated that Benazir Income Support Programme (BISP) was launched in 2010 and since then it had become a resounding success in ameliorating the fate of the poorest of the poorest families in Pakistan.\nThe federal minister said that the World Bank’s technical assistance would go a long way in maximizing the outreach and success of social protection programs in Pakistan.\nShe conveyed gratitude on behalf of the Government of Pakistan at the prompt response and tremendous support extended by the World Bank during the catastrophic floods.\nDirector Rutkowski appreciated the important role played by the BISP and other institutions in the government of Pakistan’s swift, adaptive and resilient response during the devastating and unprecedented floods last year.\nHe acknowledged the significant contributions of the BISP in protecting the livelihoods of the most vulnerable segments of Pakistani population, particularly in the aftermath of the floods.\nDirector Rutkowski praised the BISP as a successful model and said it could be implemented by other countries in the region and beyond.\nDirector Rutkowski assured the federal minister that World Bank would broaden its engagements and augment its assistance to Pakistan to foster better outcomes and enhance productivity of Pakistan’s social protection strategies through skill enhancement trainings and other means.\nMs Shazia Marri presented a Booklet on various projects of BISP to the Global Director of World Bank.\nSardar Masood Khan, Pakistan’s Ambassador to the United States was also present at the occasion.",
  "retrievedAt": "2025-08-11T05:55:25.229Z"
}
