{
  "title": "Hindutva regime converts heaven like valley into a killing field: Mushaal",
  "link": "https://www.app.com.pk/national/hindutva-regime-converts-heaven-like-valley-into-a-killing-field-mushaal/",
  "date_published": "2023-02-04T16:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP):Mushaal Hussein Mullick Chairperson Peace and Culture Organisation said that the Hindutva regime altered the heaven like valley into a killing field and urged the world powers and UN bodies to take “concrete and meaningful” steps for the full implementation of the UN Security Council resolutions on Kashmir.\nSpeaking at an event organized by Kashmir journalist forum in connection with Kashmir solidarity, here on Saturday, she said that Kashmir was a flashpoint for nuclear war and the settlement of the dispute was necessary for lasting and durable peace in the region.\nShe said that the Kashmir dispute must be settled according to the wishes of the Kashmiri people and the UN resolutions which granted them the right to self-determination.\nShe said that brutal Indian forces crossed all limits of barbarity and terrorism to dampen the courage of freedom fighters in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nMushaal said that Kashmiri people were being killed in fake encounters in the occupied territory on daily basis to spread fear among the people.\nThe Hurriyat leader stated that the top Kashmiri leadership including her husband Yasin Malik were imprisoned in fake and fabricated cases and deprived them of all legal and fundamental rights.\nThe chairperson reminded: “History tells us that struggles for freedom cannot be vanquished.”\nMushaal vowed that the valiant Kashmiri people were bound to realize their cherished goal of freedom come what may.\nShe said that the Indian government violated the mutual agreements between Pakistan and India and international laws by abrogating the special status of occupied Kashmir.\nThe Hurriyat stated that New Delhi was bent upon changing the demography of the occupied territory to convert Muslims majority into minority by issuing domiciles to non-Kashmiri settlers.\nShe urged that the world must take notice of it and put pressure on India to recognize the right to self-determination of Kashmiris.",
  "retrievedAt": "2025-08-11T05:55:21.903Z"
}
