{
  "title": "PTI leaders lack capacity, courage to launch fill the prison movement: Marriyum",
  "link": "https://www.app.com.pk/national/pti-leaders-lack-capacity-courage-to-launch-fill-the-prison-movement-marriyum/",
  "date_published": "2023-02-04T16:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Saturday said the leadership of Pakistan Tehreek-e-Insaf (PTI) did not have the courage and capacity to launch the “fill the prison movement” in the country.\nAddressing a news conference here, she said Imran Khan’s call for the movement was nothing but another political stunt which was aimed at diverting people’s attention from corruption during his four-year (mis)rule which ushered in extreme inflation, terrorism and economic crises in the country.\n“Imran Khan does not need to launch any ‘Jail Bharo Tehreek’ as the prisons will get filled automatically when he starts appearing before the courts to answer about corruption, loot and plunder during his four-year tenure as the prime minister,” she remarked.\nFlanked by Special Assistant to the Prime Minister on Poverty Alleviation and Social Safety, Faisal Karim Kundi, she said at the first place, the leadership would have to present themselves for the arrest in such movements, but ironically Imran Khan was using his party workers as a shield to save his “dirty and stinking” politics as well as to cover up his corruption.\n“How ironic it is that Imran Khan is urging his workers to get ready for the ‘Jail Bharo Tehreek’ while hiding himself in his bulletproof Zaman Park residence,” she stated.\nMarriyum said the people who started weeping after spending two days in prison did not have the courage to fill the jails while on the other hand, the entire nation had witnessed how bravely the leadership of Pakistan Muslim League-Nawaz (PML-N) and Pakistan Peoples Party (PPP) remained in jails for months during the fascist rule of Imran Khan.\nShe said PPP Co-chairman Asif Ali Zardari remained in jail for 248 days while his sister Faryal Talpur was dragged from the hospital to jail on the occasion of Eid and the media channels were told to telecast that footage.\nThe minister said likewise, Nawaz Sharif spent 374 days in jail, Maryam Nawaz 158 days, Rana Sanaullah 174 days, Captain (Retd) Safdar 53 days, Khawaja Asif 176 days and Hamza Sharif 627 days. The story of political victimization during the tenure of Imran Khan did not end here as Shahid Khaqan Abbasi remained behind bars for 222 days, Miftah Ismail for 142 days, Shehbaz Sharif for 340 days and Ahsan Iqbal 364, she added.\nShe said Mir Shakeel was sent behind bars to set an example for the entire media that nobody would be spared if they dared to criticize Imran Khan’s government.\nMarriyum said Imran Khan, who gave a call for the fill the prison movement, had not only sent all the opposition leaders and media persons into the jails but also set up a dedicated office in the Prime Minister’s Office which updated him regularly on the treatment meted out to them.\nShe said the same person during his visit to the United States announced that he would remove the air conditions from the jail in which Nawaz Sharif was kept. He issued directives to the authorities concerned in the jail not to give a chair to Shehbaz Sharif for offering daily prayers.\n“Imran Khan should better launch ‘Doob Marny Ki Tehreek’ (Shame movement) instead of ‘Jail Bharny Ki Tehreek’ (Fill the Prison Movement),” she said reiterating “coward Imran Khan” did not have the courage and capacity to launch such a movement.\n“The call for this movement is nothing but another stunt of Imran Khan who wants to divert people’s attention,” she said, reminding the PTI chief that it was he who had ruled Khyber Pakhtunkhwa for the last ten years, but did not build the capacity of Khyber Pakhtunkhwa police, nor provided the infrastructure to the department for curbing terrorism.\nShe said Imran Khan did not participate in the apex committee meeting as he knew that he did not utilize the allocated fund worth Rs 471 billion for fighting terrorism in the province. His government failed to set up the counter-terrorism department and forensic lab in Khyber Pakhtunkhwa.\nHe did not work on building the infrastructure as proposed in the National Action Plan and National Internal Security policy for fighting terrorism, she added.\nThe people of Khyber Pakhtunkhwa and the Law Enforcement Agencies were bearing the brunt of the incompetence of Imran Khan who had a mindset to promote terrorism in the country, she alleged, adding terrorists were attacking the province which had been vulnerable to terrorism due to the absence of the required infrastructure in the province.\nShe said Imran Khan was responsible for all the economic ills as the previous government of Nawaz Sharif stabilized the national economy by winding up the International Monetary Fund (IMF) programme in 2016.\n“We know and feel the pain of the people who are in trouble due to inflation, but Imran Khan is responsible for their agony,” she said, adding the country might have defaulted if the agreement signed by him with the IMF was not implemented.\nThe minister said Imran Khan would have to answer why he violated the agreement with the IMF and brought the country so close to default, and failed to take practical steps to keep terrorism at bay in Kyber Pakhtunkhwa.\nShe said Imran Khan was not fit to become a member of the National Assembly according to Article 63 (1) of the Constitution.\nAt the outset of the presser, she said Imran Khan repeated the 20-year-old speech to criticize his opponents, but ironically he could not realize that it was he who clung to the power in the federation for four years and ruled Khyber Pakhtunkhwa for almost 10 years.\nThe masses, whom he thought of as fools, fully knew that the PTI government signed an agreement with the IMF on tough conditions that caused extreme inflation and pushed the country into an economic quagmire, she said, adding the rupee devalued massively during the tenure of Imran Khan’s government, while the rate of flour and sugar went up from Rs 35 kilogram to 120 and Rs 52 to Rs 150, respectively and the debts jumped to Rs 45 trillion.\nTo a query, she said the coalition government did not believe in political victimization.",
  "retrievedAt": "2025-08-11T05:55:21.333Z"
}
