{
  "title": "India set worst example of HR violations in IIOJK: Sanjrani",
  "link": "https://www.app.com.pk/national/india-set-worst-example-of-hr-violations-in-iiojk-sanjrani/",
  "date_published": "2023-02-04T17:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 04 (APP):Senate Chairman Muhammad Sadiq Sanjrani Saturday said the Indian government has set the worst example of the violation of human rights by snatching the autonomous status of Indian Illegally Occupied Jammu and Kashmir (IIoJK) through an illegal move on August 5, 2019 to suppress the liberation struggle of the people.\nIn his message regarding Kashmir Solidarity Day, he said India would not be able to sustain its illegal occupation through such draconian laws and actions.\nExpressing complete solidarity with the people of IIOJK, he said the people of Pakistan were supporting firmly Kashmiri brethren in struggle for their just cause.\nThe increasing Indian brutality, cruelty and worst violation of human rights in Kashmir has exposed the ugly face of India to the whole world.\nNow the time has come that human rights leaders, institutions and organizations should take steps to resolve the Kashmir issue in accordance with the United Nation resolutions.\nSenate Chairman said that Kashmir is the jugular vein of Pakistan and all the political parties of Pakistan have taken steps for a peaceful solution to the issue.\nThere is a need to take more measures at the national and international level for a fair solution to the Kashmir issue.\nSanjrani further said that the people of IIOJK had rendered matchless sacrifices for their just right to self-determination. He said durable peace in the region was liked with the early resolution of the Kashmir issue in accordance with aspirations of the people of IIOJK and called upon the international community to play its role in the interest of peace and harmony in the region.\nHe said that the people and institutions of Pakistan not only fully support the innocent Kashmiris in their struggle for freedom, but they will not hesitate to make any sacrifice until their freedom is achieved.\nSenate Deputy Chairman Mirza Muhammad Afridi said that February, 5 is a day of solidarity for the sacrifices made by Kashmiris for freedom.\nWhich is celebrated with full enthusiasm by all Pakistanis and Kashmiris living across the country.\nHe said that all the political parties, institutions and the entire nation of Pakistan are of the same language regarding the Kashmir issue.",
  "retrievedAt": "2025-08-11T05:55:19.328Z"
}
