{
  "title": "Tourism in GB drops 90pc amid climate disasters, conflicts - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Unprecedented climate disasters and other factors have caused a sharp decline in both foreign and domestic tourist arrivals to Gilgit-Baltistan this year, badly affecting the local economy.\n\nOfficials said that international conflicts, natural calamities and other issues resulted in a 90 per cent drop in tourism across the region.\n\nSajid Hussain, assistant director at the GB Tourism Department, said that only 270 international climbers arrived in GB this year to attempt peaks, including K2, Broad Peak, Gasherbrum-I, Gasherbrum-II and Nanga Parbat, as compared to more than 2,000 foreign climbers and trekkers who visited the region last year.\n\nHe said that most climbers returned without success due to extreme weather conditions at the peaks. Rockfalls, avalanches and high winds forced many to abandon their attempts and remain at base camps before heading back to their countries.\n\nAccording to the department, only 40 climbers summited K2, 25 reached Nanga Parbat and about a dozen summited Gasherbrum-I this season.\n\nIqbal Hussain, director at the GB Tourism Department, told Dawn that last year 24,000 foreign tourists without permits visited GB, along with one million domestic tourists. This year, he said, the situation is alarming as tourist arrivals — both international and domestic — have declined by 90pc.\n\nAsghar Ali Porik, a tour operator, said several factors contributed to the sharp decline in foreign ad­v­e­­nture tourists. “The legal battle between the GB To­­urism Department and tour operators over the hike in permit fees, the Iran-Israel conflict, tensions between Pakistan and India, and unpredictable we­ather conditions at peaks compelled many forei­gn climbers and trekkers to cancel their plans,” he added.\n\nA tea stall owner on the Karakoram Highway said that the tourism season usually runs from May to October. “I have never experienced such a situation where you can go the whole day without a single client and return home empty-handed,” he said.\n\nLike him, hotel owners, shopkeepers, transporters, porters and tour operators are also facing financial losses.\n\nHaider Abbas, owner of Gilgit Looms, said his business had also been badly affected, adding that he had invested billions of rupees, but now found it difficult to pay shop rent and salaries.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:56:32.917Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938538/tourism-in-gb-drops-90pc-amid-climate-disasters-conflicts",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:52:44.000Z"
}
