{
  "title": "Explosion partially damages girls’ primary school in KP’s Lakki Marwat; no casualties reported - Pakistan - DAWN.COM",
  "author": null,
  "content": "An explosion at a girls’ primary school in Khyber Pakhtunkhwa’s Lakki Marwat district partially damaged the building, though no casualties were reported, police said on Sunday.\n\nDistrict Police Officer (DPO) Nazeer Khan told Dawn.com: “The incident took place late Saturday night when an explosion occurred at a girl’s primary school in the Wanda Zahid Gul area, situated within the jurisdiction of Daddiwala Police Station.”\n\nHe said that due to the explosion, carried out through an improvised explosive device (IED), the school’s building was partially damaged.\n\n“Luckily, no casualties were reported,” the DPO said, adding that a heavy contingent of police had been deployed in the area.\n\nDPO Khan further said that there were two IEDs planted in the school.\n\n“One of the IEDs exploded, while the other one was discovered when the police reached the incident site and carried out an inspection,” he said. “It was successfully defused by the bomb disposal squad.”\n\nA search operation was underway in the district to locate the perpetrators, according to the DPO.\n\nLakki Marwat has long been a hotspot for terrorism and violence, with unrest dating back to the early 2000s. While security operations brought a period of relative calm, militant activity has resurged in recent years, straining local peace efforts and heightening fears of renewed instability.\n\nEarlier this month, terrorists carried out a series of militant attacks across the district, killing three soldiers and a woman while injuring three others, including two soldiers.\n\nOn August 13, police said that terrorists blew up a gas pipeline in Lakki Marwat district, resulting in the suspension of gas supply to Punjab.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:56:52.794Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938676/explosion-partially-damages-girls-primary-school-in-kps-lakki-marwat-no-casualties-reported",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T10:57:36.000Z"
}
