{
  "title": "Floods leave women struggling in Pakistan’s relief camps - Pakistan - DAWN.COM",
  "author": null,
  "content": "In a former classroom, now a makeshift relief camp, pregnant women take refuge from the floods that have ravaged the country, their bodies aching, eyes heavy with exhaustion and silent despair.\n\nWaiting for the water that swallowed their homes to recede, women in Chung, a town on Lahore’s outskirts, have limited access to sanitary pads and essential medicines, including pregnancy-related care.\n\nShumaila Riaz, 19 years old and seven months pregnant with her first child, spent the past four days in the relief camp, enduring pregnancy cramps.\n\n“I wanted to think about the child I am going to have, but now, I am not even certain about my own future,” she told AFP.\n\nClad in dirty clothes they have worn for days and with unbrushed hair, women huddle in the overcrowded school hosting more than 2,000 people, surrounded by mud and stagnant rainwater.\n\n“My body aches a lot and I can’t get the medicines I want here,” said 19-year-old Fatima, mother to a one-year-old daughter and four months pregnant.\n\n“I used to eat as I pleased, sleep as I pleased, walk as I pleased — that is all gone now. I can’t do that here,” she added, asking AFP not to use her real name.\n\nMonsoon rains over the past week swelled three major rivers that cut through Punjab.\n\nThe number of affected people rose on Sunday to more than two million, according to Punjab Senior Minister Marriyum Aurangzeb.\n\nAround 750,000 people have been evacuated, of whom 115,000 were rescued by boat — making it the largest rescue operation in Punjab’s history, according to the provincial government.\n\nThe flooded rivers have affected mostly rural areas near their banks, but heavy rain also flooded urban areas, including several parts of Lahore.\n\nWhile South Asia’s seasonal monsoon brings rainfall that farmers depend on, climate change is making the phenomenon more erratic and deadly across the region. Landslides and floods triggered by heavier-than-usual monsoon rains have killed more than 850 people nationwide since June.\n\nThe latest downpour has killed at least 32 people, the provincial minister said on Sunday.\n\nSleeping in tents held together with thin wooden sticks, women displaced by the floods struggle to get sanitary pads and clean clothes when theirs are stained by blood from their periods.\n\nMenstruation remains a taboo topic, with many women discouraged from speaking about it.\n\n“We are struggling to get pads for when we get our period. And even if we do, there are no proper bathrooms to use,” said Aleema Bibi, 35, as her baby slept on a sheet soiled with mud. “We go to the homes nearby to use the bathroom.”\n\nJameela, who uses only one name, said she seeks privacy in a makeshift bathroom next to a cowshed.\n\n“We wait for men in these homes to leave, so that we can go use the bathrooms and change our pads,” she said.\n\nOutside the medical truck beside the relief camp, a concerned woman asked where to take her eight-month-pregnant daughter-in-law who had gone into labour, AFP journalists saw.\n\nThe pregnant women are also vulnerable to infectious diseases, according to doctors in the medical camp set up by a local NGO.\n\n“I receive around 200 to 300 patients every day with different infections and water-borne diseases,” said Fahad Abbas, 27, a doctor at the medical camp. “There are a lot of patients here who are going through psychological trauma, especially women and children, after losing their homes.”\n\nEven without the crisis of a flood, 675 babies under one month old die every day, along with 27 women in the perinatal stages from preventable complications, according to the World Health Organisation.\n\nAnother woman, who wanted to stay anonymous, said the medicine she once used to manage her period cramps was now too difficult to buy.\n\n“We escaped death, but this misery is no less than death either,” Jameela said.\n\nHeader image: Sakina Bibi, a mother of four who fled from a flooded area, sits outside her tent as she along with others take shelter near Lahore on August 31. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/3118101032077b4.webp",
  "retrievedAt": "2025-09-06T09:56:53.447Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938694/floods-leave-women-struggling-in-pakistans-relief-camps",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T13:13:31.000Z"
}
