{
  "title": "President assents to Land Port Authority Bill - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: President Asif Ali Zardari gave his assent on Saturday to the Pakistan Land Port Authority Bill, 2025, turning it into law and paving the way for the establishment of a new statutory body tasked with managing border crossings and facilitating cross-border movement.\n\nThe newly created Pakistan Land Port Authority will act as a central platform for coordinating between multiple border management agencies. Its mandate includes facilitating the smooth movement of goods and passengers across land ports, reducing delays, and ensuring more efficient trade flows.\n\nWith this development, Pakistan becomes the third country in South Asia, after Bangladesh and India, to establish a dedicated land port authority.\n\nThe authority will introduce a robust mechanism to coordinate effectively with border management agencies, streamline trade facilitation, and enhance cross-border connectivity. It will also play a vital role in meeting Pakistan’s obligations under international agreements and conventions.\n\nThe establishment of the Pakistan Land Port Authority marks a significant step towards strengthening the country’s regional trade integration, improving border management, and enhancing economic connectivity with neighbouring countries.\n\nChange in 11th NFC\n\nIn another significant development, President Asif Ali Zardari has approved a change in the constitution of the 11th National Finance Commission (NFC).\n\nAccording to the Presi­dency, the change became necessary after the government of Balochistan revised its nomination, recommending Mahfooz Ali Khan as its non-ex officio member in the 11th NFC.\n\nThe president accorded approval to this nomination, superseding the earlier approval.\n\nThe Balochistan government earlier withdrew the nomination of Farmanullah Khan, former CEO of the Balochistan Investment Board, and instead nominated Mahfooz Ali Khan to represent the province in the NFC.\n\nThis will be Mahfooz Ali Khan’s fourth term representing Balochis­tan in the NFC, as he has previously represented the province in the 5th, 6th and 7th NFCs.\n\nHe also held significant roles in the provincial government, including serving as an additional secretary and secretary of finance for six years. He retired as a Grade-21 officer in 2014 after serving as Balochistan’s secretary of finance.\n\nIn addition, he has held key positions such as Accounts General of Balochistan, Controller Military Accounts, and Director General of the National Institute of Manage­ment (NIM) Balochistan.\n\nPetroleum Bill\n\nPresident Zardari has also asse­nted to the Petroleum (Amendment) Bill, 2025, as passed by parliament.\n\nThe Act strengthens measures against smuggling and illegal operation of petrol pumps.\n\nIt empowers deputy commissioners, assistant commissioners, and customs authorities to confiscate illegal petroleum products and vehicles, introduces IT-based tracking, and enhances penalties for violations.\n\nThe legislation is expected to modernise petroleum sector regulation, improve transparency, and strengthen the government’s effor­­ts against smuggling and tax evasion.\n\nBesides, the president has also given his assent to the Criminal Laws (Amendment) Bill, 2025, as passed by parliament.\n\nSyed Irfan Raza in Islamabad and Saleem Shahid in Quetta also contributed to this report\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:57:08.943Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938516/president-assents-to-land-port-authority-bill",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:52:33.000Z"
}
