{
  "title": "Equities face challenges from floods and political noise - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The KSE-100 index has shown a solid 6.5 per cent increase month-on-month (MoM) in July, primarily driven by institutional buying.\n\nHowever, market performance on a week-on-week (WoW) basis has been more volatile, reflecting both profit-taking and external factors, such as flooding and political noise.\n\nKey economic indicators in July highlighted mixed trends. The Consumer Price Index (CPI) increased to 4.1 per cent, up from 3.2pc in June. Remittances reached $3.2bn, marking a 6pc MoM decrease but a 7pc YoY rise. Car sales showed a significant 28pc YoY increase to 11,034 units, although they dropped by 49pc MoM. Pakistan also saw a rating upgrade by Moody’s, moving from Caa2 to Caa1, with a stable outlook. The country’s current account recorded a deficit of $254m, reversing the $335m surplus seen in July 2024.\n\nIn terms of market activity, average daily traded volume fell by 8pc MoM to 737 million shares, while the value of trades increased by 42pc MoM to Rs42bn. The overall performance during the week saw the KSE-100 Index close at 148,618, down 0.6pc (875 points) week-on-week. This decline was attributed to profit-taking, although some buying interest was observed due to the ongoing earnings season.\n\nIndex increased 6.5pc month-on-month, but week-on-week performance saw a decline\n\nArif Habib Ltd (AHL) noted that the week was characterised by profit-taking as the market closed lower. Despite this, some support was offered by positive corporate results, particularly from the cement sector. The average daily traded volume remained strong at 737 million shares, though a slight drop in trading activity compared to the previous month reflected cautious sentiment in the face of geopolitical uncertainty and floods in Khyber Pakhtunkhwa and Punjab.\n\nOne of the noteworthy developments during the month was the State Bank of Pakistan’s (SBP) net foreign exchange interventions. Between June and May, the SBP conducted interventions amounting to $7.8bn, which boosted reserves by $2.1bn. However, a significant portion was used for debt repayments. In May alone, foreign exchange interventions totalled $522m.\n\nThe auto sector saw a rise in auto financing, which increased by 25.3pc YoY to Rs286bn in July, up from Rs228bn in July 2024. On a MoM basis, auto financing also saw a 3.3pc increase. Meanwhile, Pakistan’s external obligations were addressed with the clearance of over Rs100bn in dues to Chinese power plants ahead of the Prime Minister’s visit to Beijing, reducing outstanding CPEC power sector dues by nearly a quarter.\n\nOn the external front, Pakistan’s foreign exchange reserves increased by $47m week-on-week to $19.6bn, with SBP reserves rising by $18m to $14.3bn. The rupee appreciated marginally by 0.05pc against the dollar, closing the week at Rs281.77/$.\n\nDespite these positive developments, flooding and political instability weighed on market sentiment. AKD Securities Ltd highlighted the volatility during the week, attributing a decline in the KSE-100 to the impact of floods in KPK and Punjab. The index lost 0.59pc week-on-week, closing at 148,617 points. However, a recovery was seen on Friday, when the index rebounded by 1,274 points, driven by strong corporate earnings, especially in the cement sector.\n\nSector-wise, companies in the jute, property, cement, and cable sectors were among the top performers. Jute, for instance, saw a 4.9pc rise, while cement companies benefitted from strong earnings. On the other hand, textiles, pharmaceuticals, and insurance stocks saw declines, with the worst performers being woollen, leather & tanneries, and textile spinning.\n\nForeign investors remained net sellers, with a net sell of $13.5m, while banks and DFIs sold a net $9.9m. In contrast, mutual funds and companies absorbed much of the selling pressure, with net purchases of $17.4m and $10.4m, respectively.\n\nThe KSE-100 is currently trading at a forward Price-to-Earnings Ratio (PER) of 7.90x for 2026, compared to its 10-year average of 8.59x, offering an attractive dividend yield of around 6.8pc, higher than the historical average of 6.13pc. With a target of 165,215 points by December, analysts are optimistic about the market’s prospects, driven by strong corporate earnings, particularly in the fertilizer and banking sectors.\n\nThe National Electric Vehicle (NEV) Policy for 2025-30, unveiled during the week, aims to address the country’s climate challenges and stimulate the electric vehicle sector. This development is expected to provide some positive sentiment, alongside expectations for further improvements in the country’s macroeconomic fundamentals.\n\nOutlook\n\nLooking ahead, analysts predict the market will continue to experience volatility in the short term due to external risks, but the outlook remains positive for the remainder of the year. With a projected target of 165,215 points by December, driven by strong corporate earnings and improved macroeconomic stability, the KSE-100 index is expected to maintain its upward trajectory.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:57:25.099Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938510/equities-face-challenges-from-floods-and-political-noise",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:52:49.000Z"
}
