{
  "title": "Two injured in attacks on Bannu, Bajaur police stations - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT/BAJAUR: The police foiled a terrorist attack on the Miryan police station in Bannu district late on Friday.\n\nAlso, a police station came under attack from a quadcopter in the restive Lowi Mamund tehsil of Bajaur district on Saturday, injuring two people, including a policeman.\n\nA police official in Bannu told Dawn that around 70 terrorists led by their commanders Qari Niaz, Safeer and Rasool Ghani launched the late night attack with light and heavy weapons.\n\nHe said that the assailants wanted to take control of the police station. An intense exchange of fire occurred for some time before terrorists fled. All policemen remained safe, according to the official.\n\nA large police contingent later launched a search for the attackers.\n\nMeanwhile, the police arrested two suspected criminals during an action in the Mandan area of Bannu district.\n\nThe detainees, including Umar Qeebaz and Kifayatullah, both from Mir Azam Baistkhel area, were handed over to the police’s investigation wing for interrogation, according to an official.\n\nIn Bajaur district, two people, including a police official, were wounded after terrorists attacked a police station in the Laghari area of Lowi Mamund tehsil through a quadcopter on Saturday.\n\nSources said police constable Mohammad Habib and civilian Najeeb Khan were injured in the attack, which also damaged a vehicle parked on the premises.\n\nIsrar Khan, a public relations officer of the district police, told Dawn that the injured were immediately shifted to the district headquarters hospital in Khar.\n\nHe also said terrorists launched another attack on the police station through a quadcopter but it missed the target.\n\nNo group claimed responsibility for the attack. However, police officials blamed it on terrorists in light of Operation Sarbakaf launched by security forces against them a couple of weeks ago.\n\nMeanwhile, a man was killed and another injured when a mortar shell hit a house in the hilly Gohati area of the restive Lowi Mamund tehsil on Friday night.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:57:16.049Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938587/two-injured-in-attacks-on-bannu-bajaur-police-stations",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T01:15:32.000Z"
}
