{
  "title": "EU urges US to reconsider UN summit visa denial for Palestinians - World - DAWN.COM",
  "author": null,
  "content": "COPENHAGEN: The EU called upon the United States on Saturday to reconsider its decision to deny visas to Palestinian officials seeking to attend next month’s UN General Assembly.\n\n“In the light of the existing agreements between the UN and its host state, we all urge for this decision to be reconsidered,” Kaja Kallas, the bloc’s top diplomat, said following a meeting of EU foreign ministers in Copenhagen, Denmark.\n\nKallas invoked “international law” in calling for Washington to reverse the extraordinary step, which further aligns US President Donald Trump’s administration with Israel’s government.\n\nThe US move comes as France is leading a push to recognise the Pales­tinian state at the gathering of world leaders in New York. French Foreign Minister Jean-Noel Barrot spoke out in protest ahead of the Denmark talks.\n\nAbbas ‘barred’ from UN summit; Israeli forces kill 50 more as death toll rises to 63,371\n\n“A UN General Assembly meeting should not be subject to any restrictions on access,” Barrot told reporters.\n\nA string of ministers in Copenhagen echoed France’s call for the United States to allow access to the Palestinian delegation.\n\nThe Palestinian Authority has likewise called for the United States to reverse its decision, which it said “stands in clear contradiction to international law and the UN Headquarters Agreement”.\n\nPalestinian Authority President Mahmud Abbas, a veteran 89-year-old leader who once had cordial relations with Washington, had planned to attend the UN meeting.\n\nUnder an agreement as host of the United Nations in New York, the United States is not supposed to refuse visas for officials heading to the world body.\n\nA US official said on Saturday that Mahmud Abbas is among 80 officials being denied visas to attend next month’s UN General Assembly, where France is leading a push to recognise a Palestinian state.\n\n“Abbas is affected by this action along with approximately 80 other PA officials,” a State Department official said in a statement, detailing those impacted by the extraordinary decision announced on Friday by the United States.\n\nThe United States and Israel have accused France and other powers of rewarding Hamas through their recognition of a Palestinian state. Canada and Australia have also said they would recognise a Palestinian state, and Britain threatened to do so if Israel does not agree to a ceasefire in Gaza.\n\nMeanwhile, heavy bombardment has been reported in Gaza City early on Saturday as Israel said its planned seizure of the besieged Palestinian territory’s largest area was progressing. At least 50 more people were killed in Gaza in a single day, taking the death toll of Palestinians in over 22 months to 63,371.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68b3904059d0e.jpg",
  "retrievedAt": "2025-10-12T03:56:30.718Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938507/eu-urges-us-to-reconsider-un-summit-visa-denial-for-palestinians",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:52:38.000Z"
}
