{
  "title": "Contempt notice to PM Shehbaz in Aafia case ‘not executable’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Judicial Department of the Islamabad High Court (IHC) has submitted a report in Dr Aafia Siddiqui’s case, stating that the contempt of court notices served to Prime Minister Shehbaz Sharif and his federal cabinet cannot be executed before resolving certain legal issues.\n\nThe department placed a report in the case file of Dr Fowzia Siddiqui, who is seeking her sister Dr Aafia Siddiqui’s release from a US prison, noting that the notices to premier and his ministers over non-compliance of the order were not executable.\n\nIn its report, the registrar office proposed the formation of a larger bench to deliberate over three central legal issues.\n\nThe office questioned whether a judge can self-assign cases to their court, violating the Roster of Sitting. It also asked whether a judge can hear a case without the issuance of the approved cause list and whether the consent of various benches is mandatory for the consolidation of identical petitions.\n\nIHC registrar office proposes larger bench to determine legality\n\nThe development follows the Aug 29 reassignment of the case from Justice Sardar Ejaz Ishaq Khan, who had issued the sweeping contempt notices, to Justice Raja Inaam Ameen Minhas.\n\nThe change is part of a new “Roster of Sitting” taking effect on Sept 1.\n\nOn July 21, Justice Ejaz Ishaq issued the notices; however, that particular proceeding became questionable, as the judge was not inc­l­u­ded in the Roster of Sitting approved by Chief Justice Sardar Mohammad Sarfraz Dogar, since he was on a five-week leave effective from July 20.\n\nConsequently, the registrar office put an administrative hold on these notices, pending approval from the competent authority.\n\nFollowing these developments, and according to the cause list issued by the IHC registrar’s office, Justice Raja Inaam Ameen Minhas is now scheduled to address the case with a new hearing date slated for September 1.\n\nMeanwhile, under the new roster, Justice Ejaz Ishaq has been placed on a special division bench with Justice Babar Sattar to hear tax and commercial matters, a posting that prevents him from sitting as a single-judge court and hearing such petitions.\n\nDr. Fowzia Siddiqui’s petition, pending in the court since 2015, seeks to compel Pakistan’s government to formally support Dr. Aafia Siddiqui, who was imprisoned in the US in 2008 on terrorism charges. The government has so far refused to file an amicus brief in US courts on her behalf.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:56:40.150Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938539/contempt-notice-to-pm-shehbaz-in-aafia-case-not-executable",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:52:44.000Z"
}
