{
  "title": "Revised assessment puts 1.65m at risk of displacement due to flood in Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh government’s updated assessment on Saturday revealed a stark rise in potential devastation from expected high floods at Guddu Barrage and torrential rains, with over 273,000 families — approximately 1.65 million people — on the right and left banks of the Indus River at risk of displacement.\n\nA day earlier, the provincial government had anticipated the displacement of over 52,000 families due to high flows, but the number of people expected to be affected swelled owing to apprehensions of unexpected high floods that could submerge the entire katcha (riverine) area.\n\nSindh Senior Minister Sharjeel Inam Memon, at a press conference, disclosed that there was a risk of 273,000 families being impacted, with 1,651 villages and 167 union councils at risk, but asserted that the government was fully equipped to respond.\n\n“There is neither a shortage of funds in the province nor an emergency situation at present. However, the government is fully prepared to face every challenge,” he said confidently.\n\nSharjeel says 273,000 families, 1,651 villages, 167 UCs may be impacted; CM briefed on barrage water flows\n\nMr Memon said the provincial government was fully active in view of the flood situation, and all departments were working on an emergency basis.\n\nThe senior minister, who also visited the Provincial Rain and Flood Emergency Monitoring Cell established at the Sindh Secretariat to continuously monitor the situation, said that cabinet members, MPAs, district administrations and the entire machinery were present in the field.\n\n“A Provincial Rain and Flood Emergency Monitoring Cell has been set up to oversee the flood situation, which will remain operational 24/7,” he added.\n\n“At present, 192 rescue boats and mobile health units have been made operational,” he said.\n\nAccording to the senior minister, the flood situation was being directly monitored by PPP Chairman Bilawal Bhutto-Zardari and Sindh Chief Minister Syed Murad Ali Shah.\n\n“The district administration is in constant coordination, and people from potentially affected areas are being shifted to safe locations,” he said.\n\nHe said that relief camps had been set up, though most people preferred to stay with relatives, adding that 300 camps had also been established for livestock.\n\nHe further said that the provincial government was providing updates on the situation every three hours, while the Punjab government was also extending cooperation by providing kits in response to the flood situation.\n\nCM briefed\n\nMeanwhile, the chief minister contacted the assigned ministers regarding the expected flood situation in the River Indus and instructed them to strictly monitor the embankments and irrigation systems on both the right and left banks of the river.\n\nAccording to a statement issued from the CM House, Irrigation Minister Jam Khan Shoro briefed the chief minister on the river situation.\n\nThe briefing revealed that at 12 noon on Saturday, the upstream water flow at Guddu Barrage was recorded at 383,299 cusecs and the downstream at 350,943 cusecs. At Sukkur Barrage, the upstream flow was 313,000 cusecs and downstream 259,050 cusecs, while at Kotri Barrage, the upstream was 264,131 cusecs and downstream 233,216 cusecs.\n\nMr Shah was informed that the current status of the barrages was under control and that all safety measures had been completed.\n\nThe chief minister urged residents living along the riverbanks and in low-lying areas to fully cooperate with the administration to ensure their protection in case of any emergency.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:56:59.962Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938486/revised-assessment-puts-165m-at-risk-of-displacement-due-to-flood-in-sindh",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:53:07.000Z"
}
