{
  "title": "Pakistan football captain Abdullah Iqbal waiting for his next big move - Sport - DAWN.COM",
  "author": null,
  "content": "ABDULLAH Iqbal is waiting for a lot of big things to happen. The Pakistan captain and defensive stalwart can see the Swedish league title triumph on the horizon even though he says he and his side Mjallby are taking it “one game at a time”.\n\nA move to one of the top European leagues also seems on the cards for the 23-year-old. But most of all, he’s looking to give “moments of joy” to fans of the Pakistan national football team.\n\nBorn and raised in Copenhagen, it has been some journey so far for Abdullah. From playing in the Danish third tier to making his debut for Pakistan and being ultimately handed the captain’s arm-band to being on the brink of winning the Allsvenskan — Sweden’s top flight — with a club that has never won it before. It’s even more remarkable that Abdullah only transitioned to becoming a defender on his senior team debut with his former club B.93 in Denmark.\n\nIt is his performances as an assured centre-back that have reportedly caught the eye of Italian side Cremonese, who on Friday went top of the nascent Serie A standings. the Allsvenskan, meanwhile, which runs on a yearly basis, is coming to an end. With nine games remaining, Mjallby are eight points clear at the top of the standings. The transfer window for Europe’s top five leagues, meanwhile, closes on Monday.\n\nThere is, therefore, a lot going through Abdullah’s mind.\n\n“I’m trying to focus on the things on the pitch as we speak,” he told Dawn in a wide-ranging interview on Friday, on the eve of Mjallby’s 22nd fixture of this Allsvenskan season against Halmstad. “It would be huge for both me personally and the club to win the title because we’ve never done that.”\n\nBut along with his “strong desire to give back to the club”, Abdullah knows that a move to a club in the top five European leagues would be unprecedented for a Pakistan international player. Pakistan have had diaspora players for long, including the likes of Zesh Rehman who featured for Fulham in the English Premier League but that was before the defender donned the national team jersey.\n\n“The club have been clear that they won’t let the players leave in this window or even if they do, it would be if the new club agrees to loan them back for the rest of the season so it might be difficult to leave.”\n\nPressed whether he’d be more interested in moving to Italy, which has produced the game’s greatest defenders, Abdullah said he “wasn’t closing any door”. “You have to look from a case-to-case basis,” he added. “But I want my next transfer to be to a team in the top five European leagues.”\n\nEven if he stays on for the remainder of the season with Mjallby, winning the Allsvenskan title will ensure Abdullah’s stock keeps rising. According to the latest leaks, he is reported to have boosted his card to a rating of 67 from 64 for the next instalment of the popular video game franchise EA Sports FC.\n\nThat rise points to Abdullah’s perseverance, coming after a difficult start to his stint in Sweden. Having joined Mjallby last summer from boyhood club B.93, Abdullah got injured a month in. “At that time, you feel you’re not a part of the club because you can’t contribute,” he reflected. “The club were pushing for a European spots and I couldn’t do anything.”\n\nOut for the remainder of the season, Abdullah was only cleared to play before the winter break at the end of the season. He spent the off-time training with B.93. “That ensured I returned recharged for this season,” he said.\n\n‘PRE-SEASON OF TRANSITION’\n\nIt was at B.93 where Abdullah came through the youth setup, playing in midfield, but as he neared the first team, coach Thomas Norgaard suggested he would be better off as a defender.\n\n“He felt the control I exercise as a defender would be great,” recalled Abdullah. And so, it was pre-season of transition, Abdullah adjusting to his new role. There were some mistakes, that only made him stronger, but to be a solid defender he gained more muscle and did rigorous strength training. Norgaard, to his credit, was keen on giving Abdullah every chance to prove himself as a defender.\n\n“He used to tell me that since it was he who had changed my position, it was up to him to give me chances,” Abdullah said, as he became a pivotal part of the side that gained promotion to the Danish second tier. And it was during his time at B.93 that Abdullah made his international debut for Pakistan.\n\n“For me, it was always about playing internationally for Pakistan,” Abdullah detailed. “It was about how my family would feel about it. I’d never been involved with Denmark team even at youth levels and when [Pakistan goalkeeper] Yousuf Butt contacted me, I said I was very willing.\n\n“It’s been a great journey with the national team so far. Once I met the players, it gave me a feeling of home … being with my own people. There was a great sense of brotherhood in the team right from the very first camp even though we were a mix of foreign-based and local-based players.”\n\nA year on from making his debut against Nepal, Abdullah was part of the team under Stephen Constantine that made history by recording Pakistan’s first-ever victory in a FIFA World Cup qualifier.\n\n“It is the best feeling I’ve ever had … it was very special,” reflected Abdullah. “I don’t think anything will beat that for now.”\n\nThat victory against Cambodia took Pakistan to the second round of qualifiers for the 2026 FIFA World Cup — an uncharted territory for the team — and Constantine entrusted Abdullah to become the leader of the team.\n\n“It was a new challenge but throughout my career, I’ve been very communicative,” said Abdullah. “As a captain, you have to be very vocal and under Constantine, you had to be that because he was very strict with tactics and the way we played so I had to transmit the message from the coach to the players.”\n\nPakistan’s first foray into the second round of qualifying yielded no wins but was a huge learning curve for the side. Constantine has since been replaced by Nolberto Solano and Adbullah is looking forward to working with him.\n\n“With every game we’re playing, we’re getting better and better. We need to keep working and our time will come.”\n\nAbdullah’s time too will come. “For me, it is a great feeling that the fans in Pakistan are so closely following my career. They’re so interested about the next step I take. Personally, I want to give them back as well … not only do I want them to celebrate my club career but I want to give them moments of joy with the national team as well.”\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/311247565611faf.webp",
  "retrievedAt": "2025-10-12T03:56:59.250Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938494/pakistan-football-captain-abdullah-iqbal-waiting-for-his-next-big-move",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:52:55.000Z"
}
