{
  "title": "Flood hits 52 villages in Toba Tek Singh’s Kamalia, Pirmahal - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: A high flood is currently passing through the river Ravi near Mull Fatyana in tehsil Kamalia, inundating 52 villages of Kamalia and Pirmahal tehsils. Two persons drowned in the floodwater of Chenab in Jhang.\n\nDistrict administration spokesperson Shahbaz Ansari told the media on Saturday that the number of affected people had risen to 80,154. So far, the district administration has shifted 66,639 people to safer locations.\n\nAccording to him, rescue operations are supported by Civil Defence, Punjab Police and the army personnel and rescuers and health department teams have provided first aid to 685 people and arranged transport for the evacuation of 752 residents from the low-lying areas. The livestock department teams shifted 53,710 cattle to safer places while 3,471 animals were vaccinated.\n\n“Currently, 220 people are residing in relief camps where they are being provided with all basic facilities along with fodder for their livestock,” Mr Ansari said.\n\nTwo drown in Chenab near Jhang\n\nIn Jhang district, due to heavy flooding in Chenab, the Punjab government has directed the food department to safeguard wheat stocks stored in flood-affected warehouses. Hundreds of tonnes of wheat stored in the warehouses located in low-lying and flood-hit areas are being shifted to the warehouses of the food department in Gojra.\n\nJhang district information officer Riaz Marth has confirmed that the shifting of wheat stocks is in progress and is being monitored by the district food controller Muhammad Ramzan.\n\nThe district administration claimed that all spurs in Jhang are safe and after blasting a spur near railways’ Rivaz Bridge, a breach was created due to which more than 100 rural localities and their crops had been submerged and the people and their animals had been evacuated.\n\nMr Marth said 46 government schools located in flood-affected areas had been closed. Two persons are feared drowned in flood water in Jhang district; however, Rescue 1122 or district administration have not confirmed their drowning.\n\nA villager, Noor Muhammad, was crossing the floodwater near Sultan Bahu Bridge on Chenab but drowned. The rescue teams are searching his body.\n\nAnother man, Haji Naik Muhammad, saw a 12-year-old boy crossing floodwater near Shah Jewna fighting for his life and Naik jumped into water to save him. As a result, he got trapped in deep water and drowned while people saved the child’ life by throwing a tube of the tractor’s tyre.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:57:14.464Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938600/flood-hits-52-villages-in-toba-tek-singhs-kamalia-pirmahal",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T01:25:52.000Z"
}
