{
  "title": "Dollar shortage strains rupee’s ‘artificial’ strength - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistani rupee is under increasing pressure as demand for dollars rises, while exchange companies are struggling with a severe shortage of cash dollars.\n\nCurrency experts have warned that administrative measures aimed at supporting the rupee may backfire, especially in the face of unforeseen events such as the recent flood devastation across the country.\n\nDespite the growing demand for dollars and a reduction in supply, the rupee has managed to appreciate since the government crackdown and stricter monitoring in July. However, experts believe that the current trend could be unsustainable if demand continues to outstrip supply.\n\nAccording to currency dealers, many exchange companies are running low on US dollars, raising concerns about potential hoarding or smuggling. “While smuggling has been largely controlled, hoarding is becoming increasingly likely,” said one currency dealer. This shortage is also a sign of illegal currency operators possibly entering the market, further exacerbating the situation.\n\nFaisal Mamsa, CEO of Tresmark, warned that “no force can outmuscle the market when the fundamentals are stacked against it”. The rupee has been artificially strengthened by administrative measures, especially in the open market, which has led to a significant slowdown in actual cash transactions. “Exchange companies are hardly ever holding forex cash,” Mamsa noted.\n\nExperts warn administrative measures could backfire\n\nThis situation is expected to have a negative impact on remittances in the near future. Mamsa also suggested that it might reignite the use of hawala transactions or cryptocurrency exchanges, which are increasingly used as alternatives for foreign currency dealings.\n\nSpeaking before the National Assembly’s standing committee, Dr Inayat Husain, Deputy Governor of the State Bank of Pakistan (SBP), confirmed that the rupee’s strength since mid-2024 is largely due to higher inflows and administrative controls.\n\nTo prevent an “over-correction,” the SBP has purchased $7.8bn from the market, raising reserves to $14.5bn (approximately 2.3 months of import cover). However, officials argue that the rupee is now “fairly valued,” and that interventions are necessary to ensure external stability and counter concerns of an artificial peg.\n\nMeanwhile, exporters are holding back their proceeds, further tightening supply in the market. This has created an uneasy calm — an appearance of strength amid a drying up of supply. Experts warn that if inflows continue to stagnate, the pressure on the rupee could intensify, leading to a sharp correction. “As history shows, markets are always right,” Mamsa added.\n\nOn a positive note, Pakistan stands to benefit from a 50pc US tariff on Indian textile exports, which has created a gap in the market worth around $16bn. Additionally, Pakistan enjoys a 19pc tariff on its exports to the US, which is slightly more favourable than Bangladesh and Vietnam, both of which face a 20pc tariff.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:57:29.624Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938513/dollar-shortage-strains-rupees-artificial-strength",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:52:49.000Z"
}
