{
  "title": "FBR faces Rs42bn gap amid tax slowdown - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) missed its revenue collection target by nearly Rs42 billion in the first two months of the current fiscal year, mainly due to a decline in domestic sales tax collections.\n\nBetween July and August, FBR collected Rs1.657 trillion, falling short of the target of Rs1.699tr. However, this represents a 15pc increase compared to Rs1.436tr collected in the same period last year. The FBR anticipates a slight increase in collections on Aug 31, which could help narrow the overall revenue gap, according to provisional figures.\n\nThe shortfall is largely attributed to a slowdown in sales tax collection, influenced by factors such as business closures following widespread flooding. Additionally, utility bill revenue declined by Rs39bn during the first two months of FY26.\n\nCollections from utilities in July and August totalled Rs86bn, down from Rs125bn during the same period last year. This decline is attributed to power outages and increased solarisation, which has reduced taxable consumption from conventional utility sources.\n\nAs a result of these factors, revenue collection fell short of the target by Rs54bn in August, amounting to Rs897bn against the projected target of Rs951bn. Despite this shortfall, collections in August showed a 16pc year-on-year growth from Rs777bn in August FY25.\n\nIn FY25, the FBR missed its revenue target by Rs163bn despite two downward revisions. The total collection amounted to Rs11.737tr against the revised target of Rs11.9tr. However, this represented a 26.19pc increase from Rs9.301tr collected in FY24.\n\nThe FBR has announced plans to intensify enforcement efforts, including stricter measures to combat tax fraud and curb revenue leakages. Officials expect significant improvements through digital monitoring of key industrial sectors.\n\nIn line with commitments under the International Monetary Fund (IMF) programme, the government introduced additional revenue measures totalling Rs1.05tr in the last budget. These included Rs655bn in new tax initiatives and Rs400bn through intensified enforcement. For FY26, the revenue collection target is set at Rs14.131tr.\n\nThe focus of the last budget was to balance sectoral relief, expand the tax base, achieve equitable burden-sharing, and introduce stronger enforcement measures. The government expects the digital taxation framework, carbon levies, and tax enforcement on e-commerce and digital transactions to help Pakistan align with global financial regulations.\n\nDuring July and August FY26, the FBR issued Rs118bn in refunds and rebates, down from Rs132bn a year earlier. Income tax collection reached Rs710bn, exceeding the target of Rs696bn by Rs14bn, marking an 18pc increase from Rs603bn collected last year.\n\nSales tax collection amounted to Rs631bn, falling short of the target by Rs61bn, although it marked an 11pc increase compared to Rs567bn collected in the previous year. Customs duty collection stood at Rs202bn, surpassing the target by Rs10bn and growing by 19pc from Rs170bn last year. Federal Excise Duty collection reached Rs115bn, missing the target by Rs4bn but reflecting a 21pc growth compared to Rs96bn last year.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:57:26.411Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938511/fbr-faces-rs42bn-gap-amid-tax-slowdown",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:52:49.000Z"
}
