{
  "title": "Pakistan’s sporting heroes get an unofficial safety net - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: For Pakistan’s elite athletes, the pursuit of international glory is a solitary grind against a tide of financial constraints, inadequate coaching and systemic neglect. Their greatest battle is often fought far from the spotlight.\n\nWhen Commonwealth gold-medallist weightlifter Nooh Dastagir Butt stands atop the podium, the nation sees triumph. What it doesn’t see is the anxiety that once plagued him.\n\n“People initially supported me after my triumph but after that no one helped,” Nooh revealed to Dawn, his voice carrying the weight of experience.\n\nHis sentiment is a familiar refrain in the echoing halls of Pakistani sports, a testament to a culture of fleeting glory and abandoned follow-through.\n\nThe symptoms of this neglect are myriad.\n\nFor sprinter Shajar Abbas, the nation’s fastest man, the barrier was technical. At the 2022 Commonwealth Games, his coach, the architect of his technique, was left behind, a casualty of insufficient funds.\n\n“I had never competed at such a grand level so I really missed his guidance,” Shajar recounted, while talking to Dawn. “If he was there with me the results could’ve been a lot better.”\n\nEven for those who achieve the pinnacle, like javelin thrower Arshad Nadeem, whose gold medal at the 2024 Paris Olympics was a historic moment for Pakistan, the path is fraught with similar challenges, often requiring private intervention for medical treatment and training.\n\nTheir stories are not unique. They are the defining narrative for a generation of Pakistani athletes left to navigate the path to excellence alone.\n\nA LIFELINE OUTSIDE THE SYSTEM\n\nInto this void has stepped registered dietician Rizwan Aftab Ahmed, the director of National Hospital, DHA, Lahore, whose support, driven by a sense of legacy — his family’s history includes Olympian grandfather Iftikhar Ahmed Shah and founding president of the Pakistan Hockey Federation Raja Ghazanfar Ali Khan — has become an unofficial safety net for a select group of the country’s best.\n\nThe impact of Rizwan’s intervention is tangible.\n\nFor Nooh, it translated into a monthly retainer and comprehensive healthcare for his family, a lifeline starkly evident when his father, his greatest inspiration, suffered a heart crisis.\n\n“All his procedures were done in National Hospital DHA, Lahore,” Nooh revealed.\n\n“Also Mr. Rizwan has provided me and my family with free healthcare for lifetime. That’s something huge for me,” the relief still palpable in his telling. “… There are two main characters in my life, my father and Rd Rizwan.”\n\nFor Shajar, Rizwan’s support was the key that unlocked his performance plateau. With access to proper supplements and guidance, he finally broke his two-year stall, improving his 100m time to 10.37 seconds at the Asian Athletics Championship. Later, he broke his own record again, clocking 10.34 seconds.\n\n“People don’t know about it but during my injury, Mr Rizwan assisted me and got my surgery done,” Shajar told. “So I am currently going through my rehab and hopefully will be up and running soon.”\n\nWith the surgery done Shajar is now focusing on rehab for his ultimate goal: the 2028 LA Olympics.\n\nThe benefit is as much psychological as it is physical. For undefeated Mixed Martial Artist Rizwan ‘The Haider’ Ali (10-0), the mental drain of securing sponsors was a formidable opponent before any fight.\n\n“Stressing about sponsors before the fight can really divert your attention,” Rizwan explained while talking to Dawn. “But since I am associated with Mr. Rizwan this concern is no longer one that bothers me.”\n\nThis mental clarity allows him to fully focus on the grueling, multi-disciplinary training MMA demands, all funded by this unique backing.\n\nNEED FOR REFORMS\n\nBut this private intervention, while a lifeline for these individuals, underscores a national deficiency rooted in bureaucratic mechanics.\n\nAccording to Azam Dar, former Deputy Director General Technical at the Pakistan Sports Board, the system is often hamstrung by its own rigid timelines and the federations’ poor planning.\n\n“The Pakistan Sports Board sometimes fails to release funds for athletes because federations demand the money too late,” Azam told Dawn. “The PSB finalised the budgets of federations in July and after that it’s hard to make changes.”\n\nHe cited the recent example of the Pakistan Hockey Federation, which needed Rs350 million to compete in the FIH Pro League.\n\n“The Pakistan Hockey Federation demanded Rs350 million, which PSB struggled to fulfil,” he said, illustrating the challenge of responding to opportunities with a fixed annual budget.\n\nThis financial rigidity creates a vacuum, one that federations are forced to fill by any means necessary.\n\n“When PSB don’t allocate money to federations then they look elsewhere and use their influence, as they should,” Azam explained. “The federations need their athletes to participate… They don’t care from where the money is coming, as long as it is coming.”\n\nRizwan’s model is funded partly through a DRAP-registered multivitamin brand he founded. He fiercely asserts it is not a business but a vehicle for patriotism, with most revenue funnelled back into sports and welfare. This has managed to provide what entire national institutions have not: consistent and holistic backing.\n\nHowever, this private patronage model, operating on personal trust outside official channels, are a lifeline for these individuals, it raises profound questions about the state of sports governance in Pakistan.\n\nAzam acknowledges the value of such help but implicitly confirms its ad-hoc nature.\n\n“People helping out athletes is a good thing and we need people like them to keep the system running,” he said.\n\nYet, this reliance on private generosity highlights the need for a more profound shift. Azam calls for the same systematic support that athletes like Nooh and Shajar receive privately, but from the state.\n\n“The PSB should reach out to the federations and ask them about their demands for the upcoming competitions. And give them annual, special and training grant,” he stated, emphasising that real success requires long-term investment. “You can’t build world beaters in two years, it takes money and time.”\n\nDREAMS AND DUTY\n\nThis critique highlights the central paradox: the athletes, acutely aware of their privileged position, feel a transformed sense of duty precisely because the support is so rare.\n\n“I feel like it’s my responsibility to push my limits even more now that I have all the required support,” Nooh noted, his sights now set firmly on an Olympic medal.\n\nTheir dreams are bigger because their private safety net is stronger. But their stories, coupled with an insider’s view of the system’s constraints, form a clear argument: until the state can match the efficiency and commitment of its private citizens, the nation’s sporting hopes will continue to depend on the benevolence of a few, a precarious reality for the athletes who carry its dreams on their shoulders.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/31123128a8ddc35.webp",
  "retrievedAt": "2025-10-12T03:57:04.766Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938501/pakistans-sporting-heroes-get-an-unofficial-safety-net",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T00:52:55.000Z"
}
