{
  "title": "Hundreds of Afghans return from Lower South Waziristan - Pakistan - DAWN.COM",
  "author": null,
  "content": "LOWER SOUTH WAZIRISTAN: The repatriation of Afghan refugees through the Angoor Adda border here is continuing smoothly, say the local officials.\n\nThey told Dawn that the exercise was being carried out under the supervision of the district administration with the collaboration of the Frontier Corps KP (South), police and other relevant departments.\n\nThe officials said that hundreds of Afghan nationals had so far crossed the border, with the entire repatriation process taking place in a smooth and rapid manner under the government’s monitoring.\n\nThey said that the district administration, in coordination with the local security forces, had put in place special arrangements to ensure “phased and transparent” repatriation.\n\nOfficials say every effort being made to send refugees off in dignified manner\n\nDeputy commissioner Musarrat Zaman said that vehicles carrying Afghan families were seen lined up at the Angoor Adda gate in an organised manner, with every family being handled respectfully as they crossed into Afghanistan.\n\nThe officials said that the process followed legal and border protocols to prevent any “disorder or unrest” among refugees.\n\nThey said that for the departing refugees, a dedicated 50-bed shelter had been set up at the Angoor Adda border point where drinking water, electricity and freshly cooked meals were provided to them to ensure that basic needs are met before their departure.\n\nThe officials also said that tents had been installed at Agri Park Wana to serve as temporary accommodation where families had access to bedding and other facilities while waiting for their turn to proceed to the border.\n\nThey said that heavy police and security deployments had been made both at Angoor Adda and Agri Park Wana to maintain order.\n\nAccording to FC and police officials, the deployment aims to regulate the flow of people, monitor routes and ensure that the process remains uninterrupted.\n\nThey said that no untoward incident had been reported due to strict security measures.\n\nReturning refugees expressed mixed feelings about their departure.\n\nMany families said that they had lived in South Waziristan for around four decades and had always been treated with respect and kindness by the local population.\n\n“We had a very good time here [Pakistan]. After living here for almost forty years, we don’t wish to leave. However, legal compulsions are forcing us to return to Afghanistan,” said an elderly refugee with tears in his eyes.\n\nDistrict officials and security forces pointed out that repatriation was entirely voluntary and that every effort was being made to send the refugees off with dignity.\n\nThey said that humanitarian considerations would not be overlooked at any stage.\n\nDeputy commissioner Musarrat Zaman told Dawn that overall, the repatriation process through the Angoor Adda border was proceeding in a peaceful and organised manner.\n\nHe said that the district administration, with the support of security forces, had made sufficient arrangements for shelters, essential facilities and strict security so that the Afghan families could safely return to their country.\n\nPublished in Dawn, August 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:57:13.742Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938583/hundreds-of-afghans-return-from-lower-south-waziristan",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T01:15:33.000Z"
}
