{
  "title": "President Zardari signs anti-terrorism amendment bill into law - Pakistan - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari on Sunday signed into law the Anti-Terrorism (Amendment) Bill, 2025, seeking to improve counterterrorism efforts while ensuring legal oversight and safeguards.\n\nThe amendments, made to the Anti-Terrorism Act (ATA), 1997, were passed by both the National Assembly and the Senate this month amid the opposition’s uproar, as it reinserted powers granted to law enforcement authorities (LEAs) and the armed forces to detain individuals for up to three months.\n\n“President Asif Ali Zardari has given assent to the Anti-Terrorism (Amendment) Bill, 2025,” today’s statement by the President’s House said.\n\n“This law strengthens the ability of security agencies to prevent terrorism and protect national security.”\n\nIt added that the law included judicial oversight and safeguards to provide recourse against misuse and abuse of power, unlike past arbitrary practices.\n\n“The amendment aims to improve counter-terrorism efforts while ensuring legal oversight and safeguards,” it said. “This is an important step in addressing Pakistan’s ongoing security challenges.”\n\nThe bill, a copy of which is available with Dawn.com, read: “The government or, where the provisions of section 4 have been invoked, the armed forces or civil armed forces, as the case maybe, subject to the specific or general order of the government in this regard, for a period not exceeding three months and after recording reasons thereof, issue order for the preventative detention of any person.”\n\nThis amendment was made to sub-section (1) of Section 11EEEE of the ATA.\n\nAny person suspected of activities against national security or safety will be detained, according to the bill, adding that persons involved in target killing, kidnapping for ransom, or extortion can be detained for three months.\n\nThe bill also added that it applies “against whom sufficient grounds exist of his having been so concerned, for [the] purpose of inquiry”.\n\nIt stated that the detention of a person arrested under Section 11EEEE, including detention exceeding three months, would be subject to the provisions of Article 10 (safeguards as to arrest and detention) of the Constitution.\n\nIf a detention order is issued by the army or civil forces, the investigation will be conducted by a joint investigation team, according to the bill.\n\n“The inquiry will be conducted by no police officer below the rank of superintendent of police, intelligence agencies, civil armed forces, armed forces, and other law-enforcing agencies,” the bill added.\n\nThe statement of objects and reasons, presented in the houses during the passage of the bill, said that the current security situation in the country required a “robust response that goes beyond the existing legal framework.”\n\n“The erstwhile amendment of Section 11EEEE of the Act ibid, are required to be re-inserted to empower the government, Armed Forces and Civil Armed Forces with the necessary authority to detain individuals who pose a significant threat to national security,” it added.\n\nThis provision would allow for the preventive detention of suspects based on credible information or reasonable suspicion, thereby disrupting terrorist plots before they can be executed, it said.\n\nThis will also provide law enforcement agencies with the legal backing to conduct more effective operations against terrorism. It would facilitate the use of joint interrogation teams (JITs), composed of members from various law enforcement and intelligence agencies, to conduct comprehensive inquiries and gather actionable intelligence, the statement added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/3113080905f56f6.webp",
  "retrievedAt": "2025-09-06T09:56:58.585Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938651/president-zardari-signs-anti-terrorism-amendment-bill-into-law",
  "dateList": "2025-08-31",
  "date_published": "2025-08-31T08:10:31.000Z"
}
