{
  "title": "Political momentum builds across country as 2024 nomination papers submission concludes",
  "link": "https://www.app.com.pk/national/political-momentum-builds-across-country-as-2024-nomination-papers-submission-concludes/",
  "date_published": "2023-12-24T17:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP):The nomination paper submissions for the elections-2024 ended on Sunday, leading to heightened political activity in both major and smaller cities.\nThe conclusion of the nomination paper submissions has triggered increased political fervour in provincial capitals like Lahore, Karachi, Peshawar, and Quetta, as well as in smaller cities.\nThe ECP provided political parties with a five-day timeframe for submitting their nomination papers for the upcoming general elections.\nOn Friday the electoral body extended the deadline for filing nomination papers by two days until Sunday, in response to appeals from various political parties requesting an extension in submission deadline.\nOnce the deadline ends, the ECP is set to conduct scrutiny of the nomination papers from Monday and continue it till Dec 30 as per the commission’s updated schedule.\nOver 167 candidates from three constituencies in Islamabad have submitted their nomination papers as the deadline for the 2024 general elections has ended.\nOn the final day, around 17 nomination papers were submitted for three constituencies in Islamabad. Tehreek-e-Insaf’s Shoaib Shaheen, Amir Mughal, Mustafain Kazmi and Babar Awan, along with Sardar Masroof, personally submitted their forms to enter the election race in these constituencies.\nPML-N’s Tarim Fazl Chaudhry, Pir Adil Gillani, former mayor Islamabad Sheikh Ansar Aziz, Zeeshan Naqvi,Ch Rifat Jared also submitted nomination papers. Transgender Nayab Ali, Minority candidate Samoa Younus also submitted nomination papers for Islamabad constituency.\nNoor Awan from the Muslim League (N), and Umar Awan from the People’s Party have submitted papers. This brings the total number of submitted papers to 167 from three constituencies in Islamabad.\nCandidates from the Mutahidda Qaumi Movement (MQM), Awami National Party (ANP), and Jamiat Ulema Islam (JUI) have also filed their papers in Islamabad.\nToday, the Election Commission will unveil the list of candidates, marking the commencement of candidate scrutiny from December 25 to December 30.\nThe deadline for filing appeals against the RO’s decisions on accepting or rejecting nomination papers is January 3, and the appellate tribunal is expected to decide on the appeals by January 10. The revised list of candidates will be published on Jan 11 and the last date for withdrawing one’s candidature is Jan 12.\nElection symbols will be assigned to political parties on January 13, and the polls are scheduled for February 8, as per the ECP announcement.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:11:27.046Z"
}
