{
  "title": "ECP unveils list of 175 registered political parties in Pakistan",
  "link": "https://www.app.com.pk/national/ecp-unveils-list-of-175-registered-political-parties-in-pakistan/",
  "date_published": "2023-12-24T17:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP):The Election Commission of Pakistan (ECP) on Sunday released an updated roster of 175 officially registered political parties representing a diverse spectrum within Pakistan’s political arena on Sunday.\nThe updated list no longer includes Imran Khan, the founder of Pakistan Tehreek-e-Insaf (PTI), as the head of the party, marking PTI as a leaderless political entity. Furthermore, the roster now incorporates the faction led by Pervez Khattak, known as Pakistan Tehreek-e-Insaf (PTI) Parliamentarians.\nA noteworthy event occurred earlier as PTI lost its electoral symbol, the ‘bat,’ following the Election Commission of Pakistan’s (ECP) announcement of the reserved verdict on the party’s intra-party elections.\nAfter hearing arguments from all concerned parties, the ECP initially reserved its decision. Following this, Chief Election Commissioner Sikandar Sultan Raja, leading a five-member bench of the Election Commission, declared PTI’s intra-party elections null and void.\nFollowing the ECP’s verdict, Gohar Ali Khan, who took over as PTI chairman after Imran Khan, will no longer serve as the party’s leader.\nSignificantly, the registered entities include the Istehkam-e-Pakistan Party (IPP), led by President Abdul Aleem Khan. The registration of Pakistan Tehreek-e-Insaf (PTI) is associated with its former Chairman, Pervez Khattak, while Pakistan Muslim League-Nawaz (PML-N) and Pakistan Muslim League-Quaid (PML-Q) are registered under the names of Shehbaz Sharif and Chaudhry Shujaat Hussain, respectively.\nThe list includes several other notable party affiliations. The Pakistan Peoples’ Party (PPP), led by Bilawal Bhutto Zardari, is registered as the Peoples Party Parliamentarians under Asif Ali Zardari’s name. Furthermore, the Balochistan Awami Party is registered under the leadership of President Abdul Quddus Bizenjo, and the Awami Muslim League Pakistan (AMLP) is listed under the leadership of President Sheikh Rashid Ahmed.\nThe roster also highlights other prominent political groups, including the Awami National Party (ANP) led by Asfandyar Wali Khan, the Balochistan National Party (BNP) led by Akhtar Mengal, and the Jamaat-e-Islami led by Sirajul Haq.\nAdditionally, the Jamiat Ulema Islam, led by Maulana Fazlur Rehman, and the Muttahida Qaumi Movement Pakistan (MQM-P), represented by Khalid Maqbool Siddiqui, are listed.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:11:26.098Z"
}
