{
  "title": "Youths urged to follow in Quaid-i-Azam’s footsteps",
  "link": "https://www.app.com.pk/national/youths-urged-to-follow-in-quaid-i-azams-footsteps/",
  "date_published": "2023-12-24T14:40:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 24 (APP):Experts on Sunday urged students and youths to follow Quaid-i-Azam’s principles, who always advised them to pay special attention to their studies and develop a strong academic foundation for the motherland to succeed.\nTalking to APP in connection with the 147th birth anniversary of Quaid-i-Azam Muhammad Ali Jinnah, experts said he was a great thinker and politician, who believed in serving people and discipline. He was a sagacious and visionary leader and under his able leadership, workers of the Pakistan Movement sacrificed their lives for establishment of an independent Islamic state, they opined.\nThey maintained, “Our great leader stressed a sound sense of discipline, character-building and a solid academic background. To achieve all that, youths’ first obligation should be serving themselves, their parents and the State.”\nIdara Nazriya-e-Pakistan Senior Vice Chairman Mian Farooq Altaf told APP that Pakistan has been blessed by Allah Almighty and we should be proud to be a free Pakistani. Jinnah was a great leader who defeated all conspiracies of the Britishers and Hindus and created Pakistan. We were the fourth largest economy in Asia. God willing, the period of despair will end soon and we would once again be on the road to growth,” he asserted.\nHe said that the epoch struggle and leadership of Quaid-i-Azam had become the means of creation of Pakistan and “today we are breathing in a free atmosphere because of his struggle. Quaid-i-Azam was a great human being, from whose life we can learn a lot. His opponents also testified to the fact. He was a courageous and a fair man, who always believed in the rule of law.”\nIdara Nazriya-e-Pakistan Secretary Naheed Imran Gul told APP that the organisation was educating the new generation about the vision, life and services of Quaid-i-Azam and his colleagues, adding Quaid-i-Azam used to urge students to value time, pay attention to education and lead a disciplined life.\nHe said that establishment of a separate state for Muslims on the basis of the ‘Two-nation theory’ was a right decision of our elders. “Seeing the treatment of Muslims in Indian Illegally Occupied Jammu and Kashmir and other parts of India today, we should thank Allah Almighty that we are free and residents of an independent country. Quaid-i-Azam wanted to make Pakistan a cradle of Islam, while advising students and youths to stay away from elements which spread hatred and despair. MA Jinnah believed in objective and constructive politics.”\nHe urged youths to follow in his footsteps, urging students to make the saying of Quaid-i-Azam “work, work and work” as their motto, adding adopt the habit of studying. Quaid-i-Azam always gave a message to students to pay full attention to the acquisition of knowledge, he added.\nPakistan Movement Secretary Mohammad Saifullah Chaudhry said that two days before the declaration of March 23, 1940, the founder of Pakistan, Quaid-e-Azam Muhammad Ali Jinnah hoisted the flag in Manto Park. “Despite reports of attacks during the journey from Delhi to Lahore, Quaid-e-Azam did not give up his journey. Quaid advised students to pay special attention to their studies and develop a strong academic foundation to succeed.”\nHe quoted the saying of the great leader that “without education it is complete darkness and with education it is light. Education is a matter of life and death to our nation. The world is moving so fast that if you do not educate yourselves, you will be not only completely left behind but will be finished up. The Holy Prophet (S.A.W) had enjoined his followers to go even to China in the pursuit of knowledge. If that was the commandment in those days when communications were difficult, then truly Muslims as the true followers of the glorious heritage of Islam should surely utilize all available opportunities. No sacrifice of time or personal comfort should be regarded too great for the advancement of the cause of education.”\nDecember 25 will dawn with gun salutes in the federal and provincial capitals, after which a graceful changing of the guard’s ceremony will be held at the mausoleum of Quaid-i-Azam Muhammad Ali Jinnah in Karachi.\nOfficials will lay wreaths at Quaid’s Mazar and offer Fatiha. Moreover, official ceremonies and events have been scheduled throughout the country to pay tribute to Quaid’s life, political struggles, and role in the creation of Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:11:48.981Z"
}
