{
  "title": "ECP defers delimitation grievance hearing, prioritizing general elections",
  "link": "https://www.app.com.pk/national/ecp-defers-delimitation-grievance-hearing-prioritizing-general-elections/",
  "date_published": "2023-12-24T10:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP):The Election Commission of Pakistan (ECP) postponed the delimitation grievances hearing until after the General Elections 2024, prioritizing the election schedule in line with the Supreme Court’s directive to avoid disruptions.\nReferring to recent Supreme Court orders on the delimitation issue, the Election Commission of Pakistan in its orders emphasized that challenges to delimitation by the ECP will no longer lead to election delays. In a specific case, the Supreme Court underscored the importance of General Elections as a fundamental democratic principle, diminishing the procedural significance of delimitation.\nThe notification, endorsed by Chief Election Commissioner Sikandar Sultan Raja and four members of the Election Commission, conveyed that the Supreme Court of Pakistan, in the proceedings related to the delimitation of District Zhob, Sherani (Civil Petition No 4305/2023 – Gul Khan and Others Vs. Saeed-ur-Rehman and Others), underscored that the execution of General Elections is not merely a procedural necessity but a fundamental principle upholding democratic ethos.\nWhile constituency delimitation is crucial for fair representation, it doesn’t have the same urgency as conducting general elections. Postponing elections for delimitation concerns may create governance gaps and a legitimacy crisis. Thus, prioritizing general elections aligns with the principles of proportionality and the greater good.\nThe Supreme Court emphasized that while delimitation issues are important, they should be addressed after elections. Adjudicating these matters before the elections could disrupt the timeline and derail the electoral process outlined in the program announced on December 15, 2023. The Election Commission of Pakistan, following the court’s directive, will conduct elections based on the final delimitation notified on November 30.\nHence, the ECP, by Article 218(3) of the Constitution, Section 8 of the Elections Act, 2017, and the Supreme Court’s judgment, decides to defer the hearing of petitions to avoid adverse effects on the election schedule and the nomination filing deadline.\nThe cases will be postponed until the conclusion of General Elections 2024, and elections will proceed in constituencies based on Form-VII issued by the Commission on November 30, 2023, with no alterations allowed post the Election Program’s issuance, as per Section 22 of the Election Act, 2017, the ECP says in its order.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:12:14.316Z"
}
