{
  "title": "PM felicitates Christian community on Christmas, lauds their role in progress of Pakistan",
  "link": "https://www.app.com.pk/national/pm-felicitates-christian-community-on-christmas-lauds-their-role-in-progress-of-pakistan/",
  "date_published": "2023-12-24T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar felicitated the Christian community on the occasion of Christmas and said the nation on this day should pledge to make Pakistan a model of religious tolerance and inter-faith harmony.\nIn a message on the occasion of Christmas, he said, “The Christian community is celebrating Christmas in Pakistan and across the world and I and the whole nation felicitate the Christian brothers and sisters on the happy occasion of Christmas. Christmas is the name of love, brotherhood, patience and sacrifice.”\nThese values were critical in putting a society on the path of development, he added.\nThe PM said the Prophet of Allah, Hazrat Essa (AS) healed the pain of humanity and took the message of God to the whole humanity.\nHazrat Essa (AS) reformed humanity with teachings of peace, brotherhood, tolerance and forbearance which led to the success of humans.\nThe moral teachings and the guidance of the Prophet were a beacon for humanity for all times to come, he continued.\nHe said in the present age there was an acute need to follow Hazrat Essa’s message of human compassion, affection, tolerance and fraternity.\nIn the last few years at the international level, human society had been facing an adverse situation due to a wave of religious intolerance, he observed.\n“To reverse this negative trend we have to spread Hazrat Essa’s message of brotherhood and religious tolerance and follow his teachings to make the world a cradle of peace. In this way we can forever end hatred from the world,” he remarked.\nHe said the white colour in Pakistan’s green flag represented the minorities including the Christian community which played a vital role in the progress and development of the country, and in all fields including defence, judiciary, arts, sports and education made their countrymen proud.\nThe prime minister said the Christian community laid down their lives for strengthening the foundation of the country and for its integrity and solidarity.\nHe said in the Quaid of Pakistan every person had complete religious freedom and the constitution of Pakistan provided special protection to minorities, adding every citizen was given equal rights and they had complete freedom of worship and had liberty to perform religious rituals and celebrate religious occasions.\n“The State and every citizen have the responsibility to protect their places of worship,” he asserted.\nHe said, “The issues faced by Pakistan can only be resolved when we rise above the distinctions of colour, ethnicity, and religion and work day and night as a united nation for the progress of the country.”\n“Pakistan is our home and on this occasion of Christmas we should pledge that together we will make Pakistan a model of religious tolerance and brotherhood and play our foremost role in taking our country out of all kinds of difficulties,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:11:27.039Z"
}
