{
  "title": "Ethiopian tourism pavilion gets overwhelming response in Karachi",
  "link": "https://www.app.com.pk/national/ethiopian-tourism-pavilion-gets-overwhelming-response-in-karachi/",
  "date_published": "2023-12-24T15:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP): The Ethiopian Tourism Pavilion at the Karachi Feast received an overwhelming response, attracting an impressive influx of more than 25,000 visitors over the three-day extravaganza which concluded on Sunday.\nMinister for Youth Affairs, Sports and Culture Junaid Shah graced the concluding ceremony and lauded the Embassy of the Federal Democratic Republic of Ethiopia for introducing tourism and the culture of Ethiopia in Pakistan, said a news release of the Embassy issued here.\nGovernor of Sindh Muhammad Kamran Khan Tessori and Ethiopian Ambassador in Pakistan Jemal Beker Abdula inaugurated the Ethiopian Tourism cubicle on Friday in the presence of a diverse audience, including members of the diplomatic corps, government officials, business community, media, and representatives from civil society.\nCaretaker Minister for Federal Education and Professional Training Madad Ali Sindhi graced the Ethiopian Pavilion with his presence at the Karachi Festival on Saturday.\nAn industrious endeavour by the Embassy of the Federal Democratic Republic of Ethiopia in Pakistan emerged as a beacon of cultural richness and tourism allure during the Karachi Feast.\nThe Ethiopian Tourism Pavilion gave a captivating display of Ethiopia’s multifaceted culture, rich heritage, and unparalleled tourism offerings. The Ethiopian Coffee remained the centre of attraction, drawing enthusiastic Karachiites to savour the distinctive flavours of Ethiopia.\nThe cultural performances by the Ethiopian Embassy elicited immense applause, further enhancing the immersive experience for the Karachi audience.\nExpressing his delight over the three-day spectacle, Ethiopian Ambassador Jemal Beker Abdula extended heartfelt gratitude to the Bukhari Group, organizers of the Karachi Feast, for their unwavering cooperation and support in promoting Ethiopia’s culture and tourism.\nHe also expressed his gratitude for the people of Karachi who had shown immense love and strong attachment to Ethiopia which was the land of Bilal Habeshi and King Nejashi. This experience would serve as a bridge to connect them with their ancestral land, he added.",
  "retrievedAt": "2025-08-11T11:11:08.656Z"
}
