{
  "title": "Government striving to go towards solution of Balochistan protestors problem: Solangi",
  "link": "https://www.app.com.pk/national/government-striving-to-go-towards-solution-of-balochistan-protestors-problem-solangi/",
  "date_published": "2023-12-24T16:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 24 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi said on Sunday that it was an effort of the government to go towards the solution of the problem of protestors from Balochistan through negotiations.\nTalking in a programme on “GTV” the minister said that it was desire of the interim set-up that the protestors should go back to their homes with dignity, honour and safety.\n“We want to solve the problems of the protesters and talks should be held in Balochistan or Quetta instead of Islamabad,” Solangi said.\nThe minister for information said that most of the protesters from Balochistan were women and at this time, they were present in front of the National Press Club.\nSecurity, ambulance and medical facilities were available for the protesters, Murtaza Solangi informed.\nThe minister said that it was the preference of the protestors to sit in front of the NPC and register their protest peacefully.\n“Everyone is allowed to protest peacefully and our effort is to ensure that the protestors do not face any kind of inconvenience”, Murtaza Solangi remarked.\nHe said that yesterday also, the negotiation committee held talks with the protestors.\nThe minister pointed out that the demands of the protesters were decades old.\nWhen the protestors reached Islamabad, some people were already in the NPC, Murtaza Solangi added that protesters who came from Balochistan blocked the road near Chaungi No. 26 ( Motorway Chowk).\nHe said that the local administration offered the protesters space for protest in F-9 Park and H-9 ground but they refused to go there.\nElaborating further, the minister said that late night these protesters were joined by some locals.\n“When the protestors in Islamabad started moving towards the red zone, the police tried to stop them,” Murtaza Solangi said.\nHe said some protesters were arrested who were involved in stone pelting on the law enforcement agencies.\nThe minister said that arrested women were released two days ago whereas releasing 163 arrested men was in progress.\nWhen the protestors left Balochistan, they were not stopped anywhere, Murtaza Solangi added that no ill-treatment was done to the protestors.",
  "retrievedAt": "2025-08-11T11:11:08.983Z"
}
