{
  "title": "PM’s aide lauds Punjab CM for enforcing plastic ban, urges others to follow suit",
  "link": "https://www.app.com.pk/national/pms-aide-lauds-punjab-cm-for-enforcing-plastic-ban-urges-others-to-follow-suit/",
  "date_published": "2024-06-23T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): Coordinator to the Prime Minister on Climate Change, Romina Khurshid Alam said that imposing of ban on plastic bags in the Punjab by the Provincial Chief Minister Maryam Nawaz Sharif was a long-awaited move to deal with the hazardous effects of plastic on the environment and human health.\nThe PM’s aide in a press statement on Sunday said that the Punjab chief minister has enforced a comprehensive ban on the manufacturing, distribution, sale and purchase of plastic all over the province in its strict form. “We urge other provincial governments to follow suit to make Pakistan a plastic-free country”, she added.\n“Achieving plastic-free Pakistan is an extremely challenging goal, but it is possible with coordinated efforts by all provincial governments to completely ban manufacturing, distribution and sale and purchase of plastics in all forms and manifestations at all levels,” Romina Khurshid Alam remarked.\nChief Minister Maryam Nawaz Sharif enforced the province-wide ban on plastics on June 5, a move deliberately coincided with World Environment Day marked every globally on the same day.\nThe Punjab chief minister had announced weeks before that the provincial plastic ban policy would be strictly enforced, particularly in hotels, restaurants and eateries, citing the detrimental effects of plastics on the environment and public health and stating that “No to Plastic” campaign is core of the anti-plastic policy, which aims at reducing environmental pollution and promoting eco-friendly initiatives.\nThe PM’s aide on climate change Romina Khurshid recalled that when the ban on plastics was being imposed in Islamabad under a relevant law, all the provincial, Gilgit-Baltistan and Azad Jammu and Kashmir governments were requested by the federal government to impose plastic bag in their respective provincial and admirative territories as a part of the federal government’s ‘Plastic-Free Pakistan’ campaign.\nBut, “now it is heartening to note all provincial governments are making efforts to rid the country of environmentally-damaging plastics in support to achieve the goal of Plastics-Free Plastic’,” PM’s Coordinator Romina Khurshid said, rejoicingly.\nThe PM’s aide recalled that in Islamabad implementation ban on single-use plastics and other plastic items faced stiff challenges including resistance from businesses, lack of alternatives, and enforcement issues. But, continuous efforts are needed to ensure compliance and address these challenges.\nRomina Khurshid Alam, however, underlined the urgency of banning the production, distribution and use of polythene bags, citing their detrimental environmental impact and contribution to respiratory ailments and other life-threatening conditions.\nPM’s aide also urged the provincial governments to promote use of eco-friendly alternatives like cotton bags to replace plastic bags, appealing to the citizens to switch to cloth and paper bags as alternatives to plastic.\nShe also highlighted the unprecedented importance of the public engagement through awareness campaigns to reduce the environmental impact of plastic waste and promote the use of more sustainable alternatives.\n“Without engaging public through sensitization and awareness about adverse impacts of plastics on environment and public health, the country cannot get rid of the plastic pollution,” Romina Khurshid cautioned.\nShe emphasised that plastic waste has become a major source of various kinds of pollutants, contaminating land, water bodies and oceans and it takes hundreds to thousands of years to decompose, leading to long-term pollution.\nHighlighting adverse impacts of plastics on the marine life, she PM’s aide Romina Khurshid said that plastics in the ocean harms marine animals through ingestion and entanglement. Microplastics, tiny plastic particles, are ingested by marine organisms, entering the food chain and affecting biodiversity, she added.\nShe said further that the production and disposal of plastics contribute to climate changing greenhouse gas emissions. Because, plastic production relies heavily on fossil fuels and incineration of plastic waste releases carbon dioxide and other harmful gases.\n“Developing and promoting/adopting the use biodegradable plastics, adopting recycling technologies and alternative materials would significantly mitigate the negative impacts of traditional plastics in our lives,” Romina Khrushid suggested and added, the present PM Shehbaz Sharif-led government is committed to weeding out plastics from our environment and making efforts to adopted the afore-mentioned solutions.\nThe government was already incentivizing the production and use of biodegradable and eco-friendly alternatives to plastic. Manufacturers and retailers are encouraged to transition to sustainable materials, with tax benefits and subsidies provided to support this shift, she highlighted.\nShe said further that for enhanced, improved waste management systems in the country, investments were also being made to improve the country’s waste management infrastructure by encouraging establishment of more recycling facilities, better waste segregation practices, and increased capacity for plastic waste processing.\nMeanwhile, PM’s aide Romina Khurshid Alam urged businesses and industries to adopt sustainable practices and reduce plastic usage in their operations as a part of the corporate social responsibility and to support the government’s efforts to make the country plastics free.\n“Reducing plastic use, improving waste management, and transitioning to sustainable alternatives are essential steps to mitigate the harmful impacts of plastics on the environment, human health, and the economy,” she stressed.",
  "retrievedAt": "2025-08-11T03:24:14.670Z"
}
