{
  "title": "Abdullah Gul condoles demise of Sheikh Saleh Al-Sheiba",
  "link": "https://www.app.com.pk/national/abdullah-gul-condoles-demise-of-sheikh-saleh-al-sheiba/",
  "date_published": "2024-06-23T11:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP): Chairman Tehreek-e-Jawanan Pakistan(TJP) Mohammad Abdullah Gul expressed deep sorrow over the death of Sheikh Saleh Al-Sheiba, the head of the Al-Sheibi family, the key bearer of the Kaaba.\nIn a news release, the TJP Chairman paid rich tribute to the deceased key bearer of Kabaa and shed light on the history of his tribe related to the service of Holy Kaaba.\n“He was one of the descendants of Sayyidna Uthman bin Talha, may Allah be pleased with him, and was his 109th successor. Today, the funeral prayer was offered in Masjid al-Haram after Fajr and he was buried in Jannat al-Mu’ala,” Abdullah Gul said.\nThe privilege of cleaning and serving the Kaaba belongs to the “Banu Sheiba” family, for more than 16 centuries, the cleaning of the Kaaba has been held by the descendants of Qusay bin Kalab bin Murrah in the Quraysh, from whom the Al-Sheibi family is related. Those who were the custodians of the Kaaba at that time and the same people to whom the Messenger of Allah returned the key of the Kaaba after the conquest of Makkah, he added.\n“While handing over the key of the Kaaba, the Holy Prophet (PBUH) said that this key will remain with you (in your family) until the Day of Resurrection,” Gul added.\n“The key of Kaaba has been in his family for 1400 years. When you go out from the Marwa Gate No. 25 of the Kaaba, on the right hand side is Bab Bani Sheiba, which has a very beautiful historical status. In the era of the Holy Prophet (PBUH), there was a house of Banu Sheiba, who were the key bearers of the Kaaba, in the era of ignorance. Also, the key of the Kaaba was with him, and will remain with his family until the Day of Resurrection, in this place was the house of Bani Shiba in the Prophetic period, where now there is the Bani Shiba as a monument,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:24:58.506Z"
}
