{
  "title": "President for national decisions with consensus, encouraging investment, fostering social, economic justice",
  "author": null,
  "content": "ISLAMABAD, March 10 (APP): President Asif Ali Zardari on Monday urged the parliament to empower the people, make decisions of national importance with consensus, encourage domestic and international investments for economic growth and job creation, foster social and economic justice, and ensure fairness and transparency in the system.\n“As we embark on this new parliamentary year, I urge this House to focus on promoting good governance, and political and economic stability. Our people have pinned their hopes on parliament, and we must rise to meet their expectations. It is my first duty to remind you we need to work harder to strengthen our democratic system, restore public confidence in the rule of law, and put Pakistan on the road to prosperity,” the president said in his address to the joint session of Parliament at the beginning of the 2nd parliamentary year.\nAs a civilian president to address the joint session of parliament for the 8th time at the beginning of a new parliamentary year, the president stressed that the House should fulfill the responsibility entrusted to it and play its role in nation-building, strengthening institutions and improving governance.\nIn this regard, he said improving the taxation system was essential to moving forward as a country and called for reforming and expanding the tax net—not by overburdening those who already contribute, but by ensuring that every eligible taxpayer participated in nation-building.\n“The government should take measures in the forthcoming budget to increase salaries and pensions, reduce income taxes on salaried classes and lower energy costs, which would help reduce the financial burden on them. At the same time, we should avoid downsizing and job cuts. Instead, our focus should be on creating jobs and utilizing trained manpower productively,” he added.\nThe session jointly chaired by Speaker of the National Assembly Sardar Ayaz Sadiq and Chairman Senate Syed Yousaf Raza Gilani, was attended by Prime Minister Muhammad Shehbaz Sharif and members of both houses of parliament, besides, governors, chief ministers, members of diplomatic corps, and media witnessed the proceedings from the galleries.\nThe president spelled out a set of guidelines for the parliament and the incumbent government for the economic and social growth ensuring political stability.\nThe president observed that the population dynamics of the country had changed. A combination of factors presented challenges they must address.\n“The high rate of our population growth along with strategic drift in our administrative machinery has increased governance issues manifold. It is my considered opinion that this House should take its responsibilities seriously, and play its role in a real re-set of our governance and service delivery outcomes,” he added.\nHe said that they should work actively to promote inclusive and uniform development, ensuring that no province, no district, and no village was left behind. This House should ensure that development was not limited to a few selected areas but reached every nook and corner of the country. The ignored and neglected areas demanded urgent attention from the federal government.\nThe president said that they also needed investments in infrastructure, education, healthcare, and economic opportunities to address their sense of deprivation. Parliament was the one forum where any sense of deprivation could not just be aired constructively but also addressed with political empathy by the executive branch that was the test of real statecraft.\nPresident Zardari observed that Pakistan should also diversify its exports, focusing on value-added goods and services. To explore new markets and build a competitive export-oriented economy, they needed to make our IT Industry the key driver of economic growth.\n“We should focus on building digital and information highways, investing in IT parks, enhancing internet accessibility and speed, and supporting the growth of our technology-driven economy,” he added.\nThe president also underlined the need of sustained support for small and medium enterprises, highlighting ensuring of easier access to credit, address procedural and bureaucratic hurdles, and creating of policies that promoted youth-led businesses.\nThe young people should be encouraged to enter the business world through SME-focused programs, skill development initiatives, and accessible loan schemes, he suggested.\nHe further urged the House to play its role in improving the ease of doing business. Investors, small businesses, and international companies must find Pakistan an attractive destination for investment.\n“Today the common man, the labourers, and the salaried class are facing serious economic hardships. Our citizens are burdened by inflation, high prices of essential items, and rising energy costs,” he said, urging the parliament and the government to provide real relief to the people.\nThe president noted that women constituted almost 50 per cent of the country’s population but they were under-represented in every aspect of life. It was essential to empower them by enhancing their representation in various sectors.\nThe most important intervention was to make women at the bottom of the social pyramid financially independent in accordance with the vision of Shaheed Mohtarma Benazir Bhutto. The Benazir Income Support Programme (BISP) remained a crucial lifeline for millions of families. Its reach must be expanded, and cash transfers should be further enhanced, he added.\nAbout country’s youth that make up a huge proportion of current demographic, the president said that they needed hope and inspiration.\n“We should ensure that the children are not outside schools in Pakistan. Promoting higher education and enhancing research in universities should be our fundamental priority for creating a knowledge-based economy,” he added.\nThe president, in his address, also urged the federal and provincial governments to increase allocations for the education sector in the upcoming budget on the macro level and to also provide more opportunities through scholarships and financial assistance programs.\n“This is also the moment for us to reflect on how we can enhance access to quality healthcare for all of our citizens, reduce the worrying incidence of mal-nutrition and polio vaccination in many children. Emphasis should be laid on primary health care,” he added.\nAs far as the government was concerned, he said the ministries too need to redefine their vision and objectives, and understand that pressing issues faced by the people of Pakistan have to be resolved within a certain time frame.\n“We need to deliver tangible benefits to restore the trust of the people in democratic institutions,” he opined.\nAbout democratic system, President Zardari said “Democracy needs give and take, and what better place to work on collective goals than this Parliament? As elected representatives, you function as role models for the nation. As you go about your parliamentary business think beyond narrow goals. Think of the unity and consensus our country so desperately needs.”\nAs we embark on this new parliamentary year, president further urged the House to focus on promoting good governance, and political and economic stability.\n“Our people have pinned their hopes on parliament, and we must rise to meet their expectations. It is my first duty to remind you we need to work harder to strengthen our democratic system, restore public confidence in the rule of law, and put Pakistan on the road to prosperity,” he added.\nHe said the moment marked not only the continuation of their democratic journey but also provided them with an opportunity to review their progress and reaffirm their commitment to building a better future for Pakistan.\nThe president emphasized upon striving to build a Pakistan that ‘is just, prosperous, and inclusive and make the best use of this parliamentary year.’\nHe also appreciated the government’s efforts for putting the country on a positive path to economic growth. The foreign exchange reserves witnessed a  surge. There was a substantial increase in Foreign Direct Investment and the stock market also surged to a historic high. The government also reduced the policy rate from 22% to 12%, and all other economic indicators have shown a healthy sign of improvement.\nFor any country to prosper, it must build equitably, he said, adding the century would have new global challenges, and to weather such transitions, they needed to ensure that all of their peoples, with their different regions and resources, were on board for national development.\nIt was his firm belief that a strong Pakistan was one where the fruits of progress and development were equally shared by all its provinces and citizens, he added.\nThe president said that he believed that domestic and regional connectivity was fundamental to a prosperous Pakistan.\nThey needed a strong and efficient transport infrastructure, road networks, and modernized railways.  Gilgit-Baltistan and Balochistan required special attention in terms of connectivity and development, as these regions were Pakistan’s strategic frontiers and were vital to their national economy, he said, adding this would not only lower poverty but also kick-start the economy with new jobs, skills and markets.\n“The China-Pakistan Economic Corridor (CPEC) and Gwadar Port remain central to our vision of connectivity. These projects must be fully realized so that Pakistan can serve as a gateway for international trade, linking Central Asia, South Asia, and the Middle East,” he observed.\nPresident Zardari also stressed upon the federal and provincial governments to strengthen the agriculture sector, ensure sustainable water management, and bring coordination and agency to the urgent task of managing the growing threats of climate change.\n“I say this because agriculture is a key pillar of our economy, and it is imperative that we modernize this sector by adopting new farming techniques, developing better seeds, investing in agricultural research and development, and creating more jobs by making land more productive,” he added.\nIn order to improve farm productivity, increase livestock yield, and expand food exports, he said their farmers must be equipped with modern tools.\n“We must aim for stability and self-sufficiency in food production. We need to focus on greater water availability and its efficient use. We must work toward innovative solutions such as bringing water from Tajikistan to Balochistan, upgrading irrigation systems, and utilising new technologies to conserve and distribute water,” he added.\nThe president opined that their fisheries and livestock sectors had immense potential. Pakistan’s rivers, lakes, and coastal areas held untapped opportunities for fisheries.\nCommercial cattle farming could open new avenues for employment and exports, he said and suggested to the government to play its role in providing incentives, training, and support to the youth to make these industries a vital part of their economic future.\nHe also urged the government to seek greater cooperation and exchanges with China in this regard.\nAbout climate change, the president said Pakistan was one of the countries most impacted by climate change. They should focus on restoring biodiversity, adaptive strategies on the food and water security nexus, and the preservation of eco-systems.\n“We must invest in the promotion of renewable energy and electric vehicles. We must also focus on recharging our wetlands and rivers, so they emerge pollution-free and become once again the lifeline for livelihoods and rich marine eco-systems. The Mangroves of Sindh stand as a shining example of what can be achieved through conservation efforts,” he added.\nThe president said that in Sindh, they had planted 2 billion mangroves, which also earned the Sindh government substantial finances through carbon credits and called for replicating this model proactively and benefit from the international carbon credit market.\nWith regard to current internal and external security challenges, the president said that they needed to further strengthen their security capabilities and enhance the capacity of their law enforcement agencies to effectively deal with the menace of terrorism. Parliament needed to play a role in rebuilding a consensus to tackle extremist ideologies as well as the militancy that supported such violence.\n“We are all aware of the external support and funding that terrorists are getting today, causing human and financial losses to the nation. We must unite to ensure that challenges don’t gather more momentum, because already thousands of our security forces have sacrificed their lives in the fight against terrorism, and we cannot allow resurgence again,” he added.\nThe president further assured that they were committed to eradicating this menace with the support of our nation and brave armed forces. Successful intelligence-based operations had led to the dismantling of terrorist networks that sought to destabilize the nation.\n“The entire nation is proud of its security forces and pays rich tribute to their bravery, dedication, and the countless sacrifices they have made in service to the country. At the same time, we should not forget that militancy finds roots in deprivation and inequity, so we must focus on the development of regions most affected by terrorism and create employment,” he opined.\nOutside our borders, President Zardari said the world was in different stages of transition. Pakistan remained committed to regional peace, stability, and economic integration.\n“Our foreign policy will always be guided by national interests, international cooperation, and the principles of sovereignty and mutual respect. We should enhance our cooperation with friendly regional countries in the areas of trade, economy, and climate and culture exchanges. We will continue to play our role as a responsible and peace-loving nation,” he added.\nOur time-tested relationship with China remained a cornerstone of their diplomacy, and they would continue to further strengthen economic and strategic ties with Beijing.\n“We will further cement our All-Weather Strategic Cooperative Partnership with China and continue to support the One-China Policy. During my recent visit to China, I held fruitful discussions with the Chinese leadership while inviting them to make more investments in CPEC to improve regional and economic integration,” he reaffirmed.\nThrough their recent engagements with the Chinese leadership, both nations had reaffirmed their commitment to further strengthening economic cooperation. The benefits of CPEC would reach every corner of Pakistan through different projects, he added.\nPresident Zardari also appreciated the support of trusted friends—Saudi Arabia, the United Arab Emirates, Turkiye, and others—who had stood by us in times of economic challenges and reiterated to further strengthening their longstanding historical, cultural, and economic ties with the friendly nations of the Gulf and Central Asia as well as the European Union, the United Kingdom, and the United States of America.\n“The recent successful counterterrorism cooperation between the US and Pakistan is encouraging. The two countries should build on these successes to renew and enhance cooperation for joint goals,” he added.\nThe president said the plight of their brothers and sisters in Indian Illegally Occupied Jammu and Kashmir remained a grave concern for the entire nation. The people of Kashmir had been suffering for decades under the unjust occupation, oppression, and brutal human rights violations by the successive Indian regimes.\nPakistan would always stand by them in their struggle for self-determination, he added.\n“We reaffirm our unwavering moral, political and diplomatic support for the Kashmiri people and call upon the international community to take decisive action against the atrocities being committed by the Indian Occupation Forces. The voice of the oppressed will not be silenced, and Pakistan will continue to raise this issue at every international forum,” he reiterated.\nThe president further said the serial devastation in Palestine demanded the urgent attention of the world. The Palestinian people continued to endure violence, displacement, ethnic cleansing, and oppression at the hands of Israeli security forces.\n“Pakistan is actively committed to the Palestinian cause and is consistent in calling for a just and lasting solution based on international law and the aspirations of the Palestinian people. Our position is clear and unwavering: that the establishment of an independent, sovereign Palestinian state with Al-Quds Al-Sharif as its capital is essential for lasting peace in the region,” he added.\nHe said that as President of Pakistan, he had been elected by all four provincial assemblies, the National Assembly and the Senate of Pakistan. In the constitutional framework, it was his duty to represent the Federation.\nIn the most challenging of circumstances, when his wife Shaheed Mohtarma Benazir Bhutto was assassinated, he was the one who chanted “Pakistan Khappay” as for him, Pakistan always came first, he added.\n“It is therefore my constitutional duty as your President, my personal obligation as a patriotic Pakistani, to caution this House and the government, that some of your unilateral policies are causing grave strain on the federation. In particular, the Government’s unilateral decision to carve out more canals from the Indus River System, despite strong opposition from federating units,” he said, adding as their president he could not support the proposal.\nThe president urged the government to abandon this current proposal and work together with all stakeholders to come up with viable, sustainable solutions based on unanimous consensus among the federating units.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:31:32.173Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-for-national-decisions-with-consensus-encouraging-investment-fostering-social-economic-justice/",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T11:48:00.000Z"
}
