{
  "title": "Pakistan’s first ‘Dematerialized Digital Identity Card’ launched on NADRA’s silver jublilee",
  "author": null,
  "content": "ISLAMABAD, Mar 10 (APP):The National Database and Registration Authority (NADRA) has announced the launch of Pakistan’s first “dematerialized digital identity card” during its Silver Jubilee ceremony on Monday.\nThis development marks a revolutionary milestone in the national identity system.\nThe ceremony featured the unveiling of a commemorative coin by the State Bank of Pakistan, a special postage stamp by Pakistan Post, and a book chronicling NADRA’s 25-year journey.\nA special event was held at NADRA headquarters, with Major General (Retd.) Zahid Ehsan, the founding Chairman of NADRA, as the chief guest. Other attendees included Lieutenant General (Retd.) Asif Munir, Chairman of NADRA, the Special Secretary of Interior, Chief Statistician (Pakistan Bureau of Statistics), Director General of Immigration & Passport, former NADRA chairpersons, board members, and senior officials.\nIn his written message, Federal Minister for Interior and Narcotics Control, Syed Mohsin Raza Naqvi, termed the launch of Pakistan’s first dematerialized digital identity card as a significant step toward digital identity transformation.\nHe announced that after integrating this feature into the Pak ID mobile app, citizens will be able to store their identity cards on their smartphones. Additionally, a digital verification system will be introduced soon, facilitating secure and instant verification for various services under the World Bank-backed Digital Economy Project. The pilot phase of this initiative will begin on Independence Day 2025.\nThe minister also highlighted that NADRA extends identity services to remote areas within the country and Pakistanis living abroad, while also assisting law enforcement agencies in national security matters.\nTo commemorate NADRA’s 25-year journey, the State Bank of Pakistan issued a special commemorative coin, while Pakistan Post launched a special postage stamp. A documentary on NADRA’s achievements was also screened, and a commemorative book was unveiled, receiving great appreciation from the attendees.\nSpeaking on the occasion, NADRA’s founding chairman, Major General (Retd.) Zahid Ehsan, reflected on the organization’s establishment and early journey, stating that NADRA has continuously evolved to turn its vision into reality and is steadily achieving new milestones in its development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:31:29.913Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistans-first-dematerialized-digital-identity-card-launched-on-nadras-silver-jublilee/",
  "dateList": "2025-03-10",
  "date_published": "2025-03-10T12:05:00.000Z"
}
