{
  "title": "Kashmir issue, a looming nuclear war threat over South Asia",
  "link": "https://www.app.com.pk/national/kashmir-issue-a-looming-nuclear-war-threat-over-south-asia/",
  "date_published": "2021-02-02T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 2 (APP):Irresolution of the world towards Kashmir issue is a matter of sheer disappointment for people of the South Asian region and its peace is at stake with a lurking danger of war between the two nuclear neighbors India and Pakistan, already gone through several battles and skirmishes on conventional lines since partition of the sub-continent by the British rule in 1947.\nThe issue remained a bone of contention between the two South Asian arch rivals as evident from their maiden war within the first year of their independence over Kashmir, and perhaps from the recent episode when Indian jets violated Pakistan space in February last year.\nA report published by Washington-based think tank, Carnegie Tsinghua Centre for Global Policy last year in April also pointed out deepening hostilities between India and Pakistan over Kashmir issue as its author asserted that over the past years, both the countries have reached again on the brink of war.\nPrime Minister Imran Khan, who extended an olive branch to his counterpart many a time, also warned recently that India was planning a false flag operation against Pakistan in order to divert the world’s attention from its ongoing genocide in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHe also termed the issue a ‘potential flashpoint while urging the world community for resolution of the unresolved Kashmir dispute.\nTherefore, there are many grounds to believe that imminent danger of war hovered over the South Asian region and that too was due to belligerent attitude of India which was adamant to tread on collusion course.\nIt has snubbed peace overtures, made by Prime Minister Imran Khan during his over two and half year tenure and resorted to misadventures that seriously put the regional peace in peril.\nRevocation of Articles 370 and 35-A from the Indian constitution to change demographic apartheid of Kashmir was classic example of Indian bellicosity, which is at its peak especially after installation of Narendra Modi as Prime Minister of the so-called secular state,\nCan anyone imagine the scale of destruction, what will happen, if any provocation triggers a war between the two-atomic powers.\nThe consequences will not be limited to just the South Asian region; it would eventually engulf the whole world as aptly described UN Secretary-General Antonio Guterres in his recent press conference ‘a disaster of unmitigated proportion’.\nThe world community knows very well the tragic story of the IIOJK and atrocities being committed by India against its people.\nBut, it is high time for the world to take action and help Kashmiris get their right to self-determination by holding an independent plebiscite in line with United Nations Security Council resolutions, before it is too late!.",
  "retrievedAt": "2025-08-11T20:18:22.330Z"
}
