{
  "title": "COVID-19 reversed economic achievements of Govt: Hafeez Shaikh",
  "link": "https://www.app.com.pk/national/covid-19-reversed-economic-achievements-of-govt-hafeez-shaikh/",
  "date_published": "2020-10-21T16:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 21 (APP):Adviser to Prime Minister on Finance Dr Abdul Hafeez Shaikh Wednesday said that the COVID-19 pandemic had reversed the economic achievements of the government in Pakistan.\nHe was addressing a gathering of Ministers and Governors of Middle East, North Africa, Afghanistan and Pakistan (MENAP) Region of the International Monetary Fund (IMF) on the occasion of Managing Director IMF’s interaction with Ministers and Governors of the Region through video link.\nThe discussion focused on the impact of Corona Virus on the economies of the region, lessons learnt through the experiences and policy guidelines to be adopted to deal with the crisis of such magnitude which has caught the world by surprise.\nThe participants thanked the MD IMF Kristalina Georgieva and her team for arranging the discussion and highlighted the need to play a more effective role as a multilateral development partner whose advice would be of much value and importance according to the needs of the changing times.\nThe participants agreed that the virus has exposed the world’s need for health spending and to focus more on technological solutions to various problems.\nIt was observed that after the first wave of the pandemic almost all the countries have lost a significant share of their GDP and unemployment has become the biggest challenge.\nIt was agreed if the second wave comes, losses will be massive and the achievement made by some countries during the crisis will be lost if the preventive measures are not adopted as a part of their everyday life.\nThe participants praised the Debt Suspension Initiative of the G-20 and said that there is also a need to provide more finances to the vulnerable economies.\nIt was a consensus that employment generation, equality and inclusion will be the new challenges from the perspective of women and youth and new strategies will be needed to help the women and youth in the region.\nThe Adviser observed that incurring more expenditure to provide for the people at or below the poverty line will require more borrowing as it would not be possible to increase taxes at a time of declining growth in the economy.\nHe said though there were fiscal constraints, after the pandemic, the government had devised a strategy to provide whatever it could to its people and businesses by direct cash transfers and sharing the load of various expenditures of the small businesses.\n“The Government is determined to provide employment and fight in-equality”.\nHe reiterated that if the government wanted to continue economic reforms, there were two real challenges; arranging funding for pro-poor expenditures and prioritizing the need for development spending.\nAdviser Finance said that there was a need to adopt a coherent strategy with the partner countries in the region for development.\nHe added no matter how fair or transparent the Governments were in their intentions and operations this unusual situation had made them realize that there was a need for taking support from their friends and development partners in the form of technical advice and financial support and for that all must contribute.",
  "retrievedAt": "2025-08-11T19:55:40.792Z"
}
