{
  "title": "GPKSC lambastes Indian occupying forces move of grabbing Kashmiris properties through new construction laws in IIOJK:",
  "link": "https://www.app.com.pk/national/gpksc-lambastes-indian-occupying-forces-move-of-grabbing-kashmiris-properties-through-new-construction-laws-in-iiojk/",
  "date_published": "2020-10-21T11:34:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Oct 21 (APP): Britain-based Kashmiris rights outfit Global Pakistan Kashmir Supreme Council (GPKSC) Wednesday strongly condemned the Indian nefarious move to grab the lands of Jammu & Kashmir State people by amending existing construction and development laws in the Indian Illegally Occupied Jammu & Kashmir (IIOJK) State.\nThe puppet IIOJK State Administrative Council headed by Delhi’s installed Lt Governor G.C. Murmu recently approved a proposal to amend the Control of Building Operations Act, 1988 and the Development Act, 1970 for notifying “strategic areas” for use by the Indian occupational forces and regulating construction through a special dispensation.\nTalking to reporters here , the GPKSC Chairman Raja Sikander Khan, currently on official visit of Pakistan and Azad Jammu Kashmir to discuss the vibrant role of Pakistani and Kashmiri Diaspora community in Britain and other European countries raising the urgency of early peaceful settlement of Kashmir question, with the Pakistani and AJK leadership, said that the motive behind promulgation of such laws in occupied Kashmir is absolutely clear that the Indian government wants to establish settlements in the so-called strategic areas to house the Indian citizens thereafter granting them citizenship under the new domicile laws.\nThe move, he said, is aimed at to turn the majority of Kashmiri Muslims into the minority in their own internationally-acknowledged disputed homeland.\n“The latest amendments will expedite the process of demographic changes in the occupied state and turn the entire region into an Indian military garrison,” Khan emphasized.\nThe GPKSC Chairman continued that after the start of construction process by Indian occupation forces, the forests land of the territory will further squeeze and this will have highly negative impacts on the environment of the region.\nRaja Sikander Khan maintained that the puppet regime of occupied Kashmir has already handed over 243 hectares of land to Indian military and paramilitary forces, while the occupational Indian Army had already unlawfully occupied over 21 hectors of land.\nRaja Sikander said that under the new law, the Indian Army can declare any part of the occupied territory including agricultural lands, residential areas and neighbourhood to be “strategic areas”.\nThe GPKSC Chairman also vehemently condemned the continual molestation of the Kashmiri women by the Indian forces including recent shifting of three Kashmiri woman leaders Asiya Andrabi, Naheeha Nasreen and Fehmida Soofi by the Indian government to the punishment wards of Tihar Jail in New Delhi.\nHe called upon the international human rights organizations to raise their voice against the fascist tactics of the Indian government and prevent it from outraging fundamental human rights of the Kashmiri people.\nSikander Khan underlined that since the lockdown enforced by the Indian government in occupied Jammu and Kashmir since August 5 last year, more than 13,000 Kashmiri youth have been detained in different jails of occupied Kashmir and India where they were facing the worst inhuman torture.\nThe GPKSC Chairman said that the sole motive behind these fascist and imperialist tactics of India was that the Kashmiri people give up their demand for the realization of their right to self-determination, which had been acknowledged by the whole international community including the United Nations through the UN resolutions passed since over seven decades.",
  "retrievedAt": "2025-08-11T19:55:44.348Z"
}
