{
  "title": "Ayaz hails PM’s proposal for neutral, impartial investigation of Pahalgam incident",
  "author": null,
  "content": "ISLAMABAD, Apr 28 (APP): Speaker National Assembly Sardar Ayaz Sadiq Monday hailed the proposal of Prime Minister of Pakistan Mian Muhammad Shehbaz Sharif for an impartial and transparent investigation into the Pahalgam incident.\nAyaz Sadiq also emphasized that the Indian government should respond positively to Pakistan’s proposal for a neutral probe instead of indulging in baseless accusations and misinformation campaigns, said a news release issued here.\nHe also said that PM’s offer is based on goodwill and a genuine desire to uncover the truth, demonstrating Pakistan’s commitment to peace, transparency and justice.\nHe urged the Indian government to accept this offer rather than perpetuating false narratives and levelling false allegations against Pakistan.\n“The offer for independent, transparent and impartial investigation aims to expose the real perpetrators behind the Pahalgam tragedy in Indian Illegally Occupied Jammu and Kashmir,” he added. “Rather than engaging in the blame game and maligning Pakistan without evidence, India must cooperate to ensure that justice prevails”, he said.\nAyaz Sadiq also said that any misadventure by India, using the Pahalgam incident as a pretext, would be met with a strong and decisive response from Pakistan.\nHe reiterated that Pakistan’s armed forces are fully capable of defending the nation’s sovereignty and territorial integrity against any aggression.\n“India’s belligerent attitude and war hysteria risk endangering the peace and stability of the entire region,” he warned. “Pakistan’s valiant armed forces possess the capability to give a befitting and effective response to any form of Indian aggression and the entire Pakistani nation stands resolutely alongside its defenders.”\nHe also condemned India’s attempts at “water aggression” by trying to manipulate the flow of rivers in violation of international agreements, asserting that such attempts will never succeed.\n“Pakistan will not allow any compromise on its fundamental national interests,” NA Speaker affirmed. “The people of Pakistan, alongside the Parliament and all sectors of national life, remain steadfast in their commitment to defend the motherland.”\nAyaz Sadiq has also said that Pakistan has been fighting war of terrorism and has lost more than ninety thousand lives with economic stagnation.\nHe also reiterated Pakistan’s unwavering resolve to maintain peace but asserted that any provocation would be firmly countered in defense of national dignity and sovereignty.\nAyaz Sadiq also urged international community to take notice of belligerent Indian aggression and asked India for conducting an impartial inquiry into Pahalgam incident.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:58:14.981Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ayaz-hails-pms-proposal-for-neutral-impartial-investigation-of-pahalgam-incident/",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T11:20:00.000Z"
}
