{
  "title": "ECP sets May 16 deadline for postal ballot applications in PP-52 by-elections",
  "author": null,
  "content": "ISLAMABAD, Apr 28 (APP):The Election Commission of Pakistan (ECP) has set May 16 as the last day to apply for postal ballots for the upcoming by-elections in PP-52, Sialkot IX, Punjab.\nAn ECP spokesman stated that according to the law, this service has been expanded to individuals in government positions, members of the armed forces, their spouses, and their eligible children residing with them, given they are registered voters and typically reside away from their constituency location.\nPeople with physical disabilities who are unable to travel and possess a national identity card with a physical disability logo issued by the National Database and Registration Authority (NADRA) can also vote via postal ballot, the poll body spokesman stated.\nAdditionally, individuals who are detained in prison or held in custody are also eligible to vote by postal ballot.  The ECP advised that individuals appointed by the returning officers, including police personnel, to perform duties at polling stations other than where they are eligible to vote, should apply for a postal ballot to the returning officers within three days of their appointment.\nTo apply for a postal ballot, please use the specified form and submit it to the Returning Officer, Muhammad Iqbal, who is the Additional Deputy Commissioner (Revenue) Sialkot. He can be reached at his office by calling 052-9250466.\nAdditionally, it was mentioned that application forms for postal ballots are available from the respective returning officers and the ECP’s website.\nThe ECP stated that individuals issued postal ballots will not have the right to vote in person at polling stations. Finally, it emphasized that the application must be forwarded and endorsed by the office or department of the voter to prevent unauthorized persons from applying for a postal ballot.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:57:21.898Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ecp-sets-may-16-deadline-for-postal-ballot-applications-in-pp-52-by-elections/",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T18:28:00.000Z"
}
