{
  "title": "“A Moment in Time”- Masterpieces by three artistic legends on display at NAG",
  "author": null,
  "content": "ISLAMABAD, Apr 28 (APP):In a rare convergence of artistic brilliance, three of Pakistan’s celebrated creative minds including Jimmy Engineer, Professor Dr. Rahat Naveed Masud, and Amna Ismail Pataudi have come together to present an exhibition, “A Moment in Time”, opened at the National Art Gallery (NAG).\nThe exhibition was organized by For Art Sake in collaboration with the Pakistan National Council of the Arts (PNCA), and will remain open until May 12, on working days.\nThe exhibition is more than a display of artworks; it is a vivid dialogue between memory, culture, and imagination.\nEach canvas breathes life into forgotten moments, quiet reflections, and evolving identities. Through their distinct yet complementary styles, the trio invites visitors to pause, reflect, and experience the powerful beauty of moments captured through art.\nSince embarking on his professional journey in 1976, Jimmy Engineer has created over 2,000 paintings, 1,000 calligraphies, and countless prints, many of which reside in private collections across the globe. His body of work spans multiple genres, from historical events and religious themes to landscapes and abstract compositions.\nEngineer’s paintings are renowned for their emotional intensity and meticulous detail, particularly his celebrated series on the Partition of India and interpretations of Allama Iqbal’s Javid Nama.\nHis compositions, often cinematic in scale, blend realism with symbolic depth, evoking powerful emotional responses. While his classical draftsmanship draws widespread admiration, some critics argue that Engineer’s work tends toward overt didacticism, sometimes favoring message over subtlety.\nNevertheless, his dedication to narrative realism resonates strongly with audiences, earning him wide public acclaim.\nHis outstanding contributions have been recognized with honors including the Sitara-e-Imtiaz (2005) and Hilal-e-Imtiaz (2025) awarded by the Government of Pakistan.\nA pioneering figure in Pakistan’s art world, Professor Dr. Rahat Naveed Masud holds a PhD in Fine Arts (Art Practice) from the UK. She has served as Principal of the College of Art & Design and Dean of the Faculty of Art and Humanities at the University of the Punjab, Lahore. Her work has been exhibited widely across China, Iran, India, Korea, Oman, the USA, the UK, and beyond. Among her many honors are the Pride of Performance, the International Artist for Peace Award (Shanghai), and several national recognitions for her contribution to painting and arts education.\nIn Beyond the Self, the series featured in this exhibition, Masud explores the genre of self-portraiture. These paintings serve not merely as personal reflections but as mirrors of the broader socio-cultural environment. Her portraits chronicle the journey of a generation born post-Partition, navigating societal transformations and personal introspections. Masud’s paintings are deeply personal yet resonate collectively, mapping the interconnectedness of individual and societal narratives.\nHer visual storytelling captures the resilience and complexity of human experience, reflecting Pakistan’s evolving cultural landscape through her keenly observed self-representations.\nArtist, curator, critic, and educator, Amna Ismail Pataudi brings a multifaceted vision to A Moment in Time. Known for her meticulous technique and thematic depth, her paintings often emphasize heritage, spirituality, and identity, skillfully blending traditional techniques with modern sensibilities.\nHer celebrated book 47 Paintings showcases artistic interpretations of world musical instruments using miniature techniques and mixed media, highlighting her innovative approach to visual storytelling. In her paintings, still-life compositions become dynamic expressions of memory, culture, and emotion.\nBeyond her own art practice, Pataudi has curated major exhibitions that promote diverse artistic expressions. She co-curated A Moment in Time at PNCA, underscoring the role of still-life painting in contemporary art.\nHer curatorial work includes Mirror to the Soul featuring Chinese portraits by Professor Zhao Yingming, Humanism: Flowering of the Being in London supporting charitable causes, and Challenging Oeuvres in Lahore showcasing differently-abled artists from the Differently Abled Artists Consortium (DAAC). Through both her artwork and curatorial initiatives, Pataudi champions cross-cultural dialogue, inclusivity, and the celebration of artistic heritage.\nTogether, Jimmy Engineer, Dr. Rahat Naveed Masud, and Amna Ismail Pataudi offer a rich, multi-layered journey into memory, culture, and identity — inviting visitors to experience a moment suspended in time.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:57:25.778Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/a-moment-in-time-masterpieces-by-three-artistic-legends-on-display-at-nag/",
  "dateList": "2025-04-28",
  "date_published": "2025-04-28T16:38:00.000Z"
}
