{
  "title": "Developing states outperform developed economies in 2024 - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Developing economies outperformed developed nations in 2024, with imports and exports rising by 4pc for the year and 2pc in the fourth quarter, mainly driven by East and South Asia.\n\nIn contrast, developed economies saw stagnant trade for the year and a 2pc decline in the last quarter, according to a UN Conference on Trade and Development (UNCTAD) report.\n\nThe ‘Global Trade Update’ issued on Friday says global trade hit a record $33tr in 2024, growing by 3.7pc, with most regions seeing positive growth, except for Europe and Central Asia. Services led the expansion, growing 9pc annually and adding $700bn, which is nearly 60pc of the total growth.\n\nTrade in goods grew 2pc, contributing $500bn. However, overall trade growth slowed in the second half of 2024, with trade in goods growing less than 0.5pc and services just onepc in the fourth quarter.\n\nThe US trade deficit with China reached $355bn, widening by $14bn in the fourth quarter, while its deficit with the EU increased by $12bn to $241bn. Meanwhile, China’s trade surplus reached its highest level since 2022, and the EU reversed previous deficits, posting a trade surplus for the year, helped by high energy prices.\n\nThe report says trade remained stable in early 2025, but mounting geo-economic tensions, protectionist policies and trade disputes signal likely disruptions ahead.\n\nRecent shipping trends also indicate a slowdown, with falling freight indices signalling weaker industrial activity, particularly in supply chain-dependent sectors.\n\nPublished in Dawn, March 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:13:57.164Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898149/developing-states-outperform-developed-economies-in-2024",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T01:32:16.000Z"
}
