{
  "title": "Economic optimism tosses index over 115,000 - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Despite a pause in interest rate cuts and a weakening rupee due to declining foreign exchange reserves, the Pakistan Stock Exchange (PSX) remained in the green zone for the fifth consecutive week, propelling above 115,000 level after almost two months.\n\nAccording to AKD Securities Ltd, the week started on a negative note as the State Bank of Pakistan’s Monetary Policy Committee delivered a surprise status quo in the benchmark interest rate at 12pc coupled with the IMF raising concerns over the government’s plan for resolving Rs1.25 trillion circular debt through commercial bank borrowing, kept investors cautious.\n\nThis positive performance was supported by improved investor sentiment following some ‘relaxations’ provided during the first review by the visiting IMF mission.\n\nThe market traded within a narrow band of 2,100 points during the week, remaining lacklustre as trading activity was subdued due to Ramazan.\n\nDuring the last two sessions, the market turned positive owing to some developments in the discussions with the IMF team, which improved sentiment. As a result, the KSE-100 index closed at 115,536 points, reflecting a gain of 1,137 points or 0.99pc week-on-week.\n\nThe IMF has agreed to cut the tax collection target by Rs620bn to Rs12.35tr while assuring readjustments in expenditure by authorities to maintain a primary surplus of Rs2.4tr. Notably, the FBR tax collection during 8MFY25 missed the target by R600bn.\n\nMoreover, the IMF revised Pakistan’s GDP growth forecast to 2.0-2.25pc from 3.6pc earlier while lowering its inflation projection to 7.0pc from 12.5pc.\n\nMeanwhile, Moody’s up­­graded Pakistan’s banking sector outlook to positive from stable, along with an upward revision in GDP growth projection.\n\nOther major developments during the week included China rolling over a $2bn loan to Pakistan for one more year, the government hiking tariff for captive power plants by 23pc on IMF prodding, and the ECC approving amendments to net-metering regulations, cutting buyback rate to Rs10 per unit.\n\nAccording to Arif Habib Ltd (AHL), the status quo in the monetary policy against the expectations of a 50bps cut hurt the market.\n\nHowever, the momentum shifted to the green zone mid-week on the anticipation of potential development related to the settlement of energy circular debt.\n\nMoreover, the remittances by overseas Pakistanis increased by 39pc year-on-year to $3.1bn (highest after June 2024) during February. Furthermore, the government raised Rs15.8bn against the target of Rs350bn, with the cut-off yield for five-year bonds remaining unchanged while 10-year declined by 1bps.\n\nThe SBP foreign exchange reserves fell by $152 million week-on-week, settling at $11.1bn as of March 7.\n\nSector-wise positive contributions came from Exploration and production (234 points), OMCs (194 points), banks (179 points), cement (118 points), and fertiliser (110 points).\n\nMeanwhile, the sectors that contributed negatively were engineering (46 points), glass and ceramics (45 points), leather and tanneries (37 points), and automobile assembler (36 points). Scrip-wise positive contributors were Mari Energies (303 points), PSO (174 points), HBL (65 points), Engro Fertiliser (53 points), and DG Khan Cement (51 points). Whereas, scrip-wise negative contribution came from Millat Tractors Ltd (52 points), Service Industries (37 points), Pakistan Petroleum Ltd (34 points), Habib MetroBank (28 points), and International Steel Ltd (28 points).\n\nForeigner selling continued clocking in at $2.61m compared to a net sell of $5.3m last week. Major selling was witnessed in commercial banks ($2.8m), followed by E&P ($1.2m).\n\nThe average volume rose 16pc to 337m shares while the value traded jumped 21.1pc to $79m week-on-week.\n\nAccording to AKD Securities, the market will likely stay bullish with the potential announcement of a Staff-Level Agreement with the IMF. The KSE-100 index is likely to sustain its upward trajectory, with a target of 165,215 points by December, primarily driven by strong earnings in fertilisers, sustained ROEs in banks, and improving cash flows of E&P and OM.\n\nPublished in Dawn, March 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:13:56.443Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898148/economic-optimism-tosses-index-over-115000",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T01:32:16.000Z"
}
