{
  "title": "Karachi Whites, Bahawalpur win National T20 Cup openers - Sport - DAWN.COM",
  "author": null,
  "content": "FAISALABAD: Defending champions Karachi Region Whites and Bahawalpur Region registered victories on the opening day of the Bank Alfalah presents Inverex Solar Energy National T20 Cup here at the Iqbal Stadium on Friday.\n\nSkipper Saud Shakeel led Karachi Whites from the front with a match-winning half-century as they romped to a 30-run victory in the rain-hit first match of the tournament.\n\nAfter electing to bat first, Karachi Whites posted 159-6 in the allotted 20 overs.\n\nLeft-handed Saud smashed nine fours and one six in his 50-ball 76 while opening the batting. Khurram Manzoor was the other notable run-getter scoring 29 off 17 balls with four fours and one six.\n\nFor Islamabad, Naseerullah Khan and Musa Khan picked up two wickets each while Arsal Sheikh and Umair Afridi claimed one apiece.\n\nIn reply, Islamabad slipped to 27-4 and were struggling at 73-5 before the rain stopped play in the 14th over. Karachi Whites’ Mohammad Umar claimed two wickets while Danish Aziz, Arif Yaqoob and Saqib Khan took one each.\n\nSaud was named player-of-the-match.\n\nIn the second Group ‘B’ fixture, Bahawalpur Region crushed Dera Murad Jamali Region by 61 runs in a seven-overs-a-side fixture.\n\nAfter opting to bat first, Bahawalpur’s openers Aun Shahzad (28 off 16 balls) and Mohammad Sudais (21 not out off 12) stitched a quickfire half-century partnership.\n\nSkipper Mohammad Imran smashed 16 off eight while Faizan Zafar made a four-ball 16. Bahawalpur posted 95-3 in the allotted seven overs.\n\nDM Jamali in reply could only manage 34-6 in their seven overs.\n\nFor Bahawalpur, Imran Khan Sr and Salahuddin took two wickets each.\n\nImran Khan Sr was declared man-of-the-match.\n\nScores in brief:\n\nKarachi Region Whites beat Islamabad Region by 30 runs (DLS method).\n\nKARACHI WHITES 159-6 in 20 overs (Saud Shakeel 76, Khurram Manzoor 29, Saad Baig 18 not out; Naseerullah Khan 2-21, Musa Khan 2-43); ISLAMABAD 73-5 in 13.1 overs (Ali Imran 26, Hammad Siddique 25 not out; Mohammad Umar 2-9)\n\nBahawalpur Region beat Dera Murad Jamali Region by 61 runs.\n\nBAHAWALPUR 95-3 in 7 overs (Aun Shahzad 28, Mohammad Sudais 21 not out; Mohammad Shahid 3-11); DERA MURAD JAMALI 34-6 in 7 overs (Mohammad Uzair 11; Salahuddin 2-7, Imran Khan Sr 2-9).\n\nPublished in Dawn, March 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/161113436412e95.jpg",
  "retrievedAt": "2025-10-12T01:59:42.582Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898200/karachi-whites-bahawalpur-win-national-t20-cup-openers",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T01:32:23.000Z"
}
