{
  "title": "After the review - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE successful conclusion of the first performance review of the IMF’s extended $7bn funding programme for the first half of the fiscal year is a positive development for the cash-strapped economy.\n\nThe end-of-mission statement acknowledges that “programme implementation has been strong, and the discussions have made considerable progress in several areas”, including fiscal consolidation for durable reduction in public debt, tight monetary policy to keep inflation in check, energy sector reforms, the structural reform agenda to accelerate growth, social protection, and health and education spending.\n\nThat the IMF and authorities here have “made significant progress towards reaching a staff-level agreement on the first review” underlines that the talks did not encounter any major impediment — a rare occasion in recent years where the lender has refrained from imposing stricter conditions after scrutiny of its programmes in spite of delays in the execution of certain goals and failure to meet benchmark targets.\n\nHowever, this is where the story of the first review ends and future challenges begins. For now, the IMF has apparently ignored some delays and slippages. Whether it will continue to provide similar waivers on unmet goals over the remaining life of the bailout or start tightening the screws will be known once the Memorandum of Economic and Fiscal Policies is released by the lender and talks over the next budget conclude.\n\nMore worrisome is the increasing impatience with slow economic growth, as real estate tycoons scramble to persuade the prime minister to push faster growth by granting yet another tax amnesty and other concessions to the housing sector. The same group, which had convinced Imran Khan’s government to allow a tax amnesty and lucrative incentives for the construction industry, is now active, and trying to coax Shehbaz Sharif to grant it something similar. Stepping into this trap would be suicidal, both economically and politically.\n\nOrdinary people have paid a heavy price because of such experiments and do not have any strength to repeat them. The government would be doing them and itself a favour by focusing solely on restructuring the economy, preparing it for durable growth by attracting foreign private investments to boost productivity and exports rather than embarking on wasteful misadventures.\n\nSo far the government is delaying any decisions on such proposals. But for how long? Facing a formidable political challenge from the PTI in its stronghold of Punjab, it will increasingly come under pressure from ‘pro-growth’ lobbies within its own ranks and from outside in the coming months. Any unseen inflows from the Gulf could make it jettison the reforms agenda and pursue consumption-based growth. That would be nothing short of a disaster for the country and its people.\n\nPublished in Dawn, March 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:59:47.296Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898217",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T02:33:48.000Z"
}
