{
  "title": "Storm in US leaves 14 dead - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: At least 14 people were dead and several injured after violent tornadoes swept across the central United States, officials said on Saturday.\n\nTwenty-six tornadoes were reported but not confirmed to have touched down late on Friday night and early on Saturday as a low pressure system drove powerful thunderstorms across parts of Arkansas, Illinois, Mississippi and Missouri, said David Roth, a meteorologist at the National Weather Service’s Weather Prediction Centre.\n\nThe Missouri State Highway Patrol confirmed 11 “storm-related fatalities” in a statement on X, saying that local authorities were “working tirelessly to assist those in need and assess the damage.”\n\n“Today there is a high risk for more tornadoes across Alabama and Mississippi. The chance is 30 per cent,” he said. “That’s pretty significant.”\n\nThe state police reported downed trees and power lines, as well as damage to residential and commercial buildings, with some areas severely impacted by “tornadoes, thunderstorms and large hail.”\n\nSix fatalities were reported in Missouri’s Wayne County, three in Ozark County — where multiple injuries were also reported — and one each in Butler and Jefferson counties, police said. Seven others were killed in the storms, the Missouri Highway Patrol said on X, without giving details.\n\nAs the storms regain strength, the highest possible risk of tornadoes and severe thunderstorms is on Saturday night, forecasters said. The storms will move east throughout the day on Saturday and could hit as far east as the Florida Panhandle and Atlanta by midnight, according to the NWS.\n\nIn the neighbouring state of Arkansas, officials said three people had died and 29 had been injured in the storm.\n\nPublished in Dawn, March 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67d61fe6814eb.gif",
  "retrievedAt": "2025-10-12T13:02:17.707Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898176/storm-in-us-leaves-14-dead",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T01:32:31.000Z"
}
