{
  "title": "FIA offloads four more passengers in Gujrat - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: The immigration authorities of Federal Investigation Agency offloaded at least four passengers of different flights whereas four other passengers were briefly detained.\n\nOfficial sources said that a passenger namely Zeeshan having passport no CX5843351 was departing to Saudi Arabia by flight no G9553 and got hit due to “Deportee data 2022”.\n\nAnother passenger Rizwan having passport no YX5150381 was departing from SIAL to UAE by flight no FZ316 and got hit due to “Deported due to illegal entry”. The passenger namely Roshan having passport no P62760NW arrived from Canada by flight no QR630 and got hit due to “Drug trafficking, prisoner deported from Sri Lanka” whereas another passenger Muhammad Usman having passport no BT2856753 arrived from KSA by flight no OV505 and got hit due to “FIR number 07/2023 PS DACE HQ Anti-Corruption Est.”\n\nAt least four other passengers were offloaded that include Rizwan Azad Ullah having passport no BK1871531 was departing from SIAL to KSA by flight no PK745 and offloaded due to “purpose of visit not justified, insufficient funds, no paid hotel booking”.\n\nAnother passenger namely Muhammad Akram having passport no GN0161692 was departing from SIAL to KSA by flight no PK745 and offloaded due to “No show money and no paid hotel booking”.\n\nThe passenger namely Ayaz Ahmad having passport no MR1184261 was departing from SIAL to Uganda by flight no FZ338 and offloaded due to “Purpose of visit not justified, having no show money”. Abdul Qadeer having passport no FL1078303 was departing from SIAL to Uganda by flight no FZ338 and offloaded due to “Self-request”.\n\nAn FIA official said all the passengers were later released after verification.\n\nPublished in Dawn, March 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:59:54.649Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898225/fia-offloads-four-more-passengers-in-gujrat",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T02:44:18.000Z"
}
