{
  "title": "India batter Virat Kohli not ready to retire - Sport - DAWN.COM",
  "author": null,
  "content": "Indian batter Virat Kohli said he may not have another tour of Australia left in him after his team’s humbling 3-1 test series defeat Down Under but the 36-year-old has ruled out retiring anytime soon as he still enjoys playing the game too much.\n\nKohli arrested a long run of poor form with an unbeaten ton in the series opening test in Perth in November, but frequently chased balls moving away from his stumps and managed a total of 190 runs at an average of 23.75.\n\nSpeaking at the RCB Innovation Lab Indian Sports Summit on Saturday, Kohli said the slump was reminiscent of his dismal run in England in 2014 where he made 134 runs.\n\n“If you ask me the intensity of how disappointed I’ve been, the recent Australia tour would be the one that’s most fresh. So it might feel the most intense,” Kohli said.\n\n“For a long time, the tour of England in 2014 bothered me the most. But I can’t look at it that way. I might not have an Australia tour again in four years. I don’t know. You have to make peace with whatever’s happened in your life.”\n\nKohli quit Twenty20 internationals after India’s World Cup win last year but continues to play in the Indian Premier League for Royal Challengers Bengaluru.\n\nHe remains a key member of India’s test team, and played a big role in their 50-overs Champions Trophy triumph last week.\n\n“Me playing the game is not for achievements,” Kohli added.\n\n“It pretty much comes down to the pure joy and enjoyment and love for the game. As long as that love is intact, I’ll continue to play the game. I have to be honest about that with myself.\n\n“Don’t get nervous, I’m not making any announcements, as of now everything’s fine.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:13:28.637Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898257/india-batter-virat-kohli-not-ready-to-retire",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T08:05:59.000Z"
}
