{
  "title": "Millions of Cubans spend second night without electricity - World - DAWN.COM",
  "author": null,
  "content": "Millions of Cubans were without electricity for a second night on Saturday after a widespread blackout hit the island, the fourth in less than six months.\n\nCubans have been facing a serious economic crisis marked by widespread food, fuel and medicine shortages, and the island’s ageing and often failing power system has made things worse.\n\nThe latest major outage began late on Friday at a substation near the capital Havana and then spread nationwide, affecting most of the cash-strapped island’s 9.7 million people.\n\nAuthorities said on Saturday they were working to restore power, but acknowledged progress was slow.\n\nIn the meantime, Cubans were doing their best to get along.\n\nJorge Suarez, a 47-year-old lawyer, was having a beer at a Havana bar where a small generator was helping keep the place open.\n\n“You get used to the conditions,” he told AFP. “It’s like the animals that live in the desert: they have to adapt to live without water.\n\n“We just have to adapt and wait for the government … to resolve the problem.”\n\nAdela Alba, 37, owns the establishment, which also serves as a grocery store.\n\n“It’s very difficult to work like this,” she said.\n\nHer generator allows her to “maintain a minimum of service, because we have to pay the rent and the taxes despite the situation”. she added.\n\nElsewhere, people cooked meals using firewood due to the months-long gas shortage, while others gathered in homes or businesses with generators so they could charge their cell phones.\n\nAriel Mas Castellanos, an official with the power company in Havana, told local media that the equipment that failed “has been in service for many years and is getting old”.\n\nThe authorities said on Saturday that parallel circuits were helping provide power to priority sectors like hospitals and some neighborhoods.\n\n“Several provinces have parallel circuits and generator units are starting to be synchronised” with the national grid, President Miguel Diaz-Canel said on X.\n\nSilvia Torres, a 64-year-old resident of Las Tunas province in eastern Cuba, is in an area benefiting from the parallel circuits.\n\n“Thanks to God, we woke up with light … a blessing because I know that many provinces are still in the dark,” she told AFP by phone.\n\nThe outage on Friday evening plunged the streets of Havana into darkness, forcing people to navigate by phone and flashlight and to get home to dry taps.\n\n“No elevator, no water, it’s awful. I feel cornered, very annoyed,” said Ruben Borroto, 69, who has to walk up seven floors to his apartment in the capital.\n\n“Even if you don’t want it to, this situation upsets you,” said 26-year-old Daymi Echenique, adding that she has not had a second of light. “There is not a drop of water, and the food is starting to spoil,” she said.\n\nMuch of the Cuban capital faces near-daily power cuts of four or five hours — outages that can last 20 hours or more in the provinces.\n\nIn February, authorities suspended all activity on the island for two days to avoid a widespread blackout.\n\nTwo outages in the final quarter of 2024 lasted several days, one of them during a hurricane.\n\n“God help us, this country is going from bad to worse,” 82-year-old Havana resident Xiomara Castellanos said on Saturday.\n\nCuba’s eight thermal power plants, nearly all dating to the 1980s or 1990s, experience regular failures.\n\nFloating Turkish power barges and a series of generators shore up the national power system, but the US embargo in place since 1962 makes it difficult to import fuel.\n\nThe government is now rushing to install at least 55 solar parks this year — enough, it says, to supply 12 per cent of national demand.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/16170205ac4f95b.jpg",
  "retrievedAt": "2025-08-25T15:13:28.082Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898277/millions-of-cubans-spend-second-night-without-electricity",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T12:17:34.000Z"
}
