{
  "title": "US strikes in Yemen kill 31 as Trump vows to end Houthi attacks - World - DAWN.COM",
  "author": null,
  "content": "The first US strikes against Yemen’s Houthis since Donald Trump took office killed 31 people, the rebels said on Sunday, with the US president warning “hell will rain down upon” the group if it did not stop attacking shipping.\n\nThe Houthis, who have attacked Israel and Red Sea shipping throughout Israel’s bombardment of Gaza, said children were among those killed.\n\nAn AFP photographer in the rebel-held capital Sanaa heard explosions and saw plumes of smoke rising.\n\nAttacks on Sanaa, as well as on areas in Saada, Al-Bayda and Radaa, killed at least 31 people and wounded 101, “most of whom were children and women”, health ministry spokesperson Anis Al-Asbahi said.\n\nFootage on Houthi media showed children and a woman among those being treated in a hospital emergency room, including a dazed girl with blackened legs wrapped in bandages.\n\nTrump, in a post on social media, vowed to “use overwhelming lethal force” to end the Houthi attacks, which the rebels say are in solidarity with Palestinians in Gaza.\n\n“To all Houthi terrorists, your time is up, and your attacks must stop, starting today. If they don’t, hell will rain down upon you like nothing you have ever seen before!” Trump posted on his Truth Social platform.\n\nTrump also warned Iran that it needed to immediately halt support for the group. He said if Iran threatened the United States, “America will hold you fully accountable and, we won’t be nice about it!”\n\nThe unfolding strikes — which one US official told Reuters might continue for weeks — represent the biggest US military operation in the Middle East since Trump took office in January. It came as the US ramps up sanctions pressure on Tehran while trying to bring it to the negotiating table over its nuclear programme.\n\nThe Houthis’ political bureau described the attacks as a “war crime”.\n\n“Our Yemeni armed forces are fully prepared to respond to escalation with escalation,” it said in a statement.\n\nResidents in Sanaa said the strikes hit a building in a Houthi stronghold.\n\n“The explosions were violent and shook the neighborhood like an earthquake. They terrified our women and children,” one of the residents, who gave his name as Abdullah Yahia, told Reuters.\n\nAnother strike on a power station in the town of Dahyan in Saada led to a power cut, Al-Masirah TV reported earlier today. Dahyan is where Abdul Malik al-Houthi, the enigmatic leader of the Houthis, often meets his visitors.\n\nThe Houthis, an armed movement that took control of most of Yemen over the past decade, have launched scores of attacks on ships off its coast since November 2023, disrupting global commerce and setting the US military on a costly campaign to intercept missiles and drones that have burned through stocks of US air defences.\n\nA Pentagon spokesperson said the Houthis have attacked US warships 174 times and commercial vessels 145 times since 2023. The Houthis say the attacks are in solidarity with Palestinians over Israel’s military onslaught in Gaza with Hamas.\n\nIran’s other allies, Hamas and Hezbollah in Lebanon, have been severely weakened by Israel since the start of the Gaza conflict. Syria’s Bashar al-Assad, who was closely aligned with Tehran, was overthrown by rebels in December.\n\nBut throughout, Yemen’s Houthis have remained resilient and often on the offensive, sinking two vessels, seizing another and killing at least four seafarers in an offensive that disrupted global shipping, forcing firms to reroute to longer and more expensive journeys around southern Africa.\n\nThe US administration of then-president Joe Biden had sought to degrade the Houthis’ ability to attack vessels off its coast but limited the US actions.\n\nUS officials, speaking on condition of anonymity, say Trump has authorised a more aggressive approach.\n\nThe strikes on Saturday were carried out in part by fighter aircraft from the Harry S. Truman aircraft carrier, which is in the Red Sea, officials said.\n\nThe US military’s Central Command, which oversees troops in the Middle East, described Saturday’s strikes as the start of a large-scale operation across Yemen.\n\n“Houthi attacks on American ships & aircraft (and our troops!) will not be tolerated; and Iran, their benefactor, is on notice,” Defence Secretary Pete Hegseth wrote on X. “Freedom of navigation will be restored.”\n\nTrump held out the prospect of far more devastating military action against Yemen.\n\n“The Houthi attack on American vessels will not be tolerated. We will use overwhelming lethal force until we have achieved our objective,” Trump wrote.\n\nOn Tuesday, the Houthis said they would resume attacks on Israeli ships passing through the Red Sea and Arabian Sea, the Bab al-Mandab Strait and the Gulf of Aden, ending a period of relative calm starting in January with the Gaza ceasefire.\n\nIran’s Foreign Minister Abbas Araqchi said the US government had “no authority, or business, dictating Iranian foreign policy”.\n\n“End support for Israeli genocide and terrorism. Stop killing of Yemeni people,” he said in an X post earlier today.\n\nIran’s mission to the United Nations did not immediately respond to a request for comment.\n\nIran’s foreign ministry condemned deadly US strikes against Houthi rebels, saying they violated international law.\n\nMinistry spokesman Esmaeil Baqaei “strongly condemned the brutal air strikes by the US” in a statement, denouncing them a “gross violation of the principles of the UN Charter”.\n\nThe US attacks came just days after a letter to Iran’s Supreme Leader Ayatollah Ali Khamenei from Trump was delivered, seeking talks over Iran’s nuclear programme.\n\nKhamenei on Wednesday rejected holding negotiations with the United States.\n\nStill, Tehran is increasingly concerned that mounting public anger over economic hardships could erupt into mass protests, four Iranian officials told Reuters.\n\nLast year, Israeli strikes on Iranian facilities, including missile factories and air defenses, in retaliation for Iranian missile and drone attacks, reduced Tehran’s conventional military capabilities, according to US officials.\n\nIran has denied wanting to develop a nuclear weapon. However, it is dramatically accelerating enrichment of uranium to up to 60 per cent purity, close to the roughly 90pc weapons-grade level, the UN nuclear watchdog — the International Atomic Energy Agency — has warned.\n\nWestern states say there is no need to enrich uranium to such a high level under any civilian programme and that no other country has done so without producing nuclear bombs. Iran says its nuclear programme is peaceful.\n\nRussian Foreign Minister Sergei Lavrov urged the United States to cease strikes against Yemen’s Houthis, the foreign ministry said.\n\nLavrov spoke to US Secretary of State Marco Rubio by telephone, the ministry said.\n\n“In response to the American representative’s arguments, Sergei Lavrov stressed the need for an immediate cessation of the use of force and the importance for all sides to engage in political dialogue in order to find a solution that would prevent further bloodshed,” the ministry said.\n\nIn an apparent sign of US efforts to improve ties with Russia, Secretary of State Marco Rubio spoke yesterday with Lavrov to inform him about the US strikes in Yemen, the State Department said.\n\nRussia has relied on Iran-provided weaponry in its war in Ukraine, including missiles and drones, US and Ukrainian officials say.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/16171022791312c.jpg",
  "retrievedAt": "2025-08-25T15:13:29.512Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898243/us-strikes-in-yemen-kill-31-as-trump-vows-to-end-houthi-attacks",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T04:58:14.000Z"
}
