{
  "title": "BLA behind attack: state media",
  "author": null,
  "content": "A vehicle-borne suicide bomber on Sunday attacked a security forces convoy in Balochistan’s Noskhi district, leaving three security personnel and two civilians martyred, the military’s media wing said in a statement.\n\nAccording to the Inter-Services Public Relations (ISPR), as a result of the attack, “five brave sons of soil embraced shahadat (martyrdom)”.\n\nThe martyred soldiers were identified as Nawabshah district’s Havildar Manzoor Ali, Naseer Abad district’s Havildar Ali Bilawal and Badin district’s Naik Abdul Raheem.\n\nBus drivers Jalaluddin from Quetta and Muhammad Naeem from Kharan were also martyred, according to the ISPR.\n\n“In the ensuing sanitisation operation, the terrorists were pursued and after [an] intense fire exchange, three terrorists were effectively neutralised by the security forces,” the ISPR said.\n\nThe military’s media wing added that sanitisation operations in the area would continue and the “perpetrators of this heinous and cowardly act will be brought to justice”.\n\n“Security forces of Pakistan, in step with the nation, remain determined to thwart attempts at sabotaging peace, stability and progress of Balochistan and such sacrifices of our brave soldiers and valiant civilians further strengthen our resolve,” the statement concluded.\n\nEarlier today, state media reported that three Frontier Corps (FC) personnel were among five lives lost as the BLA targeted an FC convoy on a highway in Balochistan’s Noshki district.\n\nThe banned Balochistan Liberation Army (BLA) emerged as a key perpetrator of terrorist violence in Pakistan in 2024, as frequency of high-intensity attacks by outlawed groups has been increasing in the province, according to security reports.\n\nAccording to PTV News, security forces had cordoned off the area, blocking all escape routes of terrorists.\n\nNoshki Senior Superintendent of Police (SSP) Hashim Momand said more than 30 paramilitary force members were wounded, Reuters reported.\n\nEarlier, Noshki Station House Officer (SHO) Zafarullah Sumalani had said that five FC personnel were martyred while at least 12 others were injured in the explosion.\n\nAccording to SHO Sumalani, evidence from the incident site suggested that a suicide attacker rammed an explosive-laden vehicle into the FC convoy.\n\nThe injured were being shifted to the FC Camp and Noshki Teaching Hospital, where an emergency had been imposed, the police officer added.\n\nSHO Sumalani feared that the death toll and number of injured would rise since several of the injured were in critical condition.\n\nThe attack drew condemnations from leaders across the country.\n\nPresident Asif Ali Zardari and Prime Minister Shehbaz Sharif strongly condemned the blast and expressed their sorrow over the loss of lives.\n\nIn their separate statements, they prayed for the high ranks of the departed souls and the early recovery of those injured.\n\nPM Shehbaz also directed that the wounded be provided with the best possible treatment.\n\n“Such cowardly acts cannot shake our resolve against terrorism,” the prime minister affirmed.\n\nInterior Minister Mohsin Naqvi condemned the “blast near a bus on the Noshki-Dalbandin Highway” and expressed his grief over the loss of five lives.\n\nIn a statement posted by his ministry on X, Naqvi expressed his sympathies to the bereaved families and prayed for the speedy recovery of the injured.\n\n“Targeting innocent people is the height of brutality,” the interior minister said, adding that anti-state elements were “plotting a heinous conspiracy to create instability” in the country.\n\nEchoing PM Shehbaz’s statement, Naqvi asserted that such cowardly acts could not weaken the nation’s firm resolve.\n\nDenouncing the attack, Balochistan Chief Minister Sarfraz Bugti vowed strict action against terrorists.\n\n“Those who play with the peace of Balochistan will be brought to a tragic end,” CM Bugti said in a press release.\n\n“Cowardly attacks cannot lower our morale,” he said. “There is no place for terrorists in Balochistan, peace will be established at all costs.”\n\nCM Bugti vowed that all possible steps will be taken to bring the enemies of peace to justice.\n\n“This war will continue till every last terrorist is eliminated,” the chief minister said, adding that everyone in Balochistan is indebted to those who shed their blood for this homeland.\n\nThe Balochistan government also condemned the attack, spokesperson Shahid Rind said in a statement.\n\n“Targeting innocent civilians is a brutal act,” the statement said. Rind prayed for the speedy recovery of the injured and expressed condolences to the families of the deceased.\n\n“Enemy elements are trying to destabilise the country,” the statement said. “The people’s morale cannot be lowered through terrorism.”\n\n“We stand with the affected families in their hour of grief,” Rind said.\n\nMilitants in Balochistan, previously engaged in a low-level insurgency, have recently intensified their attacks. The outlawed BLA, in particular, has adopted new tactics to cause higher casualties and directly target Pakistani security forces.\n\nLast year, the interior ministry noted a “significant rise in terrorism incidents and evolving terrorism patterns” since the Afghan Taliban seized control of Kabul in August 2021, especially in the Tehreek-i-Taliban Pakistan’s activities in KP, the Baloch nationalist insurgency in Balochistan, and ethno-nationalist violence in Sindh.\n\nToday’s incident comes after a cop was martyred last night while six others were wounded in a blast near a vehicle of Balochistan’s Anti-Terrorist Force (ATF) in Quetta.\n\nIt also follows the recent Jaffar Express train hijacking near Balochistan’s Sibi area, in which 26 hostages, including 18 security personnel, lost their lives. Five more security personnel were martyred during the operation.\n\nFollowing the attack, the military vowed to take decisive action against terrorists operating in Balochistan, along with their abettors and facilitators, both inside and outside the country.\n\nPakistan ranked second in the Global Terrorism Index 2025, with the number of deaths in terrorist attacks rising by 45 per cent over the past year to 1,081.\n\nLast month, 18 soldiers were martyred while 23 terrorists were killed in various sanitisation operations in Balochistan within 24 hours, according to the Inter-Services Public Relations (ISPR).\n\nFebruary saw a marginal increase in terrorist attacks but witnessed a sharp surge in civilian casualties, according to a report published by the Islamabad-based think tank, Pakistan Institute for Conflict and Security Studies (Picss).",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/16135502b1ba91c.png",
  "retrievedAt": "2025-10-12T01:59:55.250Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898259/three-security-personnel-among-5-martyred-in-noskhi-blast-ispr",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T07:37:04.000Z"
}
