{
  "title": "OIC calls for ‘decisive action’ to combat Islamophobia - World - DAWN.COM",
  "author": null,
  "content": "UNITED NATIONS: Pakistan on behalf of the Organisation of Islamic Cooperation (OIC) has called on the world to act “decisively” in countering the rising Islamophobia and other forms of anti-Muslim hate, bigotry and intolerance, as the UN General Assembly marked the International Day to Combat Islamophobia on Friday.\n\n“Our aim must be to promote a collective effort to combat Islamophobia with unity and empathy,” said Ambassador Munir Akram, Pakistan’s permanent representative of Pakistan to the UN.\n\n“We should commit to utilising the positive messages of peace, justice, tolerance and compassion that Islam and indeed all religions offer to combat Islamophobia and all other manifestations of hate, bigotry and intolerance,” Mr Akram told the 193-member assembly, which also heard solidarity messages from UN Secretary-General Antonio Guterres and the Assembly President, Philemon Yang.\n\nIn 2022, the General Assembly adopted a resolution, co-sponsored by Pakistan, designating March 15 as the International Day to Combat Islamophobia.\n\nGuterres sees ‘disturbing rise’ in anti-Muslim bigotry\n\nMr Akram said, “Islamophobia is not restricted to one region. It is resurgent in the West and the East.\n\n“Islamophobia is now being used as an avenue for political advancement and popularity, feeding the worst human instincts of fear, prejudice and hate [and] in some countries, Muslims are being systematically marginalised and suppressed.”\n\nHe urged the governments to ensure that their policies and laws reflect an “unambiguous commitment” to religious tolerance.\n\n“No nation can claim to be a true democracy while it systematically alienates and marginalises its Muslim citizens,” he said.\n\n“In many places,” he added, “prejudice against Muslims is being stoked rather than suppressed, resentments are being revived rather than reconciled, and discrimination is being legitimised by policies and pronouncements.”\n\nHe cited the Christchurch attack of 15 March 2019 and the Israeli atrocities on Palestinians in Gaza as “vivid illustrations of Islamophobia, hatred and racism.”\n\nAmbassador Akram thanked the UN chief for indicating his intention to nominate Miguel Moratinos, a senior Spanish diplomat and the head of the UN Alliance of Civilisation, as his special envoy on Islamophobia.\n\nAmbassador Akram also appreciated the efforts of some Western countries, including Sweden and Denmark, which have enacted laws to address Islamophobia, including criminalisation of desecration of the Holy Quran and to ensure that freedom of expression is not misused to propagate hate and intolerance.\n\nHe noted that Canada has appointed a special representative to combat Islamophobia, while the US launched a national strategy against anti-Muslim hate.\n\nAustralia has also appointed a special envoy to promote interfaith dialogue. “We urge other nations to follow suit,” Mr Akram said.\n\n‘Attack on all’\n\nIn his address, the UN secretary-general has urged everyone to speak out against xenophobia and discrimination to combat a “disturbing rise” in anti-Muslim bigotry.\n\n“This is part of a wider scourge of intolerance, extremist ideologies, and attacks against religious groups and vulnerable populations,” said Mr Guterres, who is on a Ramazan solidarity visit to Bangladesh.\n\nHe said when one group is attacked, “the rights and freedoms of all are at risk”.\n\nMr Guterres called on governments to foster social cohesion and protect religious freedom and for online platforms to curb hate speech and harassment.\n\nPublished in Dawn, March 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:14:11.899Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898141/oic-calls-for-decisive-action-to-combat-islamophobia",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T01:31:58.000Z"
}
