{
  "title": "Starmer says ‘coalition of willing’ expanding preparations for post-truce Ukraine - World - DAWN.COM",
  "author": null,
  "content": "LONDON: British Prime Minister Keir Starmer said on Saturday European nations and Western allies were stepping up preparations to support Ukraine in the event a peace deal was struck with Russia, with defence chiefs to firm up “robust plans” next week.\n\nStarmer hosted a virtual meeting to win support from allies to increase pressure on Russian President Vladimir Putin to accept a ceasefire deal being pushed by US President Donald Trump, and to gather commitments to help secure any agreement — something Trump has made clear he expects Europe to take on.\n\nSome 26 fellow leaders took part, including those from Germany, France, Italy, Canada and Australia as well as Ukrainian President Volodymyr Zelensky and Nato’s secretary general — but not the US. Starmer said the “coalition of the willing” had reaffirmed its commitment both to supporting Ukraine as it resists Russia’s three-year-old invasion and to securing any ceasefire that emerges from Trump’s overtures to Russia.\n\nBritish prime minister says Putin will have to ‘come to table’\n\nWhile Russia has welcomed the ceasefire proposal in principle, it has also put forward a list of conditions that essentially restate its war aims, suggesting that any agreement will not come quickly. Starmer told reporters: “We agreed we will keep increasing the pressure on Russia, keep the military aid flowing to Ukraine, and keep tightening restrictions on Russia’s economy to weaken Putin’s war machine and bring him to the table.”\n\nJolted into action by Trump’s reluctance to keep underwriting Europe’s and Ukraine’s security, other Western countries have been forced to show that they are prepared to step up.\n\n“Our militaries will meet on Thursday this week here in the United Kingdom to put strong and robust plans in place to swing in behind a peace deal and guarantee Ukraine’s future security,” Starmer said. “President Trump has offered Putin the way forward to a lasting peace. Now we must make this a reality.”\n\n‘Sooner or later’\n\nStarmer asserted after the virtual summit that the “ball was in Russia’s court” and that President Vladimir Putin would “sooner or later” have to “come to the table”. While Ukraine had shown it was the “party of peace” by agreeing to a 30-day unconditional ceasefire, “Putin is the one trying to delay,” he said.\n\n“If Putin is serious about peace, I think it’s very simple, he has to stop his barbaric attacks on Ukraine and agree to a ceasefire, and the world is watching,” he added.\n\nUkrainian President Volodymyr Zelensky warned that Russia wanted to achieve a “stronger position” militarily ahead of any ceasefire, more than three years since it invaded his country. “They want to improve their situation on the battlefield,” Zelensky told a Kyiv press conference.\n\nZelenskiy said he had told Kyiv’s Western allies they must “define a clear position on security guarantees”, including a commitment to basing troops on Ukrainian soil. “This is a security guarantee for Ukraine and a security guarantee for Europe,” he said in a post on X.\n\nPublished in Dawn, March 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:59:50.694Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898180/starmer-says-coalition-of-willing-expanding-preparations-for-post-truce-ukraine",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T01:32:31.000Z"
}
