{
  "title": "Grilled fish draws people for iftar at Peshawar’s Namak Mandi - Pakistan - DAWN.COM",
  "author": null,
  "content": "As the holy month of Ramazan continues, a unique trend has emerged in Peshawar’s vibrant food scene: grilled fish has become a favorite dish for iftar parties, attracting a growing number of people to the city’s famous Namak Mandi food street.\n\nOn Sunday, the area buzzed with activity as locals gathered to indulge in the mouthwatering fish, which was grilled with a variety of spicy sauces.\n\nNisar Ali, a 40-year-old fish vendor who operates a popular eatery at Namak Mandi, was seen working tirelessly to fulfill an ever-growing number of orders.\n\nSurrounded by a substantial stocks of freshly unloaded fish, Ali and his team of three cook various types of fish, including rahu, shermai, mahsher and grass carp as demand soars.\n\nNasir’s efforts, despite the pressure of the iftar rush, were focused on serving timely meals to customers, many of whom took food home for iftar parties.\n\n“The recent rise in the prices of meat and chicken has led to a shift in food choices during iftar,” Nasir explained. “Seafood, particularly grilled fish, has become a more popular and affordable option for people here in Khyber Pakhtunkhwa.”\n\nHe noted that the demand for fish has soared, not only in Peshawar but across the province, providing a positive economic boost to local businesses.\n\nAli, who transitioned to the fish business 20 years ago after failing to secure a government job, now enjoys a successful career while providing employment to three other people.\n\nAccording to him, nearly 200,000 people are directly or indirectly involved in KP’s fisheries sector. He added that the province’s native fish species were more suited for local markets, as transportation costs from places like Sindh and Balochistan made the fish less economical.\n\nMany customers, like Riaz Khan, a resident of Nowshera, have developed a preference for grilled fish at iftar.\n\n“Grilled fish is my favorite dish, especially during Ramazan,” he said, adding that he and his family had visited Namak Mandi to enjoy the fish and flavourful sauces. He also noted that the prices of grilled fish were significantly lower than meat or chicken in Peshawar.\n\nWhile Namak Mandi is becoming an increasingly popular food street for locals, Riaz Khan called for official recognition of the area as a designated food street, hoping to attract more visitors and boost the local economy after Ramazan.\n\nMuhammad Zubair, the director of the fisheries department, said that fish demands increased during Ramazan after prices of meat and chicken increased in KP.\n\n“Pakistan, a country rich in water resources from marine, saline, and freshwater reservoirs, is home to a vast diversity of aquatic life,” he said.\n\nAccording to the fisheries department, there are 531 species of fish across the country, including 233 freshwater species from rivers, lakes, and ponds in KP. Freshwater ponds cover an area of 60,470 hectares, and natural warm-water lakes span 110,000 hectares.\n\nHowever, despite the abundance of resources, fish consumption in Pakistan remains low, with per capita consumption standing at just two kilogrammes per year compared to the global average of 17kg in normal days.\n\nProf Dr Muhammad Naeem from the Economics Department at the University of Swabi highlighted the profitability of fish farming and the significant potential it holds for boosting Pakistan’s economy.\n\n“If the country provides financial incentives to fish farmers, it could alleviate some of the economic challenges it faces,” Dr Naeem said.\n\nHe pointed to a notable increase in seafood exports, which earned the country over Rs12.40 billion, adding that the fisheries sector has a bright future, especially with the completion of the second phase of the China-Pakistan Economic Corridor.\n\nIn recent years, fish production in Pakistan has risen sharply. In the 2016-17 financial year, the country produced 477,000 metric tons of fish, a significant increase from just 8,430 metric tons in 2010.\n\nHowever, challenges such as overfishing, water pollution, and the impacts of climate change continue to pose a threat to the sustainability of fish farming in Pakistan. The indigenous shermai fish, found in the River Kabul, is particularly vulnerable due to pollution and overfishing.\n\nZubair emphasised the need to take strict action to protect this endangered species, suggesting that measures like banning hunting and preventing the discharge of contaminated water into the river could help preserve it for future generations.\n\nIn KP, the demand for fish farming is on the rise, and the provincial government is taking steps to support the industry’s growth. Under the ‘Development of Cold Water Fisheries Resources’ project, joint federal and provincial efforts are underway to establish 297 trout lakes in Malakand and Hazara divisions.\n\nAdditionally, trout farming has become increasingly popular in these areas, with projects like the Trout Village initiative seeing the establishment of 93 trout fish farms.\n\nThese efforts are expected to boost fish production in the province, potentially increasing it from 400 metric tons to 740 metric tons in the coming years.\n\nUsman Ali, General Secretary of the Swat Trout Fish Farming Association, stressed the importance of supporting trout farmers with incentives and improved infrastructure.\n\nHe called for further development of trout farming in the region, citing the potential for substantial revenue generation. “A farmer with 50 marlas of land and proper water management can produce 3,000kg of trout, earning about Rs2.5 million in profit,” he explained.\n\nDespite the challenges faced by the fisheries sector, such as the impact of climate change on trout farming, the potential for growth remains significant. With the right investments and policies, Pakistan could further tap into its fisheries resources, bolstering both its economy and food security.\n\nAs grilled fish continues to gain popularity in Peshawar’s iftar scene, the province’s fisheries industry is poised for growth after investment.\n\nWith increased demand for seafood, particularly during Ramazan, and governmental support for fish farming, the sector has the potential to make a lasting impact on the local economy and provide a sustainable source of income for thousands of families.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/1621010008ed2e2.jpg",
  "retrievedAt": "2025-08-25T15:13:22.719Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898297/grilled-fish-draws-people-for-iftar-at-peshawars-namak-mandi",
  "dateList": "2025-03-16",
  "date_published": "2025-03-16T16:04:59.000Z"
}
