{
  "article_id": "2025-10-14_b191b5fde031ecda66d9bb72b8cca241",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sardar-yousaf-hosts-dinner-in-honour-of-mwl-secgen-top-political-religious-leaders-attend/",
    "retrieved_at": "2025-10-17T00:03:08.106Z"
  },
  "metadata": {
    "title": "Sardar Yousaf hosts dinner in honour of MWL SecGen; top political & religious leaders attend",
    "author": null,
    "date_published": "2025-10-14T13:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 310,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, October 14 (APP):Federal Minister for Religious Affairs Sardar Muhammad Yousaf hosted a grand dinner in honour of the Secretary General of the Muslim World League (MWL), Dr Mohammed bin Abdulkarim Al-Issa, bringing together a distinguished gathering of Pakistan's top political, religious, and diplomatic figures the other day. The event was attended by Senate Chairman Syed Yousaf Raza Gilani, President of Pakistan Muslim League-Nawaz Raja Zafar-ul-Haq, Minister for Communications Aleem Khan, Senator Hafiz Abdul Karim, Minister of State for Law and Justice Barrister Aqeel, Hafiz Tahir Mahmood Ashrafi, Shah Owais Noorani, Maulana Fazl-ur-Rehman Khalil, and several foreign ambassadors. Welcoming Dr Al-Issa to Pakistan, Sardar Muhammad Yousaf said the visit of the SecGen symbolizes the renewal of a shared commitment to unity, dialogue, and cooperation across the Muslim world. He described the MWL as a beacon of unity, wisdom, and guidance for the Ummah, expressing its global efforts in promoting moderation, interfaith harmony, and humanitarian values. \"The MWL has always been at the forefront of fostering dialogue, tolerance, and understanding among diverse communities,\" the minister said, adding that Pakistan deeply values the League's constructive role in strengthening the bonds of Muslim solidarity. He further said Dr Al-Issa's visit reflects a renewed determination to pursue common objectives and collective progress among Muslim nations, praising the League's initiatives in peace-building, reconciliation, and humanitarian assistance. Expressing his gratitude for the warm welcome, Dr Mohammed bin Abdulkarim Al-Issa said he felt great joy and deep appreciation at being in Pakistan, calling it a country close to the heart of every Muslim. He emphasized that in today's world, the unity of the Muslim Ummah is more vital than ever to meet emerging global and moral challenges. Dr Al-Issa reaffirmed the MWL's continued commitment to advancing peace, coexistence, and service to humanity, stressing that cooperation and mutual respect remain the foundations of a strong and united Ummah.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}