{
  "article_id": "2025-10-14_1aec8c3b85b58be831b89fd9e679207a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-recommends-immediate-release-of-usc-employees-salaries/",
    "retrieved_at": "2025-10-17T00:01:03.839Z"
  },
  "metadata": {
    "title": "NA body recommends immediate release of USC employees salaries",
    "author": null,
    "date_published": "2025-10-14T20:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 265,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 14 (APP):The National Assembly Standing Committee on Industries and Production on Tuesday recommended that the Ministry of Industries and Production take immediate action to release five months' worth of unpaid salaries to employees of the Utility Stores Corporation (USC). The committee met here under the chairmanship of Member National Assembly (MNA) Syed Hafeezuddin, said a news release. While the report of the Sub-Committee of the Standing Committee on Industries and Production was presented by its Convener, MNA Ms. Romina Khurshid Alam, before the committee for its consideration and adoption, it was pointed out that the salaries of the employees of the Utility Stores Corporation have not been released for the last five months. The Committee expressed grave concern over the prolonged non-payment, stressing the severe financial hardship it is causing to hundreds of families. The Committee was of the view that it is unacceptable that the employees of the USC have been deprived of their rightful earnings for such an extended period. However, the Committee recommended that the Ministry of Industries and Production should take decisive action to release these five months' salaries immediately. After detailed deliberations on the tractor manufacturing companies that are operational in the province of Sindh, the Committee recommended that EDB may issue import authorization and manufacturing certificate for one year to the firm operating in Sindh. The meeting was attended by the MNAs Ms Kiran Imran Dar, Ms Romina Khurshid Alam, Dr Mahesh Kumar Malani, Dr Mahreen Razzaq Bhutto, and the Additional Secretary M/o Industries & Production, besides other senior officials of the ministry and its attached departments.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}