{
  "article_id": "2025-10-14_575370bc891b583038ebf67663e4365a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-provides-rs-1-366-bln-to-clear-dues-of-psm-retired-employees/",
    "retrieved_at": "2025-10-17T00:02:15.235Z"
  },
  "metadata": {
    "title": "Govt provides Rs 1.366 bln to clear dues of PSM retired employees",
    "author": null,
    "date_published": "2025-10-14T16:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 290,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 14 (APP): The government has provided funds amounting to Rs 1.366 billion to clear the dues of 411 retired employees of Pakistan Steel Mills (PSM). According to documents available with Wealth Pakistan, the allocated amount covers gratuity, provident fund and leave encashment payments. The disbursement is expected to conclude within the month of October, providing the long-awaited financial relief to the retired employees. According to the documents, 899 employees still remain on PSM's payroll, with salaries being financed through the government loans to the PSM to sustain operations and maintain essential functions while restructuring of the facility continues. Meanwhile, in an effort to protect this precious state enterprise, the management has intensified its anti-theft campaign, registering 26 FIRs and making multiple arrests linked to copper and other material thefts. The recovered materials will be auctioned off to generate revenue and offset operational losses. The enterprise has also recovered 20 acres of encroached land and plans to reclaim an additional 38 acres in collaboration with the local administration. These assets will be reintegrated into the industrial use under the government's broader strategy for state-owned enterprise revitalization. Though production at PSM remains halted since 2015, the government's consistent focus on financial cleanup, land recovery, and employee settlements is widely viewed as a foundation for future industrial revival in the country. The current reform plan focuses on clearing liabilities, recovering encroached land, and enhancing accountability mechanisms. Spread over 18,600 acres in Karachi, the enterprise also includes Gulshan-e-Hadeed Housing Project, developed for the employees in multiple phases since 1986. Policymakers view the revival of the mills as a strategic economic priority-one that could reduce steel imports, generate jobs, and support the construction and manufacturing sectors, both key drivers of Pakistan's industrial growth.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}