{
  "article_id": "2025-10-14_8962723d06f0939f814766d0ee253d2e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rs-11-billion-grant-insufficient-for-ptvs-salary-pension-needs-na-committee-told/",
    "retrieved_at": "2025-10-17T00:02:36.352Z"
  },
  "metadata": {
    "title": "NA committee urges new revenue options following the abolition of the PTV license fee",
    "author": null,
    "date_published": "2025-10-14T15:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 391,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 14 (APP):The National Assembly (NA) Standing Committee on Information and Broadcasting on Tuesday urged exploration of additional revenue streams to meet PTVas operating and administrative expenses while also calling on the information ministry to seek a government grant to clear outstanding employee-related financial liabilities.The Committee met under the chairmanship of Pullain Baloch, MNA, in PTV Headquarters in Islamabad.The Committee was apprised that the present management had been consistently pursuing administrative and financial reforms for the restructuring of the Corporation to become self-sustaining.Secretary Ministry of Information and Broadcasting Ambreen Jan further apprised that several proposals had been worked out that include digitalization of PTV network, induction of anchors and vibrant marketing strategy.She said that the government had given Rs11 billion to meet the expenditure during current financial year; however ministry was pursuing the provision of a grant to clear the outstanding liabilities. She further apprised that reforming the PTV screen had increased the viewership.She also informed about the recently transformed Pakistan TV, which would cater to the news requirements of the audience worldwide and counter negative propaganda against Pakistan.The Committee deferred the discussion on The Protection of Journalist and Media Professionals (Amendment) Bill, 2025 due to inability of the Mover of the Bill to attend the meeting, and decided to discuss the same in its next meeting.The Committee asked the ministry to expedite the process of appointment the Chairman of PEMRA. The Committee was apprised that the process had already been initiated and the names finalized would be sent to the Parliamentary Committee for selection of Chairman from the list of the shortlisted candidates. The Committee also asked for concluding pending inquiries against PTV employees.The Committee, while taking cognizance of the delay in execution of the PSDP projects of Pakistan Broadcasting Corporation in Karachi, appointed a sub-committee under convenership of Syed Amin ul Haq, MNA, to visit the projects and examine/identify issues associated therewith and submit its recommendations to the main committee. The Sub Committee had also been asked to suggest utilisation of properties PBC for revenue generation.The meeting of the Committee was attended by Barrister Daniyal Ch, Parliamentary Secretary for Information, MNAs Salahuddin Junejo, Ms Rana Ansar, Ms Sehr Kamran, Ms Shaheen, Ms Kitna Haider, Ms Romina Khursheed Alam, Ms Asia Naz Tanoil, Ms Kiran Imran Dar, Secretary Information and Broadcasting and other senior officers of the concerned departments.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}