{
  "article_id": "2025-10-14_534f7050549db06551232f4b383168d6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-body-reviews-implementation-status-of-various-infrastructure-projects/",
    "retrieved_at": "2025-10-17T00:01:50.581Z"
  },
  "metadata": {
    "title": "Senate body reviews implementation status of various infrastructure projects",
    "author": null,
    "date_published": "2025-10-14T18:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 688,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 14 (APP):The Senate Functional Committee on Problems of Less Developed Areas on Tuesday reviewed the implementation status of various infrastructure projects and assess departmental accountability. The Senate Functional Committee which met under the chairmanship of Senator Agha Shazaib Durrani here at Parliament House was attended by Senator Nadeem Ahmed Bhutto, Senator Falak Naz, Senator Muhammad Aslam Abro and Senator Danesh Kumar. Chairman National Highway Authority (NHA) was present, while Chairman NTDC was not present in the meeting, prompting the committee to defer agenda items related to NTDC. Chairman Durrani expressed displeasure, saying, the absence of key officials reflects a lack of seriousness towards the pressing issues of less developed areas and asked chairman NTDC to appear in the next meeting without fail.\" The Committee reviewed the compliance report by the Ministry of Communications and NHA on its previous recommendations from the February 12, meeting. One of the major concerns was the North Access Road (NAR), 7.3km section, where a stay order has halted progress. It was briefed that to alleviate local grievances and in response to contractual failures of the original contractor for NAR Pack-II, a fresh contract was awarded under RMA funds on August 5, 2025. The Committee was informed that 85% physical progress has been achieved and work is expected to be completed by end of October 2025. Regarding development in Chitral, the committee discussed progress on the Ayun, Bamboret, and Reshun roads. It was reported that while contracts have been awarded, land acquisition remains an issue. In the meeting, Senator Falak Naz offered her assistance in resolving the matter. Chairman Durrani said that Senator Falak Naz be included in all future consultations with provincial authorities to expedite administrative resolutions. NHA acknowledged her support and welcomed her participation in overcoming these roadblocks. In reviewing Recommendation for direct motorway access to the Peshawar Airport, stating, Why not construct a flyover from M-1? NHA responded that although a flyover is costly, an additional lane is being designed from the Islamabad exit towards the airport. In March 2025, the NHA Executive Board submitted a PC-I titled 'Widening of M-1, M-2 & Link Road due to Rawalpindi Ring Road merger', which includes a dedicated loop at M-1/M-2 interchange to ease airport access. Chairman Durrani stressed, this must be prioritised. The committee reviewed the progress of the N-55 project, which had faced delays prompting a departmental inquiry. Following the submission of the Fact-Finding Inquiry Committee's report, headed by B.A. Nasir in April 2025, formal disciplinary actions have been initiated. Charge sheets have been issued to BS-20 and above officers, with their cases forwarded to the Ministry of Communications and the Establishment Division. For BS-19 and below officers, inquiry proceedings are underway, being conducted by the NHA's Member (Admin). Despite the measures, Chairman Durrani remarked, not a single official has been suspended. They continued working while under inquiry. We demand full service records, postings, and accountability. NHA reported 75% completion of N-55, with an expected completion date of December 31, 2025. Chairman Durrani cautioned, presenting unverified figures before Senate forums is unacceptable. We will closely monitor this claim.\" The Committee took serious note of the Construction of Additional Carriageway from Petaro to Sehwan (N-55). While 92% physical progress has been achieved, including base laying and culvert completion, submission of the As-Built Survey report was delayed by over 240 days. Chairman Durrani demanded answers, why hasn't the report been submitted? The Committee had asked for it in 30 days. The project, spanning 66.37 km, was inspected in two phases- November 2023 and May 2025. Recommendations were sent for compliance during the defect liability period, yet several gaps remain. The Chairman directed another site visit within 15 days to verify rectification of earlier observations. The Committee also touched upon the impact of climate change, particularly floods, which continue to damage key roads in vulnerable regions. Members called for use of resilient materials and design innovations for future infrastructure. Raising concerns over fiscal discipline, Chairman Durrani said, \"Every year, development schemes worth Rs. 120 billion are proposed. This is unsustainable. No new projects should be lined up until the ongoing ones are completed.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}