{
  "article_id": "2025-10-14_ec68c1e6fb5594956cf9c619fbc6a2e0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gilani-meets-secretary-general-of-muslim-world-league/",
    "retrieved_at": "2025-10-17T00:03:02.248Z"
  },
  "metadata": {
    "title": "Gilani meets Secretary General of Muslim World League",
    "author": null,
    "date_published": "2025-10-14T14:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 204,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 14 (APP):Chairman Senate, Syed Yousaf Raza Gilani Tuesday met with the Secretary General of the Muslim World League, Dr Mohammad bin Abdulkarim Al-Issa. During the meeting, matters of mutual interest and various challenges facing the Muslim Ummah were discussed in detail. During the meeting, the Chairman Senate emphasized the significance of the Muslim World League's platform for the Muslim Ummah and said that through this forum, joint efforts can be made to promote unity among Muslims and to address their common issues. He appreciated the services of the Muslim World League and its Secretary General, and underscored the need for a coordinated and unified strategy to curb oppression and human rights violations against Muslims in different parts of the world. Stressing the importance of unity among Muslim nations, the Chairman Senate said that mutual trust and solidarity are vital to strengthening our collective position. The Secretary General of the Muslim World League, Dr Mohammad bin Abdulkarim Al-Issa, termed his visit to Pakistan as highly significant and expressed gratitude to the Chairman Senate for his warm hospitality and attention. He reaffirmed that the Muslim World League will continue to enhance close cooperation with Pakistan and promote a unified stance at the global level.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}