{
  "article_id": "2025-10-14_538314852ffdbdc63082939dcb03b369",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-directs-nha-to-open-all-toll-lanes-ensure-timely-completion-of-n-55-n-5-projects/",
    "retrieved_at": "2025-10-17T00:01:49.101Z"
  },
  "metadata": {
    "title": "NA body directs NHA to open all Toll lanes, ensure timely completion of N-55, N-5 projects",
    "author": null,
    "date_published": "2025-10-14T18:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 714,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 14 (APP):The Standing Committee on Communications met on Tuesday under the chairmanship of Member National Assembly (MNA) Aijaz Hussain Jakhrani to review matters related to motorway operations, road infrastructure, and postal services. The meeting, held at the Parliament House, began with a recitation from the Holy Quran, followed by the confirmation of the minutes from the 13th meeting, said a press release. The Committee then reviewed the Ministry's responses to previous recommendations. It was reported that the motorway police officer involved in the manhandling incident was terminated from service on 29th September 2025. Additionally, the Committee was informed that a formal body has been established to work on enhancing the salaries of motorway police personnel, bringing them in line with those of the Punjab police. An update was also provided regarding the incident involving a family traveling from Sukkur to Multan. The NHA reported ongoing efforts to increase the number of signboards on motorways to curb over-speeding. Furthermore, it was announced that new postage stamps will be issued with proper serial numbers, correcting previous shortcomings. Members were also informed that a committee has been constituted to propose amendments to the Post Office Act of 1898 to align it with current needs. The Committee advised that Pakistan Postal Life Insurance should upload the seniority list of recipients on its website to resolve pending cases fairly and transparently. It was highlighted that 3 billion was allocated this year against the 8 billion demanded. The Department assured it would improve its procedures to meet these challenges. The Committee discussed the Calling Attention notice raised by Mr. Waseem Hussain, MNA, regarding the Jamshoro Toll Plaza, which is established in violation of the NHA's rule requiring a distance of 35-60 km between two toll plazas. The Honorable Member expressed dissatisfaction with the NHA's response. After several follow-up meetings, the Committee decided to return the NHA's reply to the House along with the remarks submitted by the Honorable Member. The Calling Attention notice moved by Mr. Sahibzada Sibghatullah, MNA, concerning the inflated prices of essential food items at motorway toll areas, was deferred to the next meeting due to the absence of the Honorable Member. The Committee reviewed \"The Toll Plaza Rationalization and Equity Bill, 2025\" as moved by Syed Abrar Ali Shah. It was directed that the Law and Justice Ministry, in coordination with the NHA and the Honorable Member who moved the Bill, should examine the proposal to determine if new legislation or amendments to relevant sections of the existing Act are necessary. The issue will be taken up in the next meeting. A briefing was taken on the contract awarded under the CAREC Phase-III Project, co-funded by the Asian Development Bank, to a contractor previously disqualified by the NHA. The Committee will review the report from the Senate Committee on Communications and Economic Affairs Division in the upcoming meeting. A detailed briefing was provided on the Ratodero-Kashmore (N-55) and Moro-Ranipur (N-5) projects. The Committee emphasized the importance of completing these projects on time to ensure the convenience of the general public. To curb rising incidents of theft and road crimes, the Committee advised that vehicles should only be stopped and inspected at officially designated checkpoints, rather than at arbitrary locations. The Committee instructed that all lanes of the Toll Plaza should be kept open, as the current limited use of lanes is resulting in traffic buildup and extended queues. The NHA guaranteed full adherence to this directive and pledged to build more gateways. The Committee questioned the NHA regarding the contract period of the Toll Plazas, noting that several roads are in poor condition after their intended lifespan, yet contractors are still collecting tolls from the travelers. The meeting was attended by Members of the Standing Committee, including Sardar Muhammad Yaqoob Khan Nasar, Haji Jamal Shah Kakar, Ms. Akhtar Bibi, Dr. Darshan, Nazir Ahmed Bhugio, Mir Shabbir Ali Bijarani, Syed Ayaz Ali Shah Sheerazi, Mr. Ramesh Lal, Muhammad Usman Badini (via Zoom), and Hameed Hussain, all Members of the National Assembly (MNAs). Additionally, Syed Waseem Hussain and Syed Abrar Ali Shah, MNAs and movers of a Calling Attention Notice and a legislative Bill respectively, also participated in the meeting. Senior officials from the Ministry of Communications and representatives from affiliated departments were present as well.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}