{
  "article_id": "2025-10-14_6917168f521b475dcedd539ddda6d92f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-winds-up-egypt-visit-after-gaza-peace-summit/",
    "retrieved_at": "2025-10-17T00:03:05.351Z"
  },
  "metadata": {
    "title": "PM Shehbaz winds up Egypt visit after Gaza peace summit",
    "author": null,
    "date_published": "2025-10-14T11:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 314,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "SHARM EL SHEIKH, Oct 14 (APP): Prime Minister Shehbaz Sharif on Tuesday left here for Pakistan after a two-day visit to attend the Gaza Peace Summit, where leaders from the United States, Egypt, Qatar, and Turkey signed a peace deal for Gaza. At the Sharm El Sheikh airport, Egyptian Minister of Culture Ahmed Fouad Heno saw off the prime minister, who joined the leaders from 20 states at the summit and also addressed the gathering after Donald Trump invited him to give his address, interrupting his press conference. Calling the moment \"one of the greatest days in contemporary history\" the prime minister spoke highly for the leadership role of President Trump and said, \"And today again, I would like to nominate this great president for the Nobel Peace Prize because I genuinely feel he is the most genuine and the most wonderful candidate for the peace prize because he has not only brought peace in South Asia, saved millions of people, their lives, and today, here in Sharm el-Sheikh, achieved peace in Gaza and saved millions of lives in the Middle East,\" he said. While on his way home, Prime Minister Shehbaz, in a social media post on X, said that Pakistan's gratitude to Trump was anchored in his promise that he would make it stop, and delivering on that promise. \"We will continue to express our admiration for President Trump's unique contribution to peace,\" the prime minister said. Calling the Palestinian people's freedom, dignity and prosperity remain a primary concern for Pakistan, he reaffirmed that the establishment of a strong and viable Palestinian state with pre-1967 borders and Al Quds Al Sharif as its capital remained the bedrock of Pakistan's Middle East policy and would continue to be so. He said that Pakistan was deeply involved in the process and that, along with other brotherly nations, its priority was stated and reinforced consistently.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}